Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/clv/clv_intro.po
Languages: es

source: Introduction to Customer Lifetime Value
es: Introducción al Valor del Tiempo de Vida del Cliente

source: For a variety of reasons, companies often need to quantify the monetary value of each customer (present and future) and do so while acknowledging the entire relationship the customer has with the company. This value represents the maximum the company should spend on acquiring new customers. It may also guide customer retention efforts and inform financial forecasting.
es: Por una variedad de razones, las empresas a menudo necesitan cuantificar el valor monetario de cada cliente (presente y futuro) y hacerlo reconociendo toda la relación que el cliente tiene con la empresa. Este valor representa el máximo que la empresa debería gastar en adquirir nuevos clientes. También puede guiar los esfuerzos de retención de clientes e informar la previsión financiera.

source: A simplistic approach to calculating customer value might be to calculate how much value (e.g., revenue, profit) was derived from former customers and assume that future customers will yield similar value. Unfortunately, this and other intuitive approaches treat all customers as equivalent and fail to accurately characterize the nature of the relationshiop: this approach will not distinguish between a customer that makes large, infrequent purchases and a customer that makes small, frequent purchases.
es: Un enfoque simplista para calcular el valor del cliente podría ser calcular cuánto valor (por ejemplo, ingresos, ganancias) se derivó de clientes anteriores y asumir que los futuros clientes generarán un valor similar. Desafortunadamente, este y otros enfoques intuitivos tratan a todos los clientes como equivalentes y no logran caracterizar con precisión la naturaleza de la relación: este enfoque no distinguirá entre un cliente que realiza compras grandes e infrecuentes y un cliente que realiza compras pequeñas y frecuentes.

source: Fortunately, with Bayesian modeling, we can do better than this! Customer Lifetime Value (CLV) models can estimate various aspects of each customer's relationship with the company, project these estimates into the future for forecasting purposes, and quantify the value of the customer over the entire lifetime (past and future). These estimates can then be utilized for marketing and financial purposes.
es: Afortunadamente, con el modelado bayesiano, ¡podemos hacer mejor que esto! Los modelos de Valor de Vida del Cliente (CLV) pueden estimar varios aspectos de la relación de cada cliente con la empresa, proyectar estas estimaciones hacia el futuro con fines de pronóstico y cuantificar el valor del cliente a lo largo de toda su vida (pasada y futura). Estas estimaciones pueden ser utilizadas luego para fines de marketing y financieros.

source: What can you do with a Customer Lifetime Value model?
es: ¿Qué puedes hacer con un modelo de Valor del Tiempo de Vida del Cliente?

source: Customer lifetime value models provide rich insights and are used in many ways, but here are some of the highlights:
es: Los modelos de valor del tiempo de vida del cliente proporcionan información valiosa y se utilizan de muchas maneras, pero aquí hay algunos de los aspectos más destacados:

source: Evaluate customer acquisition costs. The value of a customer over the entire lifetime represents an absolute maximum amount a company should be willing to spend to acquire a customer.
es: Evalúa los costos de adquisición de clientes. El valor de un cliente a lo largo de toda su vida representa una cantidad máxima absoluta que una empresa debería estar dispuesta a gastar para adquirir un cliente.

source: Guide marketing campaigns. Knowing what kinds of customers are most (and least) valuable provides a strong basis for selecting customers (e.g., segments) to target with future marketing campaigns. It also provides guidance about how much to spend when targeting specific types of customers.
es: Guía las campañas de marketing. Conocer qué tipos de clientes son los más (y menos) valiosos proporciona una base sólida para seleccionar clientes (por ejemplo, segmentos) a los que dirigir futuras campañas de marketing. También proporciona orientación sobre cuánto gastar al dirigirse a tipos específicos de clientes.

source: Guide retention and reacquisition efforts. Estimates of current customers' future value can be used to automate aspects of the company's customer relationship management system. High-value customers can be prioritized. Retention campaigns can target customers at risk of churning (terminating their relationship with the company). Reacquisition campaigns can target high-value customers who have already churned.
es: Guía los esfuerzos de retención y reacquisición. Las estimaciones del valor futuro de los clientes actuales se pueden utilizar para automatizar aspectos del sistema de gestión de relaciones con los clientes de la empresa. Se pueden priorizar a los clientes de alto valor. Las campañas de retención pueden dirigirse a los clientes en riesgo de abandonar (terminar su relación con la empresa). Las campañas de reacquisición pueden dirigirse a los clientes de alto valor que ya han abandonado.

source: Avoid being misled by other factors. Without a broad, all encompassing way of valuing customers, companies may focus on KPIs that provide incomplete picture. For example, companies may focus on the total number of customers acquired without realizing that many are low-value. Or companies may focus on the average revenue generated by a customer, without a good way of building forecasts of future behavior.
es: Evita ser engañado por otros factores. Sin una forma amplia y abarcadora de valorar a los clientes, las empresas pueden centrarse en KPIs que proporcionan una imagen incompleta. Por ejemplo, las empresas pueden centrarse en el número total de clientes adquiridos sin darse cuenta de que muchos son de bajo valor. O las empresas pueden centrarse en el ingreso promedio generado por un cliente, sin una buena manera de construir pronósticos del comportamiento futuro.

source: Validate your understanding through predictions. We gain confidence in our knowledge of the world by making predictions and comparing them to what happens. CLV models generate forecasts that can be checked against reality. As a result, we can improve our understanding and modeling iteratively to become more accurate over time.
es: Valida tu comprensión a través de predicciones. Ganamos confianza en nuestro conocimiento del mundo al hacer predicciones y compararlas con lo que sucede. Los modelos de CLV generan pronósticos que se pueden verificar con la realidad. Como resultado, podemos mejorar nuestra comprensión y modelado de manera iterativa para ser más precisos con el tiempo.

source: How does a Customer Lifetime Value model work?
es: ¿Cómo funciona un modelo de Valor del Tiempo de Vida del Cliente?

source: Customer lifetime value models come in two basic varieties: contractual and non-contractual. When customer relationships are contractual (e.g., subscription-based), the CLV modeling tends to be a bit more straightforward because the company always knows the status of the customer relationship (i.e., the relationship is ongoing or has been terminated). When the relationship is non-contractual, the status of the relationship is always uncertain.
es: Los modelos de valor del tiempo de vida del cliente vienen en dos variedades básicas: contractual y no contractual. Cuando las relaciones con los clientes son contractuales (por ejemplo, basadas en suscripciones), la modelización del CLV tiende a ser un poco más directa porque la empresa siempre conoce el estado de la relación con el cliente (es decir, la relación está en curso o ha sido terminada). Cuando la relación es no contractual, el estado de la relación siempre es incierto.

source: In either case, CLV models incorporate two main components: a model of revenue and a model of the lifetime.
es: En cualquier caso, los modelos de CLV incorporan dos componentes principales: un modelo de ingresos y un modelo de la duración de la vida.

source: Modeling revenue
es: Modelando ingresos

source: The revenue model characterizes the rate at which individual customers "buy" (i.e., generate transactions) and the magnitude of those purchases. Typically, we can think about of an individual customer making purchases at a relatively steady rate (e.g., once per month). Of course, the actual timing of purchases will vary somewhat and we will be more confident about the rates associated with customers who have purchased many times in the past. The same is true of the magnitude of purchases. Our estimates of frequency and magnitude allow us to characterize how many purchases to expect from a customer in the future and how large those purchases will be. Together, this allows us to quantify the revenue expected from a customer if the relationship continued into the future.
es: El modelo de ingresos caracteriza la tasa a la que los clientes individuales "compran" (es decir, generan transacciones) y la magnitud de esas compras. Típicamente, podemos pensar en un cliente individual realizando compras a una tasa relativamente constante (por ejemplo, una vez al mes). Por supuesto, el momento real de las compras variará algo y estaremos más seguros sobre las tasas asociadas con los clientes que han comprado muchas veces en el pasado. Lo mismo es cierto para la magnitud de las compras. Nuestras estimaciones de frecuencia y magnitud nos permiten caracterizar cuántas compras esperar de un cliente en el futuro y cuán grandes serán esas compras. Juntos, esto nos permite cuantificar los ingresos esperados de un cliente si la relación continuara en el futuro.

source: Modeling lifetimes
es: Modelando tiempos de vida

source: Unfortunately, not all customer relationships last forever. The second component allows us to model the expected duration of the customer relationship. With contractual relationships, customers may voluntarily churn at the end of contract periods (e.g., deciding not to renew a subscription) and CLV models estimate the probability with which a given customer does or does not do so. With non-contractual customer relationships, things are trickier. If a customer tends to make a purchase once per month and hasn't done so for 6 weeks, should we assume the customer has churned? Or perhaps this is just part of the typical variability in this customer's behavior. Either way, CLV models permit us to evaluate the probability that a given customer will continue to be a customer at some given time in the future and the total lifetime of each customer.
es: Lamentablemente, no todas las relaciones con los clientes duran para siempre. El segundo componente nos permite modelar la duración esperada de la relación con el cliente. Con relaciones contractuales, los clientes pueden cancelar voluntariamente al final de los períodos del contrato (por ejemplo, decidir no renovar una suscripción) y los modelos de CLV estiman la probabilidad con la que un cliente dado lo hace o no lo hace. Con relaciones no contractuales, las cosas son más complicadas. Si un cliente tiende a realizar una compra una vez al mes y no lo ha hecho durante 6 semanas, ¿deberíamos asumir que el cliente ha cancelado? O quizás esto es solo parte de la variabilidad típica en el comportamiento de este cliente. De cualquier manera, los modelos de CLV nos permiten evaluar la probabilidad de que un cliente dado continúe siendo cliente en algún momento futuro y la duración total de cada cliente.

source: By combining the purchasing behavior of each customer with the expected period over which such purchases will be made, we arrive at an estimate of the total revenue expected from each customer.
es: Al combinar el comportamiento de compra de cada cliente con el período esperado durante el cual se realizarán dichas compras, llegamos a una estimación de los ingresos totales esperados de cada cliente.

source: Putting it all together
es: Uniendo todo

source: To see how all these different components come together, you can review the {ref}`CLV Quickstart <clv_quickstart>` or one of {ref}`specific CLV models <howto>` available within PyMC-Marketing.
es: Para ver cómo todos estos diferentes componentes se unen, puedes revisar el {ref}`CLV Quickstart <clv_quickstart>` o uno de los modelos CLV específicos de {ref} disponibles dentro de PyMC-Marketing.
