Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/bass/bass_example.po
Languages: es

source: Introduction to the Bass Diffusion Model
es: Introducción al Modelo de Difusión de Bass

source: What is the Bass Model?
es: ¿Qué es el Modelo de Bass?

source: The Bass diffusion model, developed by Frank Bass in 1969, is a mathematical model that describes how new products get adopted in a population over time. It's widely used in marketing to forecast sales of new products, especially when historical data is limited or non-existent.
es: El modelo de difusión de Bass, desarrollado por Frank Bass en 1969, es un modelo matemático que describe cómo los nuevos productos son adoptados en una población a lo largo del tiempo. Se utiliza ampliamente en marketing para prever las ventas de nuevos productos, especialmente cuando los datos históricos son limitados o inexistentes.

source: The model captures the entire lifecycle of product adoption, from introduction to saturation, making it a powerful tool for product planning and marketing strategy development.
es: El modelo captura todo el ciclo de vida de la adopción del producto, desde la introducción hasta la saturación, convirtiéndolo en una herramienta poderosa para la planificación de productos y el desarrollo de estrategias de marketing.

source: The Motivation Behind the Bass Model
es: La motivación detrás del modelo Bass

source: Before the Bass model, companies struggled to predict the adoption patterns of new products. Traditional forecasting methods often failed because they couldn't account for the social dynamics that drive product adoption. Frank Bass recognized that product adoption follows a distinct pattern:
es: Antes del modelo de Bass, las empresas luchaban por predecir los patrones de adopción de nuevos productos. Los métodos de pronóstico tradicionales a menudo fallaban porque no podían tener en cuenta las dinámicas sociales que impulsan la adopción de productos. Frank Bass reconoció que la adopción de productos sigue un patrón distinto:

source: **Initial slow growth**: When a product first launches, adoption starts slowly
es: **Crecimiento inicial lento**: Cuando un producto se lanza por primera vez, la adopción comienza lentamente.

source: **Rapid acceleration**: As more people adopt, word-of-mouth spreads and adoption accelerates
es: **Aceleración rápida**: A medida que más personas adoptan, el boca a boca se difunde y la adopción se acelera.

source: **Eventual saturation**: Eventually, the market becomes saturated and adoption slows down
es: **Saturación eventual**: Eventualmente, el mercado se satura y la adopción se ralentiza.

source: The Bass model provides a mathematical framework to capture these patterns, enabling businesses to make more informed decisions about production planning, inventory management, and marketing resource allocation.
es: El modelo de Bass proporciona un marco matemático para capturar estos patrones, lo que permite a las empresas tomar decisiones más informadas sobre la planificación de la producción, la gestión de inventarios y la asignación de recursos de marketing.

source: Mathematical Formulation
es: Formulación Matemática

source: The Bass model is based on a differential equation that describes the rate of adoption:
es: El modelo de Bass se basa en una ecuación diferencial que describe la tasa de adopción:

source: Where:
es: Dónde:

source: $F(t)$ is the installed base fraction (cumulative proportion of adopters)
es: $F(t)$ es la fracción de base instalada (proporción acumulativa de adoptantes)

source: $f(t)$ is the rate of change of the installed base fraction ($f(t) = F'(t)$)
es: $f(t)$ es la tasa de cambio de la fracción de la base instalada ($f(t) = F'(t)$)

source: $p$ is the coefficient of innovation or external influence
es: $p$ es el coeficiente de innovación o influencia externa

source: $q$ is the coefficient of imitation or internal influence
es: $q$ es el coeficiente de imitación o influencia interna

source: The solution to this equation gives the adoption curve:
es: La solución a esta ecuación proporciona la curva de adopción:

source: The adoption rate at time $t$ is given by:
es: La tasa de adopción en el tiempo $t$ se da por:

source: Alternatively, this can be written as:
es: Alternativamente, esto se puede escribir como:

source: Key Components of the Bass Model Implementation
es: Componentes Clave de la Implementación del Modelo Bass

source: The Bass model implementation in PyMC-Marketing consists of several key components:
es: La implementación del modelo Bass en PyMC-Marketing consiste en varios componentes clave:

source: **Adopters** - The number of new adoptions at time $t$:
es: **Adoptantes** - El número de nuevas adopciones en el momento $t$:

source: **Innovators** - Adoptions driven by external influence (advertising, etc.):
es: **Innovadores** - Adopciones impulsadas por influencia externa (publicidad, etc.):

source: **Imitators** - Adoptions driven by internal influence (word-of-mouth):
es: **Imitadores** - Adopciones impulsadas por influencia interna (boca a boca):

source: **Peak Adoption Time** - When the adoption rate reaches its maximum:
es: **Hora de Adopción Máxima** - Cuando la tasa de adopción alcanza su máximo:

source: The total number of adopters over time is the sum of innovators and imitators, which equals $\text{adopters}(t)$. All of these components are directly implemented in the PyMC model, allowing us to analyze each aspect of the diffusion process separately.
es: El número total de adoptantes a lo largo del tiempo es la suma de innovadores e imitadores, lo que equivale a $\text{adopters}(t)$. Todos estos componentes están implementados directamente en el modelo de PyMC, lo que nos permite analizar cada aspecto del proceso de difusión por separado.

source: Understanding the Relationship Between Components
es: Comprendiendo la Relación Entre los Componentes

source: A key insight of the Bass model is how it decomposes adoption into two sources:
es: Una idea clave del modelo de Bass es cómo descompone la adopción en dos fuentes:

source: At each time point:
es: En cada punto temporal:

source: **Innovators** ($m \cdot p \cdot (1 - F(t))$) represents new adoptions coming from people who are influenced by external factors like advertising
es: **Innovadores** ($m \cdot p \cdot (1 - F(t))$) representa nuevas adopciones provenientes de personas que están influenciadas por factores externos como la publicidad.

source: **Imitators** ($m \cdot q \cdot F(t) \cdot (1 - F(t))$) represents new adoptions coming from people who are influenced by previous adopters
es: **Imitadores** ($m \cdot q \cdot F(t) \cdot (1 - F(t))$) representa las nuevas adopciones que provienen de personas que están influenciadas por los adoptantes anteriores.

source: As time progresses:
es: A medida que avanza el tiempo:

source: Initially, **innovators** dominate the adoption process when few people have adopted ($F(t)$ is small)
es: Inicialmente, **los innovadores** dominan el proceso de adopción cuando pocas personas han adoptado ($F(t)$ es pequeño)

source: Later, **imitators** become the primary source of new adoptions as the word-of-mouth effect grows
es: Más tarde, los **imitadores** se convierten en la fuente principal de nuevas adopciones a medida que crece el efecto de boca a boca.

source: Eventually, both decrease as the market approaches saturation ($F(t)$ approaches 1)
es: Eventualmente, ambos disminuyen a medida que el mercado se acerca a la saturación ($F(t)$ se aproxima a 1)

source: The **cumulative adoption** at any time point is:
es: La **adopción acumulativa** en cualquier momento es:

source: This means that as $t \to \infty$, the cumulative adoption approaches the total market potential $m$:
es: Esto significa que a medida que $t \to \infty$, la adopción acumulativa se aproxima al potencial total del mercado $m$:

source: Therefore, the Bass model provides a complete accounting of the market:
es: Por lo tanto, el modelo de Bass proporciona un análisis completo del mercado:

source: At each time point, new adopters are either innovators or imitators
es: En cada momento, los nuevos adoptantes son innovadores o imitadores.

source: Over the entire product lifecycle, all potential adopters (m) eventually adopt the product
es: A lo largo de todo el ciclo de vida del producto, todos los posibles adoptantes (m) eventualmente adoptan el producto.

source: The model tracks both the adoption rate (new adopters per time period) and the cumulative adoption (total adopters to date)
es: El modelo rastrea tanto la tasa de adopción (nuevos adoptantes por período de tiempo) como la adopción acumulativa (total de adoptantes hasta la fecha).

source: This structure enables marketers to understand not just how many people will adopt over time, but also the driving forces behind adoption at different stages of the product lifecycle.
es: Esta estructura permite a los comercializadores comprender no solo cuántas personas adoptarán a lo largo del tiempo, sino también las fuerzas impulsoras detrás de la adopción en diferentes etapas del ciclo de vida del producto.

source: Understanding the Key Parameters
es: Comprendiendo los Parámetros Clave

source: The model has three main parameters:
es: El modelo tiene tres parámetros principales:

source: **Market potential (m)**: Total number of eventual adopters (the ultimate market size)
es: **Potencial de mercado (m)**: Número total de adoptantes eventuales (el tamaño final del mercado)

source: **Innovation coefficient (p)**: Measures external influence like advertising and media - typically $0.01-0.03$
es: **Coeficiente de innovación (p)**: Mide la influencia externa como la publicidad y los medios - típicamente $0.01-0.03$

source: **Imitation coefficient (q)**: Measures internal influence like word-of-mouth - typically $0.3-0.5$
es: **Coeficiente de imitación (q)**: Mide la influencia interna como el boca a boca - típicamente $0.3-0.5$

source: Parameter Interpretation
es: Interpretación de Parámetros

source: A higher **p** value indicates stronger external influence (advertising, marketing)
es: Un valor **p** más alto indica una influencia externa más fuerte (publicidad, marketing)

source: A higher **q** value indicates stronger internal influence (word-of-mouth, social interactions)
es: Un valor **q** más alto indica una influencia interna más fuerte (boca a boca, interacciones sociales)

source: The ratio **q/p** indicates the relative strength of internal vs. external influences
es: La relación **q/p** indica la fuerza relativa de las influencias internas frente a las externas.

source: The peak of adoption occurs at time
es: El pico de adopción ocurre en el momento {like_this}.

source: Innovators vs. Imitators
es: Innovadores vs. Imitadores

source: The Bass model distinguishes between two types of adopters:
es: El modelo de Bass distingue entre dos tipos de adoptantes:

source: **Innovators**: People who adopt independently of others' decisions, influenced mainly by mass media and external communications
es: **Innovadores**: Personas que adoptan independientemente de las decisiones de otros, influenciadas principalmente por los medios de comunicación masivos y las comunicaciones externas.

source: Mathematically represented as: $\text{innovators}(t) = m \cdot p \cdot (1 - F(p, q, t))$
es: Representado matemáticamente como: $\text{innovators}(t) = m \cdot p \cdot (1 - F(p, q, t))$

source: **Imitators**: People who adopt because of social influence and word-of-mouth from previous adopters
es: **Imitadores**: Personas que adoptan debido a la influencia social y el boca a boca de adoptantes anteriores.

source: Mathematically represented as: $\text{imitators}(t) = m \cdot q \cdot F(p, q, t) \cdot (1 - F(p, q, t))$
es: Representado matemáticamente como: $\text{imitators}(t) = m \cdot q \cdot F(p, q, t) \cdot (1 - F(p, q, t))$

source: Real-World Applications
es: Aplicaciones del mundo real

source: The Bass model has been successfully applied to forecast the adoption of various products and technologies:
es: El modelo Bass se ha aplicado con éxito para predecir la adopción de diversos productos y tecnologías:

source: **Consumer durables**: TVs, refrigerators, washing machines
es: **Bienes de consumo duraderos**: televisores, refrigeradores, lavadoras

source: **Technology products**: Smartphones, computers, software
es: **Productos tecnológicos**: Smartphones, computadoras, software

source: **Pharmaceutical products**: New drugs and treatments
es: **Productos farmacéuticos**: Nuevos medicamentos y tratamientos

source: **Entertainment products**: Movies, games, streaming services
es: **Productos de entretenimiento**: Películas, juegos, servicios de streaming

source: **Services and subscriptions**: Banking services, subscription plans
es: **Servicios y suscripciones**: Servicios bancarios, planes de suscripción

source: Business Value: Why the Bass Model Matters to Executives and Marketers
es: Valor Empresarial: Por qué el Modelo Bass es Importante para Ejecutivos y Marketers

source: From a business perspective, the Bass diffusion model provides substantial competitive advantages and ROI benefits:
es: Desde una perspectiva empresarial, el modelo de difusión de Bass proporciona ventajas competitivas sustanciales y beneficios de ROI:

source: 1. Resource Optimization and Cash Flow Management
es: 1. Optimización de Recursos y Gestión de Flujo de Efectivo

source: **Production Planning**: Avoid costly overproduction or stockouts by accurately forecasting demand curves
es: **Planificación de la Producción**: Evite la costosa sobreproducción o falta de stock al prever con precisión las curvas de demanda.

source: **Marketing Budget Allocation**: Optimize spending across the product lifecycle, investing more during key inflection points
es: **Asignación del Presupuesto de Marketing**: Optimizar el gasto a lo largo del ciclo de vida del producto, invirtiendo más durante los puntos de inflexión clave.

source: **Supply Chain Efficiency**: Coordinate with suppliers and distributors based on predicted adoption rates
es: **Eficiencia de la Cadena de Suministro**: Coordinar con proveedores y distribuidores en función de las tasas de adopción previstas.

source: **Cash Flow Optimization**: Better predict revenue streams, improving financial planning and investor relations
es: **Optimización del Flujo de Efectivo**: Predecir mejor los flujos de ingresos, mejorando la planificación financiera y las relaciones con los inversores.

source: 2. Strategic Decision Making
es: 2. Toma de Decisiones Estratégicas

source: **Launch Timing**: Determine the optimal time to enter a market based on diffusion patterns
es: **Tiempo de Lanzamiento**: Determine el momento óptimo para ingresar a un mercado basado en patrones de difusión.

source: **Pricing Strategy**: Implement dynamic pricing strategies aligned with the adoption curve
es: **Estrategia de Precios**: Implementar estrategias de precios dinámicos alineadas con la curva de adopción

source: **Competitive Analysis**: Compare your product's adoption parameters with competitors to identify strengths and weaknesses
es: **Análisis Competitivo**: Compare los parámetros de adopción de su producto con los de los competidores para identificar fortalezas y debilidades.

source: **Product Portfolio Management**: Make informed decisions about when to phase out older products and introduce new ones
es: **Gestión del Portafolio de Productos**: Tome decisiones informadas sobre cuándo retirar productos antiguos e introducir nuevos.

source: 3. Risk Mitigation
es: 3. Mitigación de Riesgos

source: **Scenario Planning**: Test different market assumptions and external factors through parameter variations
es: **Planificación de Escenarios**: Pruebe diferentes supuestos de mercado y factores externos a través de variaciones de parámetros

source: **Early Warning System**: Identify deviations from expected adoption curves early, enabling faster intervention
es: **Sistema de Alerta Temprana**: Identificar desviaciones de las curvas de adopción esperadas de manera temprana, lo que permite una intervención más rápida.

source: **Investment Justification**: Provide data-driven forecasts to justify R&D and marketing investments to stakeholders
es: **Justificación de la Inversión**: Proporcione pronósticos basados en datos para justificar las inversiones en I+D y marketing ante los interesados.

source: 4. Performance Measurement
es: 4. Medición del rendimiento

source: **Marketing Effectiveness**: Measure the impact of marketing campaigns on the innovation coefficient (p)
es: **Efectividad del Marketing**: Mida el impacto de las campañas de marketing en el coeficiente de innovación (p)

source: **Word-of-Mouth Strength**: Quantify the power of your brand's social influence through the imitation coefficient (q)
es: **Fuerza del Boca a Boca**: Cuantifique el poder de la influencia social de su marca a través del coeficiente de imitación (q)

source: **Total Market Potential**: Validate or adjust your total addressable market estimates (m)
es: **Potencial Total del Mercado**: Valide o ajuste sus estimaciones del mercado total direccionable (m)

source: In today's data-driven business environment, companies that effectively utilize models like Bass diffusion gain a significant competitive edge through more precise forecasting, better resource allocation, and strategic market timing.
es: En el entorno empresarial actual impulsado por datos, las empresas que utilizan eficazmente modelos como la difusión de Bass obtienen una ventaja competitiva significativa a través de pronósticos más precisos, una mejor asignación de recursos y un momento estratégico en el mercado.

source: Bayesian Extensions
es: Extensiones Bayesianas

source: In this notebook, we show how to generate simulated data from the Bass model and fit a Bayesian model to it. The Bayesian formulation offers several advantages:
es: En este cuaderno, mostramos cómo generar datos simulados a partir del modelo de Bass y ajustar un modelo bayesiano a estos. La formulación bayesiana ofrece varias ventajas:

source: **Uncertainty quantification** through prior distributions on parameters
es: **Cuantificación de la incertidumbre** a través de distribuciones a priori sobre parámetros

source: **Hierarchical modeling** for multiple products or markets
es: **Modelado jerárquico** para múltiples productos o mercados

source: **Incorporation of expert knowledge** through informative priors
es: Incorporación de conocimiento experto a través de priors informativos

source: **Full probability distributions** for future adoption forecasts
es: **Distribuciones de probabilidad completas** para pronósticos de adopción futuros

source: What we'll do in this notebook
es: Lo que haremos en este cuaderno

source: In this notebook, we'll:
es: En este cuaderno, vamos a:

source: Set up parameters for a Bass model simulation
es: Configurar parámetros para una simulación del modelo Bass

source: Generate simulated adoption data for multiple products
es: Generar datos de adopción simulados para múltiples productos

source: Fit the Bass model to our simulated data using PyMC
es: Ajuste el modelo Bass a nuestros datos simulados utilizando PyMC.

source: Visualize the adoption curves
es: Visualizar las curvas de adopción

source: Prepare Notebook
es: Preparar el cuaderno

source: Setting Up Simulation Parameters
es: Configuración de los parámetros de simulación

source: First, we'll set up the parameters for our simulation. This includes:
es: Primero, configuraremos los parámetros para nuestra simulación. Esto incluye:

source: The time period for our simulation (in weeks)
es: El período de tiempo para nuestra simulación (en semanas)

source: The number of products to simulate
es: El número de productos a simular

source: Start dates for the simulation period
es: Fechas de inicio para el período de simulación

source: Creating Prior Distributions
es: Creando Distribuciones Previas

source: For our Bayesian Bass model, we need to specify prior distributions for the key parameters:
es: Para nuestro modelo de Bass bayesiano, necesitamos especificar distribuciones a priori para los parámetros clave:

source: **m (market potential)**: How many units can potentially be sold in total
es: **m (potencial de mercado)**: Cuántas unidades se pueden vender potencialmente en total

source: **p (innovation coefficient)**: Rate of adoption from external influences
es: **p (coeficiente de innovación)**: Tasa de adopción de influencias externas

source: **q (imitation coefficient)**: Rate of adoption from internal/social influences
es: **q (coeficiente de imitación)**: Tasa de adopción a partir de influencias internas/sociales

source: **likelihood**: The probability distribution that models the observed adoption data
es: **probabilidad**: La distribución de probabilidad que modela los datos de adopción observados

source: For the market potential `m` we use a *scaling* trick to specify a scale-free prior and then add a global factor:
es: Para el potencial de mercado `m`, utilizamos un truco de *escalado* para especificar un prior sin escala y luego añadimos un factor global:

source: Let's generate and visualize the priors.
es: Generemos y visualicemos los priors.

source: Observe we have chosen the priors within the usual ranges of empirical studies:
es: Observe que hemos elegido los priors dentro de los rangos habituales de los estudios empíricos:

source: Generate Synthetic Data
es: Generar Datos Sintéticos

source: With the generative Bass model, we can generate a synthetic dataset by sampling from the prior and choosing one particular sample to use as *observed* data. For this purpose we define two auxiliary functions.
es: Con el modelo generativo Bass, podemos generar un conjunto de datos sintético muestreando del previo y eligiendo una muestra particular para usar como datos *observados*. Para este propósito, definimos dos funciones auxiliares.

source: Now we can generate the observed data:
es: Ahora podemos generar los datos observados:

source: The `actual_data` data frame has the typical format of a real dataset.
es: El marco de datos `actual_data` tiene el formato típico de un conjunto de datos real.

source: On the other hand, the `bass_data` has the same data as arrays indexed by time (relative) and product.
es: Por otro lado, los `bass_data` tienen los mismos datos que los arreglos indexados por tiempo (relativo) y producto.

source: Let's visualize both.
es: Visualicemos ambos.

source: Fit the Model
es: Ajustar el Modelo

source: We are now ready to fit the model and generate the posterior predictive distributions.
es: Ahora estamos listos para ajustar el modelo y generar las distribuciones predictivas posteriores.

source: We do not have any divergences. Let's look at the summary of the parameters.
es: No tenemos ninguna divergencia. Veamos el resumen de los parámetros.

source: Overall, the diagnostics and trace look good.
es: En general, los diagnósticos y el seguimiento se ven bien.

source: Next, we look into the posterior distributions of the parameters.
es: A continuación, examinamos las distribuciones posteriores de los parámetros.

source: We do see some heterogeneity in the parameters, but overall they are centered around the true values (from the generative model).
es: Observamos cierta heterogeneidad en los parámetros, pero en general están centrados en los valores verdaderos (del modelo generativo).

source: Examining Posterior Predictions for Specific Products
es: Examinando las Predicciones Posteriores para Productos Específicos

source: Let's look at the posterior predictive distributions to see how well our model captures the simulated data.
es: Veamos las distribuciones predictivas posteriores para ver qué tan bien nuestro modelo captura los datos simulados.
