Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/bass/bass_example.po
Languages: es

source: Overall, the model does a good job of capturing the data.
es: En general, el modelo hace un buen trabajo al capturar los datos.

source: Next, we look into the *adopters*, which represent the expected value of the likelihood.
es: A continuación, examinamos a los *adoptantes*, que representan el valor esperado de la probabilidad.

source: This show the fit is indeed quite reasonable.
es: Esto muestra que el ajuste es, de hecho, bastante razonable.

source: We can also evaluate the model goodness by looking into the cumulative data:
es: También podemos evaluar la calidad del modelo analizando los datos acumulativos:

source: Remember that the adopters is the mean of the distribution so we see some cumulative curves above and some below.
es: Recuerde que los adoptantes son la media de la distribución, por lo que vemos algunas curvas acumulativas por encima y algunas por debajo.

source: Look at the `idata["posterior_predictive"]["y"]` for the observed data.
es: Mire el `idata["posterior_predictive"]["y"]` para los datos observados.

source: We can enhance this view by looking into the components of the model: *innovators* and *imitators* (in orange and green, respectively).
es: Podemos mejorar esta vista al analizar los componentes del modelo: *innovadores* e *imitadores* (en naranja y verde, respectivamente).

source: Finally, we can inspect the peak of the adoption curve.
es: Finalmente, podemos inspeccionar el pico de la curva de adopción.

source: This fits the observed data quite well. Let's see for example the product `P4`.
es: Esto se ajusta bastante bien a los datos observados. Veamos, por ejemplo, el producto `P4`.
