Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/index.po
Languages: es

source: [![Downloads](https://static.pepy.tech/badge/pymc-marketing)](https://pepy.tech/project/pymc-marketing) [![Downloads](https://static.pepy.tech/badge/pymc-marketing/month)](https://pepy.tech/project/pymc-marketing) [![Downloads](https://static.pepy.tech/badge/pymc-marketing/week)](https://pepy.tech/project/pymc-marketing)
es: [![Descargas](https://static.pepy.tech/badge/pymc-marketing)](https://pepy.tech/project/pymc-marketing) [![Descargas](https://static.pepy.tech/badge/pymc-marketing/month)](https://pepy.tech/project/pymc-marketing) [![Descargas](https://static.pepy.tech/badge/pymc-marketing/week)](https://pepy.tech/project/pymc-marketing)

source: Downloads
es: Descargas

source: PyMC Labs logo
es: Logotipo de PyMC Labs

source: 📞 Schedule a Free Strategy Consultation
es: 📞 Programa una consulta estratégica gratuita

source: For businesses looking to integrate PyMC-Marketing into their operational framework, [PyMC Labs](https://www.pymc-labs.com) offers expert consulting and training. Our team is proficient in state-of-the-art Bayesian modeling techniques, with a focus on Marketing Mix Models (MMMs) and Customer Lifetime Value (CLV).
es: Para las empresas que buscan integrar PyMC-Marketing en su marco operativo, [PyMC Labs](https://www.pymc-labs.com) ofrece consultoría y formación expertas. Nuestro equipo domina técnicas de modelado bayesiano de vanguardia, con foco en los Modelos de Marketing Mix (MMM) y el Customer Lifetime Value (CLV).

source: We provide the following professional services:
es: Ofrecemos los siguientes servicios profesionales:

source: **Custom Models**: Bespoke Bayesian models tailored to your business requirements and data structure.
es: **Modelos Personalizados**: Modelos bayesianos a medida adaptados a los requisitos de su negocio y a la estructura de datos.

source: **Training & Coaching**: Comprehensive training programs to master PyMC-Marketing and Bayesian marketing analytics.
es: **Entrenamiento y Coaching**: Programas de entrenamiento integrales para dominar PyMC-Marketing y análisis de marketing bayesiano.

source: **Implementation Support**: End-to-end integration into your existing data infrastructure and workflows.
es: **Soporte de Implementación**: Integración de extremo a extremo en su infraestructura de datos y flujos de trabajo existentes.

source: **Strategic Advisory**: Expert guidance on marketing measurement strategy and data-driven decision frameworks.
es: **Asesoría Estratégica**: Orientación experta sobre la estrategia de medición de marketing y marcos de decisión basados en datos.

source: PyMC Labs Client Testimonials
es: Testimonios de clientes de PyMC Labs

source: Quick links
es: Enlaces rápidos

source: Getting Started
es: Comenzando

source: Browse our getting started guide to quickly get started with PyMC-Marketing.
es: Consulte nuestra guía de inicio para comenzar rápidamente con PyMC-Marketing.

source: Example notebooks
es: Cuadernos de ejemplo

source: The example notebooks provide examples of using the library in both real case scenarios and synthetic data. They explain how to use the library and showcase its features.
es: Los cuadernos de ejemplo muestran cómo usar la biblioteca tanto en casos reales como con datos sintéticos. Explican cómo utilizar la biblioteca y destacan sus funcionalidades.

source: To the example notebooks
es: Ir a los cuadernos de ejemplo

source: API Reference
es: Referencia de la API

source: The reference guide contains a detailed description of the functions, modules, and objects included in the library. The reference describes how the methods work and which parameters can be used. It assumes that you have an understanding of the key concepts.
es: La guía de referencia contiene una descripción detallada de las funciones, módulos y objetos incluidos en la biblioteca. Describe cómo funcionan los métodos y qué parámetros se pueden utilizar. Se asume que ya comprendes los conceptos clave.

source: To the reference guide
es: Ir a la guía de referencia

source: Bayesian Marketing Mix Modeling (MMM) in PyMC
es: Modelado bayesiano de Marketing Mix (MMM) en PyMC

source: Leverage our Bayesian MMM API to tailor your marketing strategies effectively. Leveraging on top of the research article [Jin, Yuxue, et al. "Bayesian methods for media mix modeling with carryover and shape effects." (2017)](https://research.google/pubs/pub46001/), and extending it by integrating the expertise from core PyMC developers, our API provides:
es: Aprovecha nuestra API bayesiana de MMM para adaptar tus estrategias de marketing de forma efectiva. Basándonos en el artículo de investigación [Jin, Yuxue, et al. "Bayesian methods for media mix modeling with carryover and shape effects." (2017)](https://research.google/pubs/pub46001/) y ampliándolo con la experiencia de los desarrolladores principales de PyMC, nuestra API ofrece:

source: Feature
es: Funcionalidad

source: Benefit
es: Beneficio

source: Custom Priors and Likelihoods
es: Distribuciones previas y verosimilitudes personalizadas

source: Tailor your model to your specific business needs by including domain knowledge via prior distributions.
es: Adapta tu modelo a las necesidades específicas de tu negocio incluyendo conocimiento de dominio mediante distribuciones previas.

source: Adstock Transformation
es: Transformación de adstock

source: Optimize the carry-over effects in your marketing channels.
es: Optimiza los efectos de arrastre en tus canales de marketing.

source: Saturation Effects
es: Efectos de saturación

source: Understand the diminishing returns in media investments.
es: Comprende los rendimientos decrecientes en las inversiones en medios.

source: Customize adstock and saturation functions
es: Personaliza las funciones de adstock y saturación

source: You can select from a variety of adstock and saturation functions. You can even implement your own custom functions. See [documentation guide](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_components.html).
es: Puedes seleccionar entre una variedad de funciones de adstock y saturación, e incluso implementar tus propias funciones personalizadas. Consulta la [guía de documentación](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_components.html).

source: Time-varying Intercept
es: Intercepto variable en el tiempo

source: Capture time-varying baseline contributions in your model (using modern and efficient Gaussian processes approximation methods). See [guide notebook](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_time_varying_media_example.html).
es: Captura contribuciones base que varían en el tiempo en tu modelo (usando métodos modernos y eficientes de aproximación con procesos gaussianos). Consulta el [cuaderno guía](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_time_varying_media_example.html).

source: Time-varying Media Contribution
es: Contribución de medios variable en el tiempo

source: Capture time-varying media efficiency in your model (using modern and efficient Gaussian processes approximation methods). See the [guide notebook](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_tvp_example.html).
es: Captura la eficiencia de los medios que varía en el tiempo en tu modelo (usando métodos modernos y eficientes de aproximación con procesos gaussianos). Consulta el [cuaderno guía](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_tvp_example.html).

source: Visualization and Model Diagnostics
es: Visualización y diagnósticos del modelo

source: Get a comprehensive view of your model's performance and insights.
es: Obtén una visión integral del desempeño de tu modelo y sus insights.

source: Choose among many inference algorithms
es: Elige entre numerosos algoritmos de inferencia

source: We provide the option to choose between various NUTS samplers (e.g. BlackJax, NumPyro and Nutpie). See the [example notebook](https://www.pymc-marketing.io/en/stable/notebooks/general/other_nuts_samplers.html) for more details.
es: Ofrecemos la opción de elegir entre varios muestreadores NUTS (p. ej., BlackJax, NumPyro y Nutpie). Consulta el [cuaderno de ejemplo](https://www.pymc-marketing.io/en/stable/notebooks/general/other_nuts_samplers.html) para más detalles.

source: GPU Support
es: Compatibilidad con GPU

source: PyMC's multiple backends allow for GPU acceleration.
es: Los múltiples backends de PyMC permiten la aceleración con GPU.

source: Out-of-sample Predictions
es: Predicciones fuera de muestra

source: Forecast future marketing performance with credible intervals. Use this for simulations and scenario planning.
es: Pronostica el rendimiento de marketing futuro con intervalos creíbles. Úsalo para simulaciones y planificación de escenarios.

source: Budget Optimization
es: Optimización del presupuesto

source: Allocate your marketing spend efficiently across various channels for maximum ROI. See the [budget optimization example notebook](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_budget_allocation_example.html)
es: Asigna tu gasto de marketing de forma eficiente entre varios canales para maximizar el ROI. Consulta el [cuaderno de ejemplo de optimización del presupuesto](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_budget_allocation_example.html)

source: Experiment Calibration
es: Calibración de experimentos

source: Fine-tune your model based on empirical experiments for a more unified view of marketing. See the [lift test integration explanation](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_lift_test.html) for more details. [Here](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_roas.html) you can find a *Case Study: Unobserved Confounders, ROAS and Lift Tests*.
es: Ajusta tu modelo basándote en experimentos empíricos para obtener una visión más unificada del marketing. Consulta la [explicación de la integración de lift test](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_lift_test.html) para más detalles. [Aquí](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_roas.html) puedes encontrar un *Estudio de caso: Confusores no observados, ROAS y pruebas de elevación*.

source: Unlock Customer Lifetime Value (CLV) with PyMC
es: Impulsa el Customer Lifetime Value (CLV) con PyMC

source: Understand and optimize your customer's value with our **CLV models**. Our API supports various types of CLV models, catering to both contractual and non-contractual settings, as well as continuous and discrete transaction modes:
es: Comprende y optimiza el valor de tus clientes con nuestros **modelos de CLV**. Nuestra API admite diversos tipos de modelos de CLV, tanto en entornos contractuales como no contractuales, así como en modos de transacción continuos y discretos:

source: [CLV Quickstart](https://www.pymc-marketing.io/en/stable/notebooks/clv/clv_quickstart.html)
es: [Inicio rápido de CLV](https://www.pymc-marketing.io/en/stable/notebooks/clv/clv_quickstart.html)

source: [BG/NBD model](https://www.pymc-marketing.io/en/stable/notebooks/clv/bg_nbd.html)
es: [Modelo BG/NBD](https://www.pymc-marketing.io/en/stable/notebooks/clv/bg_nbd.html)

source: [Pareto/NBD model](https://www.pymc-marketing.io/en/stable/notebooks/clv/pareto_nbd.html)
es: [Modelo Pareto/NBD](https://www.pymc-marketing.io/en/stable/notebooks/clv/pareto_nbd.html)

source: [Gamma-Gamma model](https://www.pymc-marketing.io/en/stable/notebooks/clv/gamma_gamma.html)
es: [Modelo Gamma-Gamma](https://www.pymc-marketing.io/en/stable/notebooks/clv/gamma_gamma.html)

source: [Modified BG/NBD model](https://www.pymc-marketing.io/en/stable/notebooks/clv/mbg_nbd.html)
es: [Modelo BG/NBD modificado](https://www.pymc-marketing.io/en/stable/notebooks/clv/mbg_nbd.html)

source: Each of these models is tailored to different types of data and business scenarios:
es: Cada uno de estos modelos se ajusta a distintos tipos de datos y escenarios de negocio:

source: **Non-contractual**
es: **No contractual**

source: **Continuous**
es: **Continuo**

source: online purchases
es: compras en línea

source: ad conversion time
es: tiempo de conversión de anuncios

source: **Discrete**
es: **Discreto**

source: concerts & sports events
es: conciertos y eventos deportivos

source: recurring subscriptions
es: suscripciones recurrentes

source: Customer Choice Analysis
es: Análisis de elección del cliente

source: Analyze the impact of new product launches and understand customer choice behavior with our **Multivariate Interrupted Time Series (MVITS)** models. Our API supports analysis in both saturated and unsaturated markets to help you:
es: Analiza el impacto de los lanzamientos de nuevos productos y comprende el comportamiento de elección del cliente con nuestros modelos de **Series de Tiempo Interrumpidas Multivariadas (MVITS)**. Nuestra API admite análisis tanto en mercados saturados como no saturados para ayudarte a:

source: Market Share Analysis
es: Análisis de cuota de mercado

source: Understand how new products affect existing product market shares
es: Comprende cómo los productos nuevos afectan las cuotas de mercado de los productos existentes

source: Causal Impact Assessment
es: Evaluación del impacto causal

source: Measure the true causal effect of product launches on sales
es: Mide el efecto causal real de los lanzamientos de productos en las ventas

source: Saturated Market Analysis
es: Análisis de mercados saturados

source: Model scenarios where total market size remains constant
es: Modela escenarios en los que el tamaño total del mercado permanece constante

source: Unsaturated Market Analysis
es: Análisis de mercados no saturados

source: Handle cases where new products grow the total market size
es: Gestiona casos en los que los nuevos productos hacen crecer el tamaño total del mercado

source: Visualization Tools
es: Herramientas de visualización

source: Plot market shares, causal impacts, and counterfactuals
es: Grafica cuotas de mercado, impactos causales y contrafactuales

source: Bayesian Inference
es: Inferencia bayesiana

source: Get uncertainty estimates around all predictions
es: Obtén estimaciones de incertidumbre para todas las predicciones

source: See our example notebooks for [saturated markets](https://www.pymc-marketing.io/en/stable/notebooks/customer_choice/mv_its_saturated.html) and [unsaturated markets](https://www.pymc-marketing.io/en/stable/notebooks/customer_choice/mv_its_unsaturated.html) to learn more about customer choice modeling with PyMC-Marketing.
es: Consulta nuestros cuadernos de ejemplo para [mercados saturados](https://www.pymc-marketing.io/en/stable/notebooks/customer_choice/mv_its_saturated.html) y [mercados no saturados](https://www.pymc-marketing.io/en/stable/notebooks/customer_choice/mv_its_unsaturated.html) para saber más sobre el modelado de la elección del cliente con PyMC-Marketing.

source: Bolt's success story with PyMC-Marketing
es: Historia de éxito de Bolt con PyMC-Marketing

source: **Checkout the video below to see how Bolt leverages PyMC-Marketing to assess the impact of their marketing efforts.**
es: **Mira el video a continuación para ver cómo Bolt aprovecha PyMC-Marketing para evaluar el impacto de sus esfuerzos de marketing.**

source: Time-varying parameters in MMMs in PyMC-Marketing
es: Parámetros variables en el tiempo en MMMs con PyMC-Marketing

source: Customer Lifetime Value Modeling in Marine Industry
es: Modelado de Customer Lifetime Value en la industria marítima

source: For more videos, webinars and resources, check out the [PyMC Labs YouTube channel](https://www.youtube.com/@PyMCLabs).
es: Para más videos, seminarios web y recursos, visita el [canal de YouTube de PyMC Labs](https://www.youtube.com/@PyMCLabs).

source: More [PyMC Labs](https://www.pymc-labs.com/) Blog Posts and Resources
es: Más entradas y recursos del blog de [PyMC Labs](https://www.pymc-labs.com/)

source: Marketing Mix Models
es: Modelos de Marketing Mix

source: [Unobserved Confounders, ROAS and Lift Tests in Media Mix Models](https://www.pymc-labs.com/blog-posts/mmm_roas_lift/)
es: [Confusores no observados, ROAS y pruebas de elevación en modelos de mezcla de medios](https://www.pymc-labs.com/blog-posts/mmm_roas_lift/)

source: [MMM Explainer App: Dynamic and Interactive Visualization of Key MMM Concepts](https://pymc-marketing-app.streamlit.app/)
es: [Aplicación explicativa de MMM: visualización dinámica e interactiva de conceptos clave de MMM](https://pymc-marketing-app.streamlit.app/)

source: Customer Lifetime Value
es: Valor del ciclo de vida del cliente

source: [Hierarchical Customer Lifetime Value Models](https://www.pymc-labs.com/blog-posts/hierarchical_clv/)
es: [Modelos jerárquicos de Customer Lifetime Value](https://www.pymc-labs.com/blog-posts/hierarchical_clv/)

source: [Customer Lifetime Value in the non-contractual continuous case: The Bayesian Pareto NBD Model](https://www.pymc-labs.com/blog-posts/pareto-nbd/)
es: [Customer Lifetime Value en el caso continuo no contractual: el modelo bayesiano Pareto NBD](https://www.pymc-labs.com/blog-posts/pareto-nbd/)

source: [Cohort Revenue & Retention Analysis](https://www.pymc-labs.com/blog-posts/cohort-revenue-retention/)
es: [Análisis de ingresos y retención por cohortes](https://www.pymc-labs.com/blog-posts/cohort-revenue-retention/)

source: Case Studies
es: Casos de estudio

source: [Building an in-house marketing analytics solution](https://www.pymc-labs.com/blog-posts/2023-07-18-niall-In-house-marketing/)
es: [Construyendo una solución interna de analítica de marketing](https://www.pymc-labs.com/blog-posts/2023-07-18-niall-In-house-marketing/)

source: [Bayesian Media Mix Models: Modelling changes in marketing effectiveness over time](https://www.pymc-labs.com/blog-posts/modelling-changes-marketing-effectiveness-over-time/)
es: [Modelos bayesianos de mezcla de medios: modelando cambios en la eficacia del marketing a lo largo del tiempo](https://www.pymc-labs.com/blog-posts/modelling-changes-marketing-effectiveness-over-time/)

source: [Improving the Speed and Accuracy of Bayesian Media Mix Models](https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/)
es: [Mejorando la velocidad y la precisión de los modelos bayesianos de mezcla de medios](https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/)

source: [Bayesian Media Mix Modeling for Marketing Optimization](https://www.pymc-labs.com/blog-posts/bayesian-media-mix-modeling-for-marketing-optimization/)
es: [Modelado bayesiano de mezcla de medios para la optimización del marketing](https://www.pymc-labs.com/blog-posts/bayesian-media-mix-modeling-for-marketing-optimization/)

source: [Bayesian inference at scale: Running A/B tests with millions of observations](https://www.pymc-labs.com/blog-posts/bayesian-inference-at-scale-running-ab-tests-with-millions-of-observations/)
es: [Inferencia bayesiana a escala: ejecución de pruebas A/B con millones de observaciones](https://www.pymc-labs.com/blog-posts/bayesian-inference-at-scale-running-ab-tests-with-millions-of-observations/)

source: For more blogposts and resources, check out the [PyMC Labs Blog](https://www.pymc-labs.com/blog-posts/).
es: Para más publicaciones y recursos, visita el [Blog de PyMC Labs](https://www.pymc-labs.com/blog-posts/).
