Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.SoftPlusHSGP.po
Languages: es

source: HSGP with softplus transformation.
es: HSGP con transformación softplus.

source: The use of the softplus transformation maps the latent GP to positive values. We then normalize multiplicatively by the time-mean so the resulting multiplier has mean 1 over the first dimension while remaining strictly positive.
es: El uso de la transformación softplus mapea el GP latente a valores positivos. Luego, normalizamos multiplicativamente por la media temporal para que el multiplicador resultante tenga una media de 1 en la primera dimensión, manteniéndose estrictamente positivo.

source: Examples
es: Ejemplos

source: Literature recommended SoftPlusHSGP configuration:
es: Literatura recomendada para la configuración de SoftPlusHSGP:

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-1.pdf>`)

source: New data predictions with SoftPlusHSGP
es: Nuevas predicciones de datos con SoftPlusHSGP

source: In making the predictions, the model needs to be transformed in order to keep the data centered around 1. There is a helper function :func:`pymc_marketing.model_graph.deterministics_to_flat` that can be used to transform the model upon out of sample predictions.
es: Al realizar las predicciones, el modelo necesita ser transformado para mantener los datos centrados alrededor de 1. Hay una función auxiliar :func:`pymc_marketing.model_graph.deterministics_to_flat` que se puede utilizar para transformar el modelo al realizar predicciones fuera de muestra.

source: This transformation is automatically handled in the provided MMMs.
es: Esta transformación se maneja automáticamente en los MMMs proporcionados.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-SoftPlusHSGP-2.pdf>`)

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabra clave.

source: :py:obj:`SoftPlusHSGP.copy <pymc_marketing.mmm.hsgp.SoftPlusHSGP.copy>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`SoftPlusHSGP.copy <pymc_marketing.mmm.hsgp.SoftPlusHSGP.copy>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`SoftPlusHSGP.create_variable <pymc_marketing.mmm.hsgp.SoftPlusHSGP.create_variable>`\ \(name\)
es: :py:obj:`SoftPlusHSGP.create_variable <pymc_marketing.mmm.hsgp.SoftPlusHSGP.create_variable>`\ \(nombre\)

source: Create the variable.
es: Cree la variable.

source: :py:obj:`SoftPlusHSGP.deterministics_to_replace <pymc_marketing.mmm.hsgp.SoftPlusHSGP.deterministics_to_replace>`\ \(name\)
es: msgid: :py:obj:`SoftPlusHSGP.deterministics_to_replace <pymc_marketing.mmm.hsgp.SoftPlusHSGP.deterministics_to_replace>`\ \(name\) msgstr: :py:obj:`SoftPlusHSGP.deterministics_to_replace <pymc_marketing.mmm.hsgp.SoftPlusHSGP.deterministics_to_replace>`\ \(name\)

source: Name of the Deterministic variables that are replaced with pm.Flat for out-of-sample.
es: Nombre de las variables determinísticas que se reemplazan con pm.Flat para fuera de muestra.

source: :py:obj:`SoftPlusHSGP.dict <pymc_marketing.mmm.hsgp.SoftPlusHSGP.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`SoftPlusHSGP.dict <pymc_marketing.mmm.hsgp.SoftPlusHSGP.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: :py:obj:`SoftPlusHSGP.from_dict <pymc_marketing.mmm.hsgp.SoftPlusHSGP.from_dict>`\ \(data\)
es: :py:obj:`SoftPlusHSGP.from_dict <pymc_marketing.mmm.hsgp.SoftPlusHSGP.from_dict>`\ \(datos\)

source: Create an object from a dictionary.
es: Cree un objeto a partir de un diccionario.

source: :py:obj:`SoftPlusHSGP.json <pymc_marketing.mmm.hsgp.SoftPlusHSGP.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`SoftPlusHSGP.json <pymc_marketing.mmm.hsgp.SoftPlusHSGP.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`SoftPlusHSGP.model_copy <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`SoftPlusHSGP.model_copy <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`SoftPlusHSGP.model_dump <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_dump>`\ \(\*\[\, mode\, include\, ...\]\)
es: :py:obj:`SoftPlusHSGP.model_dump <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_dump>`\ \(\*\[\, modo\, incluir\, ...\]\)

source: :py:obj:`SoftPlusHSGP.model_json_schema <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`SoftPlusHSGP.model_json_schema <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: :py:obj:`SoftPlusHSGP.model_post_init <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_post_init>`\ \(context\, \/\)
es: :py:obj:`SoftPlusHSGP.model_post_init <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_post_init>`\ \(contexto\, \/\)

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`SoftPlusHSGP.model_rebuild <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`SoftPlusHSGP.model_rebuild <pymc_marketing.mmm.hsgp.SoftPlusHSGP.model_rebuild>`\ \(\*\[\, forzar\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: Validate a pydantic model instance.
es: Valide una instancia del modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: Create a HSGP informed by the data with literature-based recommendations.
es: Cree un HSGP informado por los datos con recomendaciones basadas en la literatura.

source: :py:obj:`SoftPlusHSGP.parse_file <pymc_marketing.mmm.hsgp.SoftPlusHSGP.parse_file>`\ \(path\, \*\[\, ...\]\)
es: :py:obj:`SoftPlusHSGP.parse_file <pymc_marketing.mmm.hsgp.SoftPlusHSGP.parse_file>`\ \(ruta\, \*\[\, ...\]\)

source: :py:obj:`SoftPlusHSGP.parse_raw <pymc_marketing.mmm.hsgp.SoftPlusHSGP.parse_raw>`\ \(b\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`SoftPlusHSGP.parse_raw <pymc_marketing.mmm.hsgp.SoftPlusHSGP.parse_raw>`\ \(b\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: Plot the curve.
es: Dibuje la curva.

source: Register the data to be used in the model.
es: Registre los datos que se utilizarán en el modelo.

source: Sample from the prior distribution.
es: Muestra de la distribución previa.

source: :py:obj:`SoftPlusHSGP.schema <pymc_marketing.mmm.hsgp.SoftPlusHSGP.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`SoftPlusHSGP.schema <pymc_marketing.mmm.hsgp.SoftPlusHSGP.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`SoftPlusHSGP.schema_json <pymc_marketing.mmm.hsgp.SoftPlusHSGP.schema_json>`\ \(\*\[\, by\_alias\, ...\]\)
es: :py:obj:`SoftPlusHSGP.schema_json <pymc_marketing.mmm.hsgp.SoftPlusHSGP.schema_json>`\ \(\*\[\, por\_alias\, ...\]\)

source: :py:obj:`SoftPlusHSGP.to_dict <pymc_marketing.mmm.hsgp.SoftPlusHSGP.to_dict>`\ \(\)
es: msgid: :py:obj:`SoftPlusHSGP.to_dict <pymc_marketing.mmm.hsgp.SoftPlusHSGP.to_dict>`\ \(\) msgstr: :py:obj:`SoftPlusHSGP.to_dict <pymc_marketing.mmm.hsgp.SoftPlusHSGP.to_dict>`\ \(\)

source: Convert the object to a dictionary.
es: Convierte el objeto a un diccionario.

source: :py:obj:`SoftPlusHSGP.validate <pymc_marketing.mmm.hsgp.SoftPlusHSGP.validate>`\ \(value\)
es: :py:obj:`SoftPlusHSGP.validate <pymc_marketing.mmm.hsgp.SoftPlusHSGP.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que se ajuste a [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.

source: :py:obj:`centered <pymc_marketing.mmm.hsgp.SoftPlusHSGP.centered>`\
es: :py:obj:`centrado <pymc_marketing.mmm.hsgp.SoftPlusHSGP.centrado>`\
