Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.components.adstock.DelayedAdstock.po
Languages: es

source: DelayedAdstock
es: AdstockRetrasado

source: Wrapper around delayed adstock function.
es: Envoltura alrededor de la función de adstock retrasado.

source: For more information, see :func:`pymc_marketing.mmm.transformers.delayed_adstock`.
es: Para más información, consulte :func:`pymc_marketing.mmm.transformers.delayed_adstock`.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-adstock-DelayedAdstock-1.pdf>`)

source: Methods
es: Métodos

source: :py:obj:`DelayedAdstock.__init__ <pymc_marketing.mmm.components.adstock.DelayedAdstock.__init__>`\ \(\[l\_max\, normalize\, ...\]\)
es: :py:obj:`DelayedAdstock.__init__ <pymc_marketing.mmm.components.adstock.DelayedAdstock.__init__>`\ \(\[l\_max\, normalizar\, ...\]\)

source: Call within a model context.
es: Llamar dentro de un contexto de modelo.

source: Delayed adstock function.
es: Función de adstock retrasada.

source: Plot curve HDI and samples.
es: Trazar curva HDI y muestras.

source: :py:obj:`DelayedAdstock.plot_curve_hdi <pymc_marketing.mmm.components.adstock.DelayedAdstock.plot_curve_hdi>`\ \(curve\[\, ...\]\)
es: :py:obj:`DelayedAdstock.plot_curve_hdi <pymc_marketing.mmm.components.adstock.DelayedAdstock.plot_curve_hdi>`\ \(curva\[\, ...\]\)

source: Plot the HDI of the curve.
es: Trace el IDH de la curva.

source: :py:obj:`DelayedAdstock.plot_curve_samples <pymc_marketing.mmm.components.adstock.DelayedAdstock.plot_curve_samples>`\ \(curve\[\, ...\]\)
es: :py:obj:`DelayedAdstock.plot_curve_samples <pymc_marketing.mmm.components.adstock.DelayedAdstock.plot_curve_samples>`\ \(curva\[\, ...\]\)

source: Plot samples from the curve.
es: Trazar muestras de la curva.

source: :py:obj:`DelayedAdstock.sample_curve <pymc_marketing.mmm.components.adstock.DelayedAdstock.sample_curve>`\ \(parameters\[\, amount\]\)
es: :py:obj:`DelayedAdstock.sample_curve <pymc_marketing.mmm.components.adstock.DelayedAdstock.sample_curve>`\ \(parámetros\[\, cantidad\]\)

source: Sample the adstock transformation given parameters.
es: Muestre la transformación de adstock dados los parámetros.

source: Sample the priors for the transformation.
es: Muestree las distribuciones a priori para la transformación.

source: Set the dims for all priors.
es: Establezca las dimensiones para todos los antecedentes.

source: Convert the adstock transformation to a dictionary.
es: Convierte la transformación de adstock a un diccionario.

source: Update the priors for a function after initialization.
es: Actualice los priors para una función después de la inicialización.

source: Attributes
es: Atributos

source: Get the combined dims for all the parameters.
es: Obtenga las dimensiones combinadas para todos los parámetros.

source: Get the priors for the function.
es: Obtenga los priors para la función.

source: Mapping from variable name to prior for the model.
es: Mapeo del nombre de la variable a la prior para el modelo.

source: Mapping from parameter name to variable name in the model.
es: Mapeo del nombre del parámetro al nombre de la variable en el modelo.
