Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.load_mmm.po
Languages: es

source: load\_mmm
es: cargar\_mmm

source: Load a PyMC-Marketing MMM model from MLflow.
es: Cargar un modelo MMM de PyMC-Marketing desde MLflow.

source: Can either load the full model including the InferenceData, or just the lighter PyFuncModel version.
es: Puede cargar el modelo completo, incluyendo el InferenceData, o solo la versión más ligera del PyFuncModel.

source: Parameters
es: Parámetros

source: The MLflow run ID from which to load the model.
es: El ID de ejecución de MLflow desde el cual cargar el modelo.

source: **full_model** : :ref:`bool <python:bltin-boolean-values>`, default=True
es: **full_model** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=True

source: bool, default=True
es: bool, predeterminado=True

source: If True, load the full MMM model including the InferenceData.
es: Si es verdadero, carga el modelo MMM completo incluyendo los InferenceData.

source: **keep_idata** : :ref:`bool <python:bltin-boolean-values>`, default=False
es: **keep_idata** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=False

source: bool, default=False
es: bool, predeterminado=False

source: If True, keep the downloaded InferenceData saved locally.
es: Si es verdadero, mantenga los InferenceData descargados guardados localmente.

source: **artifact_path** : :class:`python:str`, default="model"
es: **artifact_path** : :class:`python:str`, predeterminado="model"

source: python:str, default="model"
es: python:str, por defecto="modelo"

source: The artifact path within the run where the model is stored.
es: La ruta del artefacto dentro de la ejecución donde se almacena el modelo.

source: **dst_path** : :class:`python:str` | :data:`python:None`, default=None
es: **dst_path** : :class:`python:str` | :data:`python:None`, predeterminado=None

source: python:str | python:None, default=None
es: python:str | python:None, por defecto=None

source: The local destination path where the InferenceData will be downloaded. If None, defaults to "idata_{run_id}" to avoid conflicts when loading multiple models.
es: La ruta de destino local donde se descargará el InferenceData. Si es None, se establece por defecto en "idata_{run_id}" para evitar conflictos al cargar múltiples modelos.

source: Returns
es: Devoluciones

source: **model** : :obj:`mlflow.pyfunc.PyFuncModel` | :obj:`MMM`
es: **modelo** : :obj:`mlflow.pyfunc.PyFuncModel` | :obj:`MMM`

source: The loaded MLflow PyFuncModel or MMM model.
es: El modelo MLflow PyFuncModel o modelo MMM cargado.

source: Examples
es: Ejemplos
