Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utils.create_new_spend_data.po
Languages: es

source: create\_new\_spend\_data
es: crear_nuevos_datos_de_gasto

source: Create new spend data for the channel forward pass.
es: Cree nuevos datos de gasto para el canal de pase hacia adelante.

source: Spends must be the same length as the number of channels.
es: Los gastos deben tener la misma longitud que el número de canales.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-utils-create_new_spend_data-1.pdf>`)

source: Parameters
es: Parámetros

source: **spend** : :obj:`np.ndarray <numpy.ndarray>`
es: **gastar** : :obj:`np.ndarray <numpy.ndarray>`

source: The spend data for the channels.
es: Los datos de gasto para los canales.

source: The maximum lag for the adstock transformation.
es: El retraso máximo para la transformación de adstock.

source: **one_time: bool, optional**
es: **una_vez: bool, opcional**

source: If the spend is one-time, by default True.
es: Si el gasto es único, por defecto es Verdadero.

source: **spend_leading_up** : :obj:`np.ndarray <numpy.ndarray>`, optional
es: **spend_leading_up** : :obj:`np.ndarray <numpy.ndarray>`, opcional

source: np.ndarray, optional
es: np.ndarray, opcional

source: The spend leading up to the first observation, by default None or 0.
es: El gasto previo a la primera observación, por defecto None o 0.

source: Returns
es: Devoluciones

source: The new spend data for the channel forward pass.
es: Los nuevos datos de gasto para el canal de pase hacia adelante.
