Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.validating.po
Languages: es

source: validating
es: validando

source: Validating methods for MMM classes.
es: Validando métodos para las clases MMM.

source: Functions
es: Funciones

source: :py:obj:`validation_method_X <pymc_marketing.mmm.validating.validation_method_X>`\ \(method\)
es: :py:obj:`validation_method_X <pymc_marketing.mmm.validating.validation_method_X>`\ \(método\)

source: Tag a method as a validation method for the predictor columns.
es: Etiquete un método como un método de validación para las columnas del predictor.

source: :py:obj:`validation_method_y <pymc_marketing.mmm.validating.validation_method_y>`\ \(method\)
es: :py:obj:`validation_method_y <pymc_marketing.mmm.validating.validation_method_y>`\ \(método\)

source: Tag a method as a validation method for the target column.
es: Etiquete un método como un método de validación para la columna objetivo.

source: Classes
es: Clases

source: Validate the channel columns.
es: Valide las columnas del canal.

source: Validate the control columns.
es: Valide las columnas de control.

source: Validate the date column.
es: Valide la columna de fecha.

source: Validate the target column.
es: Valide la columna objetivo.
