Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.create_m_and_L_recommendations.po
Languages: es

source: create\_m\_and\_L\_recommendations
es: crear_recomendaciones_m_y_L

source: Create recommendations for the number of basis functions based on the data.
es: Cree recomendaciones para el número de funciones base en función de los datos.

source: Parameters
es: Parámetros

source: The data.
es: Los datos.

source: The mean of the data.
es: La media de los datos.

source: Lower bound for the lengthscale. Default is 1.0.
es: Límite inferior para la escala de longitud. El valor predeterminado es 1.0.

source: **ls_upper** : :class:`python:float`, optional
es: **ls_upper** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: Upper bound for the lengthscale. Default is None.
es: Límite superior para la escala de longitud. El valor predeterminado es None.

source: The covariance function. Default is CovFunc.ExpQuad.
es: La función de covarianza. El valor predeterminado es CovFunc.ExpQuad.

source: Returns
es: Devoluciones

source: The number of basis functions and the boundary of the approximation.
es: El número de funciones base y el límite de la aproximación.
