Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.lift_test.exact_row_indices.po
Languages: es

source: Get indices in the model for each row in the DataFrame.
es: Obtenga índices en el modelo para cada fila en el DataFrame.

source: Assumes any column in the DataFrame is a coordinate in the model with the same name.
es: Asume que cualquier columna en el DataFrame es una coordenada en el modelo con el mismo nombre.

source: If the DataFrame has columns that are not in the model, it will raise an error.
es: Si el DataFrame tiene columnas que no están en el modelo, se generará un error.

source: Parameters
es: Parámetros

source: DataFrame with coordinates combinations.
es: DataFrame con combinaciones de coordenadas.

source: **model** : :obj:`pm.Model`
es: **modelo** : :obj:`pm.Model`

source: PyMC model with all the coordinates in the DataFrame.
es: Modelo PyMC con todas las coordenadas en el DataFrame.

source: Returns
es: Devoluciones

source: Dictionary of indices for the lift test results in the model.
es: Diccionario de índices para los resultados de las pruebas de elevación en el modelo.

source: Raises
es: Aumentos

source: If some values are not aligned. This means that some values in the DataFrame are not in the model.
es: Si algunos valores no están alineados. Esto significa que algunos valores en el DataFrame no están en el modelo.

source: If some coordinates in the DataFrame are not in the model.
es: Si algunas coordenadas en el DataFrame no están en el modelo.

source: Examples
es: Ejemplos

source: Get the indices from a DataFrame and model:
es: Obtenga los índices de un DataFrame y modelo:
