Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.media_transformation.MediaTransformation.po
Languages: es

source: MediaTransformation
es: TransformaciónDeMedios

source: Wrapper for applying adstock and saturation transformation to media data.
es: Envoltura para aplicar la transformación de adstock y saturación a los datos de medios.

source: Parameters
es: Parámetros

source: **adstock** : :obj:`AdstockTransformation`
es: **adstock** : :obj:`TransformaciónAdstock`

source: AdstockTransformation
es: TransformaciónAdstock

source: The adstock transformation to apply.
es: La transformación de adstock a aplicar.

source: **saturation** : :obj:`SaturationTransformation`
es: **saturación** : :obj:`SaturationTransformation`

source: SaturationTransformation
es: Transformación de Saturación

source: The saturation transformation to apply.
es: La transformación de saturación a aplicar.

source: **adstock_first** : :ref:`bool <python:bltin-boolean-values>`
es: **adstock_first** : :ref:`bool <python:valores-boleanos>`

source: Flag to apply the adstock transformation first.
es: Bandera para aplicar primero la transformación de adstock.

source: Dims
es: Dimensiones

source: The dimensions of the parameters.
es: Las dimensiones de los parámetros.

source: Attributes
es: Atributos

source: **first** : :obj:`AdstockTransformation` | :obj:`SaturationTransformation`
es: **primero** : :obj:`AdstockTransformation` | :obj:`SaturationTransformation`

source: The first transformation to apply.
es: La primera transformación a aplicar.

source: **second** : :obj:`AdstockTransformation` | :obj:`SaturationTransformation`
es: **segundo** : :obj:`AdstockTransformation` | :obj:`SaturationTransformation`

source: The second transformation to apply.
es: La segunda transformación a aplicar.

source: Methods
es: Métodos

source: :py:obj:`MediaTransformation.from_dict <pymc_marketing.mmm.media_transformation.MediaTransformation.from_dict>`\ \(data\)
es: :py:obj:`MediaTransformation.from_dict <pymc_marketing.mmm.media_transformation.MediaTransformation.from_dict>`\ \(datos\)

source: Create a media transformation from a dictionary.
es: Cree una transformación de medios a partir de un diccionario.

source: Convert the media transformation to a dictionary.
es: Convierte la transformación de medios en un diccionario.

source: :py:obj:`saturation <pymc_marketing.mmm.media_transformation.MediaTransformation.saturation>`\
es: :py:obj:`saturación <pymc_marketing.mmm.media_transformation.MediaTransformation.saturación>`\
