Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.fourier.po
Languages: es

source: Fourier seasonality transformations.
es: Transformaciones de estacionalidad de Fourier.

source: This modules provides Fourier seasonality transformations for use in Marketing Mix Models. The Fourier seasonality is a set of sine and cosine functions that can be used to model periodic patterns in the data.
es: Este módulo proporciona transformaciones de estacionalidad de Fourier para su uso en Modelos de Mezcla de Marketing. La estacionalidad de Fourier es un conjunto de funciones seno y coseno que se pueden utilizar para modelar patrones periódicos en los datos.

source: There are two types of Fourier seasonality transformations available:
es: Hay dos tipos de transformaciones de estacionalidad de Fourier disponibles:

source: Yearly Fourier: A yearly seasonality with a period of 365.25 days
es: Fourier Anual: Una estacionalidad anual con un período de 365.25 días.

source: Monthly Fourier: A monthly seasonality with a period of 365.25 / 12 days
es: Mensual de Fourier: Una estacionalidad mensual con un período de 365.25 / 12 días

source: Weekly Fourier: A weekly seasonality with a period of 7 days
es: Fourier Semanal: Una estacionalidad semanal con un período de 7 días

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-1.pdf>`)

source: Examples
es: Ejemplos

source: Use yearly fourier seasonality for custom Marketing Mix Model.
es: Utilice la estacionalidad de Fourier anual para el modelo de mezcla de marketing personalizado.

source: Plot the prior fourier seasonality trend.
es: Trazar la tendencia de estacionalidad de Fourier previa.

source: Change the prior distribution of the fourier seasonality.
es: Cambia la distribución previa de la estacionalidad de Fourier.

source: Even make it hierarchical...
es: Incluso hacerlo jerárquico...

source: All the plotting will still work! Just pass any coords.
es: ¡Toda la representación gráfica seguirá funcionando! Simplemente pasa cualquier coordenada.

source: Out of sample predictions with fourier seasonality by changing the day of year used in the model.
es: Predicciones fuera de muestra con estacionalidad de Fourier al cambiar el día del año utilizado en el modelo.

source: Use yearly and monthly fourier seasonality together.
es: Utilice la estacionalidad de Fourier anual y mensual juntas.

source: By default, the prefix of the fourier seasonality is set to "fourier". However, the prefix can be changed upon initialization in order to avoid variable name conflicts.
es: Por defecto, el prefijo de la estacionalidad de Fourier se establece en "fourier". Sin embargo, el prefijo se puede cambiar durante la inicialización para evitar conflictos en los nombres de las variables.

source: Functions
es: Funciones

source: :py:obj:`generate_fourier_modes <pymc_marketing.mmm.fourier.generate_fourier_modes>`\ \(periods\, n\_order\)
es: :py:obj:`generate_fourier_modes <pymc_marketing.mmm.fourier.generate_fourier_modes>`\ \(periodos\, n\_orden\)

source: Create fourier modes for a given period.
es: Crear modos de Fourier para un período dado.

source: Classes
es: Clases

source: Base class for Fourier seasonality transformations.
es: Clase base para transformaciones de estacionalidad de Fourier.

source: Monthly fourier seasonality.
es: Estacionalidad mensual de Fourier.

source: Weekly fourier seasonality.
es: Estacionalidad semanal de Fourier.

source: Yearly fourier seasonality.
es: Estacionalidad de Fourier anual.
