Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.plot.po
Languages: es

source: plot
es: trama

source: MMM related plotting class.
es: Clase de trazado relacionada con MMM.

source: Examples
es: Ejemplos

source: Quickstart with MMM:
es: Inicio rápido con MMM:

source: Wrap a custom PyMC model
es: Envuelva un modelo PyMC personalizado

source: Requirements
es: Requisitos

source: posterior_predictive plots: an `az.InferenceData` with a `posterior_predictive` group containing the variable(s) you want to plot with a `date` coordinate.
es: gráficas predictivas posteriores: un `az.InferenceData` con un grupo `posterior_predictive` que contiene la(s) variable(s) que desea graficar con una coordenada `date`.

source: contributions_over_time plots: a `posterior` group with time‑series variables (with `date`).
es: contribuciones_a_lo_largo_del_tiempo gráficos: un grupo `posterior` con variables de series temporales (con `fecha`).

source: saturation plots: a `constant_data` dataset with variables: - `channel_data`: dims include `("date", "channel", ...)` - `channel_scale`: dims include `("channel", ...)` - `target_scale`: scalar or broadcastable to the curve dims and a `posterior` variable named `channel_contribution` (or `channel_contribution_original_scale` if plotting `original_scale=True`).
es: gráficos de saturación: un conjunto de datos `constant_data` con variables: - `channel_data`: las dimensiones incluyen `("fecha", "canal", ...)` - `channel_scale`: las dimensiones incluyen `("canal", ...)` - `target_scale`: escalar o transmisible a las dimensiones de la curva y una variable `posterior` llamada `channel_contribution` (o `channel_contribution_original_scale` si se grafica `original_scale=True`).

source: Custom contributions_over_time
es: msgid: Custom contributions_over_time msgstr: Contribuciones personalizadas_a_lo_largo_del_tiempo

source: Saturation plots with a custom model
es: Gráficos de saturación con un modelo personalizado

source: Notes
es: Notas

source: `MMM` exposes this suite via the `mmm.plot` property, which internally passes the model's `idata` into `MMMPlotSuite`.
es: `MMM` expone esta suite a través de la propiedad `mmm.plot`, que internamente pasa el `idata` del modelo a `MMMPlotSuite`.

source: Any PyMC model can use `MMMPlotSuite` directly if its `InferenceData` contains the needed groups/variables described above.
es: Cualquier modelo de PyMC puede utilizar `MMMPlotSuite` directamente si su `InferenceData` contiene los grupos/variables necesarios descritos anteriormente.

source: Classes
es: Clases

source: Media Mix Model Plot Suite.
es: Suite de Gráficos del Modelo de Mezcla de Medios.
