Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.causal.CausalGraphModel.po
Languages: es

source: Represent a causal model based on a Directed Acyclic Graph (DAG).
es: Representar un modelo causal basado en un Grafo Acíclico Dirigido (DAG).

source: Provides methods to analyze causal relationships and determine the minimal adjustment set for backdoor adjustment between treatment and outcome variables.
es: Proporciona métodos para analizar relaciones causales y determinar el conjunto mínimo de ajustes para el ajuste de puerta trasera entre las variables de tratamiento y resultado.

source: Parameters
es: Parámetros

source: **causal_model** : :obj:`CausalModel`
es: **modelo_causal** : :obj:`ModeloCausal`

source: An instance of dowhy's CausalModel, representing the causal graph and its relationships.
es: Una instancia del CausalModel de dowhy, que representa el grafo causal y sus relaciones.

source: **treatment** : :class:`python:list`\[:class:`python:str`]
es: **tratamiento** : :class:`python:list`\[:class:`python:str`]

source: A list of treatment variable names.
es: Una lista de nombres de variables de tratamiento.

source: **outcome** : :class:`python:str`
es: **resultado** : :class:`python:str`

source: The outcome variable name.
es: El nombre de la variable de resultado.

source: References
es: Referencias

source: Methods
es: Métodos

source: :py:obj:`CausalGraphModel.__init__ <pymc_marketing.mmm.causal.CausalGraphModel.__init__>`\ \(causal\_model\, ...\)
es: :py:obj:`CausalGraphModel.__init__ <pymc_marketing.mmm.causal.CausalGraphModel.__init__>`\ \(modelo\_causal\, ...\)

source: Create a CausalGraphModel from a string representation of a graph.
es: Cree un CausalGraphModel a partir de una representación en cadena de un grafo.

source: Compute minimal adjustment sets and handle warnings.
es: Calcule conjuntos de ajuste mínimos y maneje las advertencias.

source: Find all backdoor paths between the combined treatment and outcome variables.
es: Encuentra todos los caminos de puerta trasera entre las variables de tratamiento combinadas y las variables de resultado.

source: Compute the minimal adjustment set required for backdoor adjustment across all treatments.
es: Calcule el conjunto de ajuste mínimo requerido para el ajuste de puerta trasera en todos los tratamientos.
