Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.po
Languages: es

source: :py:obj:`prior <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.prior>`\
es: { "singular": ":py:obj:`prior <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.prior>`", "plural": ":py:obj:`prior <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.prior>`" }

source: :py:obj:`prior_predictive <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.prior_predictive>`\
es: { "singular": ":py:obj:`prior_predictive <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.prior_predictive>`", "plural": ":py:obj:`prior_predictive <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.prior_predictive>`" }

source: :py:obj:`version <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.version>`\
es: { "singular": ":py:obj:`versión <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.versión>`", "plural": ":py:obj:`versiones <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.versiones>`" }

source: :py:obj:`idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.idata>`\
es: { "singular": ":py:obj:`idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.idata>`", "plural": ":py:obj:`idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.idata>`" }

source: :py:obj:`sampler_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.sampler_config>`\
es: { "singular": ":py:obj:`sampler_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.sampler_config>`", "plural": ":py:obj:`sampler_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.sampler_config>`" }

source: :py:obj:`model_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.model_config>`\
es: { "singular": ":py:obj:`model_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.model_config>`", "plural": ":py:obj:`model_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.model_config>`" }
