Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.create_log_callback.po
Languages: es

source: create\_log\_callback
es: crear\_registro\_callback

source: Create callback function to log sample stats and parameter values to MLflow during sampling.
es: Cree una función de devolución de llamada para registrar estadísticas de muestra y valores de parámetros en MLflow durante el muestreo.

source: This callback only works for the "pymc" sampler.
es: Esta devolución de llamada solo funciona para el muestreador "pymc".

source: Parameters
es: Parámetros

source: **stats** : :class:`python:list` of :class:`python:str`, optional
es: **estadísticas** : :class:`python:list` de :class:`python:str`, opcional

source: python:list of python:str, optional
es: python:lista de python:str, opcional

source: List of sample statistics to log from the Draw
es: Lista de estadísticas de muestra para registrar del Sorteo

source: **parameters** : :class:`python:list` of :class:`python:str`, optional
es: **parámetros** : :class:`python:list` de :class:`python:str`, opcional

source: List of parameters to log from the Draw
es: Lista de parámetros para registrar desde el Draw

source: **exclude_tuning** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **exclude_tuning** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to exclude tuning steps from logging. Defaults to True.
es: Si se deben excluir los pasos de ajuste del registro. Por defecto es True.

source: **take_every** : :class:`python:int`, optional
es: **take_every** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: Specifies the interval at which to log values. Defaults to 100.
es: Especifica el intervalo en el que se registran los valores. Por defecto es 100.

source: Returns
es: Devoluciones

source: Callable
es: Llamable

source: The callback function to log sample stats and parameter values to MLflow during sampling
es: La función de devolución de llamada para registrar estadísticas de muestra y valores de parámetros en MLflow durante el muestreo.

source: Examples
es: Ejemplos

source: Create example model:
es: Crear modelo de ejemplo:

source: Log off divergences and logp every 100th draw:
es: Registrar divergencias y registrar cada 100ª extracción:

source: Log the parameters `mu` and `sigma_log__` every 100th draw:
es: Registre los parámetros `mu` y `sigma_log__` cada 100ª extracción:
