Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.budget_optimizer.optimizer_xarray_builder.po
Languages: es

source: optimizer\_xarray\_builder
es: constructor\_xarray\_optimizador

source: Create an xarray.DataArray with flexible dimensions and coordinates.
es: Cree un xarray.DataArray con dimensiones y coordenadas flexibles.

source: Parameters
es: Parámetros

source: **value** : :term:`numpy:array_like`
es: **valor** : :term:`numpy:array_like`

source: numpy:array_like
es: numpy:similar_a_array

source: The data values for the DataArray. Shape must match the dimensions implied by the kwargs.
es: Los valores de datos para el DataArray. La forma debe coincidir con las dimensiones implicadas por los kwargs.

source: Key-value pairs representing dimension names and their corresponding coordinates.
es: Pares clave-valor que representan nombres de dimensiones y sus coordenadas correspondientes.

source: Returns
es: Devoluciones

source: The resulting DataArray with the specified dimensions and values.
es: El DataArray resultante con las dimensiones y valores especificados.

source: Raises
es: Aumentos

source: If the shape of `value` doesn't match the lengths of the specified coordinates.
es: Si la forma de `value` no coincide con las longitudes de las coordenadas especificadas.

source: Examples
es: Ejemplos

source: Create a DataArray for budget bounds with channels and bound types:
es: Cree un DataArray para los límites del presupuesto con canales y tipos de límite:

source: Create a DataArray for budget allocation with channels and regions:
es: Cree un DataArray para la asignación de presupuesto con canales y regiones:
