Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.media_transformation.MediaConfig.po
Languages: es

source: Configuration for a media transformation to certain media channels.
es: Configuración para una transformación de medios a ciertos canales de medios.

source: Parameters
es: Parámetros

source: **name** : :class:`python:str`
es: **nombre** : :class:`python:str`

source: The name of the media transformation and prefix of all media variables.
es: El nombre de la transformación de medios y el prefijo de todas las variables de medios.

source: **columns** : :class:`python:list`\[:class:`python:str`]
es: **columnas** : :class:`python:list`\[:class:`python:str`]

source: The media channels to apply the transformation to.
es: Los canales de medios a los que aplicar la transformación.

source: MediaTransformation
es: TransformaciónDeMedios

source: The media transformation to apply to the media channels.
es: La transformación de medios que se aplicará a los canales de medios.

source: Methods
es: Métodos

source: :py:obj:`MediaConfig.__init__ <pymc_marketing.mmm.media_transformation.MediaConfig.__init__>`\ \(name\, columns\, ...\)
es: :py:obj:`MediaConfig.__init__ <pymc_marketing.mmm.media_transformation.MediaConfig.__init__>`\ \(nombre\, columnas\, ...\)

source: :py:obj:`MediaConfig.from_dict <pymc_marketing.mmm.media_transformation.MediaConfig.from_dict>`\ \(data\)
es: :py:obj:`MediaConfig.from_dict <pymc_marketing.mmm.media_transformation.MediaConfig.from_dict>`\ \(datos\)

source: Create a media configuration from a dictionary.
es: Cree una configuración de medios a partir de un diccionario.

source: Convert the media configuration to a dictionary.
es: Convierte la configuración de medios a un diccionario.

source: Attributes
es: Atributos
