Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.components.saturation.po
Languages: es

source: saturation
es: saturación

source: Saturation transformations for the MMM model.
es: Transformaciones de saturación para el modelo MMM.

source: Each of these transformations is a subclass of :class:`pymc_marketing.mmm.components.saturation.SaturationTransformation` and defines a function that takes media and return the saturated media. The parameters of the function are the parameters of the saturation transformation.
es: Cada una de estas transformaciones es una subclase de :class:`pymc_marketing.mmm.components.saturation.SaturationTransformation` y define una función que toma medios y devuelve los medios saturados. Los parámetros de la función son los parámetros de la transformación de saturación.

source: Examples
es: Ejemplos

source: Create a new saturation transformation:
es: Cree una nueva transformación de saturación:

source: Plot the default priors for a saturation transformation:
es: Trace las priors predeterminadas para una transformación de saturación:

source: Define a hierarchical saturation function with only hierarchical parameters for saturation parameter of logistic saturation.
es: Defina una función de saturación jerárquica con solo parámetros jerárquicos para el parámetro de saturación de la saturación logística.

source: Functions
es: Funciones

source: :py:obj:`saturation_from_dict <pymc_marketing.mmm.components.saturation.saturation_from_dict>`\ \(data\)
es: :py:obj:`saturation_from_dict <pymc_marketing.mmm.components.saturation.saturation_from_dict>`\ \(datos\)

source: Get a saturation function from a dictionary.
es: Obtenga una función de saturación de un diccionario.

source: Classes
es: Clases

source: Wrapper around Hill saturation function.
es: Envoltura alrededor de la función de saturación de Hill.

source: Wrapper around Hill saturation sigmoid function.
es: Envoltura alrededor de la función sigmoide de saturación de Hill.

source: Wrapper around inverse scaled logistic saturation function.
es: Envoltura alrededor de la función de saturación logística inversamente escalada.

source: Wrapper around logistic saturation function.
es: Envoltura alrededor de la función de saturación logística.

source: Wrapper around Michaelis-Menten saturation function.
es: Envoltura alrededor de la función de saturación de Michaelis-Menten.

source: Wrapper around linear saturation function.
es: Envoltura alrededor de la función de saturación lineal.

source: Wrapper around Root saturation function.
es: Envoltura alrededor de la función de saturación raíz.

source: Subclass for all saturation transformations.
es: Subclase para todas las transformaciones de saturación.

source: Wrapper around tanh saturation function.
es: Envoltura alrededor de la función de saturación tanh.
