Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.bass.model.create_bass_model.po
Languages: es

source: create\_bass\_model
es: crear\_modelo\_bajo

source: Define a Bass diffusion model for product adoption forecasting.
es: Defina un modelo de difusión de Bass para la previsión de la adopción de productos.

source: This function creates a Bayesian Bass diffusion model using PyMC to forecast product adoption over time. The Bass model captures both innovation (external influence like advertising) and imitation (internal influence like word-of-mouth) effects in the adoption process.
es: Esta función crea un modelo de difusión de Bass bayesiano utilizando PyMC para predecir la adopción de productos a lo largo del tiempo. El modelo de Bass captura tanto los efectos de innovación (influencia externa como la publicidad) como los de imitación (influencia interna como el boca a boca) en el proceso de adopción.

source: The model includes the following components:
es: El modelo incluye los siguientes componentes:

source: Market potential 'm': Total number of eventual adopters
es: Potencial de mercado 'm': Número total de posibles adoptantes

source: Innovation coefficient 'p': Measures external influence
es: Coeficiente de innovación 'p': Mide la influencia externa

source: Imitation coefficient 'q': Measures internal influence
es: Coeficiente de imitación 'q': Mide la influencia interna

source: Adopters over time: Number of new adopters at each time point
es: Adoptantes a lo largo del tiempo: Número de nuevos adoptantes en cada punto temporal

source: Innovators: Adopters influenced by external factors
es: Innovadores: Adoptantes influenciados por factores externos

source: Imitators: Adopters influenced by previous adopters
es: Imitadores: Adoptantes influenciados por adoptantes anteriores

source: Peak adoption time: When adoption rate reaches maximum
es: Tiempo máximo de adopción: Cuando la tasa de adopción alcanza su máximo

source: Parameters
es: Parámetros

source: pt.TensorLike
es: pt.TensorComo

source: Time points for which the adoption is modeled.
es: Puntos de tiempo para los cuales se modela la adopción.

source: **observed** : :obj:`pt.TensorLike` | :data:`python:None`
es: **observado** : :obj:`pt.TensorLike` | :data:`python:None`

source: pt.TensorLike | python:None
es: pt.TensorLike | python:Ninguno

source: Observed adoption data at each time point. If None, only prior predictive sampling is possible.
es: Datos de adopción observados en cada punto temporal. Si es None, solo es posible el muestreo predictivo previo.

source: python:dict[python:str, Prior | Censored | VariableFactory]
es: python:dict[python:str, Prior | Censurado | VariableFactory]

source: Dictionary containing priors for: - 'm': Market potential prior - 'p': Innovation coefficient prior - 'q': Imitation coefficient prior - 'likelihood': Observation likelihood model
es: Diccionario que contiene priors para: - 'm': Prior de potencial de mercado - 'p': Prior del coeficiente de innovación - 'q': Prior del coeficiente de imitación - 'likelihood': Modelo de probabilidad de observación

source: python:dict[python:str, Any]
es: python:dict[python:str, Cualquiera]

source: Coordinate values for dimensions in the model, including 'date' for the time dimension and any other dimensions included in the prior specifications.
es: Coordine los valores para las dimensiones en el modelo, incluyendo 'fecha' para la dimensión temporal y cualquier otra dimensión incluida en las especificaciones anteriores.

source: Returns
es: Devoluciones

source: A PyMC model object for the Bass diffusion model, containing the variables m, p, q, adopters, innovators, imitators, peak, and the likelihood y.
es: Un objeto de modelo PyMC para el modelo de difusión de Bass, que contiene las variables m, p, q, adoptantes, innovadores, imitadores, pico y la verosimilitud y.

source: Notes
es: Notas

source: The returned model can be used for prior predictive checks, posterior sampling, and posterior predictive checks to forecast product adoption.
es: El modelo devuelto puede ser utilizado para verificaciones predictivas previas, muestreo posterior y verificaciones predictivas posteriores para pronosticar la adopción del producto.

source: The model implements the following mathematical relationships:
es: El modelo implementa las siguientes relaciones matemáticas:
