Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.po
Languages: es

source: Marketing Mix Models (MMM).
es: Modelos de Mezcla de Marketing (MMM).

source: Modules
es: Módulos

source: :py:obj:`additive_effect <pymc_marketing.mmm.additive_effect>`\
es: :py:obj:`efecto_aditivo <pymc_marketing.mmm.efecto_aditivo>`

source: Additive effects for the multidimensional Marketing Mix Model.
es: Efectos aditivos para el modelo de mezcla de marketing multidimensional.

source: Base class for Marketing Mix Models (MMM).
es: Clase base para Modelos de Mezcla de Marketing (MMM).

source: :py:obj:`budget_optimizer <pymc_marketing.mmm.budget_optimizer>`\
es: :py:obj:`optimizador_de_presupuesto <pymc_marketing.mmm.optimizador_de_presupuesto>`\

source: Budget optimization module.
es: Módulo de optimización de presupuesto.

source: :py:obj:`builders <pymc_marketing.mmm.builders>`\
es: :py:obj:`constructores <pymc_marketing.mmm.builders>`\

source: Configuration I/O for PyMC-Marketing.
es: Configuración de I/O para PyMC-Marketing.

source: Causal module.
es: Módulo causal.

source: :py:obj:`components <pymc_marketing.mmm.components>`\
es: :py:obj:`componentes <pymc_marketing.mmm.components>`

source: Components for media transformation in the MMM model.
es: Componentes para la transformación de medios en el modelo MMM.

source: Constraints for the BudgetOptimizer.
es: Restricciones para el BudgetOptimizer.

source: :py:obj:`evaluation <pymc_marketing.mmm.evaluation>`\
es: :py:obj:`evaluación <pymc_marketing.mmm.evaluación>`\

source: Evaluation and diagnostics for MMM models.
es: Evaluación y diagnósticos para modelos MMM.

source: Event transformations.
es: Transformaciones de eventos.

source: Fourier seasonality transformations.
es: Transformaciones de estacionalidad de Fourier.

source: HSGP components.
es: Componentes HSGP.

source: Adding lift tests as observations of saturation function.
es: Agregando pruebas de elevación como observaciones de la función de saturación.

source: Linear regression model implemented using the MMM class.
es: Modelo de regresión lineal implementado utilizando la clase MMM.

source: :py:obj:`linear_trend <pymc_marketing.mmm.linear_trend>`\
es: :py:obj:`tendencia_lineal <pymc_marketing.mmm.tendencia_lineal>`\

source: Linear trend using change points.
es: Tendencia lineal utilizando puntos de cambio.

source: :py:obj:`media_transformation <pymc_marketing.mmm.media_transformation>`\
es: :py:obj:`transformación_de_medios <pymc_marketing.mmm.transformación_de_medios>`\

source: Module for applying media transformations to media data.
es: Módulo para aplicar transformaciones de medios a datos de medios.

source: Media Mix Model class.
es: Clase de Modelo de Mezcla de Medios.

source: Multidimensional Marketing Mix Model (MMM).
es: Modelo de Mezcla de Marketing Multidimensional (MMM).

source: MMM related plotting class.
es: Clase de trazado relacionada con MMM.

source: :py:obj:`preprocessing <pymc_marketing.mmm.preprocessing>`\
es: :py:obj:`preprocesamiento <pymc_marketing.mmm.preprocessing>`

source: Preprocessing methods for the Marketing Mix Model.
es: Métodos de preprocesamiento para el Modelo de Mezcla de Marketing.

source: :py:obj:`scaling <pymc_marketing.mmm.scaling>`\
es: :py:obj:`escalado <pymc_marketing.mmm.escalado>`\

source: Scaling configuration for the MMMM.
es: Configuración de escalado para el MMMM.

source: :py:obj:`sensitivity_analysis <pymc_marketing.mmm.sensitivity_analysis>`\
es: :py:obj:`análisis_de_sensibilidad <pymc_marketing.mmm.análisis_de_sensibilidad>`\

source: Counterfactual sweeps for Marketing Mix Models (MMM).
es: Barridos contrafactuales para Modelos de Mezcla de Marketing (MMM).

source: Media transformation functions for Marketing Mix Models.
es: Funciones de transformación de medios para Modelos de Mezcla de Marketing.

source: Time Varying Gaussian Process Multiplier for Marketing Mix Modeling (MMM).
es: Multiplicador de Proceso Gaussiano Variable en el Tiempo para Modelado de Mezcla de Marketing (MMM).

source: Utility functions for Bayesian optimization.
es: Funciones utilitarias para la optimización bayesiana.

source: Utility functions for the Marketing Mix Modeling module.
es: Funciones utilitarias para el módulo de Modelado de Mezcla de Marketing.

source: :py:obj:`validating <pymc_marketing.mmm.validating>`\
es: :py:obj:`validando <pymc_marketing.mmm.validando>`\

source: Validating methods for MMM classes.
es: Validando métodos para las clases MMM.
