Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.po
Languages: es

source: ShiftedBetaGeoModel
es: { "singular": "ModeloGeoBetaDesplazado", "plural": "ModelosGeoBetaDesplazados" }

source: Shifted Beta Geometric (sBG) model for customers renewing contracts over discrete time periods.
es: { "singular": "Modelo Geométrico Beta Desplazado (sBG) para clientes que renuevan contratos durante períodos de tiempo discretos.", "plural": "Modelo Geométrico Beta Desplazado (sBG) para clientes que renuevan contratos durante períodos de tiempo discretos." }

source: The sBG model has the following assumptions:
es: { "singular": "El modelo sBG tiene las siguientes suposiciones:", "plural": "El modelo sBG tiene las siguientes suposiciones:" }

source: Dropout probabilities for each cohortare Beta-distributed with hyperparameters `alpha` and `beta`.
es: { "singular": "Las probabilidades de abandono para cada cohorte están distribuidas según una Beta con hiperparámetros `alpha` y `beta`.", "plural": "Las probabilidades de abandono para cada cohorte están distribuidas según una Beta con hiperparámetros `alpha` y `beta`." }

source: Cohort retention rates change over time due to customer heterogeneity.
es: { "singular": "Las tasas de retención de cohortes cambian con el tiempo debido a la heterogeneidad de los clientes.", "plural": "Las tasas de retención de cohortes cambian con el tiempo debido a la heterogeneidad de los clientes." }

source: Customers in the same cohort began their contract in the same time period.
es: { "singular": "Los clientes en la misma cohorte comenzaron su contrato en el mismo período de tiempo.", "plural": "Los clientes en las mismas cohortes comenzaron sus contratos en los mismos períodos de tiempo." }

source: This model requires data to be summarized by *recency*, *T*, and *cohort* for each customer. Modeling assumptions require *1 <= recency <= T*, and *T >= 2*.
es: { "singular": "Este modelo requiere que los datos sean resumidos por *recencia*, *T* y *cohorte* para cada cliente. Las suposiciones del modelo requieren *1 <= recencia <= T* y *T >= 2*.", "plural": "Este modelo requiere que los datos sean resumidos por *recencia*, *T* y *cohorte* para cada cliente. Las suposiciones del modelo requieren *1 <= recencia <= T* y *T >= 2*." }

source: First introduced by Fader & Hardie in [Ra4208df6b784-1]_.
es: { "singular": "Primero introducido por Fader & Hardie en [Ra4208df6b784-1]_.", "plural": "Primero introducido por Fader & Hardie en [Ra4208df6b784-1]_." }

source: Parameters
es: { "singular": "Parámetro", "plural": "Parámetros" }

source: **data** : :obj:`~pandas.DataFrame`
es: { "singular": "**datos** : :obj:`~pandas.DataFrame`", "plural": "**datos** : :obj:`~pandas.DataFrame`" }

source: DataFrame
es: { "singular": "DataFrame", "plural": "DataFrames" }

source: DataFrame containing the following columns:
es: { "singular": "DataFrame que contiene la siguiente columna:", "plural": "DataFrame que contiene las siguientes columnas:" }

source: `customer_id`: Unique customer identifier
es: { "singular": { "msgid": "`customer_id`: Unique customer identifier", "msgstr": "`customer_id`: Identificador único del cliente" }, "plural": { "msgid": "`customer_id`: Unique customer identifier", "msgstr": "`customer_id`: Identificador único de los clientes" } }

source: `recency`: Time period of last contract renewal. It should equal *T* for active customers.
es: { "singular": { "msgid": "recency: Time period of last contract renewal. It should equal *T* for active customers.", "msgstr": "recency: Período de tiempo de la última renovación del contrato. Debe ser igual a *T* para los clientes activos." }, "plural": { "msgid": "recency: Time period of last contract renewal. It should equal *T* for active customers.", "msgstr": "recency: Período de tiempo de la última renovación del contrato. Debe ser igual a *T* para los clientes activos." } }

source: `T`: Max observed time period in the cohort. All customers in a given cohort share the same value for *T*.
es: { "singular": { "msgid": "T: Max observed time period in the cohort. All customers in a given cohort share the same value for *T*.", "msgstr": "T: Período máximo de tiempo observado en la cohorte. Todos los clientes en una cohorte dada comparten el mismo valor para *T*." }, "plural": { "msgid": "T: Max observed time period in the cohort. All customers in a given cohort share the same value for *T*.", "msgstr": "T: Período máximo de tiempo observado en las cohortes. Todos los clientes en una cohorte dada comparten el mismo valor para *T*." } }

source: `cohort`: Customer cohort label
es: { "singular": { "msgid": "cohort", "msgstr": "etiqueta de cohorte de clientes" }, "plural": { "msgid": "cohort", "msgstr": "etiquetas de cohorte de clientes" } }

source: **model_config** : :class:`python:dict`, optional
es: { "singular": "**model_config** : :class:`python:dict`, opcional", "plural": "**model_config** : :class:`python:dict`, opcional" }

source: python:dict, optional
es: { "singular": "python:dict, opcional", "plural": "python:dict, opcional" }

source: Dictionary of model prior parameters:
es: { "singular": "Diccionario de parámetros previos del modelo:", "plural": "Diccionario de parámetros previos del modelo:" }

source: `a`: Shape parameter of dropout process; defaults to `phi_purchase` * `kappa_purchase`
es: { "singular": { "msgid": "`a`: Shape parameter of dropout process; defaults to `phi_purchase` * `kappa_purchase`", "msgstr": "`a`: Parámetro de forma del proceso de abandono; por defecto es `phi_purchase` * `kappa_purchase`" }, "plural": { "msgid": "`a`: Shape parameter of dropout process; defaults to `phi_purchase` * `kappa_purchase`", "msgstr": "`a`: Parámetro de forma del proceso de abandono; por defecto es `phi_purchase` * `kappa_purchase`" } }

source: `b`: Shape parameter of dropout process; defaults to `1-phi_dropout` * `kappa_dropout`
es: { "singular": "b: Parámetro de forma del proceso de abandono; por defecto es `1-phi_dropout` * `kappa_dropout`", "plural": "b: Parámetro de forma del proceso de abandono; por defecto es `1-phi_dropout` * `kappa_dropout`" }

source: `phi_dropout`: Pooling prior; defaults to `Prior("Uniform", lower=0, upper=1, dims="cohort")`
es: { "singular": "`phi_dropout`: Agrupación previa; por defecto es `Prior(\"Uniform\", lower=0, upper=1, dims=\"cohort\")`", "plural": "`phi_dropout`: Agrupación previa; por defecto es `Prior(\"Uniform\", lower=0, upper=1, dims=\"cohort\")`" }

source: `kappa_dropout`: Pooling prior; defaults to `Prior("Pareto", alpha=1, m=1, dims="cohort")`
es: { "singular": "`kappa_dropout`: Agrupación previa; por defecto es `Prior(\"Pareto\", alpha=1, m=1, dims=\"cohort\")`", "plural": "`kappa_dropout`: Agrupación previa; por defecto es `Prior(\"Pareto\", alpha=1, m=1, dims=\"cohort\")`" }

source: **sampler_config** : :class:`python:dict`, optional
es: { "singular": "**sampler_config** : :class:`python:dict`, opcional", "plural": "**sampler_config** : :class:`python:dict`, opcional" }

source: Dictionary of sampler parameters. Defaults to *None*.
es: { "singular": "Diccionario de parámetros del muestreador. Por defecto es *Ninguno*.", "plural": "Diccionario de parámetros del muestreador. Por defecto es *Ninguno*." }

source: References
es: { "singular": "Referencia", "plural": "Referencias" }

source: Fader, P. S., & Hardie, B. G. (2007). How to project customer retention. Journal of Interactive Marketing, 21(1), 76-90. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf
es: { "singular": "Fader, P. S., & Hardie, B. G. (2007). Cómo proyectar la retención de clientes. Journal of Interactive Marketing, 21(1), 76-90. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf", "plural": "Fader, P. S., & Hardie, B. G. (2007). Cómo proyectar la retención de clientes. Journal of Interactive Marketing, 21(1), 76-90. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf" }

source: [Ra4208df6b784-1]_
es: { "singular": "[Ra4208df6b784-1]_", "plural": "[Ra4208df6b784-1]_" }

source: Examples
es: { "singular": "Ejemplo", "plural": "Ejemplos" }

source: Methods
es: { "singular": "Método", "plural": "Métodos" }

source: :py:obj:`ShiftedBetaGeoModel.__init__ <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.__init__>`\ \(data\[\, ...\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.__init__ <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.__init__>`\ \(data\[\, ...\]\)", "plural": ":py:obj:`ShiftedBetaGeoModel.__init__ <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.__init__>`\ \(data\[\, ...\]\)" }

source: Initialize model configuration and sampler configuration for the model.
es: { "singular": "Inicializar la configuración del modelo y la configuración del muestreador para el modelo.", "plural": "Inicializar las configuraciones del modelo y del muestreador para los modelos." }

source: :py:obj:`ShiftedBetaGeoModel.attrs_to_init_kwargs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.attrs_to_init_kwargs>`\ \(attrs\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.attrs_to_init_kwargs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.attrs_to_init_kwargs>`\ \(attrs\)", "plural": ":py:obj:`ShiftedBetaGeoModel.attrs_to_init_kwargs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.attrs_to_init_kwargs>`\ \(attrs\)" }

source: Convert the model configuration and sampler configuration from the attributes to keyword arguments.
es: { "singular": "Convierte la configuración del modelo y la configuración del muestreador de los atributos a argumentos de palabra clave.", "plural": "Convierte las configuraciones del modelo y del muestreador de los atributos a argumentos de palabra clave." }

source: :py:obj:`ShiftedBetaGeoModel.build_from_idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.build_from_idata>`\ \(idata\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.build_from_idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.build_from_idata>`\ \(idata\)", "plural": ":py:obj:`ShiftedBetaGeoModel.build_from_idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.build_from_idata>`\ \(idata\)" }

source: Build the model from the InferenceData object.
es: { "singular": "Construya el modelo a partir del objeto InferenceData.", "plural": "Construyan el modelo a partir del objeto InferenceData." }

source: :py:obj:`ShiftedBetaGeoModel.build_model <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.build_model>`\ \(\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.build_model <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.build_model>`\ \(\)", "plural": ":py:obj:`ShiftedBetaGeoModel.build_model <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.build_model>`\ \(\)" }

source: Build the model.
es: { "singular": "Construya el modelo.", "plural": "Construyan el modelo." }

source: :py:obj:`ShiftedBetaGeoModel.create_idata_attrs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.create_idata_attrs>`\ \(\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.create_idata_attrs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.create_idata_attrs>`\ \(\)", "plural": ":py:obj:`ShiftedBetaGeoModel.create_idata_attrs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.create_idata_attrs>`\ \(\)" }

source: Create attributes for the inference data.
es: { "singular": "Cree atributos para los datos de inferencia.", "plural": "Cree atributos para los datos de inferencia." }

source: :py:obj:`ShiftedBetaGeoModel.expected_probability_alive <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_probability_alive>`\ \(\[...\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.expected_probability_alive <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_probability_alive>`\ \(\[...\]\)", "plural": ":py:obj:`ShiftedBetaGeoModel.expected_probability_alive <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_probability_alive>`\ \(\[...\]\)" }

source: Compute expected probability of contract renewal by cohort.
es: { "singular": "Calcule la probabilidad esperada de renovación del contrato por cohorte.", "plural": "Calcule la probabilidad esperada de renovación de los contratos por cohortes." }

source: :py:obj:`ShiftedBetaGeoModel.expected_residual_lifetime <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_residual_lifetime>`\ \(\[...\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.expected_residual_lifetime <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_residual_lifetime>`\ \(\[...\]\)", "plural": ":py:obj:`ShiftedBetaGeoModel.expected_residual_lifetime <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_residual_lifetime>`\ \(\[...\]\)" }

source: Compute expected residual lifetime of customers by cohort.
es: { "singular": "Calcule la vida residual esperada de los clientes por cohorte.", "plural": "Calcule la vida residual esperada de los clientes por cohortes." }

source: :py:obj:`ShiftedBetaGeoModel.expected_retention_rate <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_retention_rate>`\ \(\[...\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.expected_retention_rate <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_retention_rate>`\ \(\[...\]\)", "plural": ":py:obj:`ShiftedBetaGeoModel.expected_retention_rate <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_retention_rate>`\ \(\[...\]\)" }

source: Compute expected retention rate by cohort.
es: { "singular": "Calcule la tasa de retención esperada por cohorte.", "plural": "Calcule las tasas de retención esperadas por cohortes." }

source: :py:obj:`ShiftedBetaGeoModel.fit <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit>`\ \(\[method\, fit\_method\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.fit <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit>`\ \(\[método\, fit\_method\]\)", "plural": ":py:obj:`ShiftedBetaGeoModel.fit <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit>`\ \(\[métodos\, fit\_method\]\)" }

source: Infer model posterior.
es: { "singular": "Inferir la posterior del modelo.", "plural": "Inferir las posteriores del modelo." }

source: :py:obj:`ShiftedBetaGeoModel.fit_summary <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit_summary>`\ \(\*\*kwargs\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.fit_summary <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit_summary>`\ \(\*\*kwargs\)", "plural": ":py:obj:`ShiftedBetaGeoModel.fit_summary <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit_summary>`\ \(\*\*kwargs\)" }

source: Compute the summary of the fit result.
es: { "singular": "Calcule el resumen del resultado del ajuste.", "plural": "Calcule el resumen de los resultados del ajuste." }

source: :py:obj:`ShiftedBetaGeoModel.graphviz <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.graphviz>`\ \(\*\*kwargs\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.graphviz <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.graphviz>`\ \(\*\*kwargs\)", "plural": ":py:obj:`ShiftedBetaGeoModel.graphviz <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.graphviz>`\ \(\*\*kwargs\)" }

source: Get the graphviz representation of the model.
es: { "singular": "Obtenga la representación graphviz del modelo.", "plural": "Obtengan la representación graphviz del modelo." }

source: :py:obj:`ShiftedBetaGeoModel.idata_to_init_kwargs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.idata_to_init_kwargs>`\ \(idata\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.idata_to_init_kwargs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.idata_to_init_kwargs>`\ \(idata\)", "plural": ":py:obj:`ShiftedBetaGeoModel.idata_to_init_kwargs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.idata_to_init_kwargs>`\ \(idata\)" }

source: Create the initialization kwargs from an InferenceData object.
es: { "singular": "Cree los kwargs de inicialización a partir de un objeto InferenceData.", "plural": "Cree los kwargs de inicialización a partir de objetos InferenceData." }

source: :py:obj:`ShiftedBetaGeoModel.load <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.load>`\ \(fname\[\, check\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.load <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.load>`\ (fname\[\, check\])", "plural": ":py:obj:`ShiftedBetaGeoModel.load <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.load>`\ (fname\[\, check\])" }

source: Create a ModelBuilder instance from a file.
es: { "singular": "Cree una instancia de ModelBuilder a partir de un archivo.", "plural": "Cree instancias de ModelBuilder a partir de archivos." }

source: :py:obj:`ShiftedBetaGeoModel.load_from_idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.load_from_idata>`\ \(idata\[\, ...\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.load_from_idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.load_from_idata>`\ \(idata\[\, ...\]\)", "plural": ":py:obj:`ShiftedBetaGeoModel.load_from_idata <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.load_from_idata>`\ \(idata\[\, ...\]\)" }

source: Create a ModelBuilder instance from an InferenceData object.
es: { "singular": "Cree una instancia de ModelBuilder a partir de un objeto InferenceData.", "plural": "" }

source: :py:obj:`ShiftedBetaGeoModel.save <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.save>`\ \(fname\, \*\*kwargs\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.save <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.save>`\ \(fname\, \*\*kwargs\)", "plural": ":py:obj:`ShiftedBetaGeoModel.save <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.save>`\ \(fname\, \*\*kwargs\)" }

source: Save the model's inference data to a file.
es: { "singular": { "msgid": "Save the model's inference data to a file.", "msgstr": "Guarde los datos de inferencia del modelo en un archivo." }, "plural": { "msgid": "Save the model's inference data to a file.", "msgstr": "Guarde los datos de inferencia del modelo en un archivo." } }

source: :py:obj:`ShiftedBetaGeoModel.set_idata_attrs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.set_idata_attrs>`\ \(\[idata\]\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.set_idata_attrs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.set_idata_attrs>`\ \(\[idata\]\)", "plural": ":py:obj:`ShiftedBetaGeoModel.set_idata_attrs <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.set_idata_attrs>`\ \(\[idata\]\)" }

source: Set attributes on an InferenceData object.
es: { "singular": "Establecer atributos en un objeto InferenceData.", "plural": "Establecer atributos en objetos InferenceData." }

source: :py:obj:`ShiftedBetaGeoModel.table <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.table>`\ \(\*\*model\_table\_kwargs\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.table <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.table>`\ \(\*\*model\_table\_kwargs\)", "plural": ":py:obj:`ShiftedBetaGeoModel.table <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.table>`\ \(\*\*model\_table\_kwargs\)" }

source: Get the summary table of the model.
es: { "singular": "Obtenga la tabla resumen del modelo.", "plural": "Obtenga la tabla resumen de los modelos." }

source: :py:obj:`ShiftedBetaGeoModel.thin_fit_result <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.thin_fit_result>`\ \(keep\_every\)
es: { "singular": ":py:obj:`ShiftedBetaGeoModel.thin_fit_result <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.thin_fit_result>`\ \(mantener\_cada\)", "plural": ":py:obj:`ShiftedBetaGeoModel.thin_fit_result <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.thin_fit_result>`\ \(mantener\_cada\)" }

source: Return a copy of the model with a thinned fit result.
es: { "singular": "Devuelve una copia del modelo con un resultado de ajuste reducido.", "plural": "Devuelven una copia del modelo con un resultado de ajuste reducido." }

source: Attributes
es: { "singular": "Atributo", "plural": "Atributos" }

source: :py:obj:`default_model_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.default_model_config>`\
es: { "singular": ":py:obj:`default_model_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.default_model_config>`", "plural": ":py:obj:`default_model_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.default_model_config>`" }

source: Default model configuration.
es: { "singular": "Configuración de modelo predeterminada.", "plural": "Configuraciones de modelo predeterminadas." }

source: :py:obj:`default_sampler_config <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.default_sampler_config>`\
es: { "singular": ":py:obj:`configuración_del_muestreador_por_defecto <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.configuración_del_muestreador_por_defecto>`", "plural": ":py:obj:`configuraciones_del_muestreador_por_defecto <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.configuraciones_del_muestreador_por_defecto>`" }

source: Default sampler configuration.
es: { "singular": "Configuración de muestreador predeterminada.", "plural": "Configuraciones de muestreador predeterminadas." }

source: :py:obj:`fit_result <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit_result>`\
es: { "singular": ":py:obj:`fit_result <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit_result>`", "plural": ":py:obj:`fit_result <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.fit_result>`" }

source: Get the posterior fit_result.
es: { "singular": "Obtenga el resultado de ajuste posterior.", "plural": "Obtenga los resultados de ajuste posteriores." }

source: :py:obj:`id <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.id>`\
es: { "singular": ":py:obj:`id <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.id>`", "plural": ":py:obj:`id <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.id>`" }

source: Generate a unique hash value for the model.
es: { "singular": "Generar un valor hash único para el modelo.", "plural": "Generar valores hash únicos para los modelos." }

source: :py:obj:`posterior <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.posterior>`\
es: { "singular": ":py:obj:`posterior <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.posterior>`", "plural": ":py:obj:`posterior <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.posterior>`" }

source: :py:obj:`posterior_predictive <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.posterior_predictive>`\
es: { "singular": ":py:obj:`predictivo_posterior <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.predictivo_posterior>`", "plural": ":py:obj:`predictivos_posteriores <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.predictivos_posteriores>`" }

source: :py:obj:`predictions <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.predictions>`\
es: { "singular": ":py:obj:`predicciones <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.predictions>`", "plural": ":py:obj:`predicciones <pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.predictions>`" }
