Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.mmm.MMM.po
Languages: es

source: Media Mix Model class, Delayed Adstock and logistic saturation as default initialization (see [R08ddd2af69d5-1]_).
es: Modelo de Mezcla de Medios, Adstock Retrasado y saturación logística como inicialización predeterminada (ver [R08ddd2af69d5-1]__).

source: Given a time series target variable :math:`y_{t}` (e.g. sales on conversions), media variables :math:`x_{m, t}` (e.g. impressions, clicks or costs) and a set of control covariates :math:`z_{c, t}` (e.g. holidays, special events) we consider a Bayesian linear model of the form:
es: Dada una variable objetivo de series temporales :math:`y_{t}` (por ejemplo, ventas en conversiones), variables mediáticas :math:`x_{m, t}` (por ejemplo, impresiones, clics o costos) y un conjunto de covariables de control :math:`z_{c, t}` (por ejemplo, días festivos, eventos especiales), consideramos un modelo lineal bayesiano de la forma:

source: where :math:`\alpha` is the intercept, :math:`f` is a media transformation function and :math:`\varepsilon_{t}` is the error therm which we assume is normally distributed. The function :math:`f` encodes the contribution of media on the target variable. Typically we consider two types of transformation: adstock (carry-over) and saturation effects.
es: donde :math:`\alpha` es la intersección, :math:`f` es una función de transformación de medios y :math:`\varepsilon_{t}` es el término de error que asumimos está distribuido normalmente. La función :math:`f` codifica la contribución de los medios en la variable objetivo. Típicamente consideramos dos tipos de transformación: adstock (traslado) y efectos de saturación.

source: Notes
es: Notas

source: Here are some important notes about the model:
es: Aquí hay algunas notas importantes sobre el modelo:

source: 1. Before fitting the model, we scale the target variable and the media channels using the maximum absolute value of each variable. This enable us to have a more stable model and better convergence. If control variables are present, we do not scale them! If needed please do it before passing the data to the model.
es: 1. Antes de ajustar el modelo, escalamos la variable objetivo y los canales de medios utilizando el valor absoluto máximo de cada variable. Esto nos permite tener un modelo más estable y una mejor convergencia. Si hay variables de control presentes, ¡no las escalamos! Si es necesario, por favor, hágalo antes de pasar los datos al modelo.

source: 2. We allow to add yearly seasonality controls as Fourier modes. You can use the `yearly_seasonality` parameter to specify the number of Fourier modes to include.
es: 2. Permitimos añadir controles de estacionalidad anual como modos de Fourier. Puede utilizar el parámetro `yearly_seasonality` para especificar el número de modos de Fourier a incluir.

source: This class also allow us to calibrate the model using:
es: Esta clase también nos permite calibrar el modelo utilizando:

source: Custom priors for the parameters via the `model_config` parameter. You can also set the likelihood distribution.
es: Priors personalizados para los parámetros a través del parámetro `model_config`. También puede establecer la distribución de verosimilitud.

source: Adding lift tests to the likelihood function via the :meth:`add_lift_test_measurements <pymc_marketing.mmm.mmm.MMM.add_lift_test_measurements>` method.
es: Agregando pruebas de elevación a la función de probabilidad a través del método :meth:`add_lift_test_measurements <pymc_marketing.mmm.mmm.MMM.add_lift_test_measurements>`.

source: For details on a vanilla implementation in PyMC, see [R08ddd2af69d5-2]_.
es: Para obtener detalles sobre una implementación básica en PyMC, consulte [R08ddd2af69d5-2]_.

source: References
es: Referencias

source: Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017).
es: Jin, Yuxue, et al. “Métodos bayesianos para la modelización de mezcla de medios con efectos de arrastre y de forma.” (2017).

source: Orduz, J. `"Media Effect Estimation with PyMC: Adstock, Saturation & Diminishing Returns" <https://juanitorduz.github.io/pymc_mmm/>`_.
es: Orduz, J. `"Estimación del Efecto Mediático con PyMC: Adstock, Saturación y Rendimientos Decrecientes" <https://juanitorduz.github.io/pymc_mmm/>`_.

source: Examples
es: Ejemplos

source: Here is an example of how to instantiate the model with the default configuration:
es: Aquí hay un ejemplo de cómo instanciar el modelo con la configuración predeterminada:

source: Now we can fit the model with the data:
es: Ahora podemos ajustar el modelo con los datos:

source: We can also define custom priors for the model:
es: También podemos definir priors personalizados para el modelo:

source: As you can see, we can configure all prior and likelihood distributions via the `model_config`.
es: Como puede ver, podemos configurar todas las distribuciones previas y de verosimilitud a través de `model_config`.

source: The `fit` method accepts keyword arguments that are passed to the PyMC sampling method. For example, to change the number of samples and chains, and using a JAX implementation of NUTS we can do:
es: El método `fit` acepta argumentos de palabra clave que se pasan al método de muestreo de PyMC. Por ejemplo, para cambiar el número de muestras y cadenas, y utilizando una implementación de JAX de NUTS, podemos hacer:

source: Methods
es: Métodos

source: Define the constructor method.
es: Defina el método constructor.

source: Add lift tests to the model.
es: Agregue pruebas de elevación al modelo.

source: :py:obj:`MMM.approximate_fit <pymc_marketing.mmm.mmm.MMM.approximate_fit>`\ \(X\[\, y\, progressbar\, ...\]\)
es: :py:obj:`MMM.approximate_fit <pymc_marketing.mmm.mmm.MMM.approximate_fit>`\ \(X\[\, y\, barra de progreso\, ...\]\)

source: Fit a model using Variational Inference and return InferenceData.
es: Ajuste un modelo utilizando Inferencia Variacional y devuelva InferenceData.

source: :py:obj:`MMM.attrs_to_init_kwargs <pymc_marketing.mmm.mmm.MMM.attrs_to_init_kwargs>`\ \(attrs\)
es: msgid: :py:obj:`MMM.attrs_to_init_kwargs <pymc_marketing.mmm.mmm.MMM.attrs_to_init_kwargs>`\ \(attrs\) msgstr: :py:obj:`MMM.attrs_to_init_kwargs <pymc_marketing.mmm.mmm.MMM.attrs_to_init_kwargs>`\ \(attrs\)

source: Convert attributes to initialization kwargs.
es: Convertir atributos a kwargs de inicialización.

source: Build model from the InferenceData object.
es: Construir el modelo a partir del objeto InferenceData.

source: Build a probabilistic model using PyMC for marketing mix modeling.
es: Construya un modelo probabilístico utilizando PyMC para el modelado de mezcla de marketing.

source: Evaluate the channel contribution for a given channel data and a fitted model, ie.
es: Evalúe la contribución del canal para unos datos de canal dados y un modelo ajustado, es decir.

source: :py:obj:`MMM.compute_channel_contribution_original_scale <pymc_marketing.mmm.mmm.MMM.compute_channel_contribution_original_scale>`\ \(\[prior\]\)
es: :py:obj:`MMM.compute_channel_contribution_original_scale <pymc_marketing.mmm.mmm.MMM.compute_channel_contribution_original_scale>`\ \(\[previo\]\)

source: Compute the channel contributions in the original scale of the target variable.
es: Calcule las contribuciones del canal en la escala original de la variable objetivo.

source: Get the contributions of each channel over time.
es: Obtenga las contribuciones de cada canal a lo largo del tiempo.

source: Create the fit_data group based on the input data.
es: Cree el grupo fit_data basado en los datos de entrada.

source: Create attributes for the inference data.
es: Cree atributos para los datos de inferencia.

source: :py:obj:`MMM.fit <pymc_marketing.mmm.mmm.MMM.fit>`\ \(X\[\, y\, progressbar\, random\_seed\]\)
es: :py:obj:`MMM.fit <pymc_marketing.mmm.mmm.MMM.fit>`\ \(X\[\, y\, barra_de_progreso\, semilla_aleatoria\]\)

source: Fit a model using the data passed as a parameter.
es: Ajuste un modelo utilizando los datos pasados como parámetro.

source: Format the recovered transformation parameters for each channel.
es: Formatee los parámetros de transformación recuperados para cada canal.

source: Transform channel input into target contributions of each channel.
es: Transformar la entrada del canal en las contribuciones objetivo de cada canal.

source: Generate a grid of scaled channel contributions for a given grid of shared values.
es: Generar una cuadrícula de contribuciones de canal escaladas para una cuadrícula dada de valores compartidos.

source: :py:obj:`MMM.get_channel_contribution_share_samples <pymc_marketing.mmm.mmm.MMM.get_channel_contribution_share_samples>`\ \(\[prior\]\)
es: :py:obj:`MMM.get_channel_contribution_share_samples <pymc_marketing.mmm.mmm.MMM.get_channel_contribution_share_samples>`\ \(\[anterior\]\)

source: Get the share of channel contributions in the original scale of the target variable.
es: Obtenga la participación de las contribuciones del canal en la escala original de la variable objetivo.

source: Get model errors posterior distribution.
es: Obtener la distribución posterior de errores del modelo.

source: Return the target transformer pipeline used for preprocessing the target variable.
es: Devuelve la tubería del transformador objetivo utilizada para el preprocesamiento de la variable objetivo.

source: Get the posterior distribution of the time series contributions of a given variable.
es: Obtenga la distribución posterior de las contribuciones de la serie temporal de una variable dada.

source: Get the graphviz representation of the model.
es: Obtenga la representación graphviz del modelo.

source: :py:obj:`MMM.idata_to_init_kwargs <pymc_marketing.mmm.mmm.MMM.idata_to_init_kwargs>`\ \(idata\)
es: msgid: :py:obj:`MMM.idata_to_init_kwargs <pymc_marketing.mmm.mmm.MMM.idata_to_init_kwargs>`\ \(idata\) msgstr: :py:obj:`MMM.idata_to_init_kwargs <pymc_marketing.mmm.mmm.MMM.idata_to_init_kwargs>`\ \(idata\)

source: Create the model configuration and sampler configuration from the InferenceData to keyword arguments.
es: Cree la configuración del modelo y la configuración del muestreador a partir de InferenceData a argumentos de palabra clave.

source: Create a ModelBuilder instance from a file.
es: Cree una instancia de ModelBuilder a partir de un archivo.

source: :py:obj:`MMM.load_from_idata <pymc_marketing.mmm.mmm.MMM.load_from_idata>`\ \(idata\[\, check\]\)
es: :py:obj:`MMM.load_from_idata <pymc_marketing.mmm.mmm.MMM.load_from_idata>`\ \(idata\[\, verificar\]\)

source: Create a ModelBuilder instance from an InferenceData object.
es: Cree una instancia de ModelBuilder a partir de un objeto InferenceData.

source: :py:obj:`MMM.max_abs_scale_channel_data <pymc_marketing.mmm.mmm.MMM.max_abs_scale_channel_data>`\ \(data\)
es: :py:obj:`MMM.max_abs_scale_channel_data <pymc_marketing.mmm.mmm.MMM.max_abs_scale_channel_data>`\ \(datos\)

source: MaxAbsScaler for the channel data.
es: MaxAbsScaler para los datos del canal.

source: :py:obj:`MMM.max_abs_scale_target_data <pymc_marketing.mmm.mmm.MMM.max_abs_scale_target_data>`\ \(data\)
es: :py:obj:`MMM.max_abs_scale_target_data <pymc_marketing.mmm.mmm.MMM.max_abs_scale_target_data>`\ \(datos\)

source: MaxAbsScaler for the target data.
es: MaxAbsScaler para los datos objetivo.

source: :py:obj:`MMM.new_spend_contributions <pymc_marketing.mmm.mmm.MMM.new_spend_contributions>`\ \(\[spend\, ...\]\)
es: :py:obj:`MMM.new_spend_contributions <pymc_marketing.mmm.mmm.MMM.new_spend_contributions>`\ \(\[gasto\, ...\]\)

source: Return the upcoming contributions for a given spend.
es: Devuelva las contribuciones próximas para un gasto dado.

source: :py:obj:`MMM.optimize_budget <pymc_marketing.mmm.mmm.MMM.optimize_budget>`\ \(budget\, num\_periods\[\, ...\]\)
es: :py:obj:`MMM.optimize_budget <pymc_marketing.mmm.mmm.MMM.optimize_budget>`\ \(presupuesto\, num\_periodos\[\, ...\]\)

source: Optimize the given budget based on the specified utility function over a specified time period.
es: Optimice el presupuesto dado en función de la función de utilidad especificada durante un período de tiempo determinado.

source: :py:obj:`MMM.plot_allocated_contribution_by_channel <pymc_marketing.mmm.mmm.MMM.plot_allocated_contribution_by_channel>`\ \(samples\)
es: :py:obj:`MMM.plot_allocated_contribution_by_channel <pymc_marketing.mmm.mmm.MMM.plot_allocated_contribution_by_channel>`\ \(muestras\)

source: Plot the allocated contribution by channel with uncertainty intervals.
es: Trace la contribución asignada por canal con intervalos de incertidumbre.

source: Plot the budget allocation and channel contributions.
es: Trace la asignación del presupuesto y las contribuciones de los canales.

source: :py:obj:`MMM.plot_channel_contribution_grid <pymc_marketing.mmm.mmm.MMM.plot_channel_contribution_grid>`\ \(start\, ...\)
es: :py:obj:`MMM.plot_channel_contribution_grid <pymc_marketing.mmm.mmm.MMM.plot_channel_contribution_grid>`\ \(inicio\, ...\)

source: Plot a grid of scaled channel contributions for a given grid of share values.
es: Trace una cuadrícula de contribuciones de canal escaladas para una cuadrícula dada de valores de acciones.

source: Plot the share of channel contributions in a forest plot.
es: Trace la participación de las contribuciones del canal en un gráfico de bosque.

source: Plot the posterior distribution of a specific parameter for each channel.
es: Trace la distribución posterior de un parámetro específico para cada canal.

source: Plot the target variable and the posterior predictive model components.
es: Trace la variable objetivo y los componentes del modelo predictivo posterior.

source: Plot the direct contribution curves for each marketing channel.
es: Trace las curvas de contribución directa para cada canal de marketing.

source: :py:obj:`MMM.plot_errors <pymc_marketing.mmm.mmm.MMM.plot_errors>`\ \(\[original\_scale\, ax\]\)
es: :py:obj:`MMM.plot_errors <pymc_marketing.mmm.mmm.MMM.plot_errors>`\ \(\[escala\_original\, ax\]\)

source: Plot model errors by taking the difference between true values and predicted.
es: Grafique los errores del modelo tomando la diferencia entre los valores verdaderos y los predichos.

source: Plot a time series area chart for all channel contributions.
es: Trace un gráfico de área de series temporales para todas las contribuciones del canal.

source: :py:obj:`MMM.plot_new_spend_contributions <pymc_marketing.mmm.mmm.MMM.plot_new_spend_contributions>`\ \(spend\_amount\)
es: :py:obj:`MMM.plot_new_spend_contributions <pymc_marketing.mmm.mmm.MMM.plot_new_spend_contributions>`\ \(monto\_gasto\)

source: Plot the upcoming sales for a given spend amount.
es: Grafique las ventas futuras para una cantidad de gasto dada.

source: Plot the posterior predictive distribution from the model fit.
es: Trace la distribución predictiva posterior a partir del ajuste del modelo.

source: :py:obj:`MMM.plot_prior_predictive <pymc_marketing.mmm.mmm.MMM.plot_prior_predictive>`\ \(\[original\_scale\, ...\]\)
es: :py:obj:`MMM.plot_prior_predictive <pymc_marketing.mmm.mmm.MMM.plot_prior_predictive>`\ \(\[escala\_original\, ...\]\)

source: Plot the prior predictive distribution from the model fit.
es: Trace la distribución predictiva previa a partir del ajuste del modelo.

source: Plot the prior vs posterior distribution for a specified variable in a 3 columngrid layout.
es: Trace la distribución previa frente a la distribución posterior para una variable especificada en un diseño de cuadrícula de 3 columnas.

source: Create a waterfall plot.
es: Cree un gráfico de cascada.

source: Post-sample model transformation in order to store the HSGP state from fit.
es: Transformación del modelo posterior a la muestra para almacenar el estado de HSGP a partir del ajuste.

source: Use a model to predict on unseen data and return point prediction of all the samples.
es: Utilice un modelo para predecir sobre datos no vistos y devuelva la predicción puntual de todas las muestras.

source: Generate posterior predictive samples on unseen data.
es: Generar muestras predictivas posteriores en datos no vistos.

source: Alias for `predict_posterior`, for consistency with scikit-learn probabilistic estimators.
es: Alias para `predict_posterior`, para mantener la consistencia con los estimadores probabilísticos de scikit-learn.

source: :py:obj:`MMM.preprocess <pymc_marketing.mmm.mmm.MMM.preprocess>`\ \(target\, data\)
es: :py:obj:`MMM.preprocess <pymc_marketing.mmm.mmm.MMM.preprocess>`\ \(objetivo\, datos\)

source: Preprocess the provided data according to the specified target.
es: Preprocese los datos proporcionados de acuerdo con el objetivo especificado.

source: Sample from the model's posterior predictive distribution.
es: Muestra de la distribución predictiva posterior del modelo.

source: :py:obj:`MMM.sample_prior_predictive <pymc_marketing.mmm.mmm.MMM.sample_prior_predictive>`\ \(\[X\, y\, samples\, ...\]\)
es: :py:obj:`MMM.sample_prior_predictive <pymc_marketing.mmm.mmm.MMM.sample_prior_predictive>`\ \(\[X\, y\, muestras\, ...\]\)

source: Sample from the model's prior predictive distribution.
es: Muestra de la distribución predictiva previa del modelo.

source: Generate synthetic dataset and sample posterior predictive based on allocation.
es: Generar un conjunto de datos sintético y muestrear la predicción posterior basada en la asignación.

source: Save the model's inference data to a file.
es: Guarde los datos de inferencia del modelo en un archivo.

source: Set attributes on an InferenceData object.
es: Establecer atributos en un objeto InferenceData.

source: Get the summary table of the model.
es: Obtenga la tabla resumen del modelo.

source: :py:obj:`MMM.validate <pymc_marketing.mmm.mmm.MMM.validate>`\ \(target\, data\)
es: :py:obj:`MMM.validate <pymc_marketing.mmm.mmm.MMM.validate>`\ \(objetivo\, datos\)

source: Validate the input data based on the specified target type.
es: Valide los datos de entrada según el tipo de destino especificado.

source: :py:obj:`MMM.validate_channel_columns <pymc_marketing.mmm.mmm.MMM.validate_channel_columns>`\ \(data\)
es: :py:obj:`MMM.validate_channel_columns <pymc_marketing.mmm.mmm.MMM.validate_channel_columns>`\ \(datos\)

source: Validate the channel columns.
es: Valide las columnas del canal.

source: :py:obj:`MMM.validate_control_columns <pymc_marketing.mmm.mmm.MMM.validate_control_columns>`\ \(data\)
es: :py:obj:`MMM.validate_control_columns <pymc_marketing.mmm.mmm.MMM.validate_control_columns>`\ \(datos\)

source: Validate the control columns.
es: Valide las columnas de control.

source: :py:obj:`MMM.validate_date_col <pymc_marketing.mmm.mmm.MMM.validate_date_col>`\ \(data\)
es: :py:obj:`MMM.validate_date_col <pymc_marketing.mmm.mmm.MMM.validate_date_col>`\ \(datos\)

source: Validate the date column.
es: Valide la columna de fecha.

source: :py:obj:`MMM.validate_target <pymc_marketing.mmm.mmm.MMM.validate_target>`\ \(data\)
es: :py:obj:`MMM.validate_target <pymc_marketing.mmm.mmm.MMM.validate_target>`\ \(datos\)

source: Validate the target column.
es: Valide la columna objetivo.

source: Attributes
es: Atributos

source: Define the default model configuration.
es: Defina la configuración del modelo predeterminado.

source: Default sampler configuration for the model.
es: Configuración de muestreador predeterminada para el modelo.

source: Get the posterior fit_result.
es: Obtenga el resultado de ajuste posterior fit_result.

source: Generate a unique hash value for the model.
es: Generar un valor hash único para el modelo.

source: Get all methods of the object.
es: Obtenga todos los métodos del objeto.

source: Define target variable for the model.
es: Defina la variable objetivo para el modelo.

source: :py:obj:`predictions <pymc_marketing.mmm.mmm.MMM.predictions>`\
es: :py:obj:`predicciones <pymc_marketing.mmm.mmm.MMM.predictions>`\

source: :py:obj:`preprocessing_methods <pymc_marketing.mmm.mmm.MMM.preprocessing_methods>`\
es: :py:obj:`métodos_de_preprocesamiento <pymc_marketing.mmm.mmm.MMM.métodos_de_preprocesamiento>`

source: A property that provides preprocessing methods for features ("X") and the target variable ("y").
es: Una propiedad que proporciona métodos de preprocesamiento para las características ("X") y la variable objetivo ("y").

source: :py:obj:`validation_methods <pymc_marketing.mmm.mmm.MMM.validation_methods>`\
es: :py:obj:`métodos_de_validación <pymc_marketing.mmm.mmm.MMM.métodos_de_validación>`\

source: A property that provides validation methods for features ("X") and the target variable ("y").
es: Una propiedad que proporciona métodos de validación para las características ("X") y la variable objetivo ("y").

source: :py:obj:`version <pymc_marketing.mmm.mmm.MMM.version>`\
es: :py:obj:`versión <pymc_marketing.mmm.mmm.MMM.version>`\

source: :py:obj:`model <pymc_marketing.mmm.mmm.MMM.model>`\
es: :py:obj:`modelo <pymc_marketing.mmm.mmm.MMM.modelo>`\
