Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.plot.MMMPlotSuite.po
Languages: es

source: Media Mix Model Plot Suite.
es: Suite de Gráficos del Modelo de Mezcla de Medios.

source: Provides methods for visualizing the posterior predictive distribution, contributions over time, and saturation curves for a Media Mix Model.
es: Proporciona métodos para visualizar la distribución predictiva posterior, las contribuciones a lo largo del tiempo y las curvas de saturación para un Modelo de Mezcla de Medios.

source: Methods
es: Métodos

source: :py:obj:`MMMPlotSuite.allocated_contribution_by_channel_over_time <pymc_marketing.mmm.plot.MMMPlotSuite.allocated_contribution_by_channel_over_time>`\ \(samples\)
es: :py:obj:`MMMPlotSuite.allocated_contribution_by_channel_over_time <pymc_marketing.mmm.plot.MMMPlotSuite.allocated_contribution_by_channel_over_time>`\ \(muestras\)

source: Plot the allocated contribution by channel with uncertainty intervals.
es: Trace la contribución asignada por canal con intervalos de incertidumbre.

source: :py:obj:`MMMPlotSuite.budget_allocation <pymc_marketing.mmm.plot.MMMPlotSuite.budget_allocation>`\ \(samples\[\, ...\]\)
es: :py:obj:`MMMPlotSuite.budget_allocation <pymc_marketing.mmm.plot.MMMPlotSuite.budget_allocation>`\ \(muestras\[\, ...\]\)

source: Plot the budget allocation and channel contributions.
es: Trace la asignación del presupuesto y las contribuciones de los canales.

source: Plot the time-series contributions for each variable in `var`.
es: Trace las contribuciones de la serie temporal para cada variable en {var}.

source: Plot counterfactual uplift or marginal effects curves.
es: Trazar curvas de aumento contrafactual o efectos marginales.

source: Plot time series from the posterior predictive distribution.
es: Grafique series temporales de la distribución predictiva posterior.

source: :py:obj:`MMMPlotSuite.saturation_curves <pymc_marketing.mmm.plot.MMMPlotSuite.saturation_curves>`\ \(curve\[\, ...\]\)
es: :py:obj:`MMMPlotSuite.saturation_curves <pymc_marketing.mmm.plot.MMMPlotSuite.saturation_curves>`\ \(curva\[\, ...\]\)

source: Overlay saturation‑curve scatter‑plots with posterior‑predictive sample curves and HDI bands.
es: Superponga gráficos de dispersión de la curva de saturación con curvas de muestra predictiva posterior y bandas de HDI.

source: Plot scatter plots of channel contributions vs.
es: Trazar gráficos de dispersión de las contribuciones del canal frente a.

source: Plot the saturation curves for each channel.
es: Trace las curvas de saturación para cada canal.
