Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.metrics.per_observation_crps.po
Languages: es

source: per\_observation\_crps
es: per\_observación\_crps

source: Compute the continuous ranked probability score (CRPS) for each observation.
es: Calcule la puntuación de probabilidad clasificada continua (CRPS) para cada observación.

source: The CRPS — Continuous Ranked Probability Score — is a score function that compares a single ground truth value to a Cumulative Distribution Function.
es: El CRPS — Puntaje de Probabilidad Clasificada Continua — es una función de puntuación que compara un único valor de verdad fundamental con una Función de Distribución Acumulativa.

source: Parameters
es: Parámetros

source: numpy:array_like
es: msgid: numpy:array_like msgstr: numpy:array_like

source: The ground truth values.
es: Los valores de la verdad fundamental.

source: The predicted values. It is expected that y_pred has one extra sample dimension on the left.
es: Los valores predichos. Se espera que y_pred tenga una dimensión de muestra adicional a la izquierda.

source: Returns
es: Devoluciones

source: The CRPS for each observation.
es: El CRPS para cada observación.

source: References
es: Referencias

source: This implementation is a minimal adaptation from the one in the Pyro project: https://docs.pyro.ai/en/dev/_modules/pyro/ops/stats.html#crps_empirical
es: Esta implementación es una adaptación mínima de la que se encuentra en el proyecto Pyro: https://docs.pyro.ai/en/dev/_modules/pyro/ops/stats.html#crps_empirical

source: For an introduction to CRPS, see https://towardsdatascience.com/crps-a-scoring-function-for-bayesian-machine-learning-models-dd55a7a337a8
es: Para una introducción al CRPS, consulte https://towardsdatascience.com/crps-a-scoring-function-for-bayesian-machine-learning-models-dd55a7a337a8

source: Examples
es: Ejemplos
