Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.customer_choice.synthetic_data.generate_unsaturated_data.po
Languages: es

source: generate\_unsaturated\_data
es: generar\_datos\_no\_saturados

source: Generate synthetic data for the MVITS model.
es: Generar datos sintéticos para el modelo MVITS.

source: Notably, we can define different total sales levels before and after the introduction of the new model.
es: Notablemente, podemos definir diferentes niveles de ventas totales antes y después de la introducción del nuevo modelo.

source: This function generates synthetic data for the MVITS model, assuming that the market is unsaturated meaning that there are new sales to be made.
es: Esta función genera datos sintéticos para el modelo MVITS, asumiendo que el mercado está no saturado, lo que significa que hay nuevas ventas por realizar.

source: This makes the assumption that the total sales are normally distributed around some average level of sales, and that the market shares are constant over time.
es: Esto supone que las ventas totales están distribuidas normalmente alrededor de algún nivel promedio de ventas y que las cuotas de mercado son constantes a lo largo del tiempo.

source: Parameters
es: Parámetros

source: **total_sales_mu: int**
es: **total_ventas_mu: int**

source: The average level of sales in the market.
es: El nivel promedio de ventas en el mercado.

source: **total_sales_sigma: float**
es: **total_ventas_sigma: float**

source: The standard deviation of sales in the market.
es: La desviación estándar de las ventas en el mercado.

source: **treatment_time: int**
es: **tiempo_de_tratamiento: int**

source: The time at which the new model is introduced.
es: El momento en el que se introduce el nuevo modelo.

source: **n_observations: int**
es: **n_observaciones: int**

source: The number of observations to generate.
es: El número de observaciones a generar.

source: **market_shares_before: list[float]**
es: **participaciones_de_mercado_antes: lista[float]**

source: The market shares before the introduction of the new model.
es: Las cuotas de mercado antes de la introducción del nuevo modelo.

source: **market_shares_after: list[float]**
es: **participaciones_de_mercado_despues: lista[float]**

source: The market shares after the introduction of the new model.
es: Las cuotas de mercado tras la introducción del nuevo modelo.

source: **market_share_labels: list[str]**
es: **etiquetas_de_cuota_de_mercado: lista[str]**

source: The labels for the market shares.
es: Las etiquetas para las cuotas de mercado.

source: **random_seed: np.random.Generator | int, optional**
es: **semilla_aleatoria: np.random.Generator | int, opcional**

source: The random number generator to use.
es: El generador de números aleatorios a utilizar.

source: Returns
es: Devoluciones

source: The synthetic data generated.
es: Los datos sintéticos generados.
