Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.raroc.po
Languages: es

source: Calculate the Risk-Adjusted Return on Capital (RAROC).
es: Calcule el Retorno sobre el Capital Ajustado por Riesgo (RAROC).

source: RAROC measures the efficiency of capital utilization by assessing the return generated above a risk-free benchmark, normalized by the capital at risk. This metric provides insight into the value created by taking on additional risk, relative to a safe investment.
es: RAROC mide la eficiencia de la utilización del capital al evaluar el retorno generado por encima de un punto de referencia libre de riesgo, normalizado por el capital en riesgo. Esta métrica proporciona información sobre el valor creado al asumir un riesgo adicional, en relación con una inversión segura.

source: The Risk-Adjusted Return on Capital (RAROC) is calculated as:
es: El Retorno sobre el Capital Ajustado por Riesgo (RAROC) se calcula como:

source: where:
es: donde:

source: :math:`\mathbb{E}[R]` is the expected return (mean of samples).
es: :math:`\mathbb{E}[R]` es el retorno esperado (media de las muestras).

source: :math:`R_f` is the risk-free rate.
es: :math:`R_f` es la tasa libre de riesgo.

source: :math:`C` is the capital at risk.
es: :math:`C` es el capital en riesgo.

source: Parameters
es: Parámetros

source: **risk_free_rate** : :class:`python:float`, optional
es: **tasa_libre_de_riesgo** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: The rate of return on a risk-free investment, such as a government bond, used as a baseline for measuring excess returns (default is 0.0).
es: La tasa de retorno de una inversión libre de riesgo, como un bono del gobierno, utilizada como referencia para medir los retornos en exceso (el valor predeterminado es 0.0).

source: Returns
es: Devoluciones

source: A function that calculates the RAROC value given samples and budgets.
es: Una función que calcula el valor RAROC dado muestras y presupuestos.

source: References
es: Referencias

source: Matten, C. (2000). Managing Bank Capital: Capital Allocation and Performance Measurement.
es: Matten, C. (2000). Gestión del Capital Bancario: Asignación de Capital y Medición del Rendimiento.
