Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.model_builder.po
Languages: es

source: model\_builder
es: constructor_de_modelos

source: Base classes containing primitives and high-level API for model building, fitting, saving, and loading.
es: Clases base que contienen primitivas y una API de alto nivel para la construcción, ajuste, guardado y carga de modelos.

source: Functions
es: Funciones

source: :py:obj:`create_idata_accessor <pymc_marketing.model_builder.create_idata_accessor>`\ \(value\, message\)
es: :py:obj:`create_idata_accessor <pymc_marketing.model_builder.create_idata_accessor>`\ \(valor\, mensaje\)

source: Create a property accessor for an InferenceData object.
es: Cree un accesor de propiedad para un objeto InferenceData.

source: Create the dictionary of keyword arguments for `pm.sample`.
es: Cree el diccionario de argumentos clave para `pm.sample`.

source: Ensure that the model is built before calling a method.
es: Asegúrese de que el modelo esté construido antes de llamar a un método.

source: Classes
es: Clases

source: :py:obj:`ModelBuilder <pymc_marketing.model_builder.ModelBuilder>`\ \(\[model\_config\, sampler\_config\]\)
es: :py:obj:`ModelBuilder <pymc_marketing.model_builder.ModelBuilder>`\ \(\[configuración\_del\_modelo\, configuración\_del\_muestreador\]\)

source: Base class for building PyMC-Marketing models.
es: Clase base para construir modelos de PyMC-Marketing.

source: Mixin to handle saving and loading of models.
es: Mixin para manejar el guardado y la carga de modelos.

source: ModelBuilder class providing an easy-to-use API similar to scikit-learn for regression models.
es: Clase ModelBuilder que proporciona una API fácil de usar similar a scikit-learn para modelos de regresión.

source: Exceptions
es: Excepciones

source: Error raised when a model loaded is different than one saved.
es: Error generado cuando un modelo cargado es diferente al que se guardó.
