Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.hill_function.po
Languages: es

source: hill\_function
es: función\_colina

source: Hill Function.
es: Función de Hill.

source: where:
es: donde:

source: :math:`s` is the slope of the hill.
es: :math:`s` es la pendiente de la colina.

source: :math:`\kappa` is the half-saturation point as :math:`f(\kappa) = 0.5` for any value of :math:`s` and :math:`\kappa`.
es: :math:`\kappa` es el punto de media saturación ya que :math:`f(\kappa) = 0.5` para cualquier valor de :math:`s` y :math:`\kappa`.

source: :math:`x` is the independent variable and must be non-negative.
es: :math:`x` es la variable independiente y debe ser no negativa.

source: Hill function from Equation (5) in the paper [R0315939d312c-1]_.
es: Función de Hill de la Ecuación (5) en el documento [R0315939d312c-1]_.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_00_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_00_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_00_00.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_00_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_00_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_00_00.pdf>`)

source: (:download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_01_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_01_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_01_00.pdf>`)
es: (:descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_01_00.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_01_00.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_function-1_01_00.pdf>`)

source: Parameters
es: Parámetros

source: **x** : :class:`python:float` or :term:`numpy:array_like`
es: **x** : :class:`python:float` o :term:`numpy:array_like`

source: python:float or numpy:array_like
es: python:float o numpy:array_like

source: The independent variable, typically representing the concentration of a substrate or the intensity of a stimulus.
es: La variable independiente, que típicamente representa la concentración de un sustrato o la intensidad de un estímulo.

source: **slope** : :class:`python:float`
es: **pendiente** : :class:`python:float`

source: The slope of the hill. Must be non-positive.
es: La pendiente de la colina. Debe ser no positiva.

source: The half-saturation point as :math:`f(\kappa) = 0.5` for any value of :math:`s` and :math:`\kappa`.
es: El punto de media saturación como :math:`f(\kappa) = 0.5` para cualquier valor de :math:`s` y :math:`\kappa`.

source: Returns
es: Devoluciones

source: The value of the Hill function given the parameters.
es: El valor de la función Hill dado los parámetros.

source: References
es: Referencias

source: Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017).
es: Jin, Yuxue, et al. “Métodos bayesianos para la modelización de mezcla de medios con efectos de arrastre y forma.” (2017).
