Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.po
Languages: es

source: transformers
es: transformadores

source: Media transformation functions for Marketing Mix Models.
es: Funciones de transformación de medios para Modelos de Mezcla de Marketing.

source: Functions
es: Funciones

source: :py:obj:`batched_convolution <pymc_marketing.mmm.transformers.batched_convolution>`\ \(x\, w\[\, axis\, mode\]\)
es: :py:obj:`batched_convolution <pymc_marketing.mmm.transformers.batched_convolution>`\ \(x\, w\[\, eje\, modo\]\)

source: Apply a 1D convolution in a vectorized way across multiple batch dimensions.
es: Aplique una convolución 1D de manera vectorizada a través de múltiples dimensiones de lote.

source: Delayed adstock transformation.
es: Transformación de adstock retrasada.

source: Geometric adstock transformation.
es: Transformación adstock geométrica.

source: :py:obj:`hill_function <pymc_marketing.mmm.transformers.hill_function>`\ \(x\, slope\, kappa\)
es: :py:obj:`hill_function <pymc_marketing.mmm.transformers.hill_function>`\ \(x\, pendiente\, kappa\)

source: Hill Function.
es: Función de Hill.

source: Hill Saturation Sigmoid Function.
es: Función sigmoide de saturación de colina.

source: Inverse scaled logistic saturation transformation.
es: Transformación de saturación logística inversamente escalada.

source: Logistic saturation transformation.
es: Transformación de saturación logística.

source: :py:obj:`michaelis_menten <pymc_marketing.mmm.transformers.michaelis_menten>`\ \(x\, alpha\, lam\)
es: :py:obj:`michaelis_menten <pymc_marketing.mmm.transformers.michaelis_menten>`\ \(x\, alfa\, lam\)

source: Evaluate the Michaelis-Menten function for given values of x, alpha, and lambda.
es: Evalúe la función de Michaelis-Menten para los valores dados de x, alpha y lambda.

source: Root saturation transformation.
es: Transformación de saturación de raíces.

source: Tanh saturation transformation.
es: Transformación de saturación Tanh.

source: :py:obj:`tanh_saturation_baselined <pymc_marketing.mmm.transformers.tanh_saturation_baselined>`\ \(x\, x0\[\, gain\, r\]\)
es: :py:obj:`tanh_saturation_baselined <pymc_marketing.mmm.transformers.tanh_saturation_baselined>`\ \(x\, x0\[\, ganancia\, r\]\)

source: Baselined Tanh Saturation.
es: Saturación Tanh de referencia.

source: Weibull Adstocking Transformation.
es: Transformación de Adstock Weibull.

source: Classes
es: Clases

source: :py:obj:`ConvMode <pymc_marketing.mmm.transformers.ConvMode>`\ \(\*values\)
es: :py:obj:`ConvMode <pymc_marketing.mmm.transformers.ConvMode>`\ \(\*valores\)

source: Convolution mode for the convolution.
es: Modo de convolución para la convolución.

source: :py:obj:`TanhSaturationBaselinedParameters <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters>`\ \(x0\, gain\, r\)
es: :py:obj:`TanhSaturationBaselinedParameters <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters>`\ \(x0\, ganancia\, r\)

source: Representation of tanh saturation parameters in baselined form.
es: Representación de los parámetros de saturación de tanh en forma de referencia.

source: Container for tanh saturation parameters.
es: Contenedor para los parámetros de saturación de tanh.

source: :py:obj:`WeibullType <pymc_marketing.mmm.transformers.WeibullType>`\ \(\*values\)
es: :py:obj:`WeibullType <pymc_marketing.mmm.transformers.WeibullType>`\ \(\*valores\)

source: Weibull type for the Weibull adstock.
es: Tipo Weibull para el adstock Weibull.
