Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.prior.Prior.po
Languages: es

source: Prior
es: Previo

source: Backwards-compatible wrapper for the Prior class.
es: Envoltura compatible hacia atrás para la clase Prior.

source: Methods
es: Métodos

source: Initialize the Prior class with the given arguments.
es: Inicialice la clase Prior con los argumentos proporcionados.

source: :py:obj:`Prior.constrain <pymc_marketing.prior.Prior.constrain>`\ \(lower\, upper\[\, mass\, kwargs\]\)
es: :py:obj:`Prior.constrain <pymc_marketing.prior.Prior.constrain>`\ \(inferior\, superior\[\, masa\, kwargs\]\)

source: Create a new prior with a given mass constrained within the given bounds.
es: Cree un nuevo prior con una masa dada restringida dentro de los límites establecidos.

source: :py:obj:`Prior.create_likelihood_variable <pymc_marketing.prior.Prior.create_likelihood_variable>`\ \(name\, mu\, ...\)
es: :py:obj:`Prior.create_likelihood_variable <pymc_marketing.prior.Prior.create_likelihood_variable>`\ \(nombre\, mu\, ...\)

source: Create a likelihood variable from the prior.
es: Cree una variable de verosimilitud a partir de la anterior.

source: :py:obj:`Prior.create_variable <pymc_marketing.prior.Prior.create_variable>`\ \(name\)
es: :py:obj:`Prior.create_variable <pymc_marketing.prior.Prior.create_variable>`\ \(nombre\)

source: Create a PyMC variable from the prior.
es: Cree una variable de PyMC a partir del previo.

source: Return a deep copy of the prior.
es: Devuelve una copia profunda del anterior.

source: :py:obj:`Prior.from_dict <pymc_marketing.prior.Prior.from_dict>`\ \(data\)
es: :py:obj:`Prior.from_dict <pymc_marketing.prior.Prior.from_dict>`\ \(datos\)

source: Create a Prior from the dictionary format.
es: Cree un Prior a partir del formato del diccionario.

source: Sample the prior distribution for the variable.
es: Muestre la distribución previa para la variable.

source: Convert the prior to dictionary format.
es: Convierte lo anterior al formato de diccionario.

source: Generate a graph of the variables.
es: Generar un gráfico de las variables.

source: Attributes
es: Atributos

source: The dimensions of the variable.
es: Las dimensiones de la variable.

source: :py:obj:`distribution <pymc_marketing.prior.Prior.distribution>`\
es: :py:obj:`distribución <pymc_marketing.prior.Prior.distribución>`\

source: The name of the PyMC distribution.
es: El nombre de la distribución de PyMC.

source: :py:obj:`non_centered_distributions <pymc_marketing.prior.Prior.non_centered_distributions>`\
es: :py:obj:`distribuciones_no_centradas <pymc_marketing.prior.Prior.distribuciones_no_centradas>`\

source: Create an equivalent preliz distribution.
es: Cree una distribución de preliz equivalente.

source: The name of the transform to apply to the variable after it is created.
es: El nombre de la transformación que se aplicará a la variable después de que se haya creado.
