Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.po
Languages: es

source: CustomModelWrapper
es: { "singular": "CustomModelWrapper", "plural": "CustomModelWrapper" }

source: Wrapper for the BudgetOptimizer to handle custom PyMC models.
es: { "singular": "Envoltorio para el BudgetOptimizer para manejar modelos PyMC personalizados.", "plural": "Envoltorios para el BudgetOptimizer para manejar modelos PyMC personalizados." }

source: Methods
es: { "singular": "Método", "plural": "Métodos" }

source: :py:obj:`CustomModelWrapper.__init__ <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.__init__>`\ \(base\_model\, ...\)
es: { "singular": ":py:obj:`CustomModelWrapper.__init__ <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.__init__>`\ \(modelo\_base\, ...\)", "plural": ":py:obj:`CustomModelWrapper.__init__ <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.__init__>`\ \(modelos\_base\, ...\)" }

source: Create a new model by parsing and validating input data from keyword arguments.
es: { "singular": "Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabra clave.", "plural": "Cree nuevos modelos analizando y validando los datos de entrada de los argumentos de palabra clave." }

source: :py:obj:`CustomModelWrapper.construct <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.construct>`\ \(\[\_fields\_set\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.construct <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.construct>`\ \(\[\_fields\_set\]\)", "plural": ":py:obj:`CustomModelWrapper.construct <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.construct>`\ \(\[\_fields\_set\]\)" }

source: :py:obj:`CustomModelWrapper.copy <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.copy>`\ \(\*\[\, include\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.copy <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.copy>`\ \(\*\[\, incluir\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.copy <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.copy>`\ \(\*\[\, incluir\, ...\]\)" }

source: Returns a copy of the model.
es: { "singular": { "msgid": "Returns a copy of the model.", "msgstr": "Devuelve una copia del modelo." }, "plural": { "msgid": "Returns a copy of the model.", "msgstr": "Devuelve una copia del modelo." } }

source: :py:obj:`CustomModelWrapper.dict <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.dict>`\ \(\*\[\, include\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.dict <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.dict>`\ \(\*\[\, incluir\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.dict <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.dict>`\ \(\*\[\, incluir\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.from_orm <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.from_orm>`\ \(obj\)
es: { "singular": ":py:obj:`CustomModelWrapper.from_orm <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.from_orm>`\ (obj)", "plural": ":py:obj:`CustomModelWrapper.from_orm <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.from_orm>`\ (obj)" }

source: :py:obj:`CustomModelWrapper.json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.json>`\ \(\*\[\, include\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.json>`\ \(\*\[\, incluir\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.json>`\ \(\*\[\, incluir\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.model_construct <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_construct>`\ \(\[\_fields\_set\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_construct <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_construct>`\ \(\[\_fields\_set\]\)", "plural": ":py:obj:`CustomModelWrapper.model_construct <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_construct>`\ \(\[\_fields\_set\]\)" }

source: Creates a new instance of the `Model` class with validated data.
es: { "singular": "Crea una nueva instancia de la clase `Model` con datos validados.", "plural": "Crea nuevas instancias de la clase `Model` con datos validados." }

source: :py:obj:`CustomModelWrapper.model_copy <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_copy>`\ \(\*\[\, update\, deep\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_copy <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)", "plural": ":py:obj:`CustomModelWrapper.model_copy <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)" }

source: !!! abstract "Usage Documentation"
es: { "singular": "!!! abstract \"Documentación de Uso\"", "plural": "!!! abstract \"Documentación de Uso\"" }

source: :py:obj:`CustomModelWrapper.model_dump <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump>`\ \(\*\[\, mode\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_dump <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump>`\ \(\*\[\, modo\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.model_dump <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump>`\ \(\*\[\, modos\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.model_dump_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump_json>`\ \(\*\[\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_dump_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump_json>`\ \(\*\[\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.model_dump_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump_json>`\ \(\*\[\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.model_json_schema <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_json_schema>`\ \(\[...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_json_schema <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_json_schema>`\ \(\[...\]\)", "plural": ":py:obj:`CustomModelWrapper.model_json_schema <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_json_schema>`\ \(\[...\]\)" }

source: Generates a JSON schema for a model class.
es: { "singular": { "msgid": "Generates a JSON schema for a model class.", "msgstr": "Genera un esquema JSON para una clase de modelo." }, "plural": { "msgid": "Generates a JSON schema for a model class.", "msgstr": "Genera un esquema JSON para clases de modelo." } }

source: :py:obj:`CustomModelWrapper.model_parametrized_name <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_parametrized_name>`\ \(params\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_parametrized_name <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_parametrized_name>`\ (params)", "plural": ":py:obj:`CustomModelWrapper.model_parametrized_name <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_parametrized_name>`\ (params)" }

source: Compute the class name for parametrizations of generic classes.
es: { "singular": "Calcule el nombre de la clase para parametrizaciones de clases genéricas.", "plural": "Calcule los nombres de las clases para parametrizaciones de clases genéricas." }

source: :py:obj:`CustomModelWrapper.model_post_init <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_post_init>`\ \(context\, \/\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_post_init <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_post_init>`\ \(context\, \/\)", "plural": ":py:obj:`CustomModelWrapper.model_post_init <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_post_init>`\ \(context\, \/\)" }

source: This function is meant to behave like a BaseModel method to initialise private attributes.
es: { "singular": "Esta función está destinada a comportarse como un método de BaseModel para inicializar atributos privados.", "plural": "Estas funciones están destinadas a comportarse como métodos de BaseModel para inicializar atributos privados." }

source: :py:obj:`CustomModelWrapper.model_rebuild <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_rebuild <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_rebuild>`\ \(\*\[\, fuerza\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.model_rebuild <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_rebuild>`\ \(\*\[\, fuerza\, ...\]\)" }

source: Try to rebuild the pydantic-core schema for the model.
es: { "singular": "Intente reconstruir el esquema de pydantic-core para el modelo.", "plural": "Intente reconstruir los esquemas de pydantic-core para los modelos." }

source: :py:obj:`CustomModelWrapper.model_validate <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate>`\ \(obj\, \*\[\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_validate <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate>`\ (obj\, \*\[\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.model_validate <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate>`\ (obj\, \*\[\, ...\]\)" }

source: Validate a pydantic model instance.
es: { "singular": "Valide una instancia de modelo pydantic.", "plural": "Valide instancias de modelo pydantic." }

source: :py:obj:`CustomModelWrapper.model_validate_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate_json>`\ \(...\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_validate_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate_json>`\ \(...\)", "plural": ":py:obj:`CustomModelWrapper.model_validate_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate_json>`\ \(...\)" }

source: :py:obj:`CustomModelWrapper.model_validate_strings <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate_strings>`\ \(obj\, \*\)
es: { "singular": ":py:obj:`CustomModelWrapper.model_validate_strings <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate_strings>`\ (obj\, \*)", "plural": ":py:obj:`CustomModelWrapper.model_validate_strings <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate_strings>`\ (obj\, \*)" }

source: Validate the given object with string data against the Pydantic model.
es: { "singular": "Valide el objeto dado con datos de cadena contra el modelo de Pydantic.", "plural": "Valide los objetos dados con datos de cadena contra los modelos de Pydantic." }

source: :py:obj:`CustomModelWrapper.parse_file <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_file>`\ \(path\, \*\[\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.parse_file <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_file>`\ (ruta\, \*\[\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.parse_file <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_file>`\ (rutas\, \*\[\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.parse_obj <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_obj>`\ \(obj\)
es: { "singular": ":py:obj:`CustomModelWrapper.parse_obj <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_obj>`\ (obj)", "plural": ":py:obj:`CustomModelWrapper.parse_obj <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_obj>`\ (obj)" }

source: :py:obj:`CustomModelWrapper.parse_raw <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_raw>`\ \(b\, \*\[\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.parse_raw <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_raw>`\ \(b\, \*\[\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.parse_raw <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.parse_raw>`\ \(b\, \*\[\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.schema <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.schema>`\ \(\[by\_alias\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.schema <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.schema>`\ \(\[por\_alias\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.schema <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.schema>`\ \(\[por\_alias\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.schema_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.schema_json>`\ \(\*\[\, ...\]\)
es: { "singular": ":py:obj:`CustomModelWrapper.schema_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.schema_json>`\ \(\*\[\, ...\]\)", "plural": ":py:obj:`CustomModelWrapper.schema_json <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.schema_json>`\ \(\*\[\, ...\]\)" }

source: :py:obj:`CustomModelWrapper.update_forward_refs <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.update_forward_refs>`\ \(\*\*localns\)
es: { "singular": ":py:obj:`CustomModelWrapper.update_forward_refs <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.update_forward_refs>`\ \(\*\*localns\)", "plural": ":py:obj:`CustomModelWrapper.update_forward_refs <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.update_forward_refs>`\ \(\*\*localns\)" }

source: :py:obj:`CustomModelWrapper.validate <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.validate>`\ \(value\)
es: { "singular": ":py:obj:`CustomModelWrapper.validate <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.validate>`\ \(valor\)", "plural": ":py:obj:`CustomModelWrapper.validate <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.validate>`\ \(valores\)" }

source: Attributes
es: { "singular": "Atributo", "plural": "Atributos" }

source: :py:obj:`model_computed_fields <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_computed_fields>`\
es: { "singular": ":py:obj:`model_computed_fields <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_computed_fields>`", "plural": ":py:obj:`model_computed_fields <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_computed_fields>`" }

source: :py:obj:`model_config <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_config>`\
es: { "singular": ":py:obj:`model_config <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_config>`", "plural": ":py:obj:`model_config <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_config>`" }

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: { "singular": "La configuración para el modelo debe ser un diccionario que se ajuste a [`ConfigDict`][pydantic.config.ConfigDict].", "plural": "Las configuraciones para los modelos deben ser diccionarios que se ajusten a [`ConfigDict`][pydantic.config.ConfigDict]." }

source: :py:obj:`model_extra <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_extra>`\
es: { "singular": ":py:obj:`model_extra <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_extra>`", "plural": ":py:obj:`model_extra <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_extra>`" }

source: Get extra fields set during validation.
es: { "singular": "Obtenga campos adicionales establecidos durante la validación.", "plural": "Obtenga campos adicionales establecidos durante la validación." }

source: :py:obj:`model_fields <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_fields>`\
es: { "singular": ":py:obj:`model_fields <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_fields>`", "plural": ":py:obj:`model_fields <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_fields>`" }

source: :py:obj:`model_fields_set <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_fields_set>`\
es: { "singular": ":py:obj:`model_fields_set <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_fields_set>`", "plural": ":py:obj:`model_fields_set <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_fields_set>`" }

source: Returns the set of fields that have been explicitly set on this model instance.
es: { "singular": "Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.", "plural": "Devuelve el conjunto de campos que han sido establecidos explícitamente en estas instancias del modelo." }

source: :py:obj:`base_model <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.base_model>`\
es: { "singular": ":py:obj:`modelo_base <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.modelo_base>`", "plural": ":py:obj:`modelos_base <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.modelos_base>`" }

source: :py:obj:`idata <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.idata>`\
es: { "singular": ":py:obj:`idata <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.idata>`", "plural": ":py:obj:`idata <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.idata>`" }

source: :py:obj:`channel_columns <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.channel_columns>`\
es: { "singular": ":py:obj:`columnas_del_canal <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.channel_columns>`", "plural": ":py:obj:`columnas_del_canal <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.channel_columns>`" }

source: :py:obj:`adstock <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.adstock>`\
es: { "singular": ":py:obj:`adstock <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.adstock>`", "plural": ":py:obj:`adstock <pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.adstock>`" }
