Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.HSGPPeriodic.po
Languages: es

source: HSGPPeriodic
es: HSGPPeriódico

source: HSGP component for periodic data.
es: Componente HSGP para datos periódicos.

source: Examples
es: Ejemplos

source: HSGPPeriodic with default configuration:
es: HSGPPeriódico con configuración predeterminada:

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-1.pdf>`)

source: HSGPPeriodic with link function via `transform` argument
es: HSGPPeriódico con función de enlace a través del argumento `transform`

source: The `transform` parameter must be registered or from either `pytensor.tensor` or `pymc.math` namespaces. See the :func:`pymc_extras.prior.register_tensor_transform`
es: El parámetro `transform` debe estar registrado o ser de los espacios de nombres `pytensor.tensor` o `pymc.math`. Consulte la :func:`pymc_extras.prior.register_tensor_transform`

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-2.pdf>`)

source: Demeaned basis for HSGPPeriodic
es: Base menospreciada para HSGPPeriodic

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-3.pdf>`)

source: Higher dimensional HSGPPeriodic with periodic data
es: HSGPPeriódico de dimensiones superiores con datos periódicos

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGPPeriodic-4.pdf>`)

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabra clave.

source: :py:obj:`HSGPPeriodic.copy <pymc_marketing.mmm.hsgp.HSGPPeriodic.copy>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPPeriodic.copy <pymc_marketing.mmm.hsgp.HSGPPeriodic.copy>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`HSGPPeriodic.create_variable <pymc_marketing.mmm.hsgp.HSGPPeriodic.create_variable>`\ \(name\)
es: :py:obj:`HSGPPeriodic.create_variable <pymc_marketing.mmm.hsgp.HSGPPeriodic.create_variable>`\ \(nombre\)

source: Create HSGP variable.
es: Crear variable HSGP.

source: :py:obj:`HSGPPeriodic.deterministics_to_replace <pymc_marketing.mmm.hsgp.HSGPPeriodic.deterministics_to_replace>`\ \(name\)
es: :py:obj:`HSGPPeriodic.deterministics_to_replace <pymc_marketing.mmm.hsgp.HSGPPeriodic.deterministics_to_replace>`\ \(nombre\)

source: Name of the Deterministic variables that are replaced with pm.Flat for out-of-sample.
es: Nombre de las variables determinísticas que se reemplazan con pm.Flat para fuera de muestra.

source: :py:obj:`HSGPPeriodic.dict <pymc_marketing.mmm.hsgp.HSGPPeriodic.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPPeriodic.dict <pymc_marketing.mmm.hsgp.HSGPPeriodic.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: :py:obj:`HSGPPeriodic.from_dict <pymc_marketing.mmm.hsgp.HSGPPeriodic.from_dict>`\ \(data\)
es: :py:obj:`HSGPPeriodic.from_dict <pymc_marketing.mmm.hsgp.HSGPPeriodic.from_dict>`\ \(datos\)

source: Create an object from a dictionary.
es: Cree un objeto a partir de un diccionario.

source: :py:obj:`HSGPPeriodic.json <pymc_marketing.mmm.hsgp.HSGPPeriodic.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPPeriodic.json <pymc_marketing.mmm.hsgp.HSGPPeriodic.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`HSGPPeriodic.model_copy <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`HSGPPeriodic.model_copy <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`HSGPPeriodic.model_dump <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_dump>`\ \(\*\[\, mode\, include\, ...\]\)
es: :py:obj:`HSGPPeriodic.model_dump <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_dump>`\ \(\*\[\, modo\, incluir\, ...\]\)

source: :py:obj:`HSGPPeriodic.model_json_schema <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`HSGPPeriodic.model_json_schema <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`HSGPPeriodic.model_rebuild <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`HSGPPeriodic.model_rebuild <pymc_marketing.mmm.hsgp.HSGPPeriodic.model_rebuild>`\ \(\*\[\, forzar\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: Validate a pydantic model instance.
es: Valide una instancia de modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: :py:obj:`HSGPPeriodic.parse_file <pymc_marketing.mmm.hsgp.HSGPPeriodic.parse_file>`\ \(path\, \*\[\, ...\]\)
es: :py:obj:`HSGPPeriodic.parse_file <pymc_marketing.mmm.hsgp.HSGPPeriodic.parse_file>`\ \(ruta\, \*\[\, ...\]\)

source: :py:obj:`HSGPPeriodic.parse_raw <pymc_marketing.mmm.hsgp.HSGPPeriodic.parse_raw>`\ \(b\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`HSGPPeriodic.parse_raw <pymc_marketing.mmm.hsgp.HSGPPeriodic.parse_raw>`\ \(b\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: :py:obj:`HSGPPeriodic.plot_curve <pymc_marketing.mmm.hsgp.HSGPPeriodic.plot_curve>`\ \(curve\[\, n\_samples\, ...\]\)
es: :py:obj:`HSGPPeriodic.plot_curve <pymc_marketing.mmm.hsgp.HSGPPeriodic.plot_curve>`\ \(curva\[\, n\_muestras\, ...\]

source: Plot the curve.
es: Dibuje la curva.

source: Register the data to be used in the model.
es: Registre los datos que se utilizarán en el modelo.

source: Sample from the prior distribution.
es: Muestra de la distribución previa.

source: :py:obj:`HSGPPeriodic.schema <pymc_marketing.mmm.hsgp.HSGPPeriodic.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`HSGPPeriodic.schema <pymc_marketing.mmm.hsgp.HSGPPeriodic.schema>`\ \(\[por\_alias\, ref\_plantilla\]\)

source: :py:obj:`HSGPPeriodic.schema_json <pymc_marketing.mmm.hsgp.HSGPPeriodic.schema_json>`\ \(\*\[\, by\_alias\, ...\]\)
es: :py:obj:`HSGPPeriodic.schema_json <pymc_marketing.mmm.hsgp.HSGPPeriodic.schema_json>`\ \(\*\[\, por\_alias\, ...\]\)

source: Convert the object to a dictionary.
es: Convierte el objeto a un diccionario.

source: :py:obj:`HSGPPeriodic.validate <pymc_marketing.mmm.hsgp.HSGPPeriodic.validate>`\ \(value\)
es: :py:obj:`HSGPPeriodic.validate <pymc_marketing.mmm.hsgp.HSGPPeriodic.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.

source: :py:obj:`scale <pymc_marketing.mmm.hsgp.HSGPPeriodic.scale>`\
es: :py:obj:`escala <pymc_marketing.mmm.hsgp.HSGPPeriodic.scale>`\

source: :py:obj:`period <pymc_marketing.mmm.hsgp.HSGPPeriodic.period>`\
es: :py:obj:`periodo <pymc_marketing.mmm.hsgp.HSGPPeriodic.period>`\

source: :py:obj:`demeaned_basis <pymc_marketing.mmm.hsgp.HSGPPeriodic.demeaned_basis>`\
es: :py:obj:`base_demeanada <pymc_marketing.mmm.hsgp.HSGPPeriodic.base_demeanada>`
