Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.create_constrained_inverse_gamma_prior.po
Languages: es

source: create\_constrained\_inverse\_gamma\_prior
es: crear\_prior\_gamma\_inversa\_constrainada

source: Create a lengthscale prior for the HSGP model.
es: Cree un prior de escala de longitud para el modelo HSGP.

source: Parameters
es: Parámetros

source: **upper** : :class:`python:float`
es: **superior** : :class:`python:float`

source: Upper bound for the lengthscale.
es: Límite superior para la escala de longitud.

source: **lower** : :class:`python:float`
es: **inferior** : :class:`python:float`

source: Lower bound for the lengthscale. Default is 1.0.
es: Límite inferior para la escala de longitud. El valor predeterminado es 1.0.

source: **mass** : :class:`python:float`
es: **masa** : :class:`python:float`

source: Mass of the lengthscales. Default is 0.9 or 90%.
es: Masa de las escalas de longitud. El valor predeterminado es 0.9 o 90%.

source: Returns
es: Devoluciones

source: The prior for the lengthscale.
es: El prior para la longitud de escala.
