Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.tanh_saturation.po
Languages: es

source: tanh\_saturation
es: tanh\_saturación

source: Tanh saturation transformation.
es: Transformación de saturación Tanh.

source: The tanh saturation function has a nice property that is useful when setting priors. The slope of the function when x is zero is :math:`\frac{1}{c}`. This means that you can set a prior by considering how many units of media are required to acquire the first customer. Unlike most other saturation functions, the slope at 0 is independent of the saturation point.
es: La función de saturación tanh tiene una propiedad interesante que es útil al establecer priors. La pendiente de la función cuando x es cero es :math:`\frac{1}{c}`. Esto significa que puedes establecer un prior considerando cuántas unidades de medios se requieren para adquirir el primer cliente. A diferencia de la mayoría de las otras funciones de saturación, la pendiente en 0 es independiente del punto de saturación.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation-1.pdf>`)

source: Parameters
es: Parámetros

source: Input tensor.
es: Tensor de entrada.

source: **b** : :class:`python:float`, :obj:`by` default 0.5
es: **b** : :class:`python:float`, :obj:`by` por defecto 0.5

source: python:float, by default 0.5
es: python:float, por defecto 0.5

source: The saturation point. It represents the maximium number of customers that could be acquired through this channel at any point time. Must be non-negative.
es: El punto de saturación. Representa el número máximo de clientes que se podrían adquirir a través de este canal en cualquier momento. Debe ser no negativo.

source: **c** : :class:`python:float`, :obj:`by` default 0.5
es: **c** : :class:`python:float`, :obj:`by` por defecto 0.5

source: Initial cost per user. Larger values represent less efficient channels. Must be non-zero.
es: Costo inicial por usuario. Valores más altos representan canales menos eficientes. Debe ser distinto de cero.

source: Returns
es: Devoluciones

source: Transformed tensor.
es: Tensor transformado.

source: References
es: Referencias

source: See https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/ # noqa: E501
es: Vea https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/ # noqa: E501
