Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.causal.TestResult.po
Languages: es

source: TestResult
es: { "singular": "ResultadoDePrueba", "plural": "ResultadosDePrueba" }

source: Conditional independence test statistics recorded during fitting.
es: { "singular": "Estadísticas de prueba de independencia condicional registradas durante el ajuste.", "plural": "Estadísticas de prueba de independencia condicional registradas durante los ajustes." }

source: Methods
es: { "singular": "Método", "plural": "Métodos" }

source: :py:obj:`TestResult.__init__ <pymc_marketing.mmm.causal.TestResult.__init__>`\ \(\*args\, \*\*kwargs\)
es: { "singular": ":py:obj:`TestResult.__init__ <pymc_marketing.mmm.causal.TestResult.__init__>`\ \(\*args\, \*\*kwargs\)", "plural": ":py:obj:`TestResult.__init__ <pymc_marketing.mmm.causal.TestResult.__init__>`\ \(\*args\, \*\*kwargs\)" }

source: :py:obj:`TestResult.clear <pymc_marketing.mmm.causal.TestResult.clear>`\ \(\)
es: { "singular": ":py:obj:`TestResult.clear <pymc_marketing.mmm.causal.TestResult.clear>`\ \(\)", "plural": ":py:obj:`TestResult.clear <pymc_marketing.mmm.causal.TestResult.clear>`\ \(\)" }

source: :py:obj:`TestResult.copy <pymc_marketing.mmm.causal.TestResult.copy>`\ \(\)
es: { "singular": ":py:obj:`TestResult.copy <pymc_marketing.mmm.causal.TestResult.copy>`\ \(\)", "plural": ":py:obj:`TestResult.copy <pymc_marketing.mmm.causal.TestResult.copy>`\ \(\)" }

source: :py:obj:`TestResult.fromkeys <pymc_marketing.mmm.causal.TestResult.fromkeys>`\ \(iterable\[\, value\]\)
es: { "singular": ":py:obj:`TestResult.fromkeys <pymc_marketing.mmm.causal.TestResult.fromkeys>`\ \(iterable\[\, value\]\)", "plural": ":py:obj:`TestResult.fromkeys <pymc_marketing.mmm.causal.TestResult.fromkeys>`\ \(iterable\[\, value\]\)" }

source: Create a new dictionary with keys from iterable and values set to value.
es: { "singular": "Cree un nuevo diccionario con claves del iterable y valores establecidos en el valor.", "plural": "Cree nuevos diccionarios con claves del iterable y valores establecidos en el valor." }

source: :py:obj:`TestResult.get <pymc_marketing.mmm.causal.TestResult.get>`\ \(key\[\, default\]\)
es: { "singular": ":py:obj:`TestResult.get <pymc_marketing.mmm.causal.TestResult.get>`\ \(clave\[\, predeterminado\]\)", "plural": ":py:obj:`TestResult.get <pymc_marketing.mmm.causal.TestResult.get>`\ \(claves\[\, predeterminados\]\)" }

source: Return the value for key if key is in the dictionary, else default.
es: { "singular": "Devuelve el valor para la clave si la clave está en el diccionario, de lo contrario, el valor por defecto.", "plural": "Devuelven el valor para la clave si la clave está en el diccionario, de lo contrario, el valor por defecto." }

source: :py:obj:`TestResult.items <pymc_marketing.mmm.causal.TestResult.items>`\ \(\)
es: { "singular": ":py:obj:`ResultadoDePrueba.items <pymc_marketing.mmm.causal.ResultadoDePrueba.items>`\ \(\)", "plural": ":py:obj:`ResultadosDePrueba.items <pymc_marketing.mmm.causal.ResultadosDePrueba.items>`\ \(\)" }

source: :py:obj:`TestResult.keys <pymc_marketing.mmm.causal.TestResult.keys>`\ \(\)
es: { "singular": ":py:obj:`TestResult.keys <pymc_marketing.mmm.causal.TestResult.keys>`\ \(\)", "plural": ":py:obj:`TestResult.keys <pymc_marketing.mmm.causal.TestResult.keys>`\ \(\)" }

source: :py:obj:`TestResult.pop <pymc_marketing.mmm.causal.TestResult.pop>`\ \(key\[\, default\]\)
es: { "singular": ":py:obj:`TestResult.pop <pymc_marketing.mmm.causal.TestResult.pop>`\ \(clave\[\, predeterminado\]\)", "plural": ":py:obj:`TestResult.pop <pymc_marketing.mmm.causal.TestResult.pop>`\ \(claves\[\, predeterminados\]\)" }

source: If the key is not found, return the default if given; otherwise, raise a KeyError.
es: { "singular": "Si la clave no se encuentra, devuelve el valor predeterminado si se proporciona; de lo contrario, genera un KeyError.", "plural": "Si las claves no se encuentran, devuelve el valor predeterminado si se proporciona; de lo contrario, genera un KeyError." }

source: :py:obj:`TestResult.popitem <pymc_marketing.mmm.causal.TestResult.popitem>`\ \(\/\)
es: { "singular": ":py:obj:`TestResult.popitem <pymc_marketing.mmm.causal.TestResult.popitem>`\ \(\/\)", "plural": ":py:obj:`TestResult.popitem <pymc_marketing.mmm.causal.TestResult.popitem>`\ \(\/\)" }

source: Remove and return a (key, value) pair as a 2-tuple.
es: { "singular": "Elimine y devuelva un par (clave, valor) como una tupla de 2 elementos.", "plural": "Elimine y devuelva pares (clave, valor) como tuplas de 2 elementos." }

source: :py:obj:`TestResult.setdefault <pymc_marketing.mmm.causal.TestResult.setdefault>`\ \(key\[\, default\]\)
es: { "singular": ":py:obj:`TestResult.setdefault <pymc_marketing.mmm.causal.TestResult.setdefault>`\ (clave\[\, predeterminado\])", "plural": ":py:obj:`TestResult.setdefault <pymc_marketing.mmm.causal.TestResult.setdefault>`\ (claves\[\, predeterminado\])" }

source: Insert key with a value of default if key is not in the dictionary.
es: { "singular": "Inserte la clave con un valor de predeterminado si la clave no está en el diccionario.", "plural": "Inserte las claves con un valor de predeterminado si las claves no están en el diccionario." }

source: :py:obj:`TestResult.update <pymc_marketing.mmm.causal.TestResult.update>`\ \(\[E\, \]\*\*F\)
es: { "singular": ":py:obj:`TestResult.update <pymc_marketing.mmm.causal.TestResult.update>`\ \(\[E\, \]\*\*F\)", "plural": ":py:obj:`TestResult.update <pymc_marketing.mmm.causal.TestResult.update>`\ \(\[E\, \]\*\*F\)" }

source: If E is present and has a .keys() method, then does: for k in E.keys(): D[k] = E[k] If E is present and lacks a .keys() method, then does: for k, v in E: D[k] = v In either case, this is followed by: for k in F: D[k] = F[k]
es: { "singular": "Si E está presente y tiene un método .keys(), entonces hace: for k in E.keys(): D[k] = E[k] Si E está presente y carece de un método .keys(), entonces hace: for k, v in E: D[k] = v En cualquiera de los casos, esto es seguido por: for k in F: D[k] = F[k]", "plural": "Si E está presente y tiene un método .keys(), entonces hace: for k in E.keys(): D[k] = E[k] Si E está presente y carece de un método .keys(), entonces hace: for k, v in E: D[k] = v En cualquiera de los casos, esto es seguido por: for k in F: D[k] = F[k]" }

source: :py:obj:`TestResult.values <pymc_marketing.mmm.causal.TestResult.values>`\ \(\)
es: { "singular": ":py:obj:`TestResult.values <pymc_marketing.mmm.causal.TestResult.values>`\ \(\)", "plural": ":py:obj:`TestResult.values <pymc_marketing.mmm.causal.TestResult.values>`\ \(\)" }

source: Attributes
es: { "singular": "Atributo", "plural": "Atributos" }

source: :py:obj:`bic0 <pymc_marketing.mmm.causal.TestResult.bic0>`\
es: { "singular": ":py:obj:`bic0 <pymc_marketing.mmm.causal.TestResult.bic0>`", "plural": ":py:obj:`bic0 <pymc_marketing.mmm.causal.TestResult.bic0>`" }

source: :py:obj:`bic1 <pymc_marketing.mmm.causal.TestResult.bic1>`\
es: { "singular": ":py:obj:`bic1 <pymc_marketing.mmm.causal.TestResult.bic1>`", "plural": ":py:obj:`bic1 <pymc_marketing.mmm.causal.TestResult.bic1>`" }

source: :py:obj:`delta_bic <pymc_marketing.mmm.causal.TestResult.delta_bic>`\
es: { "singular": ":py:obj:`delta_bic <pymc_marketing.mmm.causal.TestResult.delta_bic>`", "plural": ":py:obj:`delta_bic <pymc_marketing.mmm.causal.TestResult.delta_bic>`" }

source: :py:obj:`logBF10 <pymc_marketing.mmm.causal.TestResult.logBF10>`\
es: { "singular": ":py:obj:`logBF10 <pymc_marketing.mmm.causal.TestResult.logBF10>`", "plural": ":py:obj:`logBF10 <pymc_marketing.mmm.causal.TestResult.logBF10>`" }

source: :py:obj:`BF10 <pymc_marketing.mmm.causal.TestResult.BF10>`\
es: { "singular": ":py:obj:`BF10 <pymc_marketing.mmm.causal.TestResult.BF10>`", "plural": ":py:obj:`BF10 <pymc_marketing.mmm.causal.TestResult.BF10>`" }

source: :py:obj:`independent <pymc_marketing.mmm.causal.TestResult.independent>`\
es: { "singular": ":py:obj:`independiente <pymc_marketing.mmm.causal.TestResult.independent>`", "plural": ":py:obj:`independientes <pymc_marketing.mmm.causal.TestResult.independent>`" }

source: :py:obj:`conditioning_set <pymc_marketing.mmm.causal.TestResult.conditioning_set>`\
es: { "singular": ":py:obj:`conjunto_de_condicionamiento <pymc_marketing.mmm.causal.TestResult.conditioning_set>`", "plural": ":py:obj:`conjuntos_de_condicionamiento <pymc_marketing.mmm.causal.TestResult.conditioning_set>`" }

source: :py:obj:`forced <pymc_marketing.mmm.causal.TestResult.forced>`\
es: { "singular": ":py:obj:`forzado <pymc_marketing.mmm.causal.TestResult.forced>`", "plural": ":py:obj:`forzados <pymc_marketing.mmm.causal.TestResult.forced>`" }
