Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.po
Languages: es

source: ParetoNBDModel
es: ModeloParetoNBD

source: Pareto Negative Binomial Model (Pareto/NBD).
es: Modelo Binomial Negativo de Pareto (Pareto/NBD).

source: Model for continuous, non-contractual customers, first introduced by Schmittlein et al. [R646f36bbc86f-1]_, with additional derivations and predictive methods by Hardie & Fader [R646f36bbc86f-2]_ [R646f36bbc86f-3]_ [R646f36bbc86f-4]_ [R646f36bbc86f-5]_.
es: Modelo para clientes continuos y no contractuales, introducido por primera vez por Schmittlein et al. [R646f36bbc86f-1]_, con derivaciones adicionales y métodos predictivos de Hardie y Fader [R646f36bbc86f-2]_ [R646f36bbc86f-3]_ [R646f36bbc86f-4]_ [R646f36bbc86f-5]_.

source: The Pareto/NBD model assumes the time duration a customer is active follows a Gamma distribution, and time between purchases is also Gamma-distributed while the customer is still active.
es: El modelo Pareto/NBD asume que la duración del tiempo en que un cliente está activo sigue una distribución Gamma, y el tiempo entre compras también se distribuye de manera Gamma mientras el cliente sigue activo.

source: This model requires data to be summarized by *recency*, *frequency*, and *T* for each customer, using `clv.rfm_summary()` or equivalent. Covariates impacting customer dropouts and transaction rates are optional.
es: Este modelo requiere que los datos sean resumidos por *recencia*, *frecuencia* y *T* para cada cliente, utilizando `clv.rfm_summary()` o equivalente. Las covariables que impactan en la deserción de clientes y las tasas de transacción son opcionales.

source: Parameters
es: Parámetros

source: **data** : :obj:`~pandas.DataFrame`
es: **datos** : :obj:`~pandas.DataFrame`

source: DataFrame containing the following columns:
es: DataFrame que contiene las siguientes columnas:

source: `customer_id`: Unique customer identifier
es: `customer_id`: Identificador único del cliente

source: `frequency`: Number of repeat purchases
es: `frequency`: Número de compras repetidas

source: `recency`: Time between the first and the last purchase
es: `recency`: Tiempo entre la primera y la última compra

source: `T`: Time between the first purchase and the end of the observation period. Model assumptions require *T >= recency*
es: `T`: Tiempo entre la primera compra y el final del período de observación. Las suposiciones del modelo requieren *T >= recency*

source: Along with optional covariate columns.
es: Junto con columnas de covariables opcionales.

source: **model_config** : :class:`python:dict`, optional
es: **model_config** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Dictionary containing model parameters and covariate column names:
es: Diccionario que contiene parámetros del modelo y nombres de columnas de covariables:

source: `r`: Shape parameter of time between purchases; defaults to `Weibull(alpha=2, beta=1)`
es: `r`: Parámetro de forma del tiempo entre compras; por defecto es `Weibull(alpha=2, beta=1)`

source: `alpha`: Scale parameter of time between purchases; defaults to `Weibull(alpha=2, beta=10)`
es: `alpha`: Parámetro de escala del tiempo entre compras; por defecto es `Weibull(alpha=2, beta=10)`

source: `s`: Shape parameter of time until dropout; defaults to `Weibull(alpha=2, beta=1)`
es: `s`: Parámetro de forma del tiempo hasta la caída; por defecto es `Weibull(alpha=2, beta=1)`

source: `beta`: Scale parameter of time until dropout; defaults to `Weibull(alpha=2, beta=10)`
es: `beta`: Parámetro de escala del tiempo hasta la deserción; por defecto es `Weibull(alpha=2, beta=10)`

source: `purchase_covariates`: Coefficients for purchase rate covariates; defaults to `Normal(0, 3)`
es: `purchase_covariates`: Coeficientes para covariables de la tasa de compra; por defecto es `Normal(0, 3)`

source: `dropout_covariates`: Coefficients for dropout covariates; defaults to `Normal.dist(0, 3)`
es: `dropout_covariates`: Coeficientes para covariables de abandono; por defecto es `Normal.dist(0, 3)`

source: `purchase_covariate_cols`: List containing column names of covariates for customer purchase rates.
es: `purchase_covariate_cols`: Lista que contiene los nombres de las columnas de covariables para las tasas de compra de los clientes.

source: `dropout_covariate_cols`: List containing column names of covariates for customer dropouts.
es: `dropout_covariate_cols`: Lista que contiene los nombres de las columnas de covariables para las bajas de clientes.

source: If not provided, the model will use default priors specified in the `default_model_config` class attribute.
es: Si no se proporciona, el modelo utilizará los priors predeterminados especificados en el atributo de clase `default_model_config`.

source: **sampler_config** : :class:`python:dict`, optional
es: **sampler_config** : :class:`python:dict`, opcional

source: Dictionary of sampler parameters. Defaults to None.
es: Diccionario de parámetros del muestreador. Por defecto es None.

source: References
es: Referencias

source: David C. Schmittlein, Donald G. Morrison and Richard Colombo. "Counting Your Customers: Who Are They and What Will They Do Next". Management Science,Vol. 33, No. 1 (Jan., 1987), pp. 1-24.
es: David C. Schmittlein, Donald G. Morrison y Richard Colombo. "Contando a sus clientes: ¿Quiénes son y qué harán a continuación?". Management Science, Vol. 33, No. 1 (ene., 1987), pp. 1-24.

source: Fader, Peter & G. S. Hardie, Bruce (2005). "A Note on Deriving the Pareto/NBD Model and Related Expressions". http://brucehardie.com/notes/009/pareto_nbd_derivations_2005-11-05.pdf
es: Fader, Peter y G. S. Hardie, Bruce (2005). "Una nota sobre la derivación del modelo Pareto/NBD y expresiones relacionadas". http://brucehardie.com/notes/009/pareto_nbd_derivations_2005-11-05.pdf

source: Fader, Peter & G. S. Hardie, Bruce (2014). "Additional Results for the Pareto/NBD Model". https://www.brucehardie.com/notes/015/additional_pareto_nbd_results.pdf
es: Fader, Peter y G. S. Hardie, Bruce (2014). "Resultados Adicionales para el Modelo Pareto/NBD". https://www.brucehardie.com/notes/015/additional_pareto_nbd_results.pdf

source: Fader, Peter & G. S. Hardie, Bruce (2014). "Deriving the Conditional PMF of the Pareto/NBD Model". https://www.brucehardie.com/notes/028/pareto_nbd_conditional_pmf.pdf
es: Fader, Peter y G. S. Hardie, Bruce (2014). "Derivando la PMF Condicional del Modelo Pareto/NBD". https://www.brucehardie.com/notes/028/pareto_nbd_conditional_pmf.pdf

source: Fader, Peter & G. S. Hardie, Bruce (2007). "Incorporating Time-Invariant Covariates into the Pareto/NBD and BG/NBD Models". https://www.brucehardie.com/notes/019/time_invariant_covariates.pdf
es: Fader, Peter y G. S. Hardie, Bruce (2007). "Incorporando covariables invariantes en el tiempo en los modelos Pareto/NBD y BG/NBD". https://www.brucehardie.com/notes/019/time_invariant_covariates.pdf

source: Examples
es: Ejemplos

source: Methods
es: Métodos

source: :py:obj:`ParetoNBDModel.__init__ <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.__init__>`\ \(data\, \*\[\, ...\]\)
es: :py:obj:`ParetoNBDModel.__init__ <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.__init__>`\ \(datos\, \*\[\, ...\]\)

source: Initialize model configuration and sampler configuration for the model.
es: Inicializar la configuración del modelo y la configuración del muestreador para el modelo.

source: Convert the model configuration and sampler configuration from the attributes to keyword arguments.
es: Convierte la configuración del modelo y la configuración del muestreador de los atributos a argumentos de palabra clave.

source: Build the model from the InferenceData object.
es: Construya el modelo a partir del objeto InferenceData.

source: Build the model.
es: Construya el modelo.

source: Create attributes for the inference data.
es: Cree atributos para los datos de inferencia.

source: Compute posterior predictive samples of dropout, purchase rate and frequency/recency of new customers.
es: Calcule muestras predictivas posteriores de abandono, tasa de compra y frecuencia/recencia de nuevos clientes.

source: Sample from the Gamma distribution representing dropout times for new customers.
es: Muestra de la distribución Gamma que representa los tiempos de abandono para nuevos clientes.

source: Sample from the Gamma distribution representing purchase rates for new customers.
es: Muestra de la distribución Gamma que representa las tasas de compra para nuevos clientes.

source: Pareto/NBD process representing purchases across the customer population.
es: Proceso Pareto/NBD que representa las compras a través de la población de clientes.

source: Compute expected probability of being alive.
es: Calcular la probabilidad esperada de estar vivo.

source: Compute expected probability of *n_purchases* over *future_t* time periods.
es: Calcule la probabilidad esperada de *n_purchases* durante *future_t* períodos de tiempo.

source: :py:obj:`ParetoNBDModel.expected_purchases <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.expected_purchases>`\ \(\[data\, ...\]\)
es: :py:obj:`ParetoNBDModel.expected_purchases <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.expected_purchases>`\ \(\[datos\, ...\]\)

source: Compute expected number of future purchases.
es: Calcular el número esperado de compras futuras.

source: Compute the expected number of purchases for a new customer across *t* time periods.
es: Calcule el número esperado de compras para un nuevo cliente a lo largo de *t* períodos de tiempo.

source: :py:obj:`ParetoNBDModel.fit <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.fit>`\ \(\[method\, fit\_method\]\)
es: :py:obj:`ParetoNBDModel.fit <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.fit>`\ \(\[método\, fit\_method\]\)

source: Infer posteriors of model parameters to run predictions.
es: Inferir los posteriores de los parámetros del modelo para realizar predicciones.

source: Compute the summary of the fit result.
es: Calcule el resumen del resultado del ajuste.

source: Get the graphviz representation of the model.
es: Obtenga la representación graphviz del modelo.

source: Create the initialization kwargs from an InferenceData object.
es: Cree los kwargs de inicialización a partir de un objeto InferenceData.

source: Create a ModelBuilder instance from a file.
es: Cree una instancia de ModelBuilder a partir de un archivo.

source: Create a ModelBuilder instance from an InferenceData object.
es: Cree una instancia de ModelBuilder a partir de un objeto InferenceData.

source: Save the model's inference data to a file.
es: Guarde los datos de inferencia del modelo en un archivo.

source: Set attributes on an InferenceData object.
es: Establecer atributos en un objeto InferenceData.

source: Get the summary table of the model.
es: Obtenga la tabla resumen del modelo.

source: Return a copy of the model with a thinned fit result.
es: Devuelva una copia del modelo con un resultado de ajuste reducido.

source: Attributes
es: Atributos

source: Default model configuration.
es: Configuración de modelo predeterminada.

source: Default sampler configuration.
es: Configuración de muestreador predeterminada.

source: Get the posterior fit_result.
es: Obtenga el resultado de ajuste posterior fit_result.

source: Generate a unique hash value for the model.
es: Generar un valor hash único para el modelo.

source: :py:obj:`predictions <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.predictions>`\
es: :py:obj:`predicciones <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.predictions>`

source: :py:obj:`version <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.version>`\
es: :py:obj:`versión <pymc_marketing.clv.models.pareto_nbd.ParetoNBDModel.version>`\
