Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.hill_saturation_sigmoid.po
Languages: es

source: Hill Saturation Sigmoid Function.
es: Función sigmoide de saturación de colina.

source: where:
es: donde:

source: :math:`\sigma` is the upper asymptote
es: :math:`\sigma` es la asíntota superior

source: :math:`\beta` is the slope parameter
es: :math:`\beta` es el parámetro de pendiente

source: :math:`\lambda` is the transition point on the X-axis
es: :math:`\lambda` es el punto de transición en el eje X.

source: :math:`x` is the independent variable
es: :math:`x` es la variable independiente

source: This function computes the Hill sigmoidal response curve, which is commonly used to describe the saturation effect in biological systems. The curve is characterized by its sigmoidal shape, representing a gradual transition from a low, nearly zero level to a high plateau, the maximum value the function will approach as the independent variable grows large. In this implementation, we add an offset to the sigmoid function to ensure that the function always passes through the origin as we expect zero spend to result in zero contribution.
es: Esta función calcula la curva de respuesta sigmoidal de Hill, que se utiliza comúnmente para describir el efecto de saturación en sistemas biológicos. La curva se caracteriza por su forma sigmoidal, que representa una transición gradual de un nivel bajo, casi cero, a un alto plateau, el valor máximo al que la función se acercará a medida que la variable independiente crezca. En esta implementación, añadimos un desplazamiento a la función sigmoidal para asegurar que la función siempre pase por el origen, ya que esperamos que un gasto de cero resulte en una contribución de cero.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_00_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_00_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_00_00.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_00_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_00_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_00_00.pdf>`)

source: (:download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_01_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_01_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_01_00.pdf>`)
es: (:descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_01_00.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_01_00.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-hill_saturation_sigmoid-1_01_00.pdf>`)

source: Parameters
es: Parámetros

source: **x** : :class:`python:float` or :term:`numpy:array_like`
es: **x** : :class:`python:float` o :term:`numpy:array_like`

source: python:float or numpy:array_like
es: python:float o numpy:array_like

source: The independent variable, typically representing the concentration of a substrate or the intensity of a stimulus.
es: La variable independiente, que típicamente representa la concentración de un sustrato o la intensidad de un estímulo.

source: The upper asymptote of the curve, representing the approximate maximum value the function will approach as x grows large. The true maximum value is at `sigma * (1 - 1 / (1 + exp(beta * lam)))`
es: La asíntota superior de la curva representa el valor máximo aproximado al que la función se acercará a medida que x crezca. El verdadero valor máximo se encuentra en `sigma * (1 - 1 / (1 + exp(beta * lam)))`

source: The slope parameter, determining the steepness of the curve.
es: El parámetro de pendiente, que determina la inclinación de la curva.

source: The x-value of the midpoint where the curve transitions from exponential growth to saturation.
es: El valor x del punto medio donde la curva transiciona de crecimiento exponencial a saturación.

source: Returns
es: Devoluciones

source: :class:`python:float` or :term:`numpy:array_like`
es: :class:`python:float` o :term:`numpy:array_like`

source: The value of the Hill saturation sigmoid function for each input value of x.
es: El valor de la función sigmoide de saturación de Hill para cada valor de entrada de x.
