Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.model_graph.deterministics_to_flat.po
Languages: es

source: deterministics\_to\_flat
es: determinísticos\_a\_plano

source: Replace all specified Deterministic nodes in a pm.Model with Flat.
es: Reemplace todos los nodos deterministas especificados en un pm.Model con Flat.

source: This is useful to capture some state from a model and to then sample from the model using that state. For example, capturing the mean of a distribution or a value of a deterministic variable.
es: Esto es útil para capturar algún estado de un modelo y luego muestrear del modelo utilizando ese estado. Por ejemplo, capturando la media de una distribución o un valor de una variable determinista.

source: See :class:`pymc_marketing.mmm.hsgp.SoftPlusHSGP` for an example of how this is used to keep a variable centered around 1.0 during sampling but stay continuous with new values.
es: Vea :class:`pymc_marketing.mmm.hsgp.SoftPlusHSGP` para un ejemplo de cómo se utiliza esto para mantener una variable centrada alrededor de 1.0 durante el muestreo, pero que permanezca continua con nuevos valores.

source: Parameters
es: Parámetros

source: **model** : :obj:`pm.Model`
es: **modelo** : :obj:`pm.Model`

source: PyMC model to be transformed
es: Modelo PyMC a ser transformado

source: **names** : :class:`python:list`\[:class:`python:str`]
es: **nombres** : :class:`python:list`\[:class:`python:str`]

source: Names of the deterministic variables to be replaced by flat
es: Nombres de las variables deterministas que serán reemplazadas por flat

source: Returns
es: Devoluciones

source: **new_model** : :obj:`pm.Model`
es: **nuevo_modelo** : :obj:`pm.Model`

source: New model with all priors replaced by flat priors
es: Nuevo modelo con todos los priors reemplazados por priors planos

source: Examples
es: Ejemplos

source: Replace single Deterministic with Flat and sample as if it were zeros.
es: Reemplace Determinista único por Plano y muestree como si fueran ceros.
