Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.special_priors.LogNormalPrior.po
Languages: es

source: Lognormal prior parameterized by positive-scale mean and std.
es: Parámetro lognormal priorizado por la media y la desviación estándar de escala positiva.

source: A lognormal prior parameterized by mean and standard deviation on the positive domain, with optional centered or non-centered parameterization.
es: Un prior lognormal parametrizado por la media y la desviación estándar en el dominio positivo, con parametrización opcional centrada o no centrada.

source: This prior differs from the standard ``LogNormal`` distribution, which takes log-scale parameters (``mu_log``, ``sigma_log``). Instead, it is parameterized directly in terms of the mean and standard deviation (``mean``, ``std``) on the positive scale, making it more intuitive and suitable for hierarchical modeling.
es: Este prior difiere de la distribución estándar ``LogNormal``, que utiliza parámetros en escala logarítmica (``mu_log``, ``sigma_log``). En cambio, está parametrizado directamente en términos de la media y la desviación estándar (``mean``, ``std``) en la escala positiva, lo que lo hace más intuitivo y adecuado para el modelado jerárquico.

source: To achieve this, the lognormal parameters are computed internally from the positive-domain parameters:
es: Para lograr esto, los parámetros lognormales se calculan internamente a partir de los parámetros del dominio positivo:

source: where :math:`\\mean > 0` and :math:`\\std > 0`.
es: donde :math:`\\mean > 0` y :math:`\\std > 0`.

source: The prior is then defined as:
es: El anterior se define entonces como:

source: This construction ensures that the resulting random variable has approximately the intended mean and variance on the positive scale, even when :math:`\\mean` and :math:`\\std` are themselves random variables.
es: Esta construcción asegura que la variable aleatoria resultante tenga aproximadamente la media y la varianza deseadas en la escala positiva, incluso cuando :math:`\\mean` y :math:`\\std` son en sí mismas variables aleatorias.

source: Parameters
es: Parámetros

source: **mean** : :obj:`Prior`, :class:`python:float`, :class:`python:int`, :term:`numpy:array_like`
es: **media** : :obj:`Prior`, :class:`python:float`, :class:`python:int`, :term:`numpy:array_like`

source: Prior, python:float, python:int, numpy:array_like
es: Previo, python:float, python:int, numpy:array_like

source: The mean of the distribution on the positive scale.
es: La media de la distribución en la escala positiva.

source: The standard deviation of the distribution on the positive scale.
es: La desviación estándar de la distribución en la escala positiva.

source: **dims** : :class:`python:tuple`\[:class:`python:str`, ...], optional
es: **dims** : :class:`python:tuple`\[:class:`python:str`, ...], opcional

source: python:tuple[python:str, ...], optional
es: python:tuple[python:str, ...], opcional

source: The dimensions of the distribution, by default None.
es: Las dimensiones de la distribución, por defecto None.

source: **centered** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **centrado** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to use the centered parameterization, by default True.
es: Si se debe utilizar la parametrización centrada, por defecto Verdadero.

source: References
es: Referencias

source: Saunders, *A positive constrained non-centered prior that sparks joy*.
es: Saunders, *Un prior no centrado positivo con restricciones que genera alegría*.

source: Wikipedia, *Log-normal distribution — Definitions*.
es: Wikipedia, *Distribución log-normal — Definiciones*.

source: Examples
es: Ejemplos

source: Build a non-centered hierarchical model where information is shared across groups:
es: Construya un modelo jerárquico no centrado donde la información se comparta entre grupos:

source: Methods
es: Métodos

source: :py:obj:`LogNormalPrior.__init__ <pymc_marketing.special_priors.LogNormalPrior.__init__>`\ \(\[dims\, centered\]\)
es: :py:obj:`LogNormalPrior.__init__ <pymc_marketing.special_priors.LogNormalPrior.__init__>`\ \(\[dims\, centrado\]\)

source: :py:obj:`LogNormalPrior.create_variable <pymc_marketing.special_priors.LogNormalPrior.create_variable>`\ \(name\)
es: :py:obj:`LogNormalPrior.create_variable <pymc_marketing.special_priors.LogNormalPrior.create_variable>`\ \(nombre\)

source: Create a variable from the prior distribution.
es: Cree una variable a partir de la distribución anterior.

source: :py:obj:`LogNormalPrior.from_dict <pymc_marketing.special_priors.LogNormalPrior.from_dict>`\ \(data\)
es: :py:obj:`LogNormalPrior.from_dict <pymc_marketing.special_priors.LogNormalPrior.from_dict>`\ \(datos\)

source: Create a LogNormalPrior prior from a dictionary.
es: Cree un LogNormalPrior a partir de un diccionario.

source: Sample from the prior distribution.
es: Muestra de la distribución previa.

source: Convert the prior distribution to a dictionary.
es: Convierte la distribución previa a un diccionario.
