Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.weibull_adstock.po
Languages: es

source: Weibull Adstocking Transformation.
es: Transformación de Adstock Weibull.

source: This transformation is similar to geometric adstock transformation but has more degrees of freedom, adding more flexibility.
es: Esta transformación es similar a la transformación adstock geométrica, pero tiene más grados de libertad, lo que añade más flexibilidad.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-weibull_adstock-1.pdf>`)

source: Parameters
es: Parámetros

source: Input tensor.
es: Tensor de entrada.

source: **lam** : :class:`python:float`, :obj:`by` default 1.
es: **lam** : :class:`python:float`, :obj:`by` por defecto 1.

source: python:float, by default 1.
es: python:float, por defecto 1.

source: Scale parameter of the Weibull distribution. Must be positive.
es: Parámetro de escala de la distribución de Weibull. Debe ser positivo.

source: **k** : :class:`python:float`, :obj:`by` default 1.
es: **k** : :class:`python:float`, :obj:`by` por defecto 1.

source: Shape parameter of the Weibull distribution. Must be positive.
es: Parámetro de forma de la distribución de Weibull. Debe ser positivo.

source: **l_max** : :class:`python:int`, :obj:`by` default 12
es: **l_max** : :class:`python:int`, :obj:`por` defecto 12

source: python:int, by default 12
es: python:int, por defecto 12

source: Maximum duration of carryover effect.
es: Duración máxima del efecto de arrastre.

source: **axis** : :class:`python:int`
es: **eje** : :class:`python:int`

source: The axis of ``x`` along witch to apply the convolution
es: El eje de ``x`` a lo largo del cual aplicar la convolución

source: **mode** : :obj:`ConvMode`, optional
es: **modo** : :obj:`ConvMode`, opcional

source: ConvMode, optional
es: ConvMode, opcional

source: The convolution mode determines how the convolution is applied at the boundaries of the input signal, denoted as "x." The default mode is ConvMode.After.
es: El modo de convolución determina cómo se aplica la convolución en los límites de la señal de entrada, denotada como "x." El modo predeterminado es ConvMode.After.

source: ConvMode.After: Applies the convolution with the "Adstock" effect, resulting in a trailing decay effect.
es: ConvMode.After: Aplica la convolución con el efecto "Adstock", resultando en un efecto de decaimiento en el tiempo.

source: ConvMode.Before: Applies the convolution with the "Excitement" effect, creating a leading effect
es: ConvMode.Before: Aplica la convolución con el efecto "Excitement", creando un efecto de anticipación

source: similar to the wow factor.
es: similar al factor wow.

source: ConvMode.Overlap: Applies the convolution with both "Pull-Forward" and "Pull-Backward" effects,
es: ConvMode.Overlap: Aplica la convolución con efectos de "Pull-Forward" y "Pull-Backward",

source: where the effect overlaps with both preceding and succeeding elements.
es: donde el efecto se superpone con los elementos precedentes y sucesivos.

source: **type** : :obj:`WeibullType` or :class:`python:str`, :obj:`by` default :obj:`WeibullType.PDF`
es: **tipo** : :obj:`WeibullType` o :class:`python:str`, :obj:`por` defecto :obj:`WeibullType.PDF`

source: WeibullType or python:str, by default WeibullType.PDF
es: WeibullType o python:str, por defecto WeibullType.PDF

source: Type of Weibull adstock transformation to be applied (PDF or CDF).
es: Tipo de transformación de adstock de Weibull que se aplicará (PDF o CDF).

source: **normalize** : :ref:`bool <python:bltin-boolean-values>`, :obj:`by` default :data:`python:False`
es: **normalizar** : :ref:`bool <python:bltin-boolean-values>`, :obj:`por` defecto :data:`python:False`

source: bool, by default python:False
es: bool, por defecto python:False

source: Whether to normalize the weights.
es: Si se deben normalizar los pesos.

source: Returns
es: Devoluciones

source: Transformed tensor based on Weibull adstock transformation.
es: Tensor transformado basado en la transformación de adstock de Weibull.
