Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.autolog.po
Languages: es

source: Autologging support for PyMC models and PyMC-Marketing models.
es: Soporte de autolog para modelos PyMC y modelos PyMC-Marketing.

source: Includes logging of sampler diagnostics, model information, data used in the model, and InferenceData objects upon sampling the models.
es: Incluye el registro de diagnósticos del muestreador, información del modelo, datos utilizados en el modelo y objetos InferenceData al muestrear los modelos.

source: For more information about MLflow, see https://mlflow.org/docs/latest/python_api/mlflow.html
es: Para más información sobre MLflow, consulte https://mlflow.org/docs/latest/python_api/mlflow.html

source: Parameters
es: Parámetros

source: **log_sampler_info** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **log_sampler_info** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to log sampler diagnostics. Default is True.
es: Si se deben registrar los diagnósticos del muestreador. El valor predeterminado es True.

source: **log_metadata_info** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **log_metadata_info** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to log the metadata of inputs used in the model. Default is True.
es: Si se debe registrar los metadatos de las entradas utilizadas en el modelo. El valor predeterminado es True.

source: **log_model_info** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **log_model_info** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to log model information. Default is True.
es: Si se debe registrar información del modelo. El valor predeterminado es True.

source: **sample_error_file** : :class:`python:str`, optional
es: **sample_error_file** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The name of the file to log the error if an error occurs during sampling. If None, the error will not be logged. Default is "sample-error.txt".
es: El nombre del archivo para registrar el error si ocurre un error durante el muestreo. Si es None, el error no será registrado. El valor predeterminado es "sample-error.txt".

source: **summary_var_names** : :class:`python:list`\[:class:`python:str`], optional
es: **summary_var_names** : :class:`python:list`\[:class:`python:str`], opcional

source: python:list[python:str], optional
es: python:list[python:str], opcional

source: The names of the variables to include in the ArviZ summary. Default is all the variables in the InferenceData object.
es: Los nombres de las variables que se incluirán en el resumen de ArviZ. El valor predeterminado son todas las variables en el objeto InferenceData.

source: **arviz_summary_kwargs** : :class:`python:dict`, optional
es: **arviz_summary_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Additional keyword arguments to pass to `az.summary`.
es: Argumentos adicionales de palabras clave para pasar a `az.summary`.

source: **log_mmm** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **log_mmm** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to log PyMC-Marketing MMM models. Default is True.
es: Si se debe registrar los modelos MMM de PyMC-Marketing. El valor predeterminado es True.

source: **log_clv** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **log_clv** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to log PyMC-Marketing CLV models. Default is True.
es: Si se deben registrar los modelos CLV de PyMC-Marketing. El valor predeterminado es True.

source: **disable** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **desactivar** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to disable autologging. Default is False.
es: Si deshabilitar el registro automático. El valor predeterminado es False.

source: **silent** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **silencioso** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to suppress all warnings. Default is False.
es: Si suprimir todas las advertencias. El valor predeterminado es False.

source: Examples
es: Ejemplos

source: Autologging for a PyMC model:
es: Autologging para un modelo de PyMC:

source: Autologging for a PyMC-Marketing MMM:
es: Autologging para un MMM de PyMC-Marketing:

source: Autologging for a PyMC-Marketing CLV model:
es: Autologging para un modelo CLV de PyMC-Marketing:
