Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.media_transformation.MediaConfigList.po
Languages: es

source: Wrapper for a list of media configurations to apply to media data.
es: Envoltura para una lista de configuraciones de medios que se aplicarán a los datos de medios.

source: Parameters
es: Parámetros

source: The media configurations to apply to the media data.
es: Las configuraciones de medios que se aplicarán a los datos de medios.

source: Examples
es: Ejemplos

source: Different order of media transformations for online and offline media channels:
es: Diferente orden de transformaciones de medios para canales de medios en línea y fuera de línea:

source: Methods
es: Métodos

source: :py:obj:`MediaConfigList.from_dict <pymc_marketing.mmm.media_transformation.MediaConfigList.from_dict>`\ \(data\)
es: :py:obj:`MediaConfigList.from_dict <pymc_marketing.mmm.media_transformation.MediaConfigList.from_dict>`\ \(datos\)

source: Create a media configuration list from a dictionary.
es: Cree una lista de configuración de medios a partir de un diccionario.

source: :py:obj:`MediaConfigList.to_dict <pymc_marketing.mmm.media_transformation.MediaConfigList.to_dict>`\ \(\)
es: msgid: :py:obj:`MediaConfigList.to_dict <pymc_marketing.mmm.media_transformation.MediaConfigList.to_dict>`\ \(\) msgstr: :py:obj:`MediaConfigList.to_dict <pymc_marketing.mmm.media_transformation.MediaConfigList.to_dict>`\ \(\)

source: Convert the media configuration list to a dictionary.
es: Convierte la lista de configuración de medios en un diccionario.

source: Attributes
es: Atributos

source: Get the media values from the media configurations.
es: Obtenga los valores de los medios de las configuraciones de medios.
