Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.conditional_value_at_risk.po
Languages: es

source: conditional\_value\_at\_risk
es: valor\_condicional\_en\_riesgo

source: Calculate the Conditional Value at Risk (CVaR) at a specified confidence level.
es: Calcule el Valor en Riesgo Condicional (CVaR) a un nivel de confianza especificado.

source: CVaR, also known as Expected Shortfall, measures the average loss exceeding the VaR at a given confidence level, providing insight into the tail risk of the distribution.
es: CVaR, también conocido como Pérdida Esperada, mide la pérdida promedio que excede el VaR a un nivel de confianza dado, proporcionando información sobre el riesgo de cola de la distribución.

source: The Conditional Value at Risk (CVaR) is calculated as:
es: El Valor en Riesgo Condicional (CVaR) se calcula como:

source: where :math:`X` represents the loss distribution, and :math:`VaR` is the Value at Risk at the specified confidence level. CVaR provides a more comprehensive view of the risk associated with extreme losses beyond the VaR.
es: donde :math:`X` representa la distribución de pérdidas, y :math:`VaR` es el Valor en Riesgo en el nivel de confianza especificado. CVaR proporciona una visión más completa del riesgo asociado con pérdidas extremas más allá del VaR.

source: Parameters
es: Parámetros

source: **confidence_level** : :class:`python:float`, optional
es: **nivel_de_confianza** : :class:`python:float`, opcional

source: python:float, optional
es: python:flotante, opcional

source: Confidence level for CVaR (default is 0.95). Confidence level must be between 0 and 1.
es: Nivel de confianza para CVaR (el valor predeterminado es 0.95). El nivel de confianza debe estar entre 0 y 1.

source: Returns
es: Devoluciones

source: A function that calculates the CVaR value at the specified confidence level given samples and budgets.
es: Una función que calcula el valor de CVaR en el nivel de confianza especificado dado muestras y presupuestos.

source: Raises
es: Aumentos

source: If confidence_level is not between 0 and 1. If no samples fall below the VaR threshold.
es: Si el nivel_de_confianza no está entre 0 y 1. Si no hay muestras que caigan por debajo del umbral de VaR.

source: References
es: Referencias

source: Rockafellar, R.T., & Uryasev, S. (2000). Optimization of Conditional Value-at-Risk.
es: Rockafellar, R.T., y Uryasev, S. (2000). Optimización del Valor en Riesgo Condicional.
