Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.components.saturation.MichaelisMentenSaturation.po
Languages: es

source: MichaelisMentenSaturation
es: Saturación de Michaelis-Menten

source: Wrapper around Michaelis-Menten saturation function.
es: Envoltorio alrededor de la función de saturación de Michaelis-Menten.

source: For more information, see :func:`pymc_marketing.mmm.transformers.michaelis_menten`.
es: Para más información, consulte :func:`pymc_marketing.mmm.transformers.michaelis_menten`.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-MichaelisMentenSaturation-1.pdf>`)

source: Methods
es: Métodos

source: Call within a model context.
es: Llamar dentro de un contexto de modelo.

source: Michaelis-Menten saturation function.
es: Función de saturación de Michaelis-Menten.

source: :py:obj:`MichaelisMentenSaturation.plot_curve <pymc_marketing.mmm.components.saturation.MichaelisMentenSaturation.plot_curve>`\ \(curve\)
es: :py:obj:`MichaelisMentenSaturation.plot_curve <pymc_marketing.mmm.components.saturation.MichaelisMentenSaturation.plot_curve>`\ \(curva\)

source: Plot curve HDI and samples.
es: Trazar la curva del IDH y las muestras.

source: :py:obj:`MichaelisMentenSaturation.plot_curve_hdi <pymc_marketing.mmm.components.saturation.MichaelisMentenSaturation.plot_curve_hdi>`\ \(curve\)
es: :py:obj:`MichaelisMentenSaturation.plot_curve_hdi <pymc_marketing.mmm.components.saturation.MichaelisMentenSaturation.plot_curve_hdi>`\ \(curva\)

source: Plot the HDI of the curve.
es: Trace el IDH de la curva.

source: :py:obj:`MichaelisMentenSaturation.plot_curve_samples <pymc_marketing.mmm.components.saturation.MichaelisMentenSaturation.plot_curve_samples>`\ \(curve\)
es: :py:obj:`MichaelisMentenSaturation.plot_curve_samples <pymc_marketing.mmm.components.saturation.MichaelisMentenSaturation.plot_curve_samples>`\ \(curva\)

source: Plot samples from the curve.
es: Trazar muestras de la curva.

source: Sample the curve of the saturation transformation given parameters.
es: Muestre la curva de la transformación de saturación dadas las parámetros.

source: Sample the priors for the transformation.
es: Muestre las distribuciones a priori para la transformación.

source: Set the dims for all priors.
es: Establezca las dimensiones para todos los antecedentes.

source: Convert the transformation to a dictionary.
es: Convierte la transformación a un diccionario.

source: Update the priors for a function after initialization.
es: Actualice los priors para una función después de la inicialización.

source: Attributes
es: Atributos

source: Get the combined dims for all the parameters.
es: Obtenga las dimensiones combinadas para todos los parámetros.

source: Get the priors for the function.
es: Obtenga los priors para la función.

source: Mapping from variable name to prior for the model.
es: Mapeo del nombre de la variable a la prior para el modelo.

source: Mapping from parameter name to variable name in the model.
es: Mapeo del nombre del parámetro al nombre de la variable en el modelo.
