Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.plot.po
Languages: es

source: plot
es: trama

source: Plot distributions stored in xarray.DataArray across coordinates.
es: Trazar distribuciones almacenadas en xarray.DataArray a través de coordenadas.

source: Used to plot the prior and posterior of the various MMM components.
es: Utilizado para trazar el anterior y el posterior de los diversos componentes de MMM.

source: See the :func:`plot_curve` function for more information.
es: Consulte la función :func:`plot_curve` para obtener más información.

source: Functions
es: Funciones

source: :py:obj:`create_legend_handles <pymc_marketing.plot.create_legend_handles>`\ \(colors\[\, alpha\, line\, ...\]\)
es: :py:obj:`create_legend_handles <pymc_marketing.plot.create_legend_handles>`\ \(colores\[\, alfa\, línea\, ...\]\)

source: Create the legend handles for the given colors.
es: Cree los controladores de leyenda para los colores dados.

source: :py:obj:`drop_scalar_coords <pymc_marketing.plot.drop_scalar_coords>`\ \(curve\)
es: :py:obj:`drop_scalar_coords <pymc_marketing.plot.drop_scalar_coords>`\ \(curva\)

source: Remove scalar coordinates from an xarray DataArray.
es: Eliminar coordenadas escalares de un DataArray de xarray.

source: :py:obj:`generate_colors <pymc_marketing.plot.generate_colors>`\ \(n\[\, start\]\)
es: :py:obj:`generate_colors <pymc_marketing.plot.generate_colors>`\ \(n\[\, inicio\]\)

source: Generate list of colors.
es: Generar lista de colores.

source: Get the plot coordinates.
es: Obtenga las coordenadas del gráfico.

source: Get the total size of the coordinates.
es: Obtenga el tamaño total de las coordenadas.

source: :py:obj:`plot_curve <pymc_marketing.plot.plot_curve>`\ \(curve\, non\_grid\_names\[\, ...\]\)
es: :py:obj:`plot_curve <pymc_marketing.plot.plot_curve>`\ \(curva\, nombres\_no\_de\_rejilla\[\, ...\]\)

source: Plot HDI with samples of the curve across coords.
es: Trazar el IDH con muestras de la curva a través de las coordenadas.

source: :py:obj:`plot_hdi <pymc_marketing.plot.plot_hdi>`\ \(curve\, non\_grid\_names\[\, hdi\_prob\, ...\]\)
es: :py:obj:`plot_hdi <pymc_marketing.plot.plot_hdi>`\ \(curva\, nombres\_no\_de\_rejilla\[\, hdi\_prob\, ...\]\)

source: Plot hdi of the curve across coords.
es: Trazar el hdi de la curva a través de las coordenadas.

source: :py:obj:`plot_samples <pymc_marketing.plot.plot_samples>`\ \(curve\, non\_grid\_names\[\, n\, ...\]\)
es: :py:obj:`plot_samples <pymc_marketing.plot.plot_samples>`\ \(curva\, non\_grid\_names\[\, n\, ...\]\)

source: Plot n samples of the curve across coords.
es: Trazar n muestras de la curva a través de coords.

source: Generate random samples from the chains and draws.
es: Generar muestras aleatorias de las cadenas y extracciones.

source: Create generator of selections.
es: Crear generador de selecciones.

source: Set the defaults for the subplot kwargs.
es: Establezca los valores predeterminados para los argumentos de la subgráfica.
