Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.distributions.po
Languages: es

source: distributions
es: distribuciones

source: Distributions for the CLV module.
es: Distribuciones para el módulo CLV.

source: Classes
es: Clases

source: :py:obj:`BetaGeoBetaBinom <pymc_marketing.clv.distributions.BetaGeoBetaBinom>`\ \(name\, \*args\, \*\*kwargs\)
es: :py:obj:`BetaGeoBetaBinom <pymc_marketing.clv.distributions.BetaGeoBetaBinom>`\ \(nombre\, \*args\, \*\*kwargs\)

source: Population-level distribution class for a discrete, non-contractual, Beta-Geometric/Beta-Binomial process.
es: Clase de distribución a nivel poblacional para un proceso discreto, no contractual, Beta-Geométrico/Beta-Binomial.

source: :py:obj:`BetaGeoNBD <pymc_marketing.clv.distributions.BetaGeoNBD>`\ \(name\, \*args\[\, rng\, dims\, ...\]\)
es: :py:obj:`BetaGeoNBD <pymc_marketing.clv.distributions.BetaGeoNBD>`\ \(nombre\, \*args\[\, rng\, dims\, ...\]\)

source: Population-level distribution class for a discrete, non-contractual, Beta-Geometric/Negative-Binomial process.
es: Clase de distribución a nivel poblacional para un proceso discreto, no contractual, Beta-Geométrico/Binomial Negativo.

source: :py:obj:`ContContract <pymc_marketing.clv.distributions.ContContract>`\ \(name\, \*args\[\, rng\, dims\, ...\]\)
es: :py:obj:`ContContract <pymc_marketing.clv.distributions.ContContract>`\ \(nombre\, \*args\[\, rng\, dims\, ...\]\)

source: Distribution class of a continuous contractual data-generating process.
es: Clase de distribución de un proceso continuo de generación de datos contractuales.

source: :py:obj:`ContNonContract <pymc_marketing.clv.distributions.ContNonContract>`\ \(name\, \*args\[\, rng\, dims\, ...\]\)
es: :py:obj:`ContNonContract <pymc_marketing.clv.distributions.ContNonContract>`\ \(nombre\, \*args\[\, rng\, dims\, ...\]\)

source: Individual-level model for the customer lifetime value.
es: Modelo a nivel individual para el valor del tiempo de vida del cliente.

source: :py:obj:`ModifiedBetaGeoNBD <pymc_marketing.clv.distributions.ModifiedBetaGeoNBD>`\ \(name\, \*args\[\, rng\, dims\, ...\]\)
es: :py:obj:`ModifiedBetaGeoNBD <pymc_marketing.clv.distributions.ModifiedBetaGeoNBD>`\ \(nombre\, \*args\[\, rng\, dims\, ...\]\)

source: Population-level distribution for a discrete, non-contractual Modified-Beta-Geometric/Negative-Binomial process.
es: Distribución a nivel poblacional para un proceso discreto, no contractual, Modificado-Beta-Geométrico/Binomial-Negativo.

source: :py:obj:`ParetoNBD <pymc_marketing.clv.distributions.ParetoNBD>`\ \(name\, \*args\[\, rng\, dims\, initval\, ...\]\)
es: :py:obj:`ParetoNBD <pymc_marketing.clv.distributions.ParetoNBD>`\ \(nombre\, \*args\[\, rng\, dims\, initval\, ...\]\)

source: Population-level distribution class for a continuous, non-contractual, Pareto/NBD process.
es: Clase de distribución a nivel poblacional para un proceso continuo, no contractual, Pareto/NBD.

source: Shifted Beta-Geometric distribution.
es: { "singular": "Distribución Beta-Geométrica Desplazada.", "plural": "Distribuciones Beta-Geométricas Desplazadas." }
