Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.hsgp_kwargs.HSGPKwargs.po
Languages: es

source: HSGP keyword arguments for the time-varying prior.
es: Argumentos clave HSGP para el prior variable en el tiempo.

source: See [R011749b1059b-1]_ and [R011749b1059b-2]_ for the theoretical background on the Hilbert Space Gaussian Process (HSGP). See , [R011749b1059b-6]_ for a practical guide through the method using code examples. See the :class:`~pymc.gp.HSGP` class for more information on the Hilbert Space Gaussian Process in PyMC. We also recommend the following resources for a more practical introduction to HSGP: [R011749b1059b-3]_, [R011749b1059b-4]_, [R011749b1059b-5]_.
es: Vea [R011749b1059b-1]_ y [R011749b1059b-2]_ para el contexto teórico sobre el Proceso Gaussiano en Espacio de Hilbert (HSGP). Vea, [R011749b1059b-6]_ para una guía práctica del método utilizando ejemplos de código. Consulte la clase :class:`~pymc.gp.HSGP` para obtener más información sobre el Proceso Gaussiano en Espacio de Hilbert en PyMC. También recomendamos los siguientes recursos para una introducción más práctica al HSGP: [R011749b1059b-3]_, [R011749b1059b-4]_, [R011749b1059b-5]_.

source: Parameters
es: Parámetros

source: Number of basis functions. Default is 200.
es: Número de funciones base. El valor predeterminado es 200.

source: **L** : :class:`python:float`, optional
es: **L** : :class:`python:float`, opcional

source: python:float, optional
es: python:flotante, opcional

source: Extent of basis functions. Set this to reflect the expected range of in+out-of-sample data (considering that time-indices are zero-centered).Default is `X_mid * 2` (identical to `c=2` in HSGP). By default it is None.
es: Extensión de las funciones base. Establezca esto para reflejar el rango esperado de datos dentro y fuera de la muestra (considerando que los índices de tiempo están centrados en cero). El valor predeterminado es `X_mid * 2` (idéntico a `c=2` en HSGP). Por defecto, es None.

source: Exponential prior for the variance. Default is 1.
es: Prior exponencial para la varianza. El valor predeterminado es 1.

source: Mean of the inverse gamma prior for the lengthscale. Default is 5.
es: Media de la prior gamma inversa para la escala de longitud. El valor predeterminado es 5.

source: Standard deviation of the inverse gamma prior for the lengthscale. Default is 5.
es: Desviación estándar de la prior gamma inversa para la escala de longitud. El valor predeterminado es 5.

source: **cov_func** : :obj:`~pymc.gp.cov.Covariance`, optional
es: **cov_func** : :obj:`~pymc.gp.cov.Covariance`, opcional

source: Covariance, optional
es: Covarianza, opcional

source: Gaussian process Covariance function. By default it is None.
es: Función de covarianza del proceso gaussiano. Por defecto, es None.

source: References
es: Referencias

source: Solin, A., Sarkka, S. (2019) Hilbert Space Methods for Reduced-Rank Gaussian Process Regression.
es: Solin, A., Sarkka, S. (2019) Métodos de Espacio de Hilbert para la Regresión de Procesos Gaussianos de Rango Reducido.

source: Ruitort-Mayol, G., and Anderson, M., and Solin, A., and Vehtari, A. (2022). Practical Hilbert Space Approximate Bayesian Gaussian Processes for Probabilistic Programming.
es: Ruitort-Mayol, G., Anderson, M., Solin, A., y Vehtari, A. (2022). Procesos Gaussianos Bayesianos Aproximados en Espacios de Hilbert Prácticos para Programación Probabilística.

source: PyMC Example Gallery: `"Gaussian Processes: HSGP Reference & First Steps" <https://www.pymc.io/projects/examples/en/latest/gaussian_processes/HSGP-Basic.html>`_.
es: Galería de Ejemplos de PyMC: `"Procesos Gaussianos: Referencia HSGP y Primeros Pasos" <https://www.pymc.io/projects/examples/en/latest/gaussian_processes/HSGP-Basic.html>`_.

source: PyMC Example Gallery: `"Gaussian Processes: HSGP Advanced Usage" <https://www.pymc.io/projects/examples/en/latest/gaussian_processes/HSGP-Advanced.html>`_.
es: Galería de Ejemplos de PyMC: `"Procesos Gaussianos: Uso Avanzado de HSGP" <https://www.pymc.io/projects/examples/en/latest/gaussian_processes/HSGP-Advanced.html>`_.

source: PyMC Example Gallery: `"Baby Births Modelling with HSGPs" <https://www.pymc.io/projects/examples/en/latest/gaussian_processes/GP-Births.html>`_.
es: Galería de Ejemplos de PyMC: `"Modelado de Nacimientos de Bebés con HSGPs" <https://www.pymc.io/projects/examples/en/latest/gaussian_processes/GP-Births.html>`_.

source: Orduz, J. `"A Conceptual and Practical Introduction to Hilbert Space GPs Approximation Methods" <https://juanitorduz.github.io/hsgp_intro/>`_.
es: Orduz, J. `"Una introducción conceptual y práctica a los métodos de aproximación de GP en espacios de Hilbert" <https://juanitorduz.github.io/hsgp_intro/>`_.

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabras clave.

source: :py:obj:`HSGPKwargs.copy <pymc_marketing.hsgp_kwargs.HSGPKwargs.copy>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPKwargs.copy <pymc_marketing.hsgp_kwargs.HSGPKwargs.copy>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`HSGPKwargs.dict <pymc_marketing.hsgp_kwargs.HSGPKwargs.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPKwargs.dict <pymc_marketing.hsgp_kwargs.HSGPKwargs.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: :py:obj:`HSGPKwargs.json <pymc_marketing.hsgp_kwargs.HSGPKwargs.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPKwargs.json <pymc_marketing.hsgp_kwargs.HSGPKwargs.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`HSGPKwargs.model_copy <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`HSGPKwargs.model_copy <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`HSGPKwargs.model_dump <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_dump>`\ \(\*\[\, mode\, include\, ...\]\)
es: :py:obj:`HSGPKwargs.model_dump <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_dump>`\ \(\*\[\, modo\, incluir\, ...\]\)

source: :py:obj:`HSGPKwargs.model_json_schema <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`HSGPKwargs.model_json_schema <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`HSGPKwargs.model_rebuild <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`HSGPKwargs.model_rebuild <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_rebuild>`\ \(\*\[\, fuerza\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: :py:obj:`HSGPKwargs.model_validate <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_validate>`\ \(obj\, \*\[\, strict\, ...\]\)
es: :py:obj:`HSGPKwargs.model_validate <pymc_marketing.hsgp_kwargs.HSGPKwargs.model_validate>`\ \(obj\, \*\[\, estricto\, ...\]\)

source: Validate a pydantic model instance.
es: Valide una instancia de modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: :py:obj:`HSGPKwargs.parse_file <pymc_marketing.hsgp_kwargs.HSGPKwargs.parse_file>`\ \(path\, \*\[\, ...\]\)
es: :py:obj:`HSGPKwargs.parse_file <pymc_marketing.hsgp_kwargs.HSGPKwargs.parse_file>`\ \(ruta\, \*\[\, ...\]\)

source: :py:obj:`HSGPKwargs.parse_raw <pymc_marketing.hsgp_kwargs.HSGPKwargs.parse_raw>`\ \(b\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`HSGPKwargs.parse_raw <pymc_marketing.hsgp_kwargs.HSGPKwargs.parse_raw>`\ \(b\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: :py:obj:`HSGPKwargs.schema <pymc_marketing.hsgp_kwargs.HSGPKwargs.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`HSGPKwargs.schema <pymc_marketing.hsgp_kwargs.HSGPKwargs.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`HSGPKwargs.validate <pymc_marketing.hsgp_kwargs.HSGPKwargs.validate>`\ \(value\)
es: :py:obj:`HSGPKwargs.validate <pymc_marketing.hsgp_kwargs.HSGPKwargs.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.
