Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.WeibullType.po
Languages: es

source: Weibull type for the Weibull adstock.
es: Tipo Weibull para el adstock Weibull.

source: Methods
es: Métodos

source: :py:obj:`WeibullType.encode <pymc_marketing.mmm.transformers.WeibullType.encode>`\ \(\/\[\, encoding\, errors\]\)
es: :py:obj:`WeibullType.encode <pymc_marketing.mmm.transformers.WeibullType.encode>`\ \(\/\[\, errores de codificación\]\)

source: Encode the string using the codec registered for encoding.
es: Codifique la cadena utilizando el códec registrado para la codificación.

source: :py:obj:`WeibullType.replace <pymc_marketing.mmm.transformers.WeibullType.replace>`\ \(old\, new\[\, count\]\)
es: :py:obj:`WeibullType.replace <pymc_marketing.mmm.transformers.WeibullType.replace>`\ \(antiguo\, nuevo\[\, conteo\]\)

source: Return a copy with all occurrences of substring old replaced by new.
es: Devuelve una copia con todas las ocurrencias de la subcadena old reemplazadas por new.

source: Return a list of the substrings in the string, using sep as the separator string.
es: Devuelve una lista de las subcadenas en la cadena, utilizando sep como la cadena separadora.

source: Concatenate any number of strings.
es: Concatenar cualquier número de cadenas.

source: Return a capitalized version of the string.
es: Devuelve una versión en mayúsculas de la cadena.

source: Return a version of the string suitable for caseless comparisons.
es: Devuelve una versión de la cadena adecuada para comparaciones sin distinción de mayúsculas y minúsculas.

source: Return a version of the string where each word is titlecased.
es: Devuelve una versión de la cadena donde cada palabra está en mayúsculas.

source: :py:obj:`WeibullType.center <pymc_marketing.mmm.transformers.WeibullType.center>`\ \(width\[\, fillchar\]\)
es: :py:obj:`WeibullType.center <pymc_marketing.mmm.transformers.WeibullType.center>`\ \(ancho\[\, caracter_de_relleno\]\)

source: Return a centered string of length width.
es: Devuelve una cadena centrada de longitud width.

source: Return the number of non-overlapping occurrences of substring sub in string S[start:end].
es: Devuelve el número de ocurrencias no superpuestas de la subcadena sub en la cadena S[start:end].

source: Return a copy where all tab characters are expanded using spaces.
es: Devuelva una copia donde todos los caracteres de tabulación se expandan utilizando espacios.

source: Return the lowest index in S where substring sub is found, such that sub is contained within S[start:end].
es: Devuelve el índice más bajo en S donde se encuentra la subcadena sub, de modo que sub esté contenida dentro de S[start:end].

source: Partition the string into three parts using the given separator.
es: Particione la cadena en tres partes utilizando el separador dado.

source: :py:obj:`WeibullType.ljust <pymc_marketing.mmm.transformers.WeibullType.ljust>`\ \(width\[\, fillchar\]\)
es: :py:obj:`WeibullType.ljust <pymc_marketing.mmm.transformers.WeibullType.ljust>`\ \(ancho\[\, caracter_de_relleno\]\)

source: Return a left-justified string of length width.
es: Devuelve una cadena alineada a la izquierda de longitud width.

source: Return a copy of the string converted to lowercase.
es: Devuelve una copia de la cadena convertida a minúsculas.

source: Return a copy of the string with leading whitespace removed.
es: Devuelve una copia de la cadena con el espacio en blanco inicial eliminado.

source: Return the highest index in S where substring sub is found, such that sub is contained within S[start:end].
es: Devuelve el índice más alto en S donde se encuentra la subcadena sub, de modo que sub esté contenida dentro de S[start:end].

source: :py:obj:`WeibullType.rjust <pymc_marketing.mmm.transformers.WeibullType.rjust>`\ \(width\[\, fillchar\]\)
es: :py:obj:`WeibullType.rjust <pymc_marketing.mmm.transformers.WeibullType.rjust>`\ \(ancho\[\, caracter_de_relleno\]\)

source: Return a right-justified string of length width.
es: Devuelve una cadena alineada a la derecha de longitud width.

source: Return a copy of the string with trailing whitespace removed.
es: Devuelve una copia de la cadena con los espacios en blanco al final eliminados.

source: :py:obj:`WeibullType.splitlines <pymc_marketing.mmm.transformers.WeibullType.splitlines>`\ \(\/\[\, keepends\]\)
es: :py:obj:`WeibullType.splitlines <pymc_marketing.mmm.transformers.WeibullType.splitlines>`\ \(\/\[\, mantenerfinales\]\)

source: Return a list of the lines in the string, breaking at line boundaries.
es: Devuelve una lista de las líneas en la cadena, rompiendo en los límites de línea.

source: Return a copy of the string with leading and trailing whitespace removed.
es: Devuelve una copia de la cadena con los espacios en blanco al principio y al final eliminados.

source: Convert uppercase characters to lowercase and lowercase characters to uppercase.
es: Convierte los caracteres en mayúsculas a minúsculas y los caracteres en minúsculas a mayúsculas.

source: :py:obj:`WeibullType.translate <pymc_marketing.mmm.transformers.WeibullType.translate>`\ \(table\, \/\)
es: :py:obj:`WeibullType.translate <pymc_marketing.mmm.transformers.WeibullType.translate>`\ \(tabla\, \/\)

source: Replace each character in the string using the given translation table.
es: Reemplace cada carácter en la cadena utilizando la tabla de traducción proporcionada.

source: Return a copy of the string converted to uppercase.
es: Devuelve una copia de la cadena convertida a mayúsculas.

source: :py:obj:`WeibullType.startswith <pymc_marketing.mmm.transformers.WeibullType.startswith>`\ \(prefix\[\, start\[\, end\]\]\)
es: :py:obj:`WeibullType.startswith <pymc_marketing.mmm.transformers.WeibullType.startswith>`\ \(prefijo\[\, inicio\[\, fin\]\]\)

source: Return True if S starts with the specified prefix, False otherwise.
es: Devuelve True si S comienza con el prefijo especificado, False en caso contrario.

source: :py:obj:`WeibullType.endswith <pymc_marketing.mmm.transformers.WeibullType.endswith>`\ \(suffix\[\, start\[\, end\]\]\)
es: :py:obj:`WeibullType.endswith <pymc_marketing.mmm.transformers.WeibullType.endswith>`\ \(sufijo\[\, inicio\[\, fin\]\]\)

source: Return True if S ends with the specified suffix, False otherwise.
es: Devuelve True si S termina con el sufijo especificado, False en caso contrario.

source: :py:obj:`WeibullType.removeprefix <pymc_marketing.mmm.transformers.WeibullType.removeprefix>`\ \(prefix\, \/\)
es: :py:obj:`WeibullType.removeprefix <pymc_marketing.mmm.transformers.WeibullType.removeprefix>`\ \(prefijo\, \/\)

source: Return a str with the given prefix string removed if present.
es: Devuelve una cadena con el prefijo dado eliminado si está presente.

source: :py:obj:`WeibullType.removesuffix <pymc_marketing.mmm.transformers.WeibullType.removesuffix>`\ \(suffix\, \/\)
es: :py:obj:`WeibullType.removesuffix <pymc_marketing.mmm.transformers.WeibullType.removesuffix>`\ \(sufijo\, \/\)

source: Return a str with the given suffix string removed if present.
es: Devuelve una cadena con el sufijo dado eliminado si está presente.

source: Return True if all characters in the string are ASCII, False otherwise.
es: Devuelve True si todos los caracteres en la cadena son ASCII, False en caso contrario.

source: Return True if the string is a lowercase string, False otherwise.
es: Devuelve True si la cadena es una cadena en minúsculas, False en caso contrario.

source: Return True if the string is an uppercase string, False otherwise.
es: Devuelve True si la cadena es una cadena en mayúsculas, False en caso contrario.

source: Return True if the string is a title-cased string, False otherwise.
es: Devuelve True si la cadena es una cadena con mayúsculas en el título, False en caso contrario.

source: Return True if the string is a whitespace string, False otherwise.
es: Devuelve True si la cadena es una cadena de espacios en blanco, False en caso contrario.

source: Return True if the string is a decimal string, False otherwise.
es: Devuelve True si la cadena es una cadena decimal, False en caso contrario.

source: Return True if the string is a digit string, False otherwise.
es: Devuelve True si la cadena es una cadena de dígitos, False en caso contrario.

source: Return True if the string is a numeric string, False otherwise.
es: Devuelve True si la cadena es una cadena numérica, False en caso contrario.

source: Return True if the string is an alphabetic string, False otherwise.
es: Devuelve True si la cadena es una cadena alfabética, False en caso contrario.

source: Return True if the string is an alpha-numeric string, False otherwise.
es: Devuelve True si la cadena es una cadena alfanumérica, False en caso contrario.

source: Return True if the string is a valid Python identifier, False otherwise.
es: Devuelve True si la cadena es un identificador válido de Python, False en caso contrario.

source: Return True if all characters in the string are printable, False otherwise.
es: Devuelve True si todos los caracteres en la cadena son imprimibles, False en caso contrario.

source: :py:obj:`WeibullType.zfill <pymc_marketing.mmm.transformers.WeibullType.zfill>`\ \(width\, \/\)
es: :py:obj:`WeibullType.zfill <pymc_marketing.mmm.transformers.WeibullType.zfill>`\ \(ancho\, \/\)

source: Pad a numeric string with zeros on the left, to fill a field of the given width.
es: Rellene una cadena numérica con ceros a la izquierda para completar un campo de la anchura dada.

source: Return a formatted version of S, using substitutions from args and kwargs.
es: Devuelve una versión formateada de S, utilizando sustituciones de args y kwargs.

source: :py:obj:`WeibullType.format_map <pymc_marketing.mmm.transformers.WeibullType.format_map>`\ \(mapping\)
es: :py:obj:`WeibullType.format_map <pymc_marketing.mmm.transformers.WeibullType.format_map>`\ \(mapeo\)

source: Return a formatted version of S, using substitutions from mapping.
es: Devuelve una versión formateada de S, utilizando sustituciones del mapeo.

source: Return a translation table usable for str.translate().
es: Devuelva una tabla de traducción utilizable para str.translate().

source: Attributes
es: Atributos
