Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.fourier.MonthlyFourier.po
Languages: es

source: Monthly fourier seasonality.
es: Estacionalidad mensual de Fourier.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-fourier-MonthlyFourier-1.pdf>`)

source: Number of fourier modes to use.
es: Número de modos de Fourier a utilizar.

source: prefix
es: prefijo

source: str, optional
es: str, opcional

source: Alternative prefix for the fourier seasonality, by default None or "fourier"
es: Prefijo alternativo para la estacionalidad de Fourier, por defecto Ninguno o "fourier"

source: prior
es: anterior

source: Prior | VariableFactory, optional
es: Prior | VariableFactory, opcional

source: Prior distribution or VariableFactory for the fourier seasonality beta parameters, by default `Prior("Laplace", mu=0, b=1)`
es: Distribución previa o VariableFactory para los parámetros beta de la estacionalidad de Fourier, por defecto `Prior("Laplace", mu=0, b=1)`

source: name
es: nombre

source: Name of the variable that multiplies the fourier modes, by default None
es: Nombre de la variable que multiplica los modos de Fourier, por defecto None

source: variable_name
es: nombre_variable

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabra clave.

source: Apply fourier seasonality to day of year.
es: Aplicar estacionalidad de Fourier al día del año.

source: :py:obj:`MonthlyFourier.copy <pymc_marketing.mmm.fourier.MonthlyFourier.copy>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`MonthlyFourier.copy <pymc_marketing.mmm.fourier.MonthlyFourier.copy>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`MonthlyFourier.dict <pymc_marketing.mmm.fourier.MonthlyFourier.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`MonthlyFourier.dict <pymc_marketing.mmm.fourier.MonthlyFourier.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: :py:obj:`MonthlyFourier.from_dict <pymc_marketing.mmm.fourier.MonthlyFourier.from_dict>`\ \(data\)
es: :py:obj:`MonthlyFourier.from_dict <pymc_marketing.mmm.fourier.MonthlyFourier.from_dict>`\ \(datos\)

source: Deserialize the Fourier seasonality.
es: Deserializar la estacionalidad de Fourier.

source: Get the start date for the Fourier curve.
es: Obtenga la fecha de inicio para la curva de Fourier.

source: :py:obj:`MonthlyFourier.json <pymc_marketing.mmm.fourier.MonthlyFourier.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`MonthlyFourier.json <pymc_marketing.mmm.fourier.MonthlyFourier.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`MonthlyFourier.model_copy <pymc_marketing.mmm.fourier.MonthlyFourier.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`MonthlyFourier.model_copy <pymc_marketing.mmm.fourier.MonthlyFourier.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`MonthlyFourier.model_dump <pymc_marketing.mmm.fourier.MonthlyFourier.model_dump>`\ \(\*\[\, mode\, ...\]\)
es: :py:obj:`MonthlyFourier.model_dump <pymc_marketing.mmm.fourier.MonthlyFourier.model_dump>`\ \(\*\[\, modo\, ...\]\)

source: :py:obj:`MonthlyFourier.model_json_schema <pymc_marketing.mmm.fourier.MonthlyFourier.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`MonthlyFourier.model_json_schema <pymc_marketing.mmm.fourier.MonthlyFourier.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: Model post initialization for a Pydantic model.
es: Inicialización del modelo posterior para un modelo Pydantic.

source: :py:obj:`MonthlyFourier.model_rebuild <pymc_marketing.mmm.fourier.MonthlyFourier.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`MonthlyFourier.model_rebuild <pymc_marketing.mmm.fourier.MonthlyFourier.model_rebuild>`\ \(\*\[\, forzar\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: Validate a pydantic model instance.
es: Valide una instancia de modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: :py:obj:`MonthlyFourier.parse_file <pymc_marketing.mmm.fourier.MonthlyFourier.parse_file>`\ \(path\, \*\[\, ...\]\)
es: :py:obj:`MonthlyFourier.parse_file <pymc_marketing.mmm.fourier.MonthlyFourier.parse_file>`\ \(ruta\, \*\[\, ...\]\)

source: :py:obj:`MonthlyFourier.plot_curve <pymc_marketing.mmm.fourier.MonthlyFourier.plot_curve>`\ \(curve\[\, ...\]\)
es: :py:obj:`MonthlyFourier.plot_curve <pymc_marketing.mmm.fourier.MonthlyFourier.plot_curve>`\ \(curva\[\, ...\]\)

source: Plot the seasonality for one full period.
es: Trace la estacionalidad para un período completo.

source: Plot full period of the fourier seasonality.
es: Trazar el período completo de la estacionalidad de Fourier.

source: :py:obj:`MonthlyFourier.plot_curve_samples <pymc_marketing.mmm.fourier.MonthlyFourier.plot_curve_samples>`\ \(curve\[\, ...\]\)
es: :py:obj:`MonthlyFourier.plot_curve_samples <pymc_marketing.mmm.fourier.MonthlyFourier.plot_curve_samples>`\ \(curva\[\, ...\]\)

source: Plot samples from the curve.
es: Trazar muestras de la curva.

source: Create full period of the Fourier seasonality.
es: Crear el período completo de la estacionalidad de Fourier.

source: Sample the prior distributions.
es: Muestree las distribuciones anteriores.

source: :py:obj:`MonthlyFourier.schema <pymc_marketing.mmm.fourier.MonthlyFourier.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`MonthlyFourier.schema <pymc_marketing.mmm.fourier.MonthlyFourier.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`MonthlyFourier.schema_json <pymc_marketing.mmm.fourier.MonthlyFourier.schema_json>`\ \(\*\[\, by\_alias\, ...\]\)
es: :py:obj:`MonthlyFourier.schema_json <pymc_marketing.mmm.fourier.MonthlyFourier.schema_json>`\ \(\*\[\, por\_alias\, ...\]\)

source: Serialize the prior distribution.
es: Serializar la distribución previa.

source: Serialize the Fourier seasonality.
es: Serializar la estacionalidad de Fourier.

source: :py:obj:`MonthlyFourier.validate <pymc_marketing.mmm.fourier.MonthlyFourier.validate>`\ \(value\)
es: :py:obj:`MonthlyFourier.validate <pymc_marketing.mmm.fourier.MonthlyFourier.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia de modelo.

source: Fourier node names for model coordinates.
es: Nombres de nodos de Fourier para coordenadas del modelo.
