Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.plotting.plot_expected_purchases_ppc.po
Languages: es

source: plot\_expected\_purchases\_ppc
es: trazar\_compras\_esperadas\_ppc

source: Plot a prior or posterior predictive check for the customer purchase frequency distribution.
es: Trace un chequeo predictivo previo o posterior para la distribución de frecuencia de compra del cliente.

source: ``ParetoNBDModel``, ``BetaGeoBetaBinomModel``, ``BetaGeoModel`` and ``ModifiedBetaGeoModel`` are supported.
es: Los modelos ``ParetoNBDModel``, ``BetaGeoBetaBinomModel``, ``BetaGeoModel`` y ``ModifiedBetaGeoModel`` son compatibles.

source: Adapted from legacy ``lifetimes`` library: https://github.com/CamDavidsonPilon/lifetimes/blob/master/lifetimes/plotting.py#L25
es: Adaptado de la biblioteca heredada ``lifetimes``: https://github.com/CamDavidsonPilon/lifetimes/blob/master/lifetimes/plotting.py#L25

source: Parameters
es: Parámetros

source: **model** : :obj:`CLVModel`
es: **modelo** : :obj:`CLVModel`

source: Prior predictive checks can be performed before or after a model is fit. Posterior predictive checks require a fitted model.
es: Se pueden realizar verificaciones predictivas previas antes o después de ajustar un modelo. Las verificaciones predictivas posteriores requieren un modelo ajustado.

source: **ppc** : :class:`python:str`, optional
es: **ppc** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: Type of predictive check to perform. Options are 'prior' or 'posterior'; defaults to 'posterior'.
es: Tipo de verificación predictiva a realizar. Las opciones son 'previa' o 'posterior'; por defecto es 'posterior'.

source: **max_purchases** : :class:`python:int`, optional
es: **max_purchases** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: Cutoff for bars of purchase counts to plot. Default is 10.
es: Límite para la cantidad de barras de compra a trazar. El valor predeterminado es 10.

source: **samples** : :class:`python:int`, optional
es: **muestras** : :class:`python:int`, opcional

source: Number of samples to draw for prior predictive checks. This is not used for posterior predictive checks.
es: Número de muestras a extraer para las verificaciones predictivas previas. Esto no se utiliza para las verificaciones predictivas posteriores.

source: **random_seed** : :class:`python:int`, optional
es: **random_seed** : :class:`python:int`, opcional

source: Random seed to fix sampling results
es: Semilla aleatoria para fijar los resultados de muestreo

source: **ax** : :obj:`matplotlib.Axes`, optional
es: **ax** : :obj:`matplotlib.Axes`, opcional

source: matplotlib.Axes, optional
es: matplotlib.Axes, opcional

source: A matplotlib Axes instance. Creates new axes instance by default.
es: Una instancia de Axes de matplotlib. Crea una nueva instancia de ejes por defecto.

source: Additional arguments to pass into the pandas.DataFrame.plot command.
es: Argumentos adicionales para pasar al comando pandas.DataFrame.plot.

source: Returns
es: Devoluciones

source: **axes** : :obj:`matplotlib.AxesSubplot`
es: **ejes** : :obj:`matplotlib.AxesSubplot`
