Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.causal.TBF_FCI.po
Languages: es

source: TBF\_FCI
es: { "singular": "TBF_FCI", "plural": "TBF_FCI" }

source: Target-first Bayes Factor Temporal PC.
es: { "singular": "Factor Bayesiano Temporal PC de objetivo primero.", "plural": "Factores Bayesianos Temporales PC de objetivo primero." }

source: This is a time-series–adapted version of TBF-PC. It combines ideas from temporal FCI/PCMCI with a Bayes-factor ΔBIC conditional independence test.
es: { "singular": "Esta es una versión adaptada de TBF-PC para series temporales. Combina ideas del FCI/PCMCI temporal con una prueba de independencia condicional ΔBIC basada en el factor de Bayes.", "plural": "Estas son versiones adaptadas de TBF-PC para series temporales. Combinan ideas del FCI/PCMCI temporal con pruebas de independencia condicional ΔBIC basadas en el factor de Bayes." }

source: For each test :math:`X \perp Y \mid S`, compare:
es: { "singular": "Para cada prueba :math:`X \perp Y \mid S`, compara:", "plural": "Para cada prueba :math:`X \perp Y \mid S`, compara:" }

source: M_0 : Y \sim S \\ M_1 : Y \sim S + X
es: { "singular": "M_0 : Y \\sim S\n\\M_1 : Y \\sim S + X", "plural": "M_0 : Y \\sim S\n\\M_1 : Y \\sim S + X" }

source: with BIC scores
es: { "singular": "con puntuaciones BIC", "plural": "con puntuaciones BIC" }

source: \mathrm{BIC}(M) = n \log\!\left(\tfrac{\mathrm{RSS}}{n}\right) + k \log(n),
es: { "singular": "\mathrm{BIC}(M) = n \log\!\left(\tfrac{\mathrm{RSS}}{n}\right) + k \log(n),", "plural": "\mathrm{BIC}(M) = n \log\!\left(\tfrac{\mathrm{RSS}}{n}\right) + k \log(n)," }

source: and Bayes factor approximation
es: { "singular": "y aproximación del factor de Bayes", "plural": "y aproximaciones del factor de Bayes" }

source: \log \mathrm{BF}_{10} \approx -\tfrac{1}{2} \left[ \mathrm{BIC}(M_1) - \mathrm{BIC}(M_0) \right].
es: { "singular": "\log \mathrm{BF}_{10} \approx -\tfrac{1}{2} \left[ \mathrm{BIC}(M_1) - \mathrm{BIC}(M_0) \right].", "plural": "\log \mathrm{BF}_{10} \approx -\tfrac{1}{2} \left[ \mathrm{BIC}(M_1) - \mathrm{BIC}(M_0) \right]." }

source: Declare independence if :math:`\mathrm{BF}_{10} < \tau`.
es: { "singular": "Declare independencia si :math:`\mathrm{BF}_{10} < \tau`.", "plural": "Declare independencia si :math:`\mathrm{BF}_{10} < \tau`." }

source: Parameters
es: { "singular": { "msgid": "Parameters", "msgstr": "Parámetro" }, "plural": { "msgid": "Parameters", "msgstr": "Parámetros" } }

source: **target** : :class:`python:str`
es: { "singular": "**objetivo** : :class:`python:str`", "plural": "**objetivo** : :class:`python:str`" }

source: python:str
es: { "singular": "python:str", "plural": "python:str" }

source: Name of the target variable (at time t).
es: { "singular": "Nombre de la variable objetivo (en el tiempo t).", "plural": "Nombre de las variables objetivo (en el tiempo t)." }

source: **target_edge_rule**
es: { "singular": "**regla_de_borde_objetivo**", "plural": "**reglas_de_borde_objetivo**" }

source: {"any", "conservative", "fullS"}
es: { "singular": "{"any", "conservative", "fullS"}", "plural": "{"any", "conservative", "fullS"}" }

source: Rule for keeping lagged → target edges.
es: { "singular": "Regla para mantener los bordes rezagados → objetivo.", "plural": "Reglas para mantener los bordes rezagados → objetivo." }

source: **bf_thresh** : :class:`python:float`, default=1.0
es: { "singular": "**bf_thresh** : :class:`python:float`, predeterminado=1.0", "plural": "**bf_thresh** : :class:`python:float`, predeterminado=1.0" }

source: python:float, default=1.0
es: { "singular": "python:float, predeterminado=1.0", "plural": "python:float, predeterminado=1.0" }

source: Declare independence if BF10 < bf_thresh.
es: { "singular": "Declare independencia si BF10 < bf_thresh.", "plural": "Declare independencia si BF10 < bf_thresh." }

source: **forbidden_edges** : :class:`python:list` of :class:`python:tuple`\[:class:`python:str`, :class:`python:str`], optional
es: { "singular": "**bordes_prohibidos** : :class:`python:list` de :class:`python:tuple`\[:class:`python:str`, :class:`python:str`], opcional", "plural": "**bordes_prohibidos** : :class:`python:list` de :class:`python:tuple`\[:class:`python:str`, :class:`python:str`], opcionales" }

source: python:list of python:tuple[python:str, python:str], optional
es: { "singular": "python:lista de python:tupla[python:str, python:str], opcional", "plural": "python:listas de python:tupla[python:str, python:str], opcional" }

source: Prior knowledge: edges to exclude.
es: { "singular": "Conocimientos previos: bordes a excluir.", "plural": "Conocimientos previos: bordes a excluir." }

source: **max_lag** : :class:`python:int`, default=2
es: { "singular": "**max_lag** : :class:`python:int`, predeterminado=2", "plural": "**max_lag** : :class:`python:int`, predeterminado=2" }

source: python:int, default=2
es: { "singular": "python:int, predeterminado=2", "plural": "python:int, predeterminado=2" }

source: Maximum lag to include (t-1, t-2, …).
es: { "singular": "Retraso máximo a incluir (t-1, t-2, …).", "plural": "Retrasos máximos a incluir (t-1, t-2, …)." }

source: **allow_contemporaneous** : :ref:`bool <python:bltin-boolean-values>`, default=True
es: { "singular": "**allow_contemporaneous** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=True", "plural": "**allow_contemporaneous** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=True" }

source: bool, default=True
es: { "singular": "bool, predeterminado=True", "plural": "bool, predeterminado=True" }

source: Whether to allow contemporaneous edges at time t.
es: { "singular": "Si permitir bordes contemporáneos en el tiempo t.", "plural": "Si permitir bordes contemporáneos en los tiempos t." }

source: Methods
es: { "singular": "Método", "plural": "Métodos" }

source: :py:obj:`TBF_FCI.__init__ <pymc_marketing.mmm.causal.TBF_FCI.__init__>`\ \(target\, \*\[\, ...\]\)
es: { "singular": ":py:obj:`TBF_FCI.__init__ <pymc_marketing.mmm.causal.TBF_FCI.__init__>`\ \(objetivo\, \*\[\, ...\]\)", "plural": ":py:obj:`TBF_FCI.__init__ <pymc_marketing.mmm.causal.TBF_FCI.__init__>`\ \(objetivos\, \*\[\, ...\]\)" }

source: Create a new temporal TBF-PC causal discovery model.
es: { "singular": "Cree un nuevo modelo de descubrimiento causal TBF-PC temporal.", "plural": "Cree nuevos modelos de descubrimiento causal TBF-PC temporales." }

source: :py:obj:`TBF_FCI.collapsed_summary <pymc_marketing.mmm.causal.TBF_FCI.collapsed_summary>`\ \(\)
es: { "singular": ":py:obj:`TBF_FCI.collapsed_summary <pymc_marketing.mmm.causal.TBF_FCI.collapsed_summary>`\ \(\)", "plural": ":py:obj:`TBF_FCI.collapsed_summary <pymc_marketing.mmm.causal.TBF_FCI.collapsed_summary>`\ \(\)" }

source: Summarize lagged edges into a driver-level view.
es: { "singular": "Resume los bordes retrasados en una vista a nivel de controlador.", "plural": "Resume los bordes retrasados en una vista a nivel de controlador." }

source: :py:obj:`TBF_FCI.fit <pymc_marketing.mmm.causal.TBF_FCI.fit>`\ \(df\, drivers\)
es: { "singular": ":py:obj:`TBF_FCI.fit <pymc_marketing.mmm.causal.TBF_FCI.fit>`\ \(df\, conductores\)", "plural": ":py:obj:`TBF_FCI.fit <pymc_marketing.mmm.causal.TBF_FCI.fit>`\ \(df\, conductores\)" }

source: Fit the temporal causal discovery algorithm to ``df``.
es: { "singular": "Ajuste el algoritmo de descubrimiento causal temporal a ``df``.", "plural": "Ajusten el algoritmo de descubrimiento causal temporal a ``df``." }

source: :py:obj:`TBF_FCI.get_directed_edges <pymc_marketing.mmm.causal.TBF_FCI.get_directed_edges>`\ \(\)
es: { "singular": ":py:obj:`TBF_FCI.get_directed_edges <pymc_marketing.mmm.causal.TBF_FCI.get_directed_edges>`\ \(\)", "plural": ":py:obj:`TBF_FCI.get_directed_edges <pymc_marketing.mmm.causal.TBF_FCI.get_directed_edges>`\ \(\)" }

source: Return directed edges in the time-unrolled graph.
es: { "singular": "Devolver aristas dirigidas en el grafo desenrollado en el tiempo.", "plural": "Devolver aristas dirigidas en los grafos desenrollados en el tiempo." }

source: :py:obj:`TBF_FCI.get_undirected_edges <pymc_marketing.mmm.causal.TBF_FCI.get_undirected_edges>`\ \(\)
es: { "singular": ":py:obj:`TBF_FCI.get_undirected_edges <pymc_marketing.mmm.causal.TBF_FCI.get_undirected_edges>`\ \(\)", "plural": ":py:obj:`TBF_FCI.get_undirected_edges <pymc_marketing.mmm.causal.TBF_FCI.get_undirected_edges>`\ \(\)" }

source: Return undirected edges in the time-unrolled graph.
es: { "singular": "Devuelve los bordes no dirigidos en el gráfico desenrollado en el tiempo.", "plural": "Devuelven los bordes no dirigidos en el gráfico desenrollado en el tiempo." }

source: :py:obj:`TBF_FCI.summary <pymc_marketing.mmm.causal.TBF_FCI.summary>`\ \(\)
es: { "singular": ":py:obj:`TBF_FCI.resumen <pymc_marketing.mmm.causal.TBF_FCI.resumen>`\ \(\)", "plural": ":py:obj:`TBF_FCI.resúmenes <pymc_marketing.mmm.causal.TBF_FCI.resúmenes>`\ \(\)" }

source: Return a human-readable summary of edges and test count.
es: { "singular": "Devuelve un resumen legible por humanos de los bordes y el conteo de pruebas.", "plural": "Devuelven un resumen legible por humanos de los bordes y el conteo de pruebas." }

source: :py:obj:`TBF_FCI.to_digraph <pymc_marketing.mmm.causal.TBF_FCI.to_digraph>`\ \(\[collapsed\]\)
es: { "singular": ":py:obj:`TBF_FCI.to_digraph <pymc_marketing.mmm.causal.TBF_FCI.to_digraph>`\ \(\[collapsed\]\)", "plural": ":py:obj:`TBF_FCI.to_digraph <pymc_marketing.mmm.causal.TBF_FCI.to_digraph>`\ \(\[collapsed\]\)" }

source: Export the learned graph as DOT text.
es: { "singular": { "msgid": "Export the learned graph as DOT text.", "msgstr": "Exporte el gráfico aprendido como texto DOT." }, "plural": { "msgid": "Export the learned graph as DOT text.", "msgstr": "Exporte los gráficos aprendidos como texto DOT." } }
