Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.diversification_ratio.po
Languages: es

source: diversification\_ratio
es: razón\_de\_diversificación

source: Calculate the Diversification Ratio of a portfolio to evaluate risk distribution.
es: Calcule el Ratio de Diversificación de una cartera para evaluar la distribución del riesgo.

source: The Diversification Ratio measures the effectiveness of diversification by comparing the weighted average volatility of individual assets to the overall portfolio volatility. A higher ratio indicates better diversification, as it reflects lower correlations among assets, leading to reduced portfolio risk.
es: El Ratio de Diversificación mide la efectividad de la diversificación al comparar la volatilidad promedio ponderada de los activos individuales con la volatilidad general de la cartera. Un ratio más alto indica una mejor diversificación, ya que refleja correlaciones más bajas entre los activos, lo que conduce a una reducción del riesgo de la cartera.

source: The Diversification Ratio is calculated as:
es: El Ratio de Diversificación se calcula como:

source: where:
es: donde:

source: :math:`w_i` is the weight of asset \\( i \\)
es: :math:`w_i` es el peso del activo \\( i \\)

source: :math:`\\sigma_i` is the volatility (standard deviation) of asset \\( i \\)
es: :math:`\\sigma_i` es la volatilidad (desviación estándar) del activo \\( i \\)

source: :math:`\\sigma_p` is the volatility of the portfolio
es: :math:`\\sigma_p` es la volatilidad de la cartera

source: Parameters
es: Parámetros

source: **samples** : :obj:`pt.TensorVariable`
es: **muestras** : :obj:`pt.TensorVariable`

source: 2D PyTensor tensor variable where each column represents the returns of an asset.
es: Variable tensor 2D de PyTensor donde cada columna representa los rendimientos de un activo.

source: **budgets** : :obj:`pt.TensorVariable`
es: **presupuestos** : :obj:`pt.TensorVariable`

source: 1D PyTensor tensor variable representing the investment amounts in each asset.
es: Variable tensor 1D PyTensor que representa los montos de inversión en cada activo.

source: Returns
es: Devoluciones

source: Diversification Ratio.
es: Ratio de Diversificación.

source: :obj:`This` :obj:`ratio` :obj:`provides` :obj:`insight` :obj:`into` :obj:`how` :obj:`individual` :obj:`asset` :obj:`volatilities` :obj:`and` :obj:`their` :obj:`correlations`
es: :obj:`Este` :obj:`ratio` :obj:`proporciona` :obj:`una` :obj:`visión` :obj:`sobre` :obj:`cómo` :obj:`las` :obj:`volatilidades` :obj:`de` :obj:`activos` :obj:`individuales` :obj:`y` :obj:`sus` :obj:`correlaciones`

source: :obj:`contribute` :obj:`to` :obj:`the` :obj:`overall` :obj:`portfolio` risk.
es: :obj:`contribuir` :obj:`a` :obj:`el` :obj:`riesgo` :obj:`general` :obj:`del` :obj:`portafolio`.

source: References
es: Referencias

source: Choueifaty, Y., & Coignard, Y. (2008). Toward Maximum Diversification. *Journal of Portfolio Management*.
es: Choueifaty, Y., y Coignard, Y. (2008). Hacia la máxima diversificación. *Revista de Gestión de Carteras*.

source: Meucci, A. (2009). Managing Diversification. *Risk*, 22(5), 74-79.
es: Meucci, A. (2009). Gestión de la Diversificación. *Riesgo*, 22(5), 74-79.
