Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.budget_optimizer.BuildMergedModel.po
Languages: es

source: BuildMergedModel
es: ConstruirModeloFusionado

source: Merge multiple optimizer-compatible models into a single model.
es: Fusionar múltiples modelos compatibles con el optimizador en un solo modelo.

source: This wrapper combines several optimizer-compatible MMM wrappers by: - Merging their posterior `InferenceData` with per-model prefixes - Optionally thinning posterior draws via ``use_every_n_draw`` - Exposing a persistent merged PyMC ``Model`` for optimization through
es: Este envoltorio combina varios envoltorios MMM compatibles con optimizadores al: - Fusionar sus `InferenceData` posteriores con prefijos por modelo - Opcionalmente reducir las muestras posteriores a través de ``use_every_n_draw`` - Exponer un ``Model`` de PyMC fusionado y persistente para optimización a través de

source: ``_set_predictors_for_optimization`` and a dynamic ``model`` property for inspection when needed
es: ``_set_predictors_for_optimization`` y una propiedad ``model`` dinámica para inspección cuando sea necesario

source: Parameters
es: Parámetros

source: **models** : :class:`python:list`\[:obj:`OptimizerCompatibleModelWrapper`]
es: **modelos** : :class:`python:list`\[:obj:`OptimizerCompatibleModelWrapper`]

source: A list of wrappers that each expose ``idata`` and ``_set_predictors_for_optimization(num_periods: int) -> Model``.
es: Una lista de envoltorios que cada uno expone ``idata`` y ``_set_predictors_for_optimization(num_periods: int) -> Model``.

source: **prefixes** : :class:`python:list`\[:class:`python:str`] | :data:`python:None`, optional
es: **prefijos** : :class:`python:list`\[:class:`python:str`] | :data:`python:None`, opcional

source: python:list[python:str] | python:None, optional
es: python:list[python:str] | python:None, opcional

source: Per-model prefixes used when merging. If ``None``, defaults to ``["model1", "model2", ...]`` with one prefix per model.
es: Prefijos por modelo utilizados al fusionar. Si ``None``, se utiliza por defecto ``["model1", "model2", ...]`` con un prefijo por modelo.

source: **merge_on** : :class:`python:str` | :data:`python:None`, optional, default "channel_data"
es: **merge_on** : :class:`python:str` | :data:`python:None`, opcional, por defecto "channel_data"

source: python:str | python:None, optional, default "channel_data"
es: python:str | python:None, opcional, predeterminado "channel_data"

source: Name of a variable expected to be present in all models and that should remain unprefixed and be used for aligning/merging dims (e.g., ``"channel_data"``). If ``None``, no variable is treated as shared and all variables/dims are prefixed.
es: Nombre de una variable que se espera que esté presente en todos los modelos y que debe permanecer sin prefijo y ser utilizada para alinear/combinar dimensiones (por ejemplo, ``"channel_data"``). Si es ``None``, ninguna variable se trata como compartida y todas las variables/dimensiones tienen prefijo.

source: **use_every_n_draw** : :class:`python:int`, optional, default 1
es: **use_every_n_draw** : :class:`python:int`, opcional, valor por defecto 1

source: python:int, optional, default 1
es: python:int, opcional, predeterminado 1

source: Thinning factor applied when merging idatas. Keeps every n-th draw.
es: Factor de adelgazamiento aplicado al fusionar idatas. Mantiene cada n-ésimo sorteo.

source: Attributes
es: Atributos

source: **prefixes** : :class:`python:list`\[:class:`python:str`]
es: **prefijos** : :class:`python:list`\[:class:`python:str`]

source: The final list of prefixes used for each model.
es: La lista final de prefijos utilizados para cada modelo.

source: The provided list of wrappers.
es: La lista de envolturas proporcionada.

source: Number of models being merged.
es: Número de modelos que se están fusionando.

source: Number of forecast periods inferred from the primary model (if available).
es: Número de períodos de pronóstico inferidos del modelo primario (si está disponible).

source: The merged and prefixed posterior (and data) container.
es: El contenedor posterior (y de datos) fusionado y prefijado.

source: **adstock** : :obj:`Any`
es: **adstock** : :obj:`Cualquiera`

source: Any
es: Cualquiera

source: Carried over from the primary model when available.
es: Transferido del modelo principal cuando está disponible.

source: :obj:`model <model>` : :obj:`pymc.Model`
es: :obj:`modelo <model>` : :obj:`pymc.Model`

source: Return the merged PyMC model.
es: Devuelve el modelo PyMC combinado.

source: Examples
es: Ejemplos

source: Merge three multidimensional MMMs into a single optimizer model:
es: Fusionar tres MMM multidimensionales en un único modelo de optimización:

source: Single model: auto-prefix and thin draws:
es: Modelo único: auto-prefijo y tiradas delgadas:

source: Merge everything with prefixes (no shared variable retained):
es: Fusionar todo con prefijos (sin variable compartida retenida):

source: Methods
es: Métodos

source: :py:obj:`model <pymc_marketing.mmm.budget_optimizer.BuildMergedModel.model>`\
es: :py:obj:`modelo <pymc_marketing.mmm.budget_optimizer.BuildMergedModel.model>`
