Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.utils.rfm_segments.po
Languages: es

source: Assign customers to segments based on spending behavior derived from RFM scores.
es: Asigne clientes a segmentos basados en el comportamiento de gasto derivado de las puntuaciones RFM.

source: This transforms a DataFrame of transaction data of the form:
es: Esto transforma un DataFrame de datos de transacciones de la forma:

source: *customer_id, datetime, monetary_value*
es: *id_cliente, fecha_hora, valor_monetario*

source: to a DataFrame of the form:
es: a un DataFrame de la forma:

source: *customer_id, frequency, recency, monetary_value, rfm_score, segment*
es: *id_cliente, frecuencia, recencia, valor_monetario, puntuación_rfm, segmento*

source: Customer purchasing data is aggregated into three variables: `recency`, `frequency`, and `monetary_value`. Quartiles are estimated for each variable, and a three-digit RFM score is then assigned to each customer. For example, a customer with a score of '234' is in the second quartile for `recency`, third quartile for `frequency`, and fourth quartile for `monetary_value`. RFM scores corresponding to segments such as "Top Spender", "Frequent Buyer", or "At-Risk" are determined, and customers are then segmented based on their RFM score.
es: Los datos de compra de los clientes se agrupan en tres variables: `recency`, `frequency` y `monetary_value`. Se estiman los cuartiles para cada variable, y luego se asigna un puntaje RFM de tres dígitos a cada cliente. Por ejemplo, un cliente con un puntaje de '234' se encuentra en el segundo cuartil para `recency`, en el tercer cuartil para `frequency` y en el cuarto cuartil para `monetary_value`. Se determinan los puntajes RFM correspondientes a segmentos como "Top Spender", "Frequent Buyer" o "At-Risk", y luego se segmentan los clientes en función de su puntaje RFM.

source: By default, the following segments are created:
es: Por defecto, se crean los siguientes segmentos:

source: "Premium Customer": Customers in top 2 quartiles for all variables.
es: Cliente Premium: Clientes en los 2 cuartiles superiores para todas las variables.

source: "Repeat Customer": Customers in top 2 quartiles for frequency, and either recency or monetary value.
es: "Cliente Recurrente": Clientes en los 2 cuartiles superiores por frecuencia, y ya sea por recencia o valor monetario.

source: "Top Spender": Customers in top 2 quartiles for monetary value, and either frequency or recency.
es: "Mejor Gastador": Clientes en los 2 cuartiles superiores por valor monetario, y ya sea por frecuencia o por recencia.

source: "At-Risk Customer": Customers in bottom 2 quartiles for two or more variables.
es: "Cliente en riesgo": Clientes en los dos cuartiles inferiores para dos o más variables.

source: "Inactive Customer": Customers in bottom quartile for two or more variables.
es: Cliente inactivo: Clientes en el cuartil inferior para dos o más variables.

source: Customers with unspecified RFM scores will be assigned to a segment named "Other".
es: Los clientes con puntuaciones RFM no especificadas serán asignados a un segmento llamado "Otro".

source: If an alternative segmentation approach is desired, use `rfm_summary(include_first_transaction=True, *args, **kwargs)` instead to preprocess data for segmentation. In either case, the returned DataFrame cannot be used for modeling. If assigning model predictions to RFM segments, create a separate DataFrame for modeling and join by Customer ID.
es: Si se desea un enfoque de segmentación alternativo, utilice `rfm_summary(include_first_transaction=True, *args, **kwargs)` en su lugar para preprocesar los datos para la segmentación. En cualquier caso, el DataFrame devuelto no puede ser utilizado para modelado. Si se asignan las predicciones del modelo a los segmentos RFM, cree un DataFrame separado para el modelado y únalo por ID de Cliente.

source: Parameters
es: Parámetros

source: **transactions** : :obj:`~pandas.DataFrame`
es: **transacciones** : :obj:`~pandas.DataFrame`

source: A Pandas DataFrame containing *customer_id_col* and *datetime_col*.
es: Un DataFrame de Pandas que contiene *customer_id_col* y *datetime_col*.

source: Column in the *transactions* DataFrame denoting the *customer_id*.
es: Columna en el DataFrame de *transacciones* que denota el *customer_id*.

source: Column in the *transactions* DataFrame denoting datetimes purchase were made.
es: Columna en el DataFrame de *transacciones* que denota las fechas y horas en que se realizaron las compras.

source: Column in the *transactions* DataFrame that denotes the monetary value of the transaction.
es: Columna en el DataFrame de *transacciones* que denota el valor monetario de la transacción.

source: **segment_config** : :class:`python:dict`, optional
es: **segment_config** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Dictionary containing segment names and list of RFM score assignments; key/value pairs should be formatted as `{"segment": ['111', '123', '321'], ...}`. If not provided, default segment names and definitions are applied.
es: Diccionario que contiene nombres de segmentos y lista de asignaciones de puntuaciones RFM; los pares clave/valor deben estar formateados como `{"segment": ['111', '123', '321'], ...}`. Si no se proporciona, se aplican los nombres y definiciones de segmentos predeterminados.

source: **observation_period_end** : :obj:`Union`\[:class:`python:str`, :obj:`pandas.Period`, :obj:`datetime`, :data:`python:None`], optional
es: **observation_period_end** : :obj:`Union`\[:class:`python:str`, :obj:`pandas.Period`, :obj:`datetime`, :data:`python:None`], opcional

source: Union[python:str, pandas.Period, datetime, python:None], optional
es: Unión[python:str, pandas.Period, datetime, python:None], opcional

source: A string or datetime to denote the final date of the study. Events after this date are truncated. If not given, defaults to the max of *datetime_col*.
es: Una cadena o fecha y hora para denotar la fecha final del estudio. Los eventos después de esta fecha se truncarán. Si no se proporciona, se establece por defecto en el máximo de *datetime_col*.

source: **datetime_format** : :class:`python:str`, optional
es: **datetime_format** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: A string that represents the timestamp format. Useful if Pandas doesn't recognize the provided format.
es: Una cadena que representa el formato de la marca de tiempo. Útil si Pandas no reconoce el formato proporcionado.

source: **time_unit** : :class:`python:str`, optional
es: **unidad_tiempo** : :class:`python:str`, opcional

source: Time granularity for study. Default: 'D' for days. Possible values listed here: https://numpy.org/devdocs/reference/arrays.datetime.html#datetime-units
es: Granularidad de tiempo para el estudio. Predeterminado: 'D' para días. Los valores posibles se enumeran aquí: https://numpy.org/devdocs/reference/arrays.datetime.html#datetime-units

source: **time_scaler** : :class:`python:int`, optional
es: **time_scaler** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: Default: 1. Scales *recency* & *T* to a different time granularity. This is useful for datasets spanning many years, and running predictions in different time scales.
es: Predeterminado: 1. Escala *recencia* y *T* a una granularidad temporal diferente. Esto es útil para conjuntos de datos que abarcan muchos años y para realizar predicciones en diferentes escalas de tiempo.

source: **sort_transactions** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **sort_transactions** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Default: *True* If raw data is already sorted in chronological order, set to *False* to improve computational efficiency.
es: Predeterminado: *Verdadero* Si los datos sin procesar ya están ordenados en orden cronológico, establezca en *Falso* para mejorar la eficiencia computacional.

source: Returns
es: Devoluciones

source: Dataframe containing summarized RFM data, RFM scores, and segment assignments
es: Dataframe que contiene datos RFM resumidos, puntuaciones RFM y asignaciones de segmentos
