Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.bass.model.F.po
Languages: es

source: Installed base fraction rate of change (adoption rate).
es: Tasa de cambio de la fracción de la base instalada (tasa de adopción).

source: This function calculates the rate of new adoptions at time t as a proportion of the potential market. It represents the probability density function of adoption time.
es: Esta función calcula la tasa de nuevas adopciones en el tiempo t como una proporción del mercado potencial. Representa la función de densidad de probabilidad del tiempo de adopción.

source: Parameters
es: Parámetros

source: **p** : :class:`python:float` or :class:`~pytensor.tensor.TensorVariable`
es: **p** : :class:`python:float` o :class:`~pytensor.tensor.TensorVariable`

source: python:float or TensorVariable
es: python:float o TensorVariable

source: Coefficient of innovation (external influence)
es: Coeficiente de innovación (influencia externa)

source: **q** : :class:`python:float` or :class:`~pytensor.tensor.TensorVariable`
es: **q** : :class:`python:float` o :class:`~pytensor.tensor.TensorVariable`

source: Coefficient of imitation (internal influence)
es: Coeficiente de imitación (influencia interna)

source: **t** : :term:`numpy:array_like` or :class:`~pytensor.tensor.TensorVariable`
es: **t** : :term:`numpy:array_like` o :class:`~pytensor.tensor.TensorVariable`

source: numpy:array_like or TensorVariable
es: numpy:array_like o TensorVariable

source: Time points
es: Puntos de tiempo

source: Returns
es: Devoluciones

source: The adoption rate at each time point as a fraction of potential market
es: La tasa de adopción en cada punto en el tiempo como una fracción del mercado potencial

source: Notes
es: Notas

source: This is the derivative of F(t) with respect to time:
es: Esta es la derivada de F(t) con respecto al tiempo:

source: Alternatively:
es: Alternativamente:

source: The peak adoption rate occurs at time :math:`t^* = \frac{\ln(q/p)}{p+q}`
es: La tasa máxima de adopción ocurre en el tiempo :math:`t^* = \frac{\ln(q/p)}{p+q}`
