Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utils.add_noise_to_channel_allocation.po
Languages: es

source: add\_noise\_to\_channel\_allocation
es: agregar\_ruido\_a\_la\_asignación\_de\_canal

source: Return *df* with additive Gaussian noise applied to *channels* columns.
es: Devuelve *df* con ruido gaussiano aditivo aplicado a las columnas *channels*.

source: Parameters
es: Parámetros

source: The original data (will **not** be modified in-place).
es: Los datos originales (no **se** modificarán en su lugar).

source: **channels** : :class:`python:list` of :class:`python:str`
es: **canales** : :class:`python:list` de :class:`python:str`

source: python:list of python:str
es: python:lista de python:str

source: Column names whose values represent media spends.
es: Nombres de columnas cuyos valores representan gastos en medios.

source: **rel_std** : :class:`python:float`, default 0.05
es: **rel_std** : :class:`python:float`, valor predeterminado 0.05

source: python:float, default 0.05
es: python:float, valor por defecto 0.05

source: Noise standard-deviation expressed as a fraction of the *column mean* (i.e. `0.05` ⇒ 5 % of the mean spend).
es: Desviación estándar del ruido expresada como una fracción de la *media de la columna* (es decir, `0.05` ⇒ 5 % de la media del gasto).

source: **seed** : :class:`python:int` or :data:`python:None`
es: **semilla** : :class:`python:int` o :data:`python:None`

source: python:int or python:None
es: python:int o python:None

source: Optional seed for deterministic output.
es: Semilla opcional para una salida determinista.

source: Returns
es: Devoluciones

source: A copy of *df* with noisy spends.
es: Una copia de *df* con gastos ruidosos.
