Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.evaluation.compute_summary_metrics.po
Languages: es

source: Evaluate the model by calculating metric distributions and summarizing them.
es: Evalúe el modelo calculando las distribuciones de métricas y resumiéndolas.

source: This method combines the functionality of `calculate_metric_distributions` and `summarize_metric_distributions`.
es: Este método combina la funcionalidad de `calculate_metric_distributions` y `summarize_metric_distributions`.

source: Parameters
es: Parámetros

source: The true values of the target variable.
es: Los verdaderos valores de la variable objetivo.

source: The predicted values of the target variable.
es: Los valores predichos de la variable objetivo.

source: **metrics_to_calculate** : :class:`python:list` of :class:`python:str` or :data:`python:None`, optional
es: **métricas_a_calcular** : :class:`python:list` de :class:`python:str` o :data:`python:None`, opcional

source: python:list of python:str or python:None, optional
es: python:lista de python:str o python:None, opcional

source: List of metrics to calculate. Options include:
es: Lista de métricas a calcular. Las opciones incluyen:

source: `r_squared`: Bayesian R-squared.
es: `r_squared`: R-cuadrado bayesiano.

source: `rmse`: Root Mean Squared Error.
es: `rmse`: Error Cuadrático Medio.

source: `nrmse`: Normalized Root Mean Squared Error.
es: `nrmse`: Error Cuadrático Medio Normalizado.

source: `mae`: Mean Absolute Error.
es: `mae`: Error Absoluto Medio.

source: `nmae`: Normalized Mean Absolute Error.
es: `nmae`: Error Absoluto Medio Normalizado.

source: `mape`: Mean Absolute Percentage Error.
es: `mape`: Error Porcentual Absoluto Medio.

source: Defaults to all metrics if None.
es: Por defecto, se aplican todas las métricas si no hay ninguna.

source: **hdi_prob** : :class:`python:float`, optional
es: **hdi_prob** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: The probability mass of the highest density interval. Defaults to 0.94.
es: La masa de probabilidad del intervalo de mayor densidad. Por defecto es 0.94.

source: Returns
es: Devoluciones

source: :class:`python:dict` of :class:`python:str` :obj:`to` :class:`python:dict`
es: :class:`python:dict` de :class:`python:str` :obj:`a` :class:`python:dict`

source: A dictionary containing summary statistics for each metric. List of summary statistics calculated for each metric:
es: Un diccionario que contiene estadísticas resumidas para cada métrica. Lista de estadísticas resumidas calculadas para cada métrica:

source: `mean`: Mean of the metric distribution.
es: `mean`: Media de la distribución de la métrica.

source: `median`: Median of the metric distribution.
es: `median`: Mediana de la distribución de la métrica.

source: `std`: Standard deviation of the metric distribution.
es: `std`: Desviación estándar de la distribución de la métrica.

source: `min`: Minimum value of the metric distribution.
es: `min`: Valor mínimo de la distribución métrica.

source: `max`: Maximum value of the metric distribution.
es: `max`: Valor máximo de la distribución métrica.

source: `hdi_lower`: Lower bound of the Highest Density Interval.
es: `hdi_lower`: Límite inferior del Intervalo de Mayor Densidad.

source: `hdi_upper`: Upper bound of the Highest Density Interval.
es: `hdi_upper`: Límite superior del Intervalo de Mayor Densidad.

source: Examples
es: Ejemplos

source: Evaluation (error and model metrics) for a PyMC-Marketing MMM.
es: Evaluación (métricas de error y modelo) para un MMM de PyMC-Marketing.
