Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.causal.BuildModelFromDAG.po
Languages: es

source: BuildModelFromDAG
es: ConstruirModeloDesdeDAG

source: Build a PyMC probabilistic model directly from a Causal DAG and a tabular dataset.
es: Construya un modelo probabilístico de PyMC directamente a partir de un DAG causal y un conjunto de datos tabular.

source: The class interprets a Directed Acyclic Graph (DAG) where each node is a column in the provided `df`. For every edge ``A -> B`` it creates a slope prior for the contribution of ``A`` into the mean of ``B``. Each node receives a likelihood prior. Dims and coords are used to align and index observed data via ``pm.Data`` and xarray.
es: La clase interpreta un Grafo Dirigido Acíclico (DAG) donde cada nodo es una columna en el `df` proporcionado. Para cada arista ``A -> B`` crea un prior de pendiente para la contribución de ``A`` en la media de ``B``. Cada nodo recibe un prior de verosimilitud. Dims y coords se utilizan para alinear e indexar los datos observados a través de ``pm.Data`` y xarray.

source: Parameters
es: Parámetros

source: DAG in DOT format (e.g. ``digraph { A -> B; B -> C; }``) or as a simple comma/newline separated list of edges (e.g. ``"A->B, B->C"``).
es: DAG en formato DOT (por ejemplo, ``digraph { A -> B; B -> C; }``) o como una lista simple de aristas separadas por comas/nuevas líneas (por ejemplo, ``"A->B, B->C"``).

source: DataFrame that contains a column for every node present in the DAG and all columns named by the provided ``dims``.
es: DataFrame que contiene una columna para cada nodo presente en el DAG y todas las columnas nombradas por los ``dims`` proporcionados.

source: **target** : :class:`python:str`
es: **objetivo** : :class:`python:str`

source: Name of the target node present in both the DAG and ``df``. This is not used to restrict modeling but is validated to exist in the DAG.
es: Nombre del nodo objetivo presente tanto en el DAG como en ``df``. Esto no se utiliza para restringir la modelización, pero se valida para que exista en el DAG.

source: Dims for the observed variables and likelihoods (e.g. ``("date", "channel")``).
es: Dimensiones para las variables observadas y las probabilidades (por ejemplo, ``("date", "channel")``).

source: Mapping from dim names to coordinate values. All coord keys must exist as columns in ``df`` and will be used to pivot the data to match dims.
es: Mapeo de nombres de dimensiones a valores de coordenadas. Todas las claves de coordenadas deben existir como columnas en ``df`` y se utilizarán para pivotar los datos para que coincidan con las dimensiones.

source: **model_config** : :class:`python:dict`, optional
es: **model_config** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Optional configuration with priors for keys ``"intercept"``, ``"slope"`` and ``"likelihood"``. Values should be ``pymc_extras.prior.Prior`` instances. Missing keys fall back to :pyattr:`default_model_config`.
es: Configuración opcional con priors para las claves ``"intercept"``, ``"slope"`` y ``"likelihood"``. Los valores deben ser instancias de ``pymc_extras.prior.Prior``. Las claves faltantes se revertirán a :pyattr:`default_model_config`.

source: Examples
es: Ejemplos

source: Minimal example using DOT format:
es: Ejemplo mínimo utilizando el formato DOT:

source: Edge-list format and custom likelihood prior:
es: Formato de lista de aristas y prior de verosimilitud personalizado:

source: Methods
es: Métodos

source: Construct and return the PyMC model implied by the DAG and data.
es: Construya y devuelva el modelo PyMC implícito en el DAG y los datos.

source: Return a copy of the parsed DAG as a NetworkX directed graph.
es: Devuelve una copia del DAG analizado como un grafo dirigido de NetworkX.

source: Return a Graphviz visualization of the built PyMC model.
es: Devuelve una visualización de Graphviz del modelo PyMC construido.

source: Attributes
es: Atributos

source: Default priors for intercepts, slopes and likelihood using ``pymc_extras.Prior``.
es: Priors predeterminados para interceptos, pendientes y verosimilitud utilizando ``pymc_extras.Prior``.
