Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.components.adstock.po
Languages: es

source: Adstock transformations for MMM.
es: Transformaciones de Adstock para MMM.

source: Each of these transformations is a subclass of :class:`pymc_marketing.mmm.components.adstock.AdstockTransformation` and defines a function that takes a time series and returns the adstocked version of it. The parameters of the function are the parameters of the adstock transformation.
es: Cada una de estas transformaciones es una subclase de :class:`pymc_marketing.mmm.components.adstock.AdstockTransformation` y define una función que toma una serie temporal y devuelve la versión adstocked de la misma. Los parámetros de la función son los parámetros de la transformación adstock.

source: Examples
es: Ejemplos

source: Create a new adstock transformation:
es: Crear una nueva transformación de adstock:

source: Plot the default priors for an adstock transformation:
es: Grafique las priors predeterminadas para una transformación de adstock:

source: Functions
es: Funciones

source: :py:obj:`adstock_from_dict <pymc_marketing.mmm.components.adstock.adstock_from_dict>`\ \(data\)
es: :py:obj:`adstock_from_dict <pymc_marketing.mmm.components.adstock.adstock_from_dict>`\ \(datos\)

source: Create an adstock transformation from a dictionary.
es: Cree una transformación de adstock a partir de un diccionario.

source: Classes
es: Clases

source: :py:obj:`AdstockTransformation <pymc_marketing.mmm.components.adstock.AdstockTransformation>`\ \(\[l\_max\, normalize\, ...\]\)
es: :py:obj:`AdstockTransformation <pymc_marketing.mmm.components.adstock.AdstockTransformation>`\ \(\[l\_max\, normalizar\, ...\]\)

source: Subclass for all adstock functions.
es: Subclase para todas las funciones de adstock.

source: :py:obj:`DelayedAdstock <pymc_marketing.mmm.components.adstock.DelayedAdstock>`\ \(\[l\_max\, normalize\, mode\, ...\]\)
es: :py:obj:`DelayedAdstock <pymc_marketing.mmm.components.adstock.DelayedAdstock>`\ \(\[l\_max\, normalizar\, modo\, ...\]\)

source: Wrapper around delayed adstock function.
es: Envoltura alrededor de la función de adstock retrasado.

source: :py:obj:`GeometricAdstock <pymc_marketing.mmm.components.adstock.GeometricAdstock>`\ \(\[l\_max\, normalize\, mode\, ...\]\)
es: :py:obj:`GeometricAdstock <pymc_marketing.mmm.components.adstock.GeometricAdstock>`\ \(\[l\_max\, normalizar\, modo\, ...\]\)

source: Wrapper around geometric adstock function.
es: Envoltura alrededor de la función adstock geométrica.

source: :py:obj:`NoAdstock <pymc_marketing.mmm.components.adstock.NoAdstock>`\ \(\[l\_max\, normalize\, mode\, priors\, ...\]\)
es: :py:obj:`NoAdstock <pymc_marketing.mmm.components.adstock.NoAdstock>`\ \(\[l\_max\, normalizar\, modo\, priors\, ...\]\)

source: Wrapper around no adstock transformation.
es: Envoltura alrededor de la transformación sin adstock.

source: :py:obj:`WeibullCDFAdstock <pymc_marketing.mmm.components.adstock.WeibullCDFAdstock>`\ \(\[l\_max\, normalize\, mode\, ...\]\)
es: :py:obj:`WeibullCDFAdstock <pymc_marketing.mmm.components.adstock.WeibullCDFAdstock>`\ \(\[l\_max\, normalizar\, modo\, ...\]\)

source: Wrapper around weibull adstock with CDF function.
es: Envoltura alrededor del adstock de Weibull con función CDF.

source: :py:obj:`WeibullPDFAdstock <pymc_marketing.mmm.components.adstock.WeibullPDFAdstock>`\ \(\[l\_max\, normalize\, mode\, ...\]\)
es: :py:obj:`WeibullPDFAdstock <pymc_marketing.mmm.components.adstock.WeibullPDFAdstock>`\ \(\[l\_max\, normalizar\, modo\, ...\]\)

source: Wrapper around weibull adstock with PDF function.
es: Envoltorio alrededor del adstock de Weibull con función PDF.
