Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.preprocessing.po
Languages: es

source: preprocessing
es: preprocesamiento

source: Preprocessing methods for the Marketing Mix Model.
es: Métodos de preprocesamiento para el Modelo de Mezcla de Marketing.

source: Functions
es: Funciones

source: :py:obj:`preprocessing_method_X <pymc_marketing.mmm.preprocessing.preprocessing_method_X>`\ \(method\)
es: :py:obj:`método_de_preprocesamiento_X <pymc_marketing.mmm.preprocessing.preprocessing_method_X>`\ \(método\)

source: Tag a method as a preprocessing method for the X data.
es: Etiquete un método como un método de preprocesamiento para los datos X.

source: :py:obj:`preprocessing_method_y <pymc_marketing.mmm.preprocessing.preprocessing_method_y>`\ \(method\)
es: :py:obj:`preprocessing_method_y <pymc_marketing.mmm.preprocessing.preprocessing_method_y>`\ \(método\)

source: Tag a method as a preprocessing method for the y data.
es: Etiqueta un método como un método de preprocesamiento para los datos y.

source: Classes
es: Clases

source: MaxAbsScaler for the channel data.
es: MaxAbsScaler para los datos del canal.

source: MaxAbsScaler for the target data.
es: MaxAbsScaler para los datos objetivo.

source: StandardScaler for the control data.
es: StandardScaler para los datos de control.
