Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.utils.rfm_train_test_split.po
Languages: es

source: Summarize transaction data and split into training and tests datasets for CLV modeling.
es: Resuma los datos de transacciones y divídalos en conjuntos de datos de entrenamiento y prueba para el modelado de CLV.

source: This can also be used to evaluate the impact of a time-based intervention like a marketing campaign.
es: Esto también se puede utilizar para evaluar el impacto de una intervención basada en el tiempo, como una campaña de marketing.

source: This transforms a DataFrame of transaction data of the form:
es: Esto transforma un DataFrame de datos de transacciones de la forma:

source: *customer_id, datetime [, monetary_value]*
es: *customer_id, fecha y hora [, valor_monetario]*

source: to a DataFrame of the form:
es: a un DataFrame de la forma:

source: *customer_id, frequency, recency, T [, monetary_value], test_frequency [, test_monetary_value], test_T*
es: *customer_id, frecuencia, recencia, T [, valor_monetario], frecuencia_prueba [, valor_monetario_prueba], test_T*

source: Note this function will exclude new customers whose first transactions occurred during the test period.
es: Tenga en cuenta que esta función excluirá a los nuevos clientes cuyas primeras transacciones ocurrieron durante el período de prueba.

source: Adapted from lifetimes package https://github.com/CamDavidsonPilon/lifetimes/blob/41e394923ad72b17b5da93e88cfabab43f51abe2/lifetimes/utils.py#L27
es: Adaptado del paquete lifetimes https://github.com/CamDavidsonPilon/lifetimes/blob/41e394923ad72b17b5da93e88cfabab43f51abe2/lifetimes/utils.py#L27

source: Parameters
es: Parámetros

source: **transactions** : :obj:`~pandas.DataFrame`
es: **transacciones** : :obj:`~pandas.DataFrame`

source: A Pandas DataFrame containing *customer_id_col* and *datetime_col*.
es: Un DataFrame de Pandas que contiene *customer_id_col* y *datetime_col*.

source: Column in the *transactions* DataFrame denoting the customer_id.
es: Columna en el DataFrame *transactions* que denota el customer_id.

source: Column in the *transactions* DataFrame denoting datetimes purchases were made.
es: Columna en el DataFrame de *transacciones* que denota las fechas y horas en las que se realizaron las compras.

source: **train_period_end** : :obj:`Union`\[:class:`python:str`, :obj:`pandas.Period`, :obj:`datetime`], optional
es: **train_period_end** : :obj:`Union`\[:class:`python:str`, :obj:`pandas.Period`, :obj:`datetime`], opcional

source: Union[python:str, pandas.Period, datetime], optional
es: Unión[python:str, pandas.Period, datetime], opcional

source: A string or datetime to denote the final time period for the training data. Events after this time period are used for the test data.
es: Una cadena o fecha y hora para denotar el período de tiempo final para los datos de entrenamiento. Los eventos después de este período de tiempo se utilizan para los datos de prueba.

source: **test_period_end** : :obj:`Union`\[:class:`python:str`, :obj:`pandas.Period`, :obj:`datetime`], optional
es: **test_period_end** : :obj:`Union`\[:class:`python:str`, :obj:`pandas.Period`, :obj:`datetime`], opcional

source: A string or datetime to denote the final time period of the study. Events after this date are truncated. If not given, defaults to the max of *datetime_col*.
es: Una cadena o fecha y hora para denotar el período final del estudio. Los eventos después de esta fecha se truncarán. Si no se proporciona, se establece por defecto en el máximo de *datetime_col*.

source: **time_unit** : :class:`python:str`, optional
es: **unidad_tiempo** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: Time granularity for study. Default: 'D' for days. Possible values listed here: https://numpy.org/devdocs/reference/arrays.datetime.html#datetime-units
es: Granularidad de tiempo para el estudio. Predeterminado: 'D' para días. Los valores posibles se enumeran aquí: https://numpy.org/devdocs/reference/arrays.datetime.html#datetime-units

source: **time_scaler** : :class:`python:int`, optional
es: **time_scaler** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: Default: 1. Scales *recency* & *T* to a different time granularity. This is useful for datasets spanning many years, and running predictions in different time scales.
es: Predeterminado: 1. Escala *recencia* y *T* a una granularidad temporal diferente. Esto es útil para conjuntos de datos que abarcan muchos años y para realizar predicciones en diferentes escalas de tiempo.

source: **datetime_format** : :class:`python:str`, optional
es: **datetime_format** : :class:`python:str`, opcional

source: A string that represents the timestamp format. Useful if Pandas doesn't recognize the provided format.
es: Una cadena que representa el formato de la marca de tiempo. Útil si Pandas no reconoce el formato proporcionado.

source: **monetary_value_col** : :class:`python:str`, optional
es: **monetary_value_col** : :class:`python:str`, opcional

source: Column in the *transactions* DataFrame that denotes the monetary value of the transaction. Optional; only needed for spend estimation models like the Gamma-Gamma model.
es: Columna en el DataFrame de *transacciones* que denota el valor monetario de la transacción. Opcional; solo se necesita para modelos de estimación de gastos como el modelo Gamma-Gamma.

source: **include_first_transaction** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **include_first_transaction** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Default: *False* For predictive CLV modeling, this should be *False*. Set to *True* if performing RFM segmentation.
es: Predeterminado: *Falso* Para el modelado predictivo de CLV, esto debe ser *Falso*. Establezca en *Verdadero* si está realizando segmentación RFM.

source: **sort_transactions** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **sort_transactions** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Default: *True* If raw data is already sorted in chronological order, set to *False* to improve computational efficiency.
es: Predeterminado: *Verdadero* Si los datos sin procesar ya están ordenados en orden cronológico, establezca en *Falso* para mejorar la eficiencia computacional.

source: Returns
es: Devoluciones

source: Dataframe containing summarized RFM data, and test columns for *frequency*, *T*, and *monetary_value* if specified
es: Dataframe que contiene datos RFM resumidos y columnas de prueba para *frecuencia*, *T* y *valor_monetario* si se especifican.
