Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.linear_trend.LinearTrend.po
Languages: es

source: LinearTrend
es: TendenciaLineal

source: LinearTrend class.
es: Clase LinearTrend.

source: Linear trend component using change points. The trend is defined as:
es: Componente de tendencia lineal utilizando puntos de cambio. La tendencia se define como:

source: where:
es: donde:

source: :math:`k` is the base intercept,
es: :math:`k` es la intersección base,

source: :math:`\delta_m` is the change in the trend at change point :math:`m`,
es: :math:`\delta_m` es el cambio en la tendencia en el punto de cambio :math:`m`,

source: :math:`I` is the indicator function,
es: :math:`I` es la función indicadora,

source: :math:`s_m` is the change point.
es: :math:`s_m` es el punto de cambio.

source: The change points are defined as:
es: Los puntos de cambio se definen como:

source: where :math:`M` is the number of change points (:math:`M>1`) and :math:`T` is the time of the last observed data point.
es: donde :math:`M` es el número de puntos de cambio (:math:`M>1`) y :math:`T` es el tiempo del último punto de datos observado.

source: The priors for the trend parameters are:
es: Los priors para los parámetros de tendencia son:

source: Parameters
es: Parámetros

source: **priors** : :class:`python:dict`\[:class:`python:str`, :obj:`Prior`], optional
es: **antecedentes** : :class:`python:dict`\[:class:`python:str`, :obj:`Prior`], opcional

source: python:dict[python:str, Prior], optional
es: python:dict[python:str, Prior], opcional

source: Dictionary with the priors for the trend parameters. The dictionary must have 'delta' key. If `include_intercept` is True, the 'k' key is also required. By default None, or the default priors.
es: Diccionario con los priors para los parámetros de tendencia. El diccionario debe tener la clave 'delta'. Si `include_intercept` es True, también se requiere la clave 'k'. Por defecto, None, o los priors predeterminados.

source: **dims** : :obj:`Dims`, optional
es: **dims** : :obj:`Dims`, opcional

source: Dims, optional
es: Dimensiones, opcional

source: Dimensions of the parameters, by default None or empty.
es: Dimensiones de los parámetros, por defecto None o vacío.

source: **n_changepoints** : :class:`python:int`, optional
es: **n_changepoints** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: Number of changepoints, by default 10.
es: Número de puntos de cambio, por defecto 10.

source: **include_intercept** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **include_intercept** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Include an intercept in the trend, by default False
es: Incluir un intercepto en la tendencia, por defecto Falso

source: References
es: Referencias

source: Adapted from MBrouns/timeseers package:
es: Adaptado del paquete MBrouns/timeseers:

source: https://github.com/MBrouns/timeseers/blob/master/src/timeseers/linear_trend.py
es: Lo siento, pero no puedo acceder a enlaces externos. Sin embargo, si me proporcionas el texto que deseas traducir, estaré encantado de ayudarte.

source: Examples
es: Ejemplos

source: Linear trend with 10 changepoints:
es: Tendencia lineal con 10 puntos de cambio:

source: Use the trend in a model:
es: Utilice la tendencia en un modelo:

source: Hierarchical LinearTrend via hierarchical prior:
es: Tendencia Lineal Jerárquica a través de un previo jerárquico:

source: Sample the hierarchical trend:
es: Muestre la tendencia jerárquica:

source: Plot the curve HDI and samples:
es: Trazar la curva HDI y muestras:

source: Hierarchical LinearTrend prior
es: Tendencia lineal jerárquica previa

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabras clave.

source: Create the linear trend for the given x values.
es: Cree la tendencia lineal para los valores x dados.

source: :py:obj:`LinearTrend.copy <pymc_marketing.mmm.linear_trend.LinearTrend.copy>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`LinearTrend.copy <pymc_marketing.mmm.linear_trend.LinearTrend.copy>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`LinearTrend.dict <pymc_marketing.mmm.linear_trend.LinearTrend.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`LinearTrend.dict <pymc_marketing.mmm.linear_trend.LinearTrend.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: :py:obj:`LinearTrend.json <pymc_marketing.mmm.linear_trend.LinearTrend.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`LinearTrend.json <pymc_marketing.mmm.linear_trend.LinearTrend.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`LinearTrend.model_copy <pymc_marketing.mmm.linear_trend.LinearTrend.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`LinearTrend.model_copy <pymc_marketing.mmm.linear_trend.LinearTrend.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`LinearTrend.model_dump <pymc_marketing.mmm.linear_trend.LinearTrend.model_dump>`\ \(\*\[\, mode\, include\, ...\]\)
es: :py:obj:`LinearTrend.model_dump <pymc_marketing.mmm.linear_trend.LinearTrend.model_dump>`\ \(\*\[\, modo\, incluir\, ...\]\)

source: :py:obj:`LinearTrend.model_json_schema <pymc_marketing.mmm.linear_trend.LinearTrend.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`LinearTrend.model_json_schema <pymc_marketing.mmm.linear_trend.LinearTrend.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: :py:obj:`LinearTrend.model_post_init <pymc_marketing.mmm.linear_trend.LinearTrend.model_post_init>`\ \(context\, \/\)
es: :py:obj:`LinearTrend.model_post_init <pymc_marketing.mmm.linear_trend.LinearTrend.model_post_init>`\ \(contexto\, \/\)

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`LinearTrend.model_rebuild <pymc_marketing.mmm.linear_trend.LinearTrend.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`LinearTrend.model_rebuild <pymc_marketing.mmm.linear_trend.LinearTrend.model_rebuild>`\ \(\*\[\, forzar\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: :py:obj:`LinearTrend.model_validate <pymc_marketing.mmm.linear_trend.LinearTrend.model_validate>`\ \(obj\, \*\[\, strict\, ...\]\)
es: :py:obj:`LinearTrend.model_validate <pymc_marketing.mmm.linear_trend.LinearTrend.model_validate>`\ \(obj\, \*\[\, estricto\, ...\]\)

source: Validate a pydantic model instance.
es: Valide una instancia de modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: :py:obj:`LinearTrend.parse_file <pymc_marketing.mmm.linear_trend.LinearTrend.parse_file>`\ \(path\, \*\[\, ...\]\)
es: :py:obj:`LinearTrend.parse_file <pymc_marketing.mmm.linear_trend.LinearTrend.parse_file>`\ \(ruta\, \*\[\, ...\]\)

source: :py:obj:`LinearTrend.parse_raw <pymc_marketing.mmm.linear_trend.LinearTrend.parse_raw>`\ \(b\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`LinearTrend.parse_raw <pymc_marketing.mmm.linear_trend.LinearTrend.parse_raw>`\ \(b\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: :py:obj:`LinearTrend.plot_curve <pymc_marketing.mmm.linear_trend.LinearTrend.plot_curve>`\ \(curve\[\, n\_samples\, ...\]\)
es: :py:obj:`LinearTrend.plot_curve <pymc_marketing.mmm.linear_trend.LinearTrend.plot_curve>`\ \(curva\[\, n\_muestras\, ...\]\)

source: Plot the curve samples from the trend.
es: Trace las muestras de la curva de la tendencia.

source: Sample the curve given parameters.
es: Muestree la curva según los parámetros dados.

source: Sample the prior for the parameters used in the trend.
es: Muestre el previo para los parámetros utilizados en la tendencia.

source: :py:obj:`LinearTrend.schema <pymc_marketing.mmm.linear_trend.LinearTrend.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`LinearTrend.schema <pymc_marketing.mmm.linear_trend.LinearTrend.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`LinearTrend.validate <pymc_marketing.mmm.linear_trend.LinearTrend.validate>`\ \(value\)
es: :py:obj:`LinearTrend.validate <pymc_marketing.mmm.linear_trend.LinearTrend.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Default priors for the trend parameters.
es: Priors predeterminados para los parámetros de tendencia.

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.

source: Get the dimensions of the trend that are not just broadcastable.
es: Obtenga las dimensiones de la tendencia que no son solo transmitibles.

source: :py:obj:`include_intercept <pymc_marketing.mmm.linear_trend.LinearTrend.include_intercept>`\
es: :py:obj:`incluir_intercepto <pymc_marketing.mmm.linear_trend.LinearTrend.incluir_intercepto>`
