Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.special_priors.MaskedPrior.po
Languages: es

source: Create variables from a prior over only the active entries of a boolean mask.
es: Cree variables a partir de un anterior solo sobre las entradas activas de una máscara booleana.

source: This class is experimental and its API may change in future versions.
es: Esta clase es experimental y su API puede cambiar en versiones futuras.

source: Parameters
es: Parámetros

source: **prior** : :obj:`Prior`
es: **previo** : :obj:`Previo`

source: Prior
es: Previo

source: Base prior whose variable is defined over `prior.dims`. Internally, the variable is created only for the active entries given by `mask` and then expanded back to the full shape with zeros at inactive positions.
es: Base previa cuya variable está definida sobre `prior.dims`. Internamente, la variable se crea solo para las entradas activas dadas por `mask` y luego se expande de nuevo a la forma completa con ceros en las posiciones inactivas.

source: **mask** : :obj:`xarray.DataArray`
es: **máscara** : :obj:`xarray.DataArray`

source: Boolean array with the same dims and shape as `prior.dims` marking active (True) and inactive (False) entries.
es: Array booleano con las mismas dimensiones y forma que `prior.dims` marcando entradas activas (True) e inactivas (False).

source: **active_dim** : :class:`python:str`, optional
es: **active_dim** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: Name of the coordinate indexing the active subset. If not provided, a name is generated as ``"non_null_dims:<dim1>_<dim2>_..."``. If an existing coordinate with the same name has a different length, a suffix with the active length is appended.
es: Nombre de la coordenada que indexa el subconjunto activo. Si no se proporciona, se genera un nombre como ``"non_null_dims:<dim1>_<dim2>_..."``. Si una coordenada existente con el mismo nombre tiene una longitud diferente, se añade un sufijo con la longitud activa.

source: Examples
es: Ejemplos

source: Simple 1D masking.
es: Enmascaramiento 1D simple.

source: Nested parameter priors with dims remapped to the active subset.
es: Parámetros anidados previos con dimensiones reasignadas al subconjunto activo.

source: All entries masked (returns deterministic zeros with original dims).
es: Todas las entradas enmascaradas (devuelve ceros deterministas con las dimensiones originales).

source: Apply over a saturation function priors:
es: Aplicar sobre una función de saturación priors:

source: Masked likelihood over an arbitrary subset of entries (2D example over (date, country)):
es: Probabilidad enmascarada sobre un subconjunto arbitrario de entradas (ejemplo 2D sobre (fecha, país)):

source: Methods
es: Métodos

source: :py:obj:`MaskedPrior.__init__ <pymc_marketing.special_priors.MaskedPrior.__init__>`\ \(prior\, mask\[\, active\_dim\]\)
es: :py:obj:`MaskedPrior.__init__ <pymc_marketing.special_priors.MaskedPrior.__init__>`\ \(prior\, máscara\[\, dim\_activa\]\)

source: :py:obj:`MaskedPrior.create_likelihood_variable <pymc_marketing.special_priors.MaskedPrior.create_likelihood_variable>`\ \(name\, ...\)
es: :py:obj:`MaskedPrior.create_likelihood_variable <pymc_marketing.special_priors.MaskedPrior.create_likelihood_variable>`\ \(nombre\, ...\)

source: Create an observed variable over the active subset and expand to full dims.
es: Cree una variable observada sobre el subconjunto activo y expanda a dimensiones completas.

source: :py:obj:`MaskedPrior.create_variable <pymc_marketing.special_priors.MaskedPrior.create_variable>`\ \(name\)
es: :py:obj:`MaskedPrior.create_variable <pymc_marketing.special_priors.MaskedPrior.create_variable>`\ \(nombre\)

source: Create a deterministic variable with full dims using the active subset.
es: Cree una variable determinista con dimensiones completas utilizando el subconjunto activo.

source: :py:obj:`MaskedPrior.from_dict <pymc_marketing.special_priors.MaskedPrior.from_dict>`\ \(data\)
es: :py:obj:`MaskedPrior.from_dict <pymc_marketing.special_priors.MaskedPrior.from_dict>`\ \(datos\)

source: Deserialize MaskedPrior from dictionary created by ``to_dict``.
es: Deserializar MaskedPrior del diccionario creado por ``to_dict``.

source: :py:obj:`MaskedPrior.to_dict <pymc_marketing.special_priors.MaskedPrior.to_dict>`\ \(\)
es: msgid: :py:obj:`MaskedPrior.to_dict <pymc_marketing.special_priors.MaskedPrior.to_dict>`\ \(\) msgstr: :py:obj:`MaskedPrior.to_dict <pymc_marketing.special_priors.MaskedPrior.to_dict>`\ \(\)

source: Serialize MaskedPrior to a JSON-serializable dictionary.
es: Serializar MaskedPrior a un diccionario que se puede serializar en JSON.
