Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.plotting.plot_expected_purchases_over_time.po
Languages: es

source: plot\_expected\_purchases\_over\_time
es: trazar\_compras\_esperadas\_a\_lo\_largo\_del\_tiempo

source: Plot actual and expected purchases over time for a fitted ``BetaGeoModel`` or ``ParetoNBDModel``.
es: Representar las compras reales y esperadas a lo largo del tiempo para un ``BetaGeoModel`` o ``ParetoNBDModel`` ajustado.

source: This function is based on the formulation on page 8 of [R791c56446d1e-1]_. Specifically, we take only customers who have made their first purchase before the specified number of ``t`` time periods, and run ``expected_purchases_new_customer()`` for all remaining time periods. Results can be either cumulative or incremental.
es: Esta función se basa en la formulación en la página 8 de [R791c56446d1e-1]_. Específicamente, tomamos solo a los clientes que han realizado su primera compra antes del número especificado de ``t`` períodos de tiempo, y ejecutamos ``expected_purchases_new_customer()`` para todos los períodos de tiempo restantes. Los resultados pueden ser acumulativos o incrementales.

source: Adapted from the legacy ``lifetimes`` library: https://github.com/CamDavidsonPilon/lifetimes/blob/master/lifetimes/plotting.py#L392
es: Adaptado de la biblioteca heredada ``lifetimes``: https://github.com/CamDavidsonPilon/lifetimes/blob/master/lifetimes/plotting.py#L392

source: Parameters
es: Parámetros

source: **model**
es: **modelo**

source: A fitted ``BetaGeoModel`` or ``ParetoNBDModel``.
es: Un modelo ``BetaGeoModel`` o ``ParetoNBDModel`` ajustado.

source: **purchase_history** : :obj:`~pandas.DataFrame`
es: **historial_de_compras** : :obj:`~pandas.DataFrame`

source: A Pandas DataFrame containing *customer_id_col* and *datetime_col*.
es: Un DataFrame de Pandas que contiene *customer_id_col* y *datetime_col*.

source: Column in the *purchases* DataFrame denoting the *customer_id*.
es: Columna en el DataFrame de *compras* que denota el *customer_id*.

source: Column in the *purchases* DataFrame denoting datetimes purchase were made.
es: Columna en el DataFrame *purchases* que denota las fechas y horas en las que se realizaron las compras.

source: Number of time units since earliest purchase to include in plot.
es: Número de unidades de tiempo desde la compra más temprana para incluir en el gráfico.

source: Default: *True* Plot cumulative purchases over time. Set to *False* to plot incremental purchases.
es: Predeterminado: *Verdadero* Grafique las compras acumulativas a lo largo del tiempo. Establezca en *Falso* para graficar las compras incrementales.

source: **t_start_eval** : :class:`python:int`, optional
es: **t_start_eval** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: If testing model on unobserved data, specify number of time units in training data to add an indicator for the start of the testing period.
es: Si se está probando el modelo con datos no observados, especifique el número de unidades de tiempo en los datos de entrenamiento para agregar un indicador para el inicio del período de prueba.

source: **datetime_format** : :class:`python:str`, optional
es: **datetime_format** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: A string that represents the timestamp format. Useful if Pandas doesn't recognize the provided format.
es: Una cadena que representa el formato de la marca de tiempo. Útil si Pandas no reconoce el formato proporcionado.

source: **time_unit** : :class:`python:str`, optional
es: **unidad_tiempo** : :class:`python:str`, opcional

source: Time granularity for study. Default: 'D' for days. Possible values listed here: https://numpy.org/devdocs/reference/arrays.datetime.html#datetime-units
es: Granularidad de tiempo para el estudio. Predeterminado: 'D' para días. Los valores posibles se enumeran aquí: https://numpy.org/devdocs/reference/arrays.datetime.html#datetime-units

source: **time_scaler** : :class:`python:int`, optional
es: **time_scaler** : :class:`python:int`, opcional

source: Default: 1. Scales *recency* & *T* to a different time granularity. This is useful for datasets spanning many years, and running predictions in different time scales.
es: Predeterminado: 1. Escala *recencia* y *T* a una granularidad temporal diferente. Esto es útil para conjuntos de datos que abarcan muchos años y para realizar predicciones en diferentes escalas de tiempo.

source: **sort_purchases** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **sort_purchases** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Default: *True* If *purchase_history* DataFrame is already sorted in chronological order, set to *False* to improve computational efficiency.
es: Predeterminado: *Verdadero* Si el DataFrame *purchase_history* ya está ordenado en orden cronológico, establezca en *Falso* para mejorar la eficiencia computacional.

source: **set_index_date** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **set_index_date** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Set to True to return a dataframe with a datetime index.
es: Establezca en True para devolver un dataframe con un índice de tipo datetime.

source: **title** : :class:`python:str`, optional
es: **título** : :class:`python:str`, opcional

source: Figure title
es: Título de la figura

source: **xlabel** : :class:`python:str`, optional
es: **xlabel** : :class:`python:str`, opcional

source: Figure xlabel
es: Etiqueta del eje x

source: **ylabel** : :class:`python:str`, optional
es: **ylabel** : :class:`python:str`, opcional

source: Figure ylabel
es: Etiqueta del eje y

source: **ax** : :obj:`matplotlib.Axes`, optional
es: **ax** : :obj:`matplotlib.Axes`, opcional

source: matplotlib.Axes, optional
es: matplotlib.Axes, opcional

source: A matplotlib Axes instance. Creates new axes instance by default.
es: Una instancia de Axes de matplotlib. Crea una nueva instancia de ejes por defecto.

source: Additional arguments to pass into the pandas.DataFrame.plot command.
es: Argumentos adicionales para pasar al comando pandas.DataFrame.plot.

source: Returns
es: Devoluciones

source: axes: :obj:`matplotlib.AxesSubplot`
es: ejes: :obj:`matplotlib.AxesSubplot`

source: References
es: Referencias

source: Fader, Peter S., Bruce G.S. Hardie, and Ka Lok Lee (2005),
es: Fader, Peter S., Bruce G.S. Hardie y Ka Lok Lee (2005),

source: A Note on Implementing the Pareto/NBD Model in MATLAB. http://brucehardie.com/notes/008/
es: Una nota sobre la implementación del modelo Pareto/NBD en MATLAB. http://brucehardie.com/notes/008/
