Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.log_mmm.po
Languages: es

source: Log a PyMC-Marketing MMM as a native MLflow model for the current run.
es: Registrar un MMM de PyMC-Marketing como un modelo nativo de MLflow para la ejecución actual.

source: Parameters
es: Parámetros

source: The MMM to be logged.
es: El MMM debe ser registrado.

source: **artifact_path** : :class:`python:str`, optional
es: **ruta_del_artifacto** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The path to the artifact to be logged. Defaults to "mmm_model".
es: La ruta al artefacto que se registrará. Por defecto es "mmm_model".

source: **conda_env** : :class:`python:dict`, optional
es: **conda_env** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: A dictionary representation of a Conda environment. Defaults to the default conda environment.
es: Una representación en diccionario de un entorno Conda. Por defecto, se utiliza el entorno conda predeterminado.

source: **registered_model_name** : :class:`python:str`, optional
es: **registered_model_name** : :class:`python:str`, opcional

source: The name of the registered model to be logged. Defaults to None. If specified, the model will be registered under this name, otherwise it will not be registered.
es: El nombre del modelo registrado que se registrará. Por defecto es None. Si se especifica, el modelo se registrará bajo este nombre; de lo contrario, no se registrará.

source: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to extend the inference data with predictions. Used for all prediction methods. Defaults to False.
es: Si se debe extender los datos de inferencia con predicciones. Utilizado para todos los métodos de predicción. Por defecto es False.

source: **combined** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **combinado** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to combine chain and draw dims into sample. Won't work if a dim named sample already exists. Used for posterior/prior predictive sampling. Defaults to True.
es: Si se debe combinar las dimensiones de cadena y de dibujo en la muestra. No funcionará si ya existe una dimensión llamada sample. Se utiliza para el muestreo predictivo posterior/anterior. Por defecto es True.

source: **include_last_observations** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **include_last_observations** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to include the last observations of training data for adstock transformation. Assumes X are next predictions following training data. Used for all prediction methods. Defaults to False.
es: Si incluir las últimas observaciones de los datos de entrenamiento para la transformación de adstock. Se asume que X son las siguientes predicciones que siguen a los datos de entrenamiento. Utilizado para todos los métodos de predicción. Por defecto es False.

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to return predictions in original scale of target variable. Used for all prediction methods. Defaults to True.
es: Si se deben devolver las predicciones en la escala original de la variable objetivo. Utilizado para todos los métodos de predicción. Por defecto es True.

source: Notes
es: Notas

source: This function logs the model as a native MLflow model, this is different to the full model object, which includes the InferenceData. Doing this allows for the model to be stored in the MLFlow registry, helping with model versioning and deployment.
es: Esta función registra el modelo como un modelo nativo de MLflow, lo cual es diferente del objeto completo del modelo, que incluye los InferenceData. Hacer esto permite que el modelo se almacene en el registro de MLFlow, ayudando con la versionado y el despliegue del modelo.

source: Examples
es: Ejemplos

source: MLFlow Registering for a PyMC-Marketing MMM:
es: MLFlow Registrando para un PyMC-Marketing MMM:
