Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.components.*.po
Languages: es

source: Base class for adstock and saturation functions used in MMM.
es: Clase base para funciones de adstock y saturación utilizadas en MMM.

source: Use the subclasses directly for custom transformations:
es: Utilice las subclases directamente para transformaciones personalizadas:

source: Adstock Transformations: :class:`pymc_marketing.mmm.components.adstock.AdstockTransformation`
es: Transformaciones de Adstock: :class:`pymc_marketing.mmm.components.adstock.AdstockTransformation`

source: Saturation Transformations: :class:`pymc_marketing.mmm.components.saturation.SaturationTransformation`
es: Transformaciones de Saturación: :class:`pymc_marketing.mmm.components.saturation.SaturationTransformation`

source: Functions
es: Funciones

source: :py:obj:`create_registration_meta <pymc_marketing.mmm.components.base.create_registration_meta>`\ \(subclasses\)
es: :py:obj:`create_registration_meta <pymc_marketing.mmm.components.base.create_registration_meta>`\ \(subclases\)

source: Create a metaclass for registering subclasses.
es: Cree una metaclase para registrar subclases.

source: Index a variable based on the provided dimensions and index.
es: Indexar una variable según las dimensiones e índice proporcionados.

source: Classes
es: Clases

source: :py:obj:`Transformation <pymc_marketing.mmm.components.base.Transformation>`\ \(\[priors\, prefix\]\)
es: :py:obj:`Transformación <pymc_marketing.mmm.components.base.Transformation>`\ \(\[priors\, prefix\]\)

source: Base class for adstock and saturation functions.
es: Clase base para funciones de adstock y saturación.

source: Exceptions
es: Excepciones

source: :py:obj:`DuplicatedTransformationError <pymc_marketing.mmm.components.base.DuplicatedTransformationError>`\ \(name\, lookup\_name\)
es: :py:obj:`DuplicatedTransformationError <pymc_marketing.mmm.components.base.DuplicatedTransformationError>`\ \(nombre\, nombre\_de\_búsqueda\)

source: Exception when a transformation is duplicated.
es: Excepción cuando se duplica una transformación.

source: Error if the function doesn't have a data parameter.
es: Error si la función no tiene un parámetro de datos.

source: :py:obj:`ParameterPriorException <pymc_marketing.mmm.components.base.ParameterPriorException>`\ \(priors\, parameters\)
es: :py:obj:`ParameterPriorException <pymc_marketing.mmm.components.base.ParameterPriorException>`\ \(prior\, parámetros\)

source: Error when the functions and specified priors don't match up.
es: Error cuando las funciones y los priors especificados no coinciden.
