Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.lift_test.po
Languages: es

source: lift\_test
es: prueba\_de\_elevación

source: Adding lift tests as observations of saturation function.
es: Añadiendo pruebas de elevación como observaciones de la función de saturación.

source: This provides the inner workings of `MMM.add_lift_test_measurements` method. Other methods can be MMM.add_cost_per_target_calibration. Use any of these methods directly while working with the `MMM` class.
es: Esto proporciona el funcionamiento interno del método `MMM.add_lift_test_measurements`. Otros métodos pueden ser MMM.add_cost_per_target_calibration. Utilice cualquiera de estos métodos directamente al trabajar con la clase `MMM`.

source: Functions
es: Funciones

source: Add ``pm.Potential`` penalties to calibrate cost-per-target.
es: Agregue las penalizaciones ``pm.Potential`` para calibrar el costo por objetivo.

source: Add lift measurements to the likelihood from a saturation transformation.
es: Agregue las medidas de elevación a la probabilidad de una transformación de saturación.

source: Add saturation observations to the likelihood of the model.
es: Agregue observaciones de saturación a la probabilidad del modelo.

source: :py:obj:`assert_is_subset <pymc_marketing.mmm.lift_test.assert_is_subset>`\ \(required\, available\)
es: :py:obj:`assert_is_subset <pymc_marketing.mmm.lift_test.assert_is_subset>`\ (requerido, disponible)

source: Check if the available set is a subset of the required set.
es: Verifique si el conjunto disponible es un subconjunto del conjunto requerido.

source: Check if the lift test results satisfy the increasing assumption.
es: Verifique si los resultados de la prueba del ascensor satisfacen la suposición de aumento.

source: :py:obj:`create_time_varying_saturation <pymc_marketing.mmm.lift_test.create_time_varying_saturation>`\ \(saturation\, ...\)
es: :py:obj:`create_time_varying_saturation <pymc_marketing.mmm.lift_test.create_time_varying_saturation>`\ (saturación\, ...)

source: Return function and variable mapping that use a time-varying variable.
es: Devolver la función y el mapeo de variables que utilizan una variable que varía con el tiempo.

source: :py:obj:`create_variable_indexer <pymc_marketing.mmm.lift_test.create_variable_indexer>`\ \(model\, indices\)
es: :py:obj:`create_variable_indexer <pymc_marketing.mmm.lift_test.create_variable_indexer>`\ \(modelo\, índices\)

source: Create a function to index variables in the model.
es: Cree una función para indexar variables en el modelo.

source: :py:obj:`exact_row_indices <pymc_marketing.mmm.lift_test.exact_row_indices>`\ \(df\, model\)
es: :py:obj:`exact_row_indices <pymc_marketing.mmm.lift_test.exact_row_indices>`\ \(df\, modelo\)

source: Get indices in the model for each row in the DataFrame.
es: Obtenga los índices en el modelo para cada fila en el DataFrame.

source: Scale the lift measurements for a specific channel.
es: Escalar las medidas de elevación para un canal específico.

source: Scale the DataFrame with lift test results to be used in the model.
es: Escalar el DataFrame con los resultados de la prueba de elevación para ser utilizados en el modelo.

source: :py:obj:`scale_target_for_lift_measurements <pymc_marketing.mmm.lift_test.scale_target_for_lift_measurements>`\ \(target\, ...\)
es: :py:obj:`scale_target_for_lift_measurements <pymc_marketing.mmm.lift_test.scale_target_for_lift_measurements>`\ \(objetivo\, ...\)

source: Scale the target for the lift measurements.
es: Escale el objetivo para las mediciones de elevación.

source: Exceptions
es: Excepciones

source: :py:obj:`MissingValueError <pymc_marketing.mmm.lift_test.MissingValueError>`\ \(missing\_values\, ...\)
es: :py:obj:`MissingValueError <pymc_marketing.mmm.lift_test.MissingValueError>`\ \(valores\_faltantes\, ...\)

source: Error when values are missing from a required set.
es: Error cuando faltan valores de un conjunto requerido.

source: Data is not monotonic.
es: Los datos no son monótonos.

source: :py:obj:`UnalignedValuesError <pymc_marketing.mmm.lift_test.UnalignedValuesError>`\ \(unaligned\_values\)
es: :py:obj:`UnalignedValuesError <pymc_marketing.mmm.lift_test.UnalignedValuesError>`\ \(valores\_no\_alineados\)

source: Raised when some values are not aligned.
es: Se levantó cuando algunos valores no están alineados.
