Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.log_sample_diagnostics.po
Languages: es

source: log\_sample\_diagnostics
es: log\_muestra\_diagnósticos

source: Log sample diagnostics to MLflow.
es: Registrar muestras de diagnóstico en MLflow.

source: Includes:
es: Incluye:

source: The total number of divergences
es: El número total de divergencias

source: The total sampling time in seconds (if available)
es: El tiempo total de muestreo en segundos (si está disponible)

source: The time per draw in seconds (if available)
es: El tiempo por sorteo en segundos (si está disponible)

source: The number of tuning steps (if available)
es: El número de pasos de ajuste (si está disponible)

source: The number of draws
es: El número de sorteos

source: The number of chains
es: El número de cadenas

source: The inference library used
es: La biblioteca de inferencia utilizada

source: The version of the inference library
es: La versión de la biblioteca de inferencia

source: The version of ArviZ
es: La versión de ArviZ

source: Parameters
es: Parámetros

source: The InferenceData object returned by the sampling method.
es: El objeto InferenceData devuelto por el método de muestreo.

source: **tune** : :class:`python:int`, optional
es: **ajuste** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: The number of tuning steps used in sampling. Derived from the inference data if not provided.
es: El número de pasos de ajuste utilizados en la muestreo. Derivado de los datos de inferencia si no se proporciona.
