Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.HSGPBase.po
Languages: es

source: Shared logic between HSGP and HSGPPeriodic.
es: Lógica compartida entre HSGP y HSGPPeriodic.

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabra clave.

source: :py:obj:`HSGPBase.copy <pymc_marketing.mmm.hsgp.HSGPBase.copy>`\ \(\*\[\, include\, exclude\, update\, ...\]\)
es: :py:obj:`HSGPBase.copy <pymc_marketing.mmm.hsgp.HSGPBase.copy>`\ \(\*\[\, incluir\, excluir\, actualizar\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`HSGPBase.create_variable <pymc_marketing.mmm.hsgp.HSGPBase.create_variable>`\ \(name\)
es: :py:obj:`HSGPBase.create_variable <pymc_marketing.mmm.hsgp.HSGPBase.create_variable>`\ \(nombre\)

source: Create a variable from configuration.
es: Cree una variable a partir de la configuración.

source: :py:obj:`HSGPBase.deterministics_to_replace <pymc_marketing.mmm.hsgp.HSGPBase.deterministics_to_replace>`\ \(name\)
es: msgid: :py:obj:`HSGPBase.deterministics_to_replace <pymc_marketing.mmm.hsgp.HSGPBase.deterministics_to_replace>`\ \(name\) msgstr: :py:obj:`HSGPBase.deterministics_to_replace <pymc_marketing.mmm.hsgp.HSGPBase.deterministics_to_replace>`\ \(name\)

source: Name of the Deterministic variables that are replaced with pm.Flat for out-of-sample.
es: Nombre de las variables determinísticas que se reemplazan con pm.Flat para fuera de muestra.

source: :py:obj:`HSGPBase.dict <pymc_marketing.mmm.hsgp.HSGPBase.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPBase.dict <pymc_marketing.mmm.hsgp.HSGPBase.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: :py:obj:`HSGPBase.json <pymc_marketing.mmm.hsgp.HSGPBase.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`HSGPBase.json <pymc_marketing.mmm.hsgp.HSGPBase.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`HSGPBase.model_copy <pymc_marketing.mmm.hsgp.HSGPBase.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`HSGPBase.model_copy <pymc_marketing.mmm.hsgp.HSGPBase.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`HSGPBase.model_dump <pymc_marketing.mmm.hsgp.HSGPBase.model_dump>`\ \(\*\[\, mode\, include\, ...\]\)
es: :py:obj:`HSGPBase.model_dump <pymc_marketing.mmm.hsgp.HSGPBase.model_dump>`\ \(\*\[\, modo\, incluir\, ...\]\)

source: :py:obj:`HSGPBase.model_json_schema <pymc_marketing.mmm.hsgp.HSGPBase.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`HSGPBase.model_json_schema <pymc_marketing.mmm.hsgp.HSGPBase.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`HSGPBase.model_rebuild <pymc_marketing.mmm.hsgp.HSGPBase.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`HSGPBase.model_rebuild <pymc_marketing.mmm.hsgp.HSGPBase.model_rebuild>`\ \(\*\[\, forzar\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: :py:obj:`HSGPBase.model_validate <pymc_marketing.mmm.hsgp.HSGPBase.model_validate>`\ \(obj\, \*\[\, strict\, ...\]\)
es: :py:obj:`HSGPBase.model_validate <pymc_marketing.mmm.hsgp.HSGPBase.model_validate>`\ \(obj\, \*\[\, estricto\, ...\]\)

source: Validate a pydantic model instance.
es: Valide una instancia del modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: :py:obj:`HSGPBase.parse_file <pymc_marketing.mmm.hsgp.HSGPBase.parse_file>`\ \(path\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`HSGPBase.parse_file <pymc_marketing.mmm.hsgp.HSGPBase.parse_file>`\ \(ruta\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: :py:obj:`HSGPBase.parse_raw <pymc_marketing.mmm.hsgp.HSGPBase.parse_raw>`\ \(b\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`HSGPBase.parse_raw <pymc_marketing.mmm.hsgp.HSGPBase.parse_raw>`\ \(b\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: :py:obj:`HSGPBase.plot_curve <pymc_marketing.mmm.hsgp.HSGPBase.plot_curve>`\ \(curve\[\, n\_samples\, ...\]\)
es: :py:obj:`HSGPBase.plot_curve <pymc_marketing.mmm.hsgp.HSGPBase.plot_curve>`\ \(curva\[\, n\_muestras\, ...\]\)

source: Plot the curve.
es: Trazar la curva.

source: Register the data to be used in the model.
es: Registre los datos que se utilizarán en el modelo.

source: Sample from the prior distribution.
es: Muestra de la distribución previa.

source: :py:obj:`HSGPBase.schema <pymc_marketing.mmm.hsgp.HSGPBase.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`HSGPBase.schema <pymc_marketing.mmm.hsgp.HSGPBase.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`HSGPBase.schema_json <pymc_marketing.mmm.hsgp.HSGPBase.schema_json>`\ \(\*\[\, by\_alias\, ref\_template\]\)
es: :py:obj:`HSGPBase.schema_json <pymc_marketing.mmm.hsgp.HSGPBase.schema_json>`\ \(\*\[\, por\_alias\, ref\_template\]\)

source: :py:obj:`HSGPBase.to_dict <pymc_marketing.mmm.hsgp.HSGPBase.to_dict>`\ \(\)
es: msgid: :py:obj:`HSGPBase.to_dict <pymc_marketing.mmm.hsgp.HSGPBase.to_dict>`\ \(\) msgstr: :py:obj:`HSGPBase.to_dict <pymc_marketing.mmm.hsgp.HSGPBase.to_dict>`\ \(\)

source: Convert the object to a dictionary.
es: Convierte el objeto a un diccionario.

source: :py:obj:`HSGPBase.validate <pymc_marketing.mmm.hsgp.HSGPBase.validate>`\ \(value\)
es: :py:obj:`HSGPBase.validate <pymc_marketing.mmm.hsgp.HSGPBase.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.

source: :py:obj:`demeaned_basis <pymc_marketing.mmm.hsgp.HSGPBase.demeaned_basis>`\
es: :py:obj:`base_demeanada <pymc_marketing.mmm.hsgp.HSGPBase.base_demeanada>`
