Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.portfolio_entropy.po
Languages: es

source: Calculate the entropy of a portfolio's asset weights to assess diversification.
es: Calcule la entropía de los pesos de los activos de una cartera para evaluar la diversificación.

source: Portfolio entropy, derived from Shannon entropy in information theory, quantifies the dispersion of asset weights within a portfolio. A higher entropy value indicates a more diversified portfolio, as investments are more evenly distributed across assets. Conversely, a lower entropy suggests concentration in fewer assets, implying higher risk.
es: La entropía de la cartera, derivada de la entropía de Shannon en la teoría de la información, cuantifica la dispersión de los pesos de los activos dentro de una cartera. Un valor de entropía más alto indica una cartera más diversificada, ya que las inversiones están más uniformemente distribuidas entre los activos. Por el contrario, una entropía más baja sugiere concentración en menos activos, lo que implica un mayor riesgo.

source: The entropy is calculated using the formula:
es: La entropía se calcula utilizando la fórmula:

source: where :math:`w_i` represents the weight of asset \( i \) in the portfolio.
es: donde :math:`w_i` representa el peso del activo \( i \) en la cartera.

source: Parameters
es: Parámetros

source: **samples** : :obj:`pt.TensorVariable`
es: **muestras** : :obj:`pt.TensorVariable`

source: 1D PyTensor tensor variable containing samples.
es: Variable de tensor PyTensor 1D que contiene muestras.

source: **budgets** : :obj:`pt.TensorVariable`
es: **presupuestos** : :obj:`pt.TensorVariable`

source: 1D PyTensor tensor variable representing the investment amounts in each asset.
es: Variable tensor 1D PyTensor que representa los montos de inversión en cada activo.

source: Returns
es: Devoluciones

source: Portfolio entropy value.
es: Valor de entropía del portafolio.

source: References
es: Referencias

source: Bera, A. K., & Park, S. Y. (2008). Optimal Portfolio Diversification using the Maximum Entropy Principle.
es: Bera, A. K., y Park, S. Y. (2008). Diversificación óptima de carteras utilizando el principio de máxima entropía.

source: Pola, G. (2013). On entropy and portfolio diversification. *Journal of Asset Management*, 14(4), 228-238.
es: Pola, G. (2013). Sobre la entropía y la diversificación de carteras. *Revista de Gestión de Activos*, 14(4), 228-238.
