Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.plotting.plot_frequency_recency_matrix.po
Languages: es

source: plot\_frequency\_recency\_matrix
es: matriz\_frecuencia\_recencia\_trama

source: Plot expected purchases in *future_t* time periods as a heatmap based on customer population *frequency* and *recency*.
es: Representar las compras esperadas en *future_t* períodos de tiempo como un mapa de calor basado en la *frecuencia* y la *recencia* de la población de clientes.

source: Parameters
es: Parámetros

source: **model: CLV model**
es: **modelo: modelo CLV**

source: A fitted CLV model.
es: Un modelo CLV ajustado.

source: **future_t: float, optional**
es: **future_t: flotante, opcional**

source: Future time periods over which to run predictions.
es: Períodos de tiempo futuros sobre los cuales realizar predicciones.

source: **max_frequency: int, optional**
es: **max_frequency: int, opcional**

source: The maximum *frequency* to plot. Defaults to max observed *frequency*.
es: La *frecuencia* máxima a graficar. Por defecto, se establece en la *frecuencia* máxima observada.

source: **max_recency: int, optional**
es: **max_recency: int, opcional**

source: The maximum *recency* to plot. This also determines the age of the customer. Defaults to max observed *recency*.
es: La *recencia* máxima a trazar. Esto también determina la antigüedad del cliente. Por defecto, se establece en la *recencia* máxima observada.

source: **title: str, optional**
es: **título: str, opcional**

source: Figure title
es: Título de la figura

source: **xlabel: str, optional**
es: **xlabel: str, opcional**

source: Figure xlabel
es: Etiqueta de figura

source: **ylabel: str, optional**
es: **ylabel: str, opcional**

source: Figure ylabel
es: Etiqueta del eje y

source: **ax: plt.Axes, optional**
es: **ax: plt.Axes, opcional**

source: A matplotlib axes instance. Creates new axes instance by default.
es: Una instancia de ejes de matplotlib. Crea una nueva instancia de ejes por defecto.

source: Passed into the matplotlib.imshow command.
es: Pasado al comando matplotlib.imshow.

source: Returns
es: Devoluciones

source: axes: :obj:`matplotlib.AxesSubplot`
es: ejes: :obj:`matplotlib.AxesSubplot`
