Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.lift_test.create_variable_indexer.po
Languages: es

source: create\_variable\_indexer
es: crear\_indexador\_de\_variables

source: Create a function to index variables in the model.
es: Cree una función para indexar variables en el modelo.

source: Parameters
es: Parámetros

source: **model** : :obj:`pm.Model`
es: **modelo** : :obj:`pm.Model`

source: PyMC model
es: Modelo PyMC

source: **indices** : :class:`python:dict`\[:class:`python:str`, :obj:`np.ndarray <numpy.ndarray>`]
es: **índices** : :class:`python:dict`\[:class:`python:str`, :obj:`np.ndarray <numpy.ndarray>`]

source: Dictionary of indices for the indices in the model.
es: Diccionario de índices para los índices en el modelo.

source: Returns
es: Devoluciones

source: Function to index variables in the model.
es: Función para indexar variables en el modelo.

source: Raises
es: Aumentos

source: If the variable is not in the model.
es: Si la variable no está en el modelo.

source: Examples
es: Ejemplos

source: Create a variable indexer:
es: Crear un indexador de variables:

source: Get alpha at indices:
es: Obtener alfa en los índices:

source: Get beta at indices:
es: Obtener beta en índices:
