Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.tanh_saturation_baselined.po
Languages: es

source: tanh\_saturation\_baselined
es: tanh\_saturación\_de\_referencia

source: Baselined Tanh Saturation.
es: Saturación Tanh de referencia.

source: This parameterization that is easier than :func:`tanh_saturation` to use for industry applications where domain knowledge is an essence.
es: Esta parametrización es más fácil de usar que :func:`tanh_saturation` para aplicaciones industriales donde el conocimiento del dominio es esencial.

source: In a nutshell, it is an alternative parameterization of the reach function is given by:
es: En resumen, se presenta una parametrización alternativa de la función de alcance dada por:

source: where:
es: donde:

source: :math:`x_0` is the "reference point". This is a point chosen by the user (not given a prior) where they expect most of their data to lie. For example, if you're spending between 50 and 150 dollars on a particular channel, you might choose :math:`x_0 = 100`. Suggested value is median channel spend: ``np.median(spend)``.
es: :math:`x_0` es el "punto de referencia". Este es un punto elegido por el usuario (no se proporciona un previo) donde espera que la mayor parte de sus datos se encuentre. Por ejemplo, si está gastando entre 50 y 150 dólares en un canal particular, podría elegir :math:`x_0 = 100`. El valor sugerido es el gasto mediano del canal: ``np.median(spend)``.

source: :math:`g` is the "gain", which is the value of the CAC (:math:`c_0`) at the reference point. You have to set a prior on what you think the CAC is when you spend :math:`x_0 = 100`. Imagine you have four advertising channels, and you acquired 1000 new users. If each channel performed equally well, and advertising drove all sales, you might expect that you gained 250 users from each channel. Here, your "gain" would be :math:`250 / 100 = 2.5`. Suggested prior is ``pm.Exponential``
es: :math:`g` es la "ganancia", que es el valor del CAC (:math:`c_0`) en el punto de referencia. Debe establecer un previo sobre lo que piensa que es el CAC cuando gasta :math:`x_0 = 100`. Imagine que tiene cuatro canales de publicidad y adquirió 1000 nuevos usuarios. Si cada canal tuvo un rendimiento igualmente bueno, y la publicidad impulsó todas las ventas, podría esperar que ganó 250 usuarios de cada canal. Aquí, su "ganancia" sería :math:`250 / 100 = 2.5`. El previo sugerido es ``pm.Exponential``.

source: :math:`r`, the overspend fraction is telling you where the reference point is.
es: :math:`r`, la fracción de gasto excesivo te está indicando dónde se encuentra el punto de referencia.

source: :math:`0` - we can increase our budget by a lot to reach the saturated region, the diminishing returns are not visible yet.
es: :math:`0` - podemos aumentar nuestro presupuesto considerablemente para alcanzar la región saturada, los rendimientos decrecientes aún no son visibles.

source: :math:`1` - the reference point is already in the saturation region and additional dollar spend will not lead to any new users.
es: :math:`1` - el punto de referencia ya se encuentra en la región de saturación y el gasto adicional en dólares no conducirá a nuevos usuarios.

source: :math:`0.8`, you can still increase acquired users by :math:`50\%` as much you get in the reference point by increasing the budget. :math:`x_0` effect is 20% away from saturation point
es: :math:`0.8`, aún puedes aumentar los usuarios adquiridos en :math:`50\%` tanto como obtienes en el punto de referencia al aumentar el presupuesto. El efecto de :math:`x_0` está a un 20% del punto de saturación.

source: Suggested prior is ``pm.Beta``
es: Sugerido anterior es ``pm.Beta``

source: The reference point :math:`x_0` has to be set within the range of the actual spends. As in, you buy ads three times and spend :math:`5`, :math:`6` and :math:`7` dollars, :math:`x_0` has to be set within :math:`[5, 7]`, so not :math:`4` not :math:`8`. Otherwise the posterior of r and gain becomes a skinny diagonal line. It could be very relevant if there is very little spend observations for a particular channel.
es: El punto de referencia :math:`x_0` debe establecerse dentro del rango de los gastos reales. Es decir, si compras anuncios tres veces y gastas :math:`5`, :math:`6` y :math:`7` dólares, :math:`x_0` debe establecerse dentro de :math:`[5, 7]`, por lo que no puede ser :math:`4` ni :math:`8`. De lo contrario, la posterior de r y la ganancia se convierte en una línea diagonal delgada. Podría ser muy relevante si hay muy pocas observaciones de gasto para un canal particular.

source: The original reach or saturation function used in an MMM is formulated as
es: La función original de alcance o saturación utilizada en un MMM se formula como

source: :math:`\beta` is the saturation, or the limit of the total number of new users obtained when an infinite number of dollars are spent on that channel.
es: :math:`\beta` es la saturación, o el límite del número total de nuevos usuarios obtenidos cuando se gastan una cantidad infinita de dólares en ese canal.

source: :math:`c_0` is the cost per acquisition (CAC0), so the initial cost per new user.
es: :math:`c_0` es el costo por adquisición (CAC0), por lo que el costo inicial por nuevo usuario.

source: :math:`\frac{1}{c_0}` is the inverse of the CAC0, so it's the number of new users we might expect after spending our first dollar.
es: :math:`\frac{1}{c_0}` es el inverso del CAC0, por lo que es el número de nuevos usuarios que podríamos esperar después de gastar nuestro primer dólar.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-tanh_saturation_baselined-1.pdf>`)

source: Parameters
es: Parámetros

source: Input tensor.
es: Tensor de entrada.

source: Baseline for saturation.
es: Línea base para la saturación.

source: **gain** : :obj:`tensor`, :obj:`by` default 0.5
es: **ganancia** : :obj:`tensor`, :obj:`por` defecto 0.5

source: tensor, by default 0.5
es: tensor, por defecto 0.5

source: ROAS at the baseline point, mathematically as :math:`gain = f(x0) / x0`.
es: ROAS en el punto base, matemáticamente como :math:`ganancia = f(x0) / x0`.

source: **r** : :obj:`tensor`, :obj:`by` default 0.5
es: **r** : :obj:`tensor`, :obj:`por` defecto 0.5

source: The overspend fraction, mathematically as :math:`r = f(x0) / \text{saturation}`.
es: La fracción de gasto excesivo, matemáticamente como :math:`r = f(x0) / \text{saturation}`.

source: Returns
es: Devoluciones

source: Transformed tensor.
es: Tensor transformado.

source: References
es: Referencias

source: Developed by Max Kochurov and Aziz Al-Maeeni doing innovative work in `PyMC Labs <pymc-labs.com>`_.
es: Desarrollado por Max Kochurov y Aziz Al-Maeeni, realizando un trabajo innovador en `PyMC Labs <pymc-labs.com>`_.

source: Examples
es: Ejemplos
