Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.builders.yaml.build_mmm_from_yaml.po
Languages: es

source: Build an MMM model from *config_path*.
es: Construya un modelo MMM desde *config_path*.

source: The configuration keys:
es: Las claves de configuración:

source: `model` (required): MMM initialization parameters
es: `model` (requerido): parámetros de inicialización de MMM

source: `effects` (optional): list of additive effects in the model
es: `effects` (opcional): lista de efectos aditivos en el modelo

source: `data` (optional): paths to X and y data
es: `data` (opcional): rutas a los datos de X e y

source: `original_scale_vars` (optional): list of original scale variables
es: `original_scale_vars` (opcional): lista de variables de escala originales

source: `idata_path` (optional): path to inference data
es: `idata_path` (opcional): ruta a los datos de inferencia

source: Parameters
es: Parámetros

source: python:str | Path
es: python:str | Ruta

source: YAML file with model configuration.
es: Archivo YAML con la configuración del modelo.

source: **X** : :obj:`pandas.DataFrame`, optional
es: **X** : :obj:`pandas.DataFrame`, opcional

source: pandas.DataFrame, optional
es: pandas.DataFrame, opcional

source: Pre-loaded covariate matrix. If omitted, the loader tries to read it from a path in the YAML under `data.X_path`.
es: Matriz de covariables pre-cargada. Si se omite, el cargador intenta leerla desde una ruta en el YAML bajo `data.X_path`.

source: **y** : :obj:`pandas.DataFrame` | :obj:`pandas.Series`, optional
es: **y** : :obj:`pandas.DataFrame` | :obj:`pandas.Series`, opcional

source: pandas.DataFrame | pandas.Series, optional
es: pandas.DataFrame | pandas.Series, opcional

source: Pre-loaded target vector. If omitted, the loader tries to read it from a path in the YAML under `data.y_path`.
es: Vector objetivo pre-cargado. Si se omite, el cargador intenta leerlo desde una ruta en el YAML bajo `data.y_path`.

source: **model_kwargs** : :class:`python:dict`, optional
es: **model_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Additional keyword arguments for the model. They override any defaults specified in the YAML config.
es: Argumentos de palabra clave adicionales para el modelo. Anulan cualquier valor predeterminado especificado en la configuración YAML.

source: Returns
es: Devoluciones

source: **model** : :obj:`MMM`
es: **modelo** : :obj:`MMM`
