Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.models.beta_geo.BetaGeoModel.po
Languages: es

source: Beta-Geometric Negative Binomial Distribution (BG/NBD) model for a non-contractual customer population across continuous time.
es: Modelo de distribución binomial negativa geométrica beta (BG/NBD) para una población de clientes no contractuales a lo largo del tiempo continuo.

source: First introduced by Fader, Hardie & Lee [R2639b53c1838-1]_, with additional predictive methods and enhancements in [R2639b53c1838-2]_,[R2639b53c1838-3]_, [R2639b53c1838-4]_ and [R2639b53c1838-5]_
es: Primero introducido por Fader, Hardie y Lee [R2639b53c1838-1]_, con métodos predictivos adicionales y mejoras en [R2639b53c1838-2]_, [R2639b53c1838-3]_, [R2639b53c1838-4]_ y [R2639b53c1838-5]_

source: The BG/NBD model assumes dropout probabilities for the customer population are Beta distributed, and time between transactions follows a Gamma distribution while the customer is still active.
es: El modelo BG/NBD asume que las probabilidades de abandono para la población de clientes están distribuidas según una Beta, y el tiempo entre transacciones sigue una distribución Gamma mientras el cliente esté activo.

source: This model requires data to be summarized by *recency*, *frequency*, and *T* for each customer, using `clv.utils.rfm_summary()` or equivalent. Modeling assumptions require *T >= recency*.
es: Este modelo requiere que los datos sean resumidos por *recencia*, *frecuencia* y *T* para cada cliente, utilizando `clv.utils.rfm_summary()` o equivalente. Las suposiciones del modelo requieren *T >= recencia*.

source: Predictive methods have been adapted from the *BetaGeoFitter* class in the legacy *lifetimes* library (see https://github.com/CamDavidsonPilon/lifetimes/).
es: Los métodos predictivos se han adaptado de la clase *BetaGeoFitter* en la biblioteca heredada *lifetimes* (ver https://github.com/CamDavidsonPilon/lifetimes/).

source: Parameters
es: Parámetros

source: **data** : :obj:`~pandas.DataFrame`
es: **datos** : :obj:`~pandas.DataFrame`

source: DataFrame containing the following columns:
es: DataFrame que contiene las siguientes columnas:

source: `customer_id`: Unique customer identifier
es: `customer_id`: Identificador único del cliente

source: `frequency`: Number of repeat purchases
es: `frequency`: Número de compras repetidas

source: `recency`: Time between the first and the last purchase
es: `recency`: Tiempo entre la primera y la última compra

source: `T`: Time between the first purchase and the end of the observation period
es: `T`: Tiempo entre la primera compra y el final del período de observación

source: **model_config** : :class:`python:dict`, optional
es: **model_config** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Dictionary of model prior parameters:
es: Diccionario de parámetros previos del modelo:

source: `alpha`: Scale parameter for time between purchases; defaults to `Prior("Weibull", alpha=2, beta=10)`
es: `alpha`: Parámetro de escala para el tiempo entre compras; por defecto es `Prior("Weibull", alpha=2, beta=10)`

source: `r`: Shape parameter for time between purchases; defaults to `Prior("Weibull", alpha=2, beta=1)`
es: `r`: Parámetro de forma para el tiempo entre compras; por defecto es `Prior("Weibull", alpha=2, beta=1)`

source: `a`: Shape parameter of dropout process; defaults to `phi_purchase` * `kappa_purchase`
es: `a`: Parámetro de forma del proceso de abandono; por defecto es `phi_purchase` * `kappa_purchase`

source: `b`: Shape parameter of dropout process; defaults to `1-phi_dropout` * `kappa_dropout`
es: `b`: Parámetro de forma del proceso de abandono; por defecto es `1-phi_dropout` * `kappa_dropout`

source: `phi_dropout`: Nested prior for a and b priors; defaults to `Prior("Uniform", lower=0, upper=1)`
es: `phi_dropout`: Prior anidado para los priors a y b; por defecto es `Prior("Uniform", lower=0, upper=1)`

source: `kappa_dropout`: Nested prior for a and b priors; defaults to `Prior("Pareto", alpha=1, m=1)`
es: `kappa_dropout`: Prior anidado para los priors a y b; por defecto es `Prior("Pareto", alpha=1, m=1)`

source: `purchase_covariates`: Coefficients for purchase rate covariates; defaults to `Normal(0, 1)`
es: `purchase_covariates`: Coeficientes para covariables de tasa de compra; por defecto es `Normal(0, 1)`

source: `dropout_covariates`: Coefficients for dropout covariates; defaults to `Normal.dist(0, 1)`
es: `dropout_covariates`: Coeficientes para covariables de abandono; por defecto es `Normal.dist(0, 1)`

source: `purchase_covariate_cols`: List containing column names of covariates for customer purchase rates.
es: `purchase_covariate_cols`: Lista que contiene los nombres de las columnas de covariables para las tasas de compra de los clientes.

source: `dropout_covariate_cols`: List containing column names of covariates for customer dropouts.
es: `dropout_covariate_cols`: Lista que contiene los nombres de las columnas de covariables para la deserción de clientes.

source: **sampler_config** : :class:`python:dict`, optional
es: **sampler_config** : :class:`python:dict`, opcional

source: Dictionary of sampler parameters. Defaults to *None*.
es: Diccionario de parámetros del muestreador. Por defecto es *Ninguno*.

source: References
es: Referencias

source: Fader, P. S., Hardie, B. G., & Lee, K. L. (2005). “Counting your customers the easy way: An alternative to the Pareto/NBD model." Marketing science, 24(2), 275-284. http://brucehardie.com/papers/018/fader_et_al_mksc_05.pdf
es: Fader, P. S., Hardie, B. G., y Lee, K. L. (2005). “Contando a sus clientes de la manera fácil: Una alternativa al modelo Pareto/NBD." Ciencia del marketing, 24(2), 275-284. http://brucehardie.com/papers/018/fader_et_al_mksc_05.pdf

source: Fader, P. S., Hardie, B. G., & Lee, K. L. (2008). "Computing P (alive) using the BG/NBD model." http://www.brucehardie.com/notes/021/palive_for_BGNBD.pdf.
es: Fader, P. S., Hardie, B. G., y Lee, K. L. (2008). "Cálculo de P (vivo) utilizando el modelo BG/NBD." http://www.brucehardie.com/notes/021/palive_for_BGNBD.pdf.

source: Fader, P. S. & Hardie, B. G. (2013) "Overcoming the BG/NBD Model's #NUM! Error Problem." http://brucehardie.com/notes/027/bgnbd_num_error.pdf.
es: Fader, P. S. y Hardie, B. G. (2013) "Superando el problema de error #NUM! del modelo BG/NBD." http://brucehardie.com/notes/027/bgnbd_num_error.pdf.

source: Fader, P. S. & Hardie, B. G. (2019) "A Step-by-Step Derivation of the BG/NBD Model." https://www.brucehardie.com/notes/039/bgnbd_derivation__2019-11-06.pdf
es: Fader, P. S. y Hardie, B. G. (2019) "Una derivación paso a paso del modelo BG/NBD." https://www.brucehardie.com/notes/039/bgnbd_derivation__2019-11-06.pdf

source: Fader, Peter & G. S. Hardie, Bruce (2007). "Incorporating Time-Invariant Covariates into the Pareto/NBD and BG/NBD Models". https://www.brucehardie.com/notes/019/time_invariant_covariates.pdf
es: Fader, Peter y G. S. Hardie, Bruce (2007). "Incorporando covariables invariantes en el tiempo en los modelos Pareto/NBD y BG/NBD". https://www.brucehardie.com/notes/019/time_invariant_covariates.pdf

source: Examples
es: Ejemplos

source: Methods
es: Métodos

source: Initialize model configuration and sampler configuration for the model.
es: Inicializar la configuración del modelo y la configuración del muestreador para el modelo.

source: Convert the model configuration and sampler configuration from the attributes to keyword arguments.
es: Convierte la configuración del modelo y la configuración del muestreador de los atributos a argumentos de palabra clave.

source: Build the model from the InferenceData object.
es: Construya el modelo a partir del objeto InferenceData.

source: Build the model.
es: Construya el modelo.

source: Create attributes for the inference data.
es: Cree atributos para los datos de inferencia.

source: Compute posterior predictive samples of dropout, purchase rate and frequency/recency of new customers.
es: Calcule muestras predictivas posteriores de abandono, tasa de compra y frecuencia/recencia de nuevos clientes.

source: Sample the Beta distribution for the population-level dropout rate.
es: Muestree la distribución Beta para la tasa de abandono a nivel poblacional.

source: Sample the Gamma distribution for the population-level purchase rate.
es: Muestree la distribución Gamma para la tasa de compra a nivel poblacional.

source: BG/NBD process representing purchases across the customer population.
es: Proceso BG/NBD que representa las compras a través de la población de clientes.

source: Compute the probability a customer with history *frequency*, *recency*, and *T* is currently active.
es: Calcule la probabilidad de que un cliente con historial de *frecuencia*, *recencia* y *T* esté actualmente activo.

source: Compute the probability a customer with history frequency, recency, and T will have 0 purchases in the period (T, T+t].
es: Calcule la probabilidad de que un cliente con frecuencia, recencia y T en su historial tenga 0 compras en el período (T, T+t].

source: :py:obj:`BetaGeoModel.expected_purchases <pymc_marketing.clv.models.beta_geo.BetaGeoModel.expected_purchases>`\ \(\[data\, future\_t\]\)
es: :py:obj:`BetaGeoModel.expected_purchases <pymc_marketing.clv.models.beta_geo.BetaGeoModel.expected_purchases>`\ \(\[datos\, futuro\_t\]\)

source: Compute the expected number of future purchases across *future_t* time periods given *recency*, *frequency*, and *T* for each customer.
es: Calcule el número esperado de compras futuras a lo largo de *future_t* períodos de tiempo dado *recency*, *frequency* y *T* para cada cliente.

source: Compute the expected number of purchases for a new customer across *t* time periods.
es: Calcule el número esperado de compras para un nuevo cliente a lo largo de *t* períodos de tiempo.

source: :py:obj:`BetaGeoModel.fit <pymc_marketing.clv.models.beta_geo.BetaGeoModel.fit>`\ \(\[method\, fit\_method\]\)
es: :py:obj:`BetaGeoModel.fit <pymc_marketing.clv.models.beta_geo.BetaGeoModel.fit>`\ \(\[método\, fit\_method\]\)

source: Infer model posterior.
es: Inferir la posterior del modelo.

source: Compute the summary of the fit result.
es: Calcule el resumen del resultado del ajuste.

source: Get the graphviz representation of the model.
es: Obtenga la representación graphviz del modelo.

source: Create the initialization kwargs from an InferenceData object.
es: Cree los kwargs de inicialización a partir de un objeto InferenceData.

source: Create a ModelBuilder instance from a file.
es: Cree una instancia de ModelBuilder a partir de un archivo.

source: Create a ModelBuilder instance from an InferenceData object.
es: Cree una instancia de ModelBuilder a partir de un objeto InferenceData.

source: Save the model's inference data to a file.
es: Guarde los datos de inferencia del modelo en un archivo.

source: Set attributes on an InferenceData object.
es: Establecer atributos en un objeto InferenceData.

source: Get the summary table of the model.
es: Obtenga la tabla resumen del modelo.

source: Return a copy of the model with a thinned fit result.
es: Devuelva una copia del modelo con un resultado de ajuste reducido.

source: Attributes
es: Atributos

source: Default model configuration.
es: Configuración del modelo predeterminado.

source: Default sampler configuration.
es: Configuración de muestreador predeterminada.

source: Get the posterior fit_result.
es: Obtenga el resultado de ajuste posterior.

source: Generate a unique hash value for the model.
es: Generar un valor hash único para el modelo.

source: :py:obj:`predictions <pymc_marketing.clv.models.beta_geo.BetaGeoModel.predictions>`\
es: :py:obj:`predicciones <pymc_marketing.clv.models.beta_geo.BetaGeoModel.predictions>`

source: :py:obj:`version <pymc_marketing.clv.models.beta_geo.BetaGeoModel.version>`\
es: :py:obj:`versión <pymc_marketing.clv.models.beta_geo.BetaGeoModel.version>`
