Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.inverse_scaled_logistic_saturation.po
Languages: es

source: inverse\_scaled\_logistic\_saturation
es: inversa\_escalada\_logística\_saturación

source: Inverse scaled logistic saturation transformation.
es: Transformación de saturación logística inversamente escalada.

source: It offers a more intuitive alternative to logistic_saturation, allowing for lambda to be interpreted as the half saturation point when using default value for eps.
es: Ofrece una alternativa más intuitiva a logistic_saturation, permitiendo que lambda sea interpretado como el punto de media saturación al utilizar el valor predeterminado para eps.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-inverse_scaled_logistic_saturation-1.pdf>`)

source: Parameters
es: Parámetros

source: Input tensor.
es: Tensor de entrada.

source: **lam** : :class:`python:float` or :term:`numpy:array_like`, optional, :obj:`by` default 0.5
es: **lam** : :class:`python:float` o :term:`numpy:array_like`, opcional, :obj:`by` por defecto 0.5

source: python:float or numpy:array_like, optional, by default 0.5
es: python:float o numpy:array_like, opcional, por defecto 0.5

source: The half-saturation point. Larger values represent less efficient channels.
es: El punto de media saturación. Los valores más grandes representan canales menos eficientes.

source: **eps** : :class:`python:float` or :term:`numpy:array_like`, optional, :obj:`by` default :obj:`ln`\(3)
es: **eps** : :class:`python:float` o :term:`numpy:array_like`, opcional, :obj:`por` defecto :obj:`ln`\(3)

source: python:float or numpy:array_like, optional, by default ln(3)
es: python:float o numpy:array_like, opcional, por defecto ln(3)

source: Scaling parameter. ln(3) results in halfway saturation at lam
es: Parámetro de escalado. ln(3) resulta en una saturación a mitad de camino en lam.

source: Returns
es: Devoluciones

source: Transformed tensor.
es: Tensor transformado.
