Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.po
Languages: es

source: HSGP components.
es: Componentes HSGP.

source: Functions
es: Funciones

source: Use heuristics for minimum `m` and `c` values.
es: Utilice heurísticas para los valores mínimos de `m` y `c`.

source: Create prior that penalizes complexity for GP lengthscale.
es: Cree un prior que penalice la complejidad para la longitud de escala de GP.

source: :py:obj:`create_constrained_inverse_gamma_prior <pymc_marketing.mmm.hsgp.create_constrained_inverse_gamma_prior>`\ \(\*\, upper\)
es: :py:obj:`create_constrained_inverse_gamma_prior <pymc_marketing.mmm.hsgp.create_constrained_inverse_gamma_prior>`\ \(\*\, superior\)

source: Create a lengthscale prior for the HSGP model.
es: Cree un prior de escala de longitud para el modelo HSGP.

source: :py:obj:`create_eta_prior <pymc_marketing.mmm.hsgp.create_eta_prior>`\ \(\[mass\, upper\]\)
es: :py:obj:`create_eta_prior <pymc_marketing.mmm.hsgp.create_eta_prior>`\ \(\[masa\, superior\]\)

source: Create prior for the variance.
es: Cree un previo para la varianza.

source: :py:obj:`create_m_and_L_recommendations <pymc_marketing.mmm.hsgp.create_m_and_L_recommendations>`\ \(X\, X\_mid\[\, ...\]\)
es: msgid: :py:obj:`create_m_and_L_recommendations <pymc_marketing.mmm.hsgp.create_m_and_L_recommendations>`\ \(X\, X\_mid\[\, ...\]\) msgstr: :py:obj:`create_m_and_L_recommendations <pymc_marketing.mmm.hsgp.create_m_and_L_recommendations>`\ \(X\, X\_mid\[\, ...\]\)

source: Create recommendations for the number of basis functions based on the data.
es: Cree recomendaciones para el número de funciones base en función de los datos.

source: Classes
es: Clases

source: :py:obj:`CovFunc <pymc_marketing.mmm.hsgp.CovFunc>`\ \(\*values\)
es: :py:obj:`CovFunc <pymc_marketing.mmm.hsgp.CovFunc>`\ \(\*valores\)

source: Supported covariance functions for the HSGP model.
es: Funciones de covarianza soportadas para el modelo HSGP.

source: HSGP component.
es: Componente HSGP.

source: Shared logic between HSGP and HSGPPeriodic.
es: Lógica compartida entre HSGP y HSGPPeriodic.

source: HSGP component for periodic data.
es: Componente HSGP para datos periódicos.

source: :py:obj:`PeriodicCovFunc <pymc_marketing.mmm.hsgp.PeriodicCovFunc>`\ \(\*values\)
es: :py:obj:`PeriodicCovFunc <pymc_marketing.mmm.hsgp.PeriodicCovFunc>`\ \(\*valores\)

source: HSGP with softplus transformation.
es: HSGP con transformación softplus.
