Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.additive_effect.po
Languages: es

source: additive\_effect
es: efecto\_aditivo

source: Additive effects for the multidimensional Marketing Mix Model.
es: Efectos aditivos para el modelo de mezcla de marketing multidimensional.

source: Example of a custom additive effect
es: Ejemplo de un efecto aditivo personalizado

source: Custom negative-effect component (added as a MuEffect)
es: Componente de efecto negativo personalizado (agregado como un MuEffect)

source: How it works
es: Cómo funciona

source: Mu effects follow a simple protocol: ``create_data(mmm)``, ``create_effect(mmm)``, and ``set_data(mmm, model, X)``.
es: Los efectos Mu siguen un protocolo simple: ``create_data(mmm)``, ``create_effect(mmm)``, y ``set_data(mmm, model, X)``.

source: During ``MMM.build_model(...)``, each effect’s ``create_data`` is called first to introduce any needed ``pm.Data``. Then ``create_effect`` must return a tensor with dims ("date", *mmm.dims) that is added additively to the model mean.
es: Durante ``MMM.build_model(...)``, se llama primero a ``create_data`` de cada efecto para introducir cualquier ``pm.Data`` necesario. Luego, ``create_effect`` debe devolver un tensor con dimensiones ("date", *mmm.dims) que se añade de forma aditiva a la media del modelo.

source: During posterior predictive, ``set_data`` is called with the cloned PyMC model and the new coordinates; update any ``pm.Data`` you created using ``pm.set_data``.
es: Durante la predicción posterior, se llama a ``set_data`` con el modelo PyMC clonado y las nuevas coordenadas; actualice cualquier ``pm.Data`` que haya creado utilizando ``pm.set_data``.

source: Tips for custom components
es: Consejos para componentes personalizados

source: Use unique variable prefixes to avoid name clashes with built-in pieces like controls. Do not call your component "control"; choose a distinct name/prefix.
es: Utilice prefijos de variable únicos para evitar conflictos de nombres con elementos integrados como los controles. No llame a su componente "control"; elija un nombre/prefijo distinto.

source: Follow the patterns used by the provided effects in this module (e.g., `FourierEffect`, `LinearTrendEffect`, `EventAdditiveEffect`): - In `create_data`, derive and register any required inputs into the model. - In `create_effect`, construct PyTensor expressions and return a contribution
es: Siga los patrones utilizados por los efectos proporcionados en este módulo (por ejemplo, `FourierEffect`, `LinearTrendEffect`, `EventAdditiveEffect`): - En `create_data`, derive y registre cualquier entrada requerida en el modelo. - En `create_effect`, construya expresiones de PyTensor y devuelva una contribución.

source: with dims ("date", *mmm.dims). If you need broadcasting, use `pymc_extras.prior.create_dim_handler` as shown above.
es: con dims ("date", *mmm.dims). Si necesita broadcasting, utilice `pymc_extras.prior.create_dim_handler` como se mostró arriba.

source: In `set_data`, update the data variables when dates/dims change.
es: En `set_data`, actualice las variables de datos cuando cambien las fechas/dimensiones.

source: Classes
es: Clases

source: Event effect class for the MMM.
es: Clase de efecto de evento para el MMM.

source: Fourier seasonality additive effect for MMM.
es: Efecto aditivo de estacionalidad de Fourier para MMM.

source: :py:obj:`LinearTrendEffect <pymc_marketing.mmm.additive_effect.LinearTrendEffect>`\ \(trend\, prefix\[\, date\_dim\_name\]\)
es: :py:obj:`LinearTrendEffect <pymc_marketing.mmm.additive_effect.LinearTrendEffect>`\ \(tendencia\, prefijo\[\, nombre\_dim\_fecha\]\)

source: Wrapper for LinearTrend to use with MMM's MuEffect protocol.
es: Envoltura para LinearTrend para usar con el protocolo MuEffect de MMM.

source: :py:obj:`Model <pymc_marketing.mmm.additive_effect.Model>`\ \(\*args\, \*\*kwargs\)
es: :py:obj:`Modelo <pymc_marketing.mmm.additive_effect.Model>`\ \(\*args\, \*\*kwargs\)

source: Protocol MMM.
es: Protocolo MMM.

source: Protocol for arbitrary additive mu effect.
es: Protocolo para el efecto mu aditivo arbitrario.
