Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.media_transformation.po
Languages: es

source: media\_transformation
es: transformación\_media

source: Module for applying media transformations to media data.
es: Módulo para aplicar transformaciones de medios a datos de medios.

source: Examples
es: Ejemplos

source: Create a media transformation for online and offline media channels:
es: Cree una transformación de medios para canales de medios en línea y fuera de línea:

source: Create a combined media configuration for offline and online media channels:
es: Cree una configuración de medios combinada para canales de medios en línea y fuera de línea:

source: Apply the media transformation to media data in PyMC model:
es: Aplica la transformación de medios a los datos de medios en el modelo PyMC:

source: Classes
es: Clases

source: :py:obj:`MediaConfig <pymc_marketing.mmm.media_transformation.MediaConfig>`\ \(name\, columns\, media\_transformation\)
es: :py:obj:`MediaConfig <pymc_marketing.mmm.media_transformation.MediaConfig>`\ \(nombre\, columnas\, transformación\_de\_medios\)

source: Configuration for a media transformation to certain media channels.
es: Configuración para una transformación de medios a ciertos canales de medios.

source: Wrapper for a list of media configurations to apply to media data.
es: Contenedor para una lista de configuraciones de medios que se aplicarán a los datos de medios.

source: :py:obj:`MediaTransformation <pymc_marketing.mmm.media_transformation.MediaTransformation>`\ \(adstock\, saturation\, ...\)
es: :py:obj:`MediaTransformation <pymc_marketing.mmm.media_transformation.MediaTransformation>`\ \(adstock\, saturación\, ...\)

source: Wrapper for applying adstock and saturation transformation to media data.
es: Envoltura para aplicar la transformación de adstock y saturación a los datos de medios.
