Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.multidimensional.po
Languages: es

source: Multidimensional Marketing Mix Model (MMM).
es: Modelo de Mezcla de Marketing Multidimensional (MMM).

source: Examples
es: Ejemplos

source: Basic MMM fit:
es: Ajuste básico de MMM:

source: Multi-dimensional (panel) with dims:
es: Multi-dimensional (panel) con dimensiones:

source: Time-varying parameters and seasonality:
es: Parámetros variables en el tiempo y estacionalidad:

source: Controls (additional regressors):
es: Controles (regresores adicionales):

source: Events:
es: Eventos:

source: Save, load, and plot:
es: Guardar, cargar y trazar:

source: Notes
es: Notas

source: X must include `date`, the `channel_columns`, and any extra `dims` columns.
es: X debe incluir `date`, las `channel_columns` y cualquier columna adicional de `dims`.

source: y is a Series with name equal to `target_column`.
es: y es una Serie con el nombre igual a `target_column`.

source: Call `add_events` before fitting/building.
es: Llama a `add_events` antes de ajustar/construir.

source: Functions
es: Funciones

source: Create the dictionary of keyword arguments for `pm.sample`.
es: Cree el diccionario de argumentos clave para `pm.sample`.

source: Classes
es: Clases

source: :py:obj:`MMM <pymc_marketing.mmm.multidimensional.MMM>`\ \(\[date\_column\, channel\_columns\, ...\]\)
es: :py:obj:`MMM <pymc_marketing.mmm.multidimensional.MMM>`\ \(\[columna\_fecha\, columnas\_canal\, ...\]\)

source: Marketing Mix Model class for estimating the impact of marketing channels on a target variable.
es: Clase del Modelo de Mezcla de Marketing para estimar el impacto de los canales de marketing en una variable objetivo.

source: Wrapper for the BudgetOptimizer to handle multi-dimensional model.
es: Envoltura para el BudgetOptimizer para manejar un modelo multidimensional.
