Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.log_model_derived_info.po
Languages: es

source: Log various model derived information to MLflow.
es: Registrar diversas informaciones derivadas del modelo en MLflow.

source: Includes:
es: Incluye:

source: The types of parameters in the model.
es: Los tipos de parámetros en el modelo.

source: The likelihood type of the model.
es: El tipo de verosimilitud del modelo.

source: The model representation (str).
es: La representación del modelo (str).

source: The model coordinates (coords.json).
es: Las coordenadas del modelo (coords.json).

source: Parameters
es: Parámetros

source: **model** : :class:`~pymc.Model`
es: **modelo** : :class:`~pymc.Model`

source: Model
es: Modelo

source: The PyMC model object.
es: El objeto del modelo PyMC.
