Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.plotting.plot_customer_exposure.po
Languages: es

source: plot\_customer\_exposure
es: trazar\_exposición\_del\_cliente

source: Plot the recency and T of DataFrame of customers.
es: Trace la recencia y T del DataFrame de clientes.

source: Plots customers as horizontal lines with markers representing their recency and T starting. Order is the same as the DataFrame and plotted from the bottom up.
es: Representa a los clientes como líneas horizontales con marcadores que representan su recencia y el inicio de T. El orden es el mismo que el del DataFrame y se traza de abajo hacia arriba.

source: The lines are colored by recency and T.
es: Las líneas están coloreadas por recencia y T.

source: Parameters
es: Parámetros

source: A DataFrame with columns "recency" and "T" representing the recency and age of customers.
es: Un DataFrame con columnas "recency" y "T" que representan la recencia y la antigüedad de los clientes.

source: **linewidth** : :class:`python:float`, optional
es: **linewidth** : :class:`python:float`, opcional

source: python:float, optional
es: python:flotante, opcional

source: The width of the horizontal lines in the plot.
es: El ancho de las líneas horizontales en el gráfico.

source: **size** : :class:`python:float`, optional
es: **tamaño** : :class:`python:float`, opcional

source: The size of the markers in the plot.
es: El tamaño de los marcadores en el gráfico.

source: **labels** : :obj:`Sequence`\[:class:`python:str`], optional
es: **etiquetas** : :obj:`Secuencia`\[:class:`python:str`], opcional

source: Sequence[python:str], optional
es: Secuencia[python:str], opcional

source: A sequence of labels for the legend. Default is ["Recency", "T"].
es: Una secuencia de etiquetas para la leyenda. El valor predeterminado es ["Recency", "T"].

source: **colors** : :obj:`Sequence`\[:class:`python:str`], optional
es: **colores** : :obj:`Secuencia`\[:class:`python:str`], opcional

source: A sequence of colors for the legend. Default is ["C0", "C1"].
es: Una secuencia de colores para la leyenda. El valor predeterminado es ["C0", "C1"].

source: **padding** : :class:`python:float`, optional
es: **padding** : :class:`python:float`, opcional

source: The padding around the plot. Default is 0.25.
es: El relleno alrededor del gráfico. El valor predeterminado es 0.25.

source: **ax** : :obj:`plt.Axes`, optional
es: **ax** : :obj:`plt.Axes`, opcional

source: plt.Axes, optional
es: plt.Axes, opcional

source: A matplotlib axes instance to plot on. If None, a new figure and axes is created.
es: Una instancia de ejes de matplotlib en la que trazar. Si es None, se crea una nueva figura y ejes.

source: Returns
es: Devoluciones

source: The matplotlib axes instance.
es: La instancia de ejes de matplotlib.

source: Examples
es: Ejemplos

source: Plot customer exposure
es: Trazar la exposición del cliente

source: Plot customer exposure ordered by recency and T
es: Trazar la exposición del cliente ordenada por recencia y T

source: Plot exposure for only those with time until last purchase is less than 3
es: Mostrar exposición solo para aquellos con tiempo hasta la última compra menor a 3
