Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.create_complexity_penalizing_prior.po
Languages: es

source: create\_complexity\_penalizing\_prior
es: crear\_prior\_penalizando\_complejidad

source: Create prior that penalizes complexity for GP lengthscale.
es: Cree un prior que penalice la complejidad para la longitud de escala GP.

source: The prior is defined with the following property:
es: El anterior se define con la siguiente propiedad:

source: Where :math:`\ell` is the lengthscale
es: Donde :math:`\ell` es la escala de longitud

source: Parameters
es: Parámetros

source: Tail probability.
es: Probabilidad de cola.

source: **lower** : :class:`python:float`
es: **inferior** : :class:`python:float`

source: Lower bound for the lengthscale.
es: Límite inferior para la escala de longitud.

source: Returns
es: Devoluciones

source: Weibull prior for the lengthscale with the given properties.
es: Prior de Weibull para la longitud de escala con las propiedades dadas.

source: References
es: Referencias
