Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.tvp.time_varying_prior.po
Languages: es

source: time\_varying\_prior
es: prior\_variable\_en\_el\_tiempo

source: Time varying prior, based on the Hilbert Space Gaussian Process (HSGP).
es: Prior variable en el tiempo, basado en el Proceso Gaussiano del Espacio de Hilbert (HSGP).

source: For more information see `pymc.gp.HSGP <https://www.pymc.io/projects/docs/en/stable/api/gp/generated/pymc.gp.HSGP.html>`_.
es: Para más información, consulte `pymc.gp.HSGP <https://www.pymc.io/projects/docs/en/stable/api/gp/generated/pymc.gp.HSGP.html>`_.

source: Parameters
es: Parámetros

source: **name** : :class:`python:str`
es: **nombre** : :class:`python:str`

source: Name of the prior and associated variables.
es: Nombre de la variable anterior y las variables asociadas.

source: **X** : 1d :term:`numpy:array_like` of :class:`python:int` or :class:`python:float`
es: **X** : 1d :term:`numpy:array_like` de :class:`python:int` o :class:`python:float`

source: Time points.
es: Puntos de tiempo.

source: **X_mid** : :class:`python:int` or :class:`python:float`
es: **X_mid** : :class:`python:int` o :class:`python:float`

source: python:int or python:float
es: python:int o python:float

source: Midpoint of the time points.
es: Punto medio de los puntos de tiempo.

source: **dims** : :class:`python:tuple` of :class:`python:str` or :class:`python:str`
es: **dims** : :class:`python:tuple` de :class:`python:str` o :class:`python:str`

source: python:tuple of python:str or python:str
es: python:tupla de python:str o python:str

source: Dimensions of the prior. If a tuple, the first element is the name of the time dimension, and the second may be any other dimension, across which independent time varying priors for each coordinate are desired (e.g. channels).
es: Dimensiones del previo. Si es una tupla, el primer elemento es el nombre de la dimensión temporal, y el segundo puede ser cualquier otra dimensión, a través de la cual se desean previos que varían en el tiempo de manera independiente para cada coordenada (por ejemplo, canales).

source: Keyword arguments for the Hilbert Space Gaussian Process. By default it is None, in which case the default parameters are used. See `HSGPKwargs` for more information.
es: Argumentos de palabras clave para el Proceso Gaussiano del Espacio de Hilbert. Por defecto, es None, en cuyo caso se utilizan los parámetros predeterminados. Consulte `HSGPKwargs` para más información.

source: Returns
es: Devoluciones

source: Time-varying prior.
es: Prior variable en el tiempo.

source: References
es: Referencias

source: Ruitort-Mayol, G., and Anderson, M., and Solin, A., and Vehtari, A. (2022). Practical Hilbert Space Approximate Bayesian Gaussian Processes for Probabilistic Programming
es: Ruitort-Mayol, G., Anderson, M., Solin, A. y Vehtari, A. (2022). Procesos Gaussianos Bayesianos Aproximados en Espacios de Hilbert Prácticos para Programación Probabilística

source: Solin, A., Sarkka, S. (2019) Hilbert Space Methods for Reduced-Rank Gaussian Process Regression.
es: Solin, A., Sarkka, S. (2019) Métodos de espacio de Hilbert para la regresión de procesos gaussianos de rango reducido.
