Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.MMMWrapper.po
Languages: es

source: A class to prepare a PyMC-Marketing Mix Model (MMM) for logging and registering in MLflow.
es: Una clase para preparar un modelo de mezcla de marketing (MMM) de PyMC para registrar y registrar en MLflow.

source: This class extends MLflow's PythonModel to handle prediction tasks using a PyMC-based MMM. It supports several prediction methods, including point-prediction, posterior and prior predictive sampling.
es: Esta clase extiende el PythonModel de MLflow para manejar tareas de predicción utilizando un MMM basado en PyMC. Soporta varios métodos de predicción, incluyendo predicción puntual, muestreo predictivo posterior y muestreo predictivo anterior.

source: Parameters
es: Parámetros

source: **model** : :obj:`pymc_marketing.mmm.MMM`
es: **modelo** : :obj:`pymc_marketing.mmm.MMM`

source: The marketing mix model to be registered and used for predictions.
es: El modelo de mezcla de marketing que se registrará y utilizará para predicciones.

source: **predict_method** : :class:`python:str`, optional, default="predict"
es: **predict_method** : :class:`python:str`, opcional, predeterminado="predict"

source: python:str, optional, default="predict"
es: python:str, opcional, predeterminado="predict"

source: The default prediction method to use, such as "predict", "sample_posterior_predictive", or "sample_prior_predictive".
es: El método de predicción predeterminado a utilizar, como "predict", "sample_posterior_predictive" o "sample_prior_predictive".

source: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, default=False
es: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=False

source: bool, default=False
es: bool, predeterminado=False

source: Boolean determining whether the predictions should be added to inference data object. Defaults to False.
es: Boolean que determina si las predicciones deben ser añadidas al objeto de datos de inferencia. Por defecto es False.

source: **combined** : :ref:`bool <python:bltin-boolean-values>`, default=True
es: **combinado** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=True

source: bool, default=True
es: bool, predeterminado=True

source: Combine chain and draw dims into sample. Won't work if a dim named sample already exists. Defaults to True.
es: Combina la cadena y las dimensiones de dibujo en la muestra. No funcionará si ya existe una dimensión llamada muestra. Por defecto es True.

source: **include_last_observations** : :ref:`bool <python:bltin-boolean-values>`, default=False
es: **include_last_observations** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=False

source: Boolean determining whether to include the last observations of the training data in order to carry over costs with the adstock transformation. Assumes that X are the next predictions following the training data. Defaults to False.
es: Boolean que determina si se deben incluir las últimas observaciones de los datos de entrenamiento para trasladar los costos con la transformación de adstock. Se asume que X son las siguientes predicciones que siguen a los datos de entrenamiento. Por defecto es False.

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, default=True
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=True

source: Boolean determining whether to return the predictions in the original scale of the target variable.
es: Boolean que determina si se deben devolver las predicciones en la escala original de la variable objetivo.

source: **var_names** : :class:`python:list` of :class:`python:str`, optional, default=None
es: **var_names** : :class:`python:list` de :class:`python:str`, opcional, predeterminado=None

source: python:list of python:str, optional, default=None
es: python:lista de python:str, opcional, predeterminado=None

source: The variable names to include in the predictions.
es: Los nombres de las variables a incluir en las predicciones.

source: **sample_kwargs** : :class:`python:dict`, optional
es: **sample_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Additional keyword arguments to pass to the selected sampling methods.
es: Argumentos adicionales de palabras clave para pasar a los métodos de muestreo seleccionados.

source: Methods
es: Métodos

source: :py:obj:`MMMWrapper.__init__ <pymc_marketing.mlflow.MMMWrapper.__init__>`\ \(model\[\, predict\_method\, ...\]\)
es: :py:obj:`MMMWrapper.__init__ <pymc_marketing.mlflow.MMMWrapper.__init__>`\ \(modelo\[\, método\_de\_predicción\, ...\]\)

source: :py:obj:`MMMWrapper.load_context <pymc_marketing.mlflow.MMMWrapper.load_context>`\ \(context\)
es: :py:obj:`MMMWrapper.load_context <pymc_marketing.mlflow.MMMWrapper.load_context>`\ \(contexto\)

source: Loads artifacts from the specified :class:`~PythonModelContext` that can be used by :func:`~PythonModel.predict` when evaluating inputs.
es: Carga artefactos del :class:`~PythonModelContext` especificado que pueden ser utilizados por :func:`~PythonModel.predict` al evaluar entradas.

source: :py:obj:`MMMWrapper.predict <pymc_marketing.mlflow.MMMWrapper.predict>`\ \(context\, model\_input\[\, ...\]\)
es: :py:obj:`MMMWrapper.predict <pymc_marketing.mlflow.MMMWrapper.predict>`\ \(contexto\, modelo\_entrada\[\, ...\]\)

source: Perform predictions or sampling using the specified prediction method.
es: Realice predicciones o muestreo utilizando el método de predicción especificado.

source: :py:obj:`MMMWrapper.predict_stream <pymc_marketing.mlflow.MMMWrapper.predict_stream>`\ \(context\, model\_input\)
es: :py:obj:`MMMWrapper.predict_stream <pymc_marketing.mlflow.MMMWrapper.predict_stream>`\ \(contexto\, entrada\_modelo\)

source: Evaluates a pyfunc-compatible input and produces an iterator of output.
es: Evalúa una entrada compatible con pyfunc y produce un iterador de salida.

source: Attributes
es: Atributos

source: Internal method to get type hints from the predict function signature.
es: Método interno para obtener sugerencias de tipo de la firma de la función predict.
