Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.sharpe_ratio.po
Languages: es

source: Calculate the Sharpe Ratio.
es: Calcule el Ratio de Sharpe.

source: The Sharpe Ratio assesses the risk-adjusted return of an investment by comparing the excess return over the risk-free rate to the standard deviation of returns.
es: El Ratio de Sharpe evalúa el rendimiento ajustado al riesgo de una inversión al comparar el rendimiento en exceso sobre la tasa libre de riesgo con la desviación estándar de los rendimientos.

source: The Sharpe Ratio is calculated as:
es: El Ratio de Sharpe se calcula como:

source: where:
es: donde:

source: :math:`\mathbb{E}[R - R_f]` is the mean of excess returns.
es: :math:`\mathbb{E}[R - R_f]` es la media de los rendimientos en exceso.

source: :math:`\sigma` is the standard deviation of the excess returns.
es: :math:`\sigma` es la desviación estándar de los rendimientos en exceso.

source: Parameters
es: Parámetros

source: **risk_free_rate** : :class:`python:float`, optional
es: **tasa_libre_de_riesgo** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: Risk-free rate of return (default is 0.0).
es: Tasa de retorno libre de riesgo (el valor predeterminado es 0.0).

source: Returns
es: Devoluciones

source: A function that calculates the Sharpe Ratio given samples and budgets.
es: Una función que calcula el Ratio de Sharpe dado muestras y presupuestos.

source: References
es: Referencias

source: Sharpe, W.F. (1966). Mutual Fund Performance.
es: Sharpe, W.F. (1966). Rendimiento de Fondos Mutuos.
