Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.events.AsymmetricGaussianBasis.po
Languages: es

source: Asymmetric Gaussian bump basis transformation.
es: Transformación de base de bache gaussiano asimétrico.

source: Allows different widths (sigma_before, sigma_after) and amplitudes (a_after) after the event.
es: Permite diferentes anchos (sigma_before, sigma_after) y amplitudes (a_after) después del evento.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-AsymmetricGaussianBasis-1.pdf>`)

source: Parameters
es: Parámetros

source: **event_in** : :obj:`Literal`\["before", "after", "exclude"]
es: **event_in** : :obj:`Literal`\["antes", "después", "excluir"]

source: Literal["before", "after", "exclude"]
es: Literal["antes", "después", "excluir"]

source: Whether to include the event in the before or after part of the basis, or leave it out entirely. Default is "after".
es: Si incluir el evento en la parte anterior o posterior de la base, o dejarlo completamente fuera. El valor predeterminado es "después".

source: **priors** : :class:`python:dict`\[:class:`python:str`, :obj:`Prior`]
es: **antecedentes** : :class:`python:dict`\[:class:`python:str`, :obj:`Prior`]

source: Prior for the sigma_before, sigma_after, a_before, and a_after parameters.
es: Prior para los parámetros sigma_before, sigma_after, a_before y a_after.

source: **prefix** : :class:`python:str`
es: **prefijo** : :class:`python:str`

source: Prefix for the parameters.
es: Prefijo para los parámetros.

source: Methods
es: Métodos

source: :py:obj:`AsymmetricGaussianBasis.__init__ <pymc_marketing.mmm.events.AsymmetricGaussianBasis.__init__>`\ \(\[event\_in\]\)
es: msgid: :py:obj:`AsymmetricGaussianBasis.__init__ <pymc_marketing.mmm.events.AsymmetricGaussianBasis.__init__>`\ \(\[event\_in\]\) msgstr: :py:obj:`AsymmetricGaussianBasis.__init__ <pymc_marketing.mmm.events.AsymmetricGaussianBasis.__init__>`\ \(\[event\_in\]\)

source: Call within a model context.
es: Llamar dentro de un contexto de modelo.

source: Asymmetric Gaussian bump function.
es: Función de bache gaussiano asimétrico.

source: :py:obj:`AsymmetricGaussianBasis.plot_curve <pymc_marketing.mmm.events.AsymmetricGaussianBasis.plot_curve>`\ \(curve\[\, ...\]\)
es: :py:obj:`AsymmetricGaussianBasis.plot_curve <pymc_marketing.mmm.events.AsymmetricGaussianBasis.plot_curve>`\ \(curva\[\, ...\]\)

source: Plot curve HDI and samples.
es: Trazar curva HDI y muestras.

source: :py:obj:`AsymmetricGaussianBasis.plot_curve_hdi <pymc_marketing.mmm.events.AsymmetricGaussianBasis.plot_curve_hdi>`\ \(curve\)
es: :py:obj:`AsymmetricGaussianBasis.plot_curve_hdi <pymc_marketing.mmm.events.AsymmetricGaussianBasis.plot_curve_hdi>`\ \(curva\)

source: Plot the HDI of the curve.
es: Trace el IDH de la curva.

source: :py:obj:`AsymmetricGaussianBasis.plot_curve_samples <pymc_marketing.mmm.events.AsymmetricGaussianBasis.plot_curve_samples>`\ \(curve\)
es: :py:obj:`AsymmetricGaussianBasis.plot_curve_samples <pymc_marketing.mmm.events.AsymmetricGaussianBasis.plot_curve_samples>`\ \(curva\)

source: Plot samples from the curve.
es: Trazar muestras de la curva.

source: Sample the curve of the saturation transformation given parameters.
es: Muestre la curva de la transformación de saturación dadas las parámetros.

source: Sample the priors for the transformation.
es: Muestre las distribuciones a priori para la transformación.

source: :py:obj:`AsymmetricGaussianBasis.set_dims_for_all_priors <pymc_marketing.mmm.events.AsymmetricGaussianBasis.set_dims_for_all_priors>`\ \(dims\)
es: msgid: :py:obj:`AsymmetricGaussianBasis.set_dims_for_all_priors <pymc_marketing.mmm.events.AsymmetricGaussianBasis.set_dims_for_all_priors>`\ \(dims\) msgstr: :py:obj:`AsymmetricGaussianBasis.set_dims_for_all_priors <pymc_marketing.mmm.events.AsymmetricGaussianBasis.set_dims_for_all_priors>`\ \(dims\)

source: Set the dims for all priors.
es: Establezca las dimensiones para todos los priors.

source: :py:obj:`AsymmetricGaussianBasis.to_dict <pymc_marketing.mmm.events.AsymmetricGaussianBasis.to_dict>`\ \(\)
es: msgid: :py:obj:`AsymmetricGaussianBasis.to_dict <pymc_marketing.mmm.events.AsymmetricGaussianBasis.to_dict>`\ \(\) msgstr: :py:obj:`AsymmetricGaussianBasis.to_dict <pymc_marketing.mmm.events.AsymmetricGaussianBasis.to_dict>`\ \(\)

source: Convert the asymmetric Gaussian basis to a dictionary.
es: Convierte la base gaussiana asimétrica en un diccionario.

source: Update the priors for a function after initialization.
es: Actualiza los priors para una función después de la inicialización.

source: Attributes
es: Atributos

source: Get the combined dims for all the parameters.
es: Obtenga las dimensiones combinadas para todos los parámetros.

source: Get the priors for the function.
es: Obtenga los antecedentes para la función.

source: Mapping from variable name to prior for the model.
es: Mapeo del nombre de la variable a la prior para el modelo.

source: :py:obj:`prefix <pymc_marketing.mmm.events.AsymmetricGaussianBasis.prefix>`\
es: :py:obj:`prefijo <pymc_marketing.mmm.events.AsymmetricGaussianBasis.prefix>`\

source: Mapping from parameter name to variable name in the model.
es: Mapeo del nombre del parámetro al nombre de la variable en el modelo.
