Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.distributions.ParetoNBD.po
Languages: es

source: Population-level distribution class for a continuous, non-contractual, Pareto/NBD process.
es: Clase de distribución a nivel poblacional para un proceso continuo, no contractual, Pareto/NBD.

source: It is based on Schmittlein, et al. in [Rf2b6c68d4881-2]_.
es: Se basa en Schmittlein, et al. en [Rf2b6c68d4881-2]_.

source: The likelihood function is derived from equations (22) and (23) of [Rf2b6c68d4881-3]_, with terms rearranged for numerical stability.
es: La función de verosimilitud se deriva de las ecuaciones (22) y (23) de [Rf2b6c68d4881-3]_, con los términos reorganizados para la estabilidad numérica.

source: The modified expression is provided below:
es: La expresión modificada se proporciona a continuación:

source: \begin{align} \text{if }\alpha > \beta: \\ \\ \mathbb{L}(r, \alpha, s, \beta | x, t_x, T) &= \frac{\Gamma(r+x)\alpha^r\beta}{\Gamma(r)+(\alpha +t_x)^{r+s+x}} [(\frac{s}{r+s+x})_2F_1(r+s+x,s+1;r+s+x+1;\frac{\alpha-\beta}{\alpha+t_x}) \\ &+ (\frac{r+x}{r+s+x}) \frac{_2F_1(r+s+x,s;r+s+x+1;\frac{\alpha-\beta}{\alpha+T})(\alpha +t_x)^{r+s+x}} {(\alpha +T)^{r+s+x}}] \\ \\ \text{if }\beta >= \alpha: \\ \\ \mathbb{L}(r, \alpha, s, \beta | x, t_x, T) &= \frac{\Gamma(r+x)\alpha^r\beta}{\Gamma(r)+(\beta +t_x)^{r+s+x}} [(\frac{s}{r+s+x})_2F_1(r+s+x,r+x;r+s+x+1;\frac{\beta-\alpha}{\beta+t_x}) \\ &+ (\frac{r+x}{r+s+x}) \frac{_2F_1(r+s+x,r+x+1;r+s+x+1;\frac{\beta-\alpha}{\beta+T})(\beta +t_x)^{r+s+x}} {(\beta +T)^{r+s+x}}] \end{align}
es: \begin{align} \text{if }\alpha > \beta: \\ \\ \mathbb{L}(r, \alpha, s, \beta | x, t_x, T) &= \frac{\Gamma(r+x)\alpha^r\beta}{\Gamma(r)+(\alpha +t_x)^{r+s+x}} [(\frac{s}{r+s+x})_2F_1(r+s+x,s+1;r+s+x+1;\frac{\alpha-\beta}{\alpha+t_x}) \\ &+ (\frac{r+x}{if }0) \frac{_2F_1(r+s+x,s;r+s+x+1;\frac{if }1{if }2)(\alpha +t_x)^{if }3} {(\alpha +T)^{if }4}] \\ \\ \text{if }5\beta >= \alpha: \\ \\ \mathbb{if }6(r, \alpha, s, \beta | x, t_x, T) &= \frac{if }7{\Gamma(r)+(\beta +t_x)^{if }8} [(\frac{if }9{L}0)_2F_1(r+s+x,r+x;r+s+x+1;\frac{L}1{L}2) \\ &+ (\frac{L}3{L}4) \frac{_2F_1(r+s+x,r+x+1;r+s+x+1;\frac{L}5{L}6)(\beta +t_x)^{L}7} {(\beta +T)^{L}8}] \end{L}9

source: Support
es: Soporte

source: :math:`t_j >= 0` for :math:`j = 1, \dots, x`
es: :math:`t_j >= 0` para :math:`j = 1, \dots, x`

source: Mean
es: Media

source: References
es: Referencias

source: David C. Schmittlein, Donald G. Morrison and Richard Colombo. "Counting Your Customers: Who Are They and What Will They Do Next." Management Science,Vol. 33, No. 1 (Jan., 1987), pp. 1-24.
es: David C. Schmittlein, Donald G. Morrison y Richard Colombo. "Contando a sus clientes: ¿Quiénes son y qué harán a continuación?" Management Science, Vol. 33, No. 1 (ene., 1987), pp. 1-24.

source: Fader, Peter & G. S. Hardie, Bruce (2005). "A Note on Deriving the Pareto/NBD Model and Related Expressions." http://brucehardie.com/notes/009/pareto_nbd_derivations_2005-11-05.pdf
es: Fader, Peter y G. S. Hardie, Bruce (2005). "Una Nota sobre la Derivación del Modelo Pareto/NBD y Expresiones Relacionadas." http://brucehardie.com/notes/009/pareto_nbd_derivations_2005-11-05.pdf

source: Methods
es: Métodos

source: Get the distribution from the parameters.
es: Obtenga la distribución de los parámetros.

source: Log-likelihood of the distribution.
es: Log-verosimilitud de la distribución.

source: Attributes
es: Atributos

source: :py:obj:`rv_op <pymc_marketing.clv.distributions.ParetoNBD.rv_op>`\ \(r\, alpha\, s\, beta\, T\[\, size\]\)
es: :py:obj:`rv_op <pymc_marketing.clv.distributions.ParetoNBD.rv_op>`\ \(r\, alpha\, s\, beta\, T\[\, tamaño\]\)
