Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.causal.po
Languages: es

source: causal
es: { "singular": "causal", "plural": "causales" }

source: Causal module.
es: { "singular": "Módulo causal.", "plural": "Módulos causales." }

source: Classes
es: { "singular": "Clase", "plural": "Clases" }

source: :py:obj:`BuildModelFromDAG <pymc_marketing.mmm.causal.BuildModelFromDAG>`\ \(\*\[\, dag\, df\, target\, ...\]\)
es: { "singular": ":py:obj:`BuildModelFromDAG <pymc_marketing.mmm.causal.BuildModelFromDAG>`\ \(\*\[\, dag\, df\, target\, ...\]\)", "plural": ":py:obj:`BuildModelFromDAG <pymc_marketing.mmm.causal.BuildModelFromDAG>`\ \(\*\[\, dag\, df\, target\, ...\]\)" }

source: Build a PyMC probabilistic model directly from a Causal DAG and a tabular dataset.
es: { "singular": "Construya un modelo probabilístico de PyMC directamente desde un DAG causal y un conjunto de datos tabular.", "plural": "Construyan un modelo probabilístico de PyMC directamente desde un DAG causal y un conjunto de datos tabular." }

source: :py:obj:`CausalGraphModel <pymc_marketing.mmm.causal.CausalGraphModel>`\ \(causal\_model\, treatment\, ...\)
es: { "singular": ":py:obj:`CausalGraphModel <pymc_marketing.mmm.causal.CausalGraphModel>`\ \(modelo\_causal\, tratamiento\, ...\)", "plural": ":py:obj:`CausalGraphModel <pymc_marketing.mmm.causal.CausalGraphModel>`\ \(modelos\_causales\, tratamientos\, ...\)" }

source: Represent a causal model based on a Directed Acyclic Graph (DAG).
es: { "singular": "Representar un modelo causal basado en un Grafo Acíclico Dirigido (DAG).", "plural": "Representar modelos causales basados en Grafos Acíclicos Dirigidos (DAG)." }

source: :py:obj:`TBFPC <pymc_marketing.mmm.causal.TBFPC>`\ \(target\, \*\[\, target\_edge\_rule\, ...\]\)
es: { "singular": ":py:obj:`TBFPC <pymc_marketing.mmm.causal.TBFPC>`\ \(objetivo\, \*\[\, regla\_de\_borde\_objetivo\, ...\]\)", "plural": ":py:obj:`TBFPC <pymc_marketing.mmm.causal.TBFPC>`\ \(objetivos\, \*\[\, reglas\_de\_borde\_objetivo\, ...\]\)" }

source: Target-first Bayes Factor PC (TBF-PC) causal discovery algorithm.
es: { "singular": "Algoritmo de descubrimiento causal del Factor de Bayes TBF-PC.", "plural": "Algoritmos de descubrimiento causal del Factor de Bayes TBF-PC." }

source: :py:obj:`TestResult <pymc_marketing.mmm.causal.TestResult>`\
es: { "singular": ":py:obj:`ResultadoDePrueba <pymc_marketing.mmm.causal.ResultadoDePrueba>`", "plural": ":py:obj:`ResultadosDePrueba <pymc_marketing.mmm.causal.ResultadosDePrueba>`" }

source: Conditional independence test statistics recorded during fitting.
es: { "singular": "Estadísticas de prueba de independencia condicional registradas durante el ajuste.", "plural": "Estadísticas de prueba de independencia condicional registradas durante los ajustes." }
