Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters.po
Languages: es

source: Representation of tanh saturation parameters in baselined form.
es: Representación de los parámetros de saturación de tanh en forma de referencia.

source: Parameters
es: Parámetros

source: pt.TensorLike
es: pt.TensorComo

source: Baseline spend.
es: Gasto base.

source: **gain** : :obj:`pt.TensorLike`
es: **ganancia** : :obj:`pt.TensorLike`

source: ROAS at :math:`x_0`.
es: ROAS en :math:`x_0`.

source: Overspend Fraction.
es: Fracción de gasto excesivo.

source: Methods
es: Métodos

source: :py:obj:`TanhSaturationBaselinedParameters.count <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters.count>`\ \(value\, \/\)
es: :py:obj:`TanhSaturationBaselinedParameters.count <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters.count>`\ (valor\, \/)

source: Return number of occurrences of value.
es: Devolver el número de ocurrencias del valor.

source: Change the parameterization to baselined to be classic saturation and cac.
es: Cambia la parametrización a la línea base para que sea saturación clásica y cac.

source: :py:obj:`TanhSaturationBaselinedParameters.index <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters.index>`\ \(value\)
es: :py:obj:`TanhSaturationBaselinedParameters.index <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters.index>`\ \(valor\)

source: Return first index of value.
es: Devolver el primer índice del valor.

source: Change the parameterization to baselined at :math:`x_1`.
es: Cambia la parametrización a la línea base en :math:`x_1`.

source: Attributes
es: Atributos

source: :py:obj:`gain <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters.gain>`\
es: :py:obj:`ganancia <pymc_marketing.mmm.transformers.TanhSaturationBaselinedParameters.gain>`\

source: Alias for field number 1
es: Alias para el campo número 1

source: Alias for field number 2
es: Alias para el campo número 2

source: Alias for field number 0
es: Alias para el campo número 0
