Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mlflow.po
Languages: es

source: MLflow logging utilities for PyMC models.
es: Utilidades de registro de MLflow para modelos de PyMC.

source: This module provides utilities to log various aspects of PyMC models to MLflow which is then extended to PyMC-Marketing models.
es: Este módulo proporciona utilidades para registrar varios aspectos de los modelos de PyMC en MLflow, que luego se extiende a los modelos de PyMC-Marketing.

source: Autologging is supported for PyMC models and PyMC-Marketing models. This including logging of sampler diagnostics, model information, data used in the model, and InferenceData objects.
es: El autologging es compatible con modelos de PyMC y modelos de PyMC-Marketing. Esto incluye el registro de diagnósticos del muestreador, información del modelo, datos utilizados en el modelo y objetos de InferenceData.

source: The autologging can be enabled by calling the `autolog` function. The following functions are patched:
es: La autologging se puede habilitar llamando a la función `autolog`. Las siguientes funciones están parcheadas:

source: :func:`log_versions`: Log the versions of PyMC-Marketing, PyMC, and ArviZ to MLflow.
es: :func:`log_versions`: Registra las versiones de PyMC-Marketing, PyMC y ArviZ en MLflow.

source: :func:`log_model_derived_info`: Log types of parameters, coords, model graph, etc.
es: :func:`log_model_derived_info`: Registrar tipos de parámetros, coordenadas, gráfico del modelo, etc.

source: :func:`log_sample_diagnostics`: Log information derived from the InferenceData object.
es: :func:`log_sample_diagnostics`: Registrar información derivada del objeto InferenceData.

source: :func:`log_arviz_summary`: Log table of summary statistics about estimated parameters
es: :func:`log_arviz_summary`: Tabla de registro de estadísticas resumidas sobre los parámetros estimados

source: :func:`log_metadata`: Log the metadata of the data used in the model.
es: :func:`log_metadata`: Registra los metadatos de los datos utilizados en el modelo.

source: :func:`log_error`: Log the traceback and exception if an error occurs during sampling.
es: :func:`log_error`: Registra el seguimiento y la excepción si ocurre un error durante el muestreo.

source: All parameters, metrics, and artifacts from `pymc.sample`
es: Todos los parámetros, métricas y artefactos de `pymc.sample`

source: :func:`log_mmm_configuration`: Log the configuration of the MMM model.
es: :func:`log_mmm_configuration`: Registra la configuración del modelo MMM.

source: Information dependent on fit method used (MCMC or MAP)
es: Información dependiente del método de ajuste utilizado (MCMC o MAP)

source: Model type and fit method
es: Tipo de modelo y método de ajuste

source: Examples
es: Ejemplos

source: Autologging for a PyMC model:
es: Autologging para un modelo de PyMC:

source: Autologging for a PyMC-Marketing MMM:
es: Autologging para un MMM de PyMC-Marketing:

source: Autologging for a PyMC-Marketing CLV model:
es: Autologging para un modelo CLV de PyMC-Marketing:

source: Functions
es: Funciones

source: Autologging support for PyMC models and PyMC-Marketing models.
es: Soporte de autolog para modelos PyMC y modelos PyMC-Marketing.

source: :py:obj:`create_log_callback <pymc_marketing.mlflow.create_log_callback>`\ \(\[stats\, parameters\, ...\]\)
es: :py:obj:`create_log_callback <pymc_marketing.mlflow.create_log_callback>`\ \(\[estadísticas\, parámetros\, ...\]\)

source: Create callback function to log sample stats and parameter values to MLflow during sampling.
es: Cree una función de callback para registrar estadísticas de muestra y valores de parámetros en MLflow durante el muestreo.

source: Load a PyMC-Marketing MMM model from MLflow.
es: Cargar un modelo MMM de PyMC-Marketing desde MLflow.

source: Log the ArviZ summary as an artifact on MLflow.
es: Registra el resumen de ArviZ como un artefacto en MLflow.

source: :py:obj:`log_error <pymc_marketing.mlflow.log_error>`\ \(func\, file\_name\)
es: :py:obj:`log_error <pymc_marketing.mlflow.log_error>`\ \(función\, nombre\_de\_archivo\)

source: Log arbitrary caught error and traceback to MLflow.
es: Registrar error arbitrario capturado y seguimiento a MLflow.

source: Log the InferenceData to MLflow.
es: Registre el InferenceData en MLflow.

source: :py:obj:`log_likelihood_type <pymc_marketing.mlflow.log_likelihood_type>`\ \(model\)
es: :py:obj:`log_likelihood_type <pymc_marketing.mlflow.log_likelihood_type>`\ \(modelo\)

source: Save the likelihood type of the model to MLflow.
es: Guarde el tipo de probabilidad del modelo en MLflow.

source: :py:obj:`log_metadata <pymc_marketing.mlflow.log_metadata>`\ \(model\, idata\)
es: :py:obj:`log_metadata <pymc_marketing.mlflow.log_metadata>`\ \(modelo\, idata\)

source: Log the metadata of the data used in the model to MLflow.
es: Registre los metadatos de los datos utilizados en el modelo en MLflow.

source: :py:obj:`log_mmm <pymc_marketing.mlflow.log_mmm>`\ \(mmm\[\, artifact\_path\, ...\]\)
es: :py:obj:`log_mmm <pymc_marketing.mlflow.log_mmm>`\ \(mmm\[\, ruta\_del\_artefacto\, ...\]\)

source: Log a PyMC-Marketing MMM as a native MLflow model for the current run.
es: Registrar un MMM de PyMC-Marketing como un modelo nativo de MLflow para la ejecución actual.

source: Log the configuration of the MMM model to MLflow.
es: Registre la configuración del modelo MMM en MLflow.

source: Log evaluation metrics produced by `pymc_marketing.mmm.evaluation.compute_summary_metrics()` to MLflow.
es: Registrar métricas de evaluación producidas por `pymc_marketing.mmm.evaluation.compute_summary_metrics()` en MLflow.

source: :py:obj:`log_model_derived_info <pymc_marketing.mlflow.log_model_derived_info>`\ \(model\)
es: :py:obj:`log_model_derived_info <pymc_marketing.mlflow.log_model_derived_info>`\ \(modelo\)

source: Log various model derived information to MLflow.
es: Registrar varios datos derivados del modelo en MLflow.

source: :py:obj:`log_model_graph <pymc_marketing.mlflow.log_model_graph>`\ \(model\, path\)
es: :py:obj:`log_model_graph <pymc_marketing.mlflow.log_model_graph>`\ \(modelo\, ruta\)

source: Log the model graph PDF as artifact on MLflow.
es: Registra el gráfico del modelo en PDF como artefacto en MLflow.

source: Log sample diagnostics to MLflow.
es: Registrar muestras de diagnóstico en MLflow.

source: :py:obj:`log_types_of_parameters <pymc_marketing.mlflow.log_types_of_parameters>`\ \(model\)
es: :py:obj:`log_types_of_parameters <pymc_marketing.mlflow.log_types_of_parameters>`\ \(modelo\)

source: Log the types of parameters in a PyMC model to MLflow.
es: Registra los tipos de parámetros en un modelo PyMC en MLflow.

source: Log the versions of PyMC-Marketing, PyMC, and ArviZ to MLflow.
es: Registre las versiones de PyMC-Marketing, PyMC y ArviZ en MLflow.

source: Classes
es: Clases

source: :py:obj:`MMMWrapper <pymc_marketing.mlflow.MMMWrapper>`\ \(model\[\, predict\_method\, ...\]\)
es: :py:obj:`MMMWrapper <pymc_marketing.mlflow.MMMWrapper>`\ \(modelo\[\, método\_de\_predicción\, ...\]\)

source: A class to prepare a PyMC-Marketing Mix Model (MMM) for logging and registering in MLflow.
es: Una clase para preparar un Modelo de Mezcla de Marketing (MMM) de PyMC para registrar y registrar en MLflow.
