Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.hsgp.HSGP.po
Languages: es

source: HSGP component.
es: Componente HSGP.

source: Examples
es: Ejemplos

source: Literature recommended HSGP configuration:
es: Configuración recomendada de HSGP según la literatura:

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-1.pdf>`)

source: Using a demeaned basis to remove "intercept" effect of first basis:
es: Usando una base desmedida para eliminar el efecto de "intercepto" de la primera base:

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-2.pdf>`)

source: HSGP with different covariance function
es: HSGP con diferente función de covarianza

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-3.pdf>`)

source: HSGP with different link function via `transform` argument
es: HSGP con una función de enlace diferente a través del argumento `transform`

source: The `transform` parameter must be registered or from either `pytensor.tensor` or `pymc.math` namespaces. See the :func:`pymc_extras.prior.register_tensor_transform`
es: El parámetro `transform` debe estar registrado o provenir de los espacios de nombres `pytensor.tensor` o `pymc.math`. Consulte la :func:`pymc_extras.prior.register_tensor_transform`

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-4.pdf>`)

source: New data predictions with HSGP
es: Nuevas predicciones de datos con HSGP

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-5.pdf>`)

source: Higher dimensional HSGP
es: HSGP de dimensiones superiores

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-hsgp-HSGP-6.pdf>`)

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabras clave.

source: :py:obj:`HSGP.copy <pymc_marketing.mmm.hsgp.HSGP.copy>`\ \(\*\[\, include\, exclude\, update\, deep\]\)
es: :py:obj:`HSGP.copy <pymc_marketing.mmm.hsgp.HSGP.copy>`\ \(\*\[\, incluir\, excluir\, actualizar\, profundo\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`HSGP.create_variable <pymc_marketing.mmm.hsgp.HSGP.create_variable>`\ \(name\)
es: :py:obj:`HSGP.create_variable <pymc_marketing.mmm.hsgp.HSGP.create_variable>`\ \(nombre\)

source: Create a variable from HSGP configuration.
es: Cree una variable a partir de la configuración de HSGP.

source: :py:obj:`HSGP.deterministics_to_replace <pymc_marketing.mmm.hsgp.HSGP.deterministics_to_replace>`\ \(name\)
es: :py:obj:`HSGP.deterministics_to_replace <pymc_marketing.mmm.hsgp.HSGP.deterministics_to_replace>`\ %(name)s

source: Name of the Deterministic variables that are replaced with pm.Flat for out-of-sample.
es: Nombre de las variables determinísticas que se reemplazan con pm.Flat para fuera de muestra.

source: :py:obj:`HSGP.dict <pymc_marketing.mmm.hsgp.HSGP.dict>`\ \(\*\[\, include\, exclude\, by\_alias\, ...\]\)
es: :py:obj:`HSGP.dict <pymc_marketing.mmm.hsgp.HSGP.dict>`\ \(\*\[\, incluir\, excluir\, por\_alias\, ...\]\)

source: :py:obj:`HSGP.from_dict <pymc_marketing.mmm.hsgp.HSGP.from_dict>`\ \(data\)
es: :py:obj:`HSGP.from_dict <pymc_marketing.mmm.hsgp.HSGP.from_dict>`\ \(datos\)

source: Create an object from a dictionary.
es: Cree un objeto a partir de un diccionario.

source: :py:obj:`HSGP.json <pymc_marketing.mmm.hsgp.HSGP.json>`\ \(\*\[\, include\, exclude\, by\_alias\, ...\]\)
es: :py:obj:`HSGP.json <pymc_marketing.mmm.hsgp.HSGP.json>`\ \(\*\[\, incluir\, excluir\, por\_alias\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`HSGP.model_copy <pymc_marketing.mmm.hsgp.HSGP.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`HSGP.model_copy <pymc_marketing.mmm.hsgp.HSGP.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`HSGP.model_dump <pymc_marketing.mmm.hsgp.HSGP.model_dump>`\ \(\*\[\, mode\, include\, exclude\, ...\]\)
es: :py:obj:`HSGP.model_dump <pymc_marketing.mmm.hsgp.HSGP.model_dump>`\ \(\*\[\, modo\, incluir\, excluir\, ...\]\)

source: :py:obj:`HSGP.model_json_schema <pymc_marketing.mmm.hsgp.HSGP.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`HSGP.model_json_schema <pymc_marketing.mmm.hsgp.HSGP.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: :py:obj:`HSGP.model_post_init <pymc_marketing.mmm.hsgp.HSGP.model_post_init>`\ \(context\, \/\)
es: :py:obj:`HSGP.model_post_init <pymc_marketing.mmm.hsgp.HSGP.model_post_init>`\ \(contexto\, \/\)

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`HSGP.model_rebuild <pymc_marketing.mmm.hsgp.HSGP.model_rebuild>`\ \(\*\[\, force\, raise\_errors\, ...\]\)
es: :py:obj:`HSGP.model_rebuild <pymc_marketing.mmm.hsgp.HSGP.model_rebuild>`\ \(\*\[\, forzar\, raise\_errors\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: :py:obj:`HSGP.model_validate <pymc_marketing.mmm.hsgp.HSGP.model_validate>`\ \(obj\, \*\[\, strict\, extra\, ...\]\)
es: :py:obj:`HSGP.model_validate <pymc_marketing.mmm.hsgp.HSGP.model_validate>`\ \(obj\, \*\[\, estricto\, extra\, ...\]\)

source: Validate a pydantic model instance.
es: Valide una instancia de modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: Create a HSGP informed by the data with literature-based recommendations.
es: Cree un HSGP informado por los datos con recomendaciones basadas en la literatura.

source: :py:obj:`HSGP.parse_file <pymc_marketing.mmm.hsgp.HSGP.parse_file>`\ \(path\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`HSGP.parse_file <pymc_marketing.mmm.hsgp.HSGP.parse_file>`\ \(ruta\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: :py:obj:`HSGP.parse_raw <pymc_marketing.mmm.hsgp.HSGP.parse_raw>`\ \(b\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`HSGP.parse_raw <pymc_marketing.mmm.hsgp.HSGP.parse_raw>`\ \(b\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: Plot the curve.
es: Dibuje la curva.

source: Register the data to be used in the model.
es: Registre los datos que se utilizarán en el modelo.

source: Sample from the prior distribution.
es: Muestra de la distribución previa.

source: :py:obj:`HSGP.schema <pymc_marketing.mmm.hsgp.HSGP.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`HSGP.schema <pymc_marketing.mmm.hsgp.HSGP.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`HSGP.schema_json <pymc_marketing.mmm.hsgp.HSGP.schema_json>`\ \(\*\[\, by\_alias\, ref\_template\]\)
es: :py:obj:`HSGP.schema_json <pymc_marketing.mmm.hsgp.HSGP.schema_json>`\ \(\*\[\, por\_alias\, ref\_template\]\)

source: Convert the object to a dictionary.
es: Convierte el objeto a un diccionario.

source: :py:obj:`HSGP.validate <pymc_marketing.mmm.hsgp.HSGP.validate>`\ \(value\)
es: :py:obj:`HSGP.validate <pymc_marketing.mmm.hsgp.HSGP.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.

source: :py:obj:`centered <pymc_marketing.mmm.hsgp.HSGP.centered>`\
es: :py:obj:`centrado <pymc_marketing.mmm.hsgp.HSGP.centrado>`\

source: :py:obj:`demeaned_basis <pymc_marketing.mmm.hsgp.HSGP.demeaned_basis>`\
es: :py:obj:`base_demeanada <pymc_marketing.mmm.hsgp.HSGP.base_demeanada>`
