Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.budget_optimizer.po
Languages: es

source: budget\_optimizer
es: optimizador\_de\_presupuesto

source: Budget optimization module.
es: Módulo de optimización de presupuesto.

source: Overview
es: Resumen

source: Optimize how to allocate a total budget across channels (and optional extra dims) to maximize an expected response derived from a fitted MMM posterior.
es: Optimizar la forma de asignar un presupuesto total entre canales (y dimensiones adicionales opcionales) para maximizar una respuesta esperada derivada de un posterior de MMM ajustado.

source: Quickstart (multi‑dimensional MMM)
es: Inicio rápido (MMM multidimensional)

source: Use a custom pymc model with any dimensionality
es: Utilice un modelo pymc personalizado con cualquier dimensionalidad.

source: Requirements
es: Requisitos

source: The optimizer works on any wrapper that satisfies `OptimizerCompatibleModelWrapper`: - Attributes: `adstock`, `_channel_scales`, `idata` (arviz.InferenceData with posterior) - Method: `_set_predictors_for_optimization(num_periods) -> pm.Model` that returns a PyMC
es: El optimizador funciona con cualquier envoltura que satisfaga `OptimizerCompatibleModelWrapper`: - Atributos: `adstock`, `_channel_scales`, `idata` (arviz.InferenceData con posterior) - Método: `_set_predictors_for_optimization(num_periods) -> pm.Model` que devuelve un PyMC

source: model where a variable named `channel_data` exists with dims including `"date"` and all budget dims (e.g., `("channel", "geo")`). The optimizer replaces `channel_data` with the optimization variable under the hood.
es: modelo donde existe una variable llamada `channel_data` con dimensiones que incluyen `"date"` y todas las dimensiones de presupuesto (por ejemplo, `("channel", "geo")`). El optimizador reemplaza `channel_data` con la variable de optimización internamente.

source: Posterior must contain a response variable (default: `"total_contribution"`) or any custom `response_variable` you pass, and the required MMM deterministics (e.g. `channel_contribution`).
es: Posterior debe contener una variable de respuesta (predeterminada: `"total_contribution"`) o cualquier `response_variable` personalizada que proporciones, y los determinísticos MMM requeridos (por ejemplo, `channel_contribution`).

source: For time distribution: pass a DataArray with dims `("date", *budget_dims)` and values along `date` summing to 1 for each budget cell.
es: Para la distribución del tiempo: pase un DataArray con dimensiones `("fecha", *dimensiones_presupuesto)` y valores a lo largo de `fecha` que sumen 1 para cada celda de presupuesto.

source: Bounds can be a dict only for single‑dimensional budgets; otherwise use an xarray.DataArray (use `optimizer_xarray_builder(...)`).
es: Los límites pueden ser un diccionario solo para presupuestos unidimensionales; de lo contrario, utilice un xarray.DataArray (utilice `optimizer_xarray_builder(...)`).

source: Notes
es: Notas

source: If `budgets_to_optimize` is not provided, the optimizer auto‑detects cells with historical information using `idata.posterior.channel_contribution.mean(("chain","draw","date")).astype(bool)`.
es: Si `budgets_to_optimize` no se proporciona, el optimizador detecta automáticamente las celdas con información histórica utilizando `idata.posterior.channel_contribution.mean(("chain","draw","date")).astype(bool)`.

source: Default bounds are `[0, total_budget]` on each optimized cell.
es: Los límites predeterminados son `[0, total_budget]` en cada celda optimizada.

source: Set `callback=True` in `allocate_budget(...)` to receive per‑iteration diagnostics (objective, gradient, constraints) for monitoring.
es: Establezca `callback=True` en `allocate_budget(...)` para recibir diagnósticos por iteración (objetivo, gradiente, restricciones) para su monitoreo.

source: Functions
es: Funciones

source: :py:obj:`optimizer_xarray_builder <pymc_marketing.mmm.budget_optimizer.optimizer_xarray_builder>`\ \(value\, \*\*kwargs\)
es: :py:obj:`optimizer_xarray_builder <pymc_marketing.mmm.budget_optimizer.optimizer_xarray_builder>`\ \(valor\, \*\*kwargs\)

source: Create an xarray.DataArray with flexible dimensions and coordinates.
es: Cree un xarray.DataArray con dimensiones y coordenadas flexibles.

source: Classes
es: Clases

source: A class for optimizing budget allocation in a marketing mix model.
es: Una clase para optimizar la asignación de presupuesto en un modelo de mezcla de marketing.

source: :py:obj:`BuildMergedModel <pymc_marketing.mmm.budget_optimizer.BuildMergedModel>`\ \(models\[\, prefixes\, ...\]\)
es: :py:obj:`BuildMergedModel <pymc_marketing.mmm.budget_optimizer.BuildMergedModel>`\ \(modelos\[\, prefijos\, ...\]\)

source: Merge multiple optimizer-compatible models into a single model.
es: Fusionar múltiples modelos compatibles con el optimizador en un solo modelo.

source: Wrapper for the BudgetOptimizer to handle custom PyMC models.
es: msgid: Wrapper for the BudgetOptimizer to handle custom PyMC models. msgstr: Envoltorio para el BudgetOptimizer para manejar modelos PyMC personalizados.

source: Protocol for marketing mix model wrappers compatible with the BudgetOptimizer.
es: Protocolo para envolturas del modelo de mezcla de marketing compatibles con el BudgetOptimizer.

source: Exceptions
es: Excepciones

source: :py:obj:`MinimizeException <pymc_marketing.mmm.budget_optimizer.MinimizeException>`\ \(message\)
es: :py:obj:`MinimizeException <pymc_marketing.mmm.budget_optimizer.MinimizeException>`\ \(mensaje\)

source: Custom exception for optimization failure.
es: Excepción personalizada para fallo de optimización.
