Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.linear_trend.po
Languages: es

source: linear\_trend
es: tendencia\_lineal

source: Linear trend using change points.
es: Tendencia lineal utilizando puntos de cambio.

source: Examples
es: Ejemplos

source: Define a linear trend with 8 changepoints:
es: Defina una tendencia lineal con 8 puntos de cambio:

source: Sample the prior for the trend parameters and curve:
es: Muestree el anterior para los par√°metros de tendencia y la curva:

source: Plot the curve samples:
es: Trazar las muestras de la curva:

source: LinearTrend prior
es: TendenciaLineal anterior

source: Classes
es: Clases

source: :py:obj:`LinearTrend <pymc_marketing.mmm.linear_trend.LinearTrend>`\ \(\*\*data\)
es: :py:obj:`LinearTrend <pymc_marketing.mmm.linear_trend.LinearTrend>`\ \(\*\*datos\)

source: LinearTrend class.
es: Clase LinearTrend.
