Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.adjusted_value_at_risk_score.po
Languages: es

source: adjusted\_value\_at\_risk\_score
es: puntuación\_ajustada\_de\_valor\_en\_riesgo

source: Calculate adjusted Value at Risk (AVaR) score.
es: Calcular la puntuación de Valor en Riesgo Ajustado (AVaR).

source: The adjusted Value at Risk (AVaR) score is a risk-adjusted metric that combines the mean and Value at Risk (VaR) based on a risk aversion parameter. It provides a single metric that accounts for both return and risk preferences.
es: El puntaje de Valor en Riesgo Ajustado (AVaR) es una métrica ajustada al riesgo que combina la media y el Valor en Riesgo (VaR) basado en un parámetro de aversión al riesgo. Proporciona una única métrica que tiene en cuenta tanto las preferencias de retorno como las de riesgo.

source: The score is calculated as:
es: La puntuación se calcula como:

source: where:
es: donde:

source: :math:`\mu` is the mean of the sample returns.
es: :math:`\mu` es la media de los retornos de la muestra.

source: :math:`VaR` is the Value at Risk at the specified confidence level.
es: :math:`VaR` es el Valor en Riesgo al nivel de confianza especificado.

source: :math:`\alpha` is the risk aversion parameter.
es: :math:`\alpha` es el parámetro de aversión al riesgo.

source: Parameters
es: Parámetros

source: **confidence_level** : :class:`python:float`, optional
es: **nivel_de_confianza** : :class:`python:float`, opcional

source: python:float, optional
es: python:flotante, opcional

source: Confidence level for VaR (e.g., 0.95 for 95% VaR). Confidence level must be between 0 and 1.
es: Nivel de confianza para VaR (por ejemplo, 0.95 para VaR del 95%). El nivel de confianza debe estar entre 0 y 1.

source: **risk_aversion** : :class:`python:float`, optional
es: **aversión_al_riesgo** : :class:`python:float`, opcional

source: Risk aversion parameter (0 = low risk aversion, 1 = high risk aversion).
es: Parámetro de aversión al riesgo (0 = baja aversión al riesgo, 1 = alta aversión al riesgo).

source: Returns
es: Devoluciones

source: A function that calculates the adjusted Value at Risk score given samples and budgets.
es: Una función que calcula el puntaje de Valor en Riesgo ajustado dado muestras y presupuestos.

source: Raises
es: Aumentos

source: If the risk aversion parameter is not between 0 and 1. If confidence_level is not between 0 and 1.
es: Si el parámetro de aversión al riesgo no está entre 0 y 1. Si confidence_level no está entre 0 y 1.
