Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.causal.TBFPC.po
Languages: es

source: Target-first Bayes Factor PC (TBF-PC) causal discovery algorithm.
es: Algoritmo de descubrimiento causal del Factor Bayesiano de primer objetivo PC (TBF-PC).

source: This algorithm is a target-oriented variant of the Peter–Clark (PC) algorithm, using Bayes factors (via ΔBIC approximation) as the conditional independence test.
es: Este algoritmo es una variante orientada a objetivos del algoritmo de Peter–Clark (PC), utilizando factores de Bayes (a través de la aproximación ΔBIC) como la prueba de independencia condicional.

source: For each conditional independence test of the form
es: Para cada prueba de independencia condicional de la forma

source: we compare two linear models:
es: comparamos dos modelos lineales:

source: where :math:`S` is a conditioning set of variables.
es: donde :math:`S` es un conjunto de variables de condicionamiento.

source: The Bayesian Information Criterion (BIC) is defined as
es: El Criterio de Información Bayesiano (BIC) se define como

source: with residual sum of squares :math:`\mathrm{RSS}`, sample size :math:`n`, and number of parameters :math:`k`.
es: con la suma residual de cuadrados :math:`\mathrm{RSS}`, tamaño de muestra :math:`n`, y número de parámetros :math:`k`.

source: The Bayes factor is approximated by
es: El factor de Bayes se aproxima a

source: Independence is declared if :math:`\mathrm{BF}_{10} < \tau`, where :math:`\tau` is set via the ``bf_thresh`` parameter.
es: La independencia se declara si :math:`\mathrm{BF}_{10} < \tau`, donde :math:`\tau` se establece a través del parámetro ``bf_thresh``.

source: References
es: Referencias

source: Spirtes, Glymour, Scheines (2000). *Causation, Prediction, and Search*. MIT Press. [PC algorithm]
es: Spirtes, Glymour, Scheines (2000). *Causación, Predicción y Búsqueda*. MIT Press. [algoritmo PC]

source: Spirtes & Glymour (1991). "An Algorithm for Fast Recovery of Sparse Causal Graphs."
es: Spirtes y Glymour (1991). "Un algoritmo para la recuperación rápida de gráficos causales dispersos."

source: Kass, R. & Raftery, A. (1995). "Bayes Factors."
es: Kass, R. y Raftery, A. (1995). "Factores de Bayes."

source: Examples
es: Ejemplos

source: **1. Basic usage with full conditioning set**
es: **1. Uso básico con conjunto de condiciones completo**

source: **2. Using forbidden edges**
es: **2. Uso de bordes prohibidos**

source: You can specify edges that must *not* be tested or included (prior knowledge about the domain).
es: Puede especificar los bordes que *no* deben ser probados o incluidos (conocimiento previo sobre el dominio).

source: **3. Conservative rule**
es: **3. Gobierno conservador**

source: Keeps driver → target edges if **any conditioning set** shows dependence.
es: Mantiene los bordes del conductor → objetivo si **cualquier conjunto de condicionamiento** muestra dependencia.

source: Methods
es: Métodos

source: :py:obj:`TBFPC.__init__ <pymc_marketing.mmm.causal.TBFPC.__init__>`\ \(target\, \*\[\, ...\]\)
es: :py:obj:`TBFPC.__init__ <pymc_marketing.mmm.causal.TBFPC.__init__>`\ \(objetivo\, \*\[\, ...\]\)

source: Create a new TBFPC causal discovery model.
es: Cree un nuevo modelo de descubrimiento causal TBFPC.

source: :py:obj:`TBFPC.fit <pymc_marketing.mmm.causal.TBFPC.fit>`\ \(df\, drivers\)
es: :py:obj:`TBFPC.fit <pymc_marketing.mmm.causal.TBFPC.fit>`\ \(df\, controladores\)

source: Fit the TBFPC procedure to the supplied dataframe.
es: Ajuste el procedimiento TBFPC al dataframe proporcionado.

source: Enumerate all acyclic orientations (consistent extensions) of the CPDAG.
es: { "singular": "Enumere todas las orientaciones acíclicas (extensiones consistentes) del CPDAG.", "plural": "Enumeren todas las orientaciones acíclicas (extensiones consistentes) del CPDAG." }

source: Return directed edges learned by the algorithm.
es: Devolver los bordes dirigidos aprendidos por el algoritmo.

source: Return ΔBIC diagnostics for the unordered pair ``(x, y)``.
es: Devuelva los diagnósticos ΔBIC para el par no ordenado ``(x, y)``.

source: Return undirected edges remaining after orientation.
es: Devolver los bordes no dirigidos que quedan después de la orientación.

source: Render a text summary of the learned graph and test count.
es: Renderizar un resumen de texto del gráfico aprendido y el conteo de pruebas.

source: Return the learned graph encoded in DOT format.
es: Devuelva el grafo aprendido codificado en formato DOT.
