Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.events.po
Languages: es

source: events
es: eventos

source: Event transformations.
es: Transformaciones de eventos.

source: This module provides event transformations for use in Marketing Mix Models.
es: Este módulo proporciona transformaciones de eventos para su uso en Modelos de Mezcla de Marketing.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-events-1.pdf>`)

source: Functions
es: Funciones

source: :py:obj:`basis_from_dict <pymc_marketing.mmm.events.basis_from_dict>`\ \(data\)
es: :py:obj:`basis_from_dict <pymc_marketing.mmm.events.basis_from_dict>`\ \(datos\)

source: Create a basis transformation from a dictionary.
es: Cree una transformación de base a partir de un diccionario.

source: :py:obj:`days_from_reference <pymc_marketing.mmm.events.days_from_reference>`\ \(dates\, reference\_date\)
es: :py:obj:`days_from_reference <pymc_marketing.mmm.events.days_from_reference>`\ \(fechas\, fecha\_de\_referencia\)

source: Calculate the difference in days between dates and a reference date.
es: Calcule la diferencia en días entre las fechas y una fecha de referencia.

source: Classes
es: Clases

source: Asymmetric Gaussian bump basis transformation.
es: Transformación de base de bache gaussiano asimétrico.

source: Basis transformation associated with an event model.
es: Transformación de base asociada con un modelo de evento.

source: Event effect associated with an event model.
es: Efecto del evento asociado con un modelo de evento.

source: Gaussian basis transformation.
es: Transformación de la base gaussiana.

source: :py:obj:`HalfGaussianBasis <pymc_marketing.mmm.events.HalfGaussianBasis>`\ \(\[mode\, include\_event\]\)
es: :py:obj:`HalfGaussianBasis <pymc_marketing.mmm.events.HalfGaussianBasis>`\ \(\[modo\, incluir\_evento\]\)

source: One-sided Gaussian basis transformation.
es: Transformación de base gaussiana unidimensional.
