Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.po
Languages: es

source: utility
es: utilidad

source: Utility functions for Bayesian optimization.
es: Funciones utilitarias para la optimización bayesiana.

source: Key Concepts:
es: Conceptos Clave:

source: **Samples**:
es: **Muestras**:

source: A PyTensor tensor variable (`pt.TensorVariable`) representing samples drawn from the posterior distributions of the model outputs. These samples capture the uncertainty in the model predictions and are essential for computing expected utilities and risk measures in Bayesian optimization.
es: Una variable tensorial de PyTensor (`pt.TensorVariable`) que representa muestras extraídas de las distribuciones posteriores de las salidas del modelo. Estas muestras capturan la incertidumbre en las predicciones del modelo y son esenciales para calcular utilidades esperadas y medidas de riesgo en la optimización bayesiana.

source: **Budgets**:
es: **Presupuestos**:

source: A PyTensor tensor variable representing a set of monetary budgets allocated to different assets, investments, or channels. Each element corresponds to the budget for a specific option in the optimization process.
es: Una variable tensorial de PyTensor que representa un conjunto de presupuestos monetarios asignados a diferentes activos, inversiones o canales. Cada elemento corresponde al presupuesto para una opción específica en el proceso de optimización.

source: Functions
es: Funciones

source: :py:obj:`adjusted_value_at_risk_score <pymc_marketing.mmm.utility.adjusted_value_at_risk_score>`\ \(\[...\]\)
es: :py:obj:`puntuación_de_riesgo_ajustado <pymc_marketing.mmm.utility.puntuación_de_riesgo_ajustado>`\ \(\[...\]\)

source: Calculate adjusted Value at Risk (AVaR) score.
es: Calcular la puntuación de Valor en Riesgo Ajustado (AVaR).

source: :py:obj:`average_response <pymc_marketing.mmm.utility.average_response>`\ \(samples\, budgets\)
es: :py:obj:`average_response <pymc_marketing.mmm.utility.average_response>`\ \(muestras\, presupuestos\)

source: Compute the average response of the posterior predictive distribution.
es: Calcule la respuesta promedio de la distribución predictiva posterior.

source: :py:obj:`conditional_value_at_risk <pymc_marketing.mmm.utility.conditional_value_at_risk>`\ \(\[confidence\_level\]\)
es: :py:obj:`conditional_value_at_risk <pymc_marketing.mmm.utility.conditional_value_at_risk>`\ \(\[nivel\_de\_confianza\]\)

source: Calculate the Conditional Value at Risk (CVaR) at a specified confidence level.
es: Calcule el Valor en Riesgo Condicional (CVaR) a un nivel de confianza especificado.

source: :py:obj:`diversification_ratio <pymc_marketing.mmm.utility.diversification_ratio>`\ \(samples\, budgets\)
es: :py:obj:`diversification_ratio <pymc_marketing.mmm.utility.diversification_ratio>`\ \(muestras\, presupuestos\)

source: Calculate the Diversification Ratio of a portfolio to evaluate risk distribution.
es: Calcule el Ratio de Diversificación de una cartera para evaluar la distribución del riesgo.

source: :py:obj:`mean_tightness_score <pymc_marketing.mmm.utility.mean_tightness_score>`\ \(\[alpha\, confidence\_level\]\)
es: :py:obj:`mean_tightness_score <pymc_marketing.mmm.utility.mean_tightness_score>`\ \(\[alpha\, nivel\_de\_confianza\]\)

source: Calculate the Mean Tightness Score (MTS).
es: Calcule el Puntaje Medio de Ajuste (MTS).

source: :py:obj:`portfolio_entropy <pymc_marketing.mmm.utility.portfolio_entropy>`\ \(samples\, budgets\)
es: :py:obj:`portfolio_entropy <pymc_marketing.mmm.utility.portfolio_entropy>`\ \(muestras\, presupuestos\)

source: Calculate the entropy of a portfolio's asset weights to assess diversification.
es: Calcule la entropía de los pesos de los activos de una cartera para evaluar la diversificación.

source: :py:obj:`raroc <pymc_marketing.mmm.utility.raroc>`\ \(\[risk\_free\_rate\]\)
es: :py:obj:`raroc <pymc_marketing.mmm.utility.raroc>`\ \(\[tasa\_libre\_de\_riesgo\]\)

source: Calculate the Risk-Adjusted Return on Capital (RAROC).
es: Calcule el Retorno sobre el Capital Ajustado por Riesgo (RAROC).

source: :py:obj:`sharpe_ratio <pymc_marketing.mmm.utility.sharpe_ratio>`\ \(\[risk\_free\_rate\]\)
es: :py:obj:`sharpe_ratio <pymc_marketing.mmm.utility.sharpe_ratio>`\ \(\[tasa\_libre\_de\_riesgo\]\)

source: Calculate the Sharpe Ratio.
es: Calcule el Ratio de Sharpe.

source: :py:obj:`tail_distance <pymc_marketing.mmm.utility.tail_distance>`\ \(\[confidence\_level\]\)
es: :py:obj:`tail_distance <pymc_marketing.mmm.utility.tail_distance>`\ \(\[nivel\_de\_confianza\]\)

source: Calculate the absolute distance between the mean and the quantiles.
es: Calcule la distancia absoluta entre la media y los cuantiles.

source: :py:obj:`value_at_risk <pymc_marketing.mmm.utility.value_at_risk>`\ \(\[confidence\_level\]\)
es: :py:obj:`value_at_risk <pymc_marketing.mmm.utility.value_at_risk>`\ \(\[nivel\_de\_confianza\]\)

source: Calculate the Value at Risk (VaR) at a specified confidence level.
es: Calcule el Valor en Riesgo (VaR) a un nivel de confianza especificado.
