Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.plotting.po
Languages: es

source: plotting
es: trazado

source: Plotting functions for the CLV module.
es: Funciones de trazado para el módulo CLV.

source: Functions
es: Funciones

source: Plot the recency and T of DataFrame of customers.
es: Trazar la recencia y T del DataFrame de clientes.

source: :py:obj:`plot_expected_purchases_over_time <pymc_marketing.clv.plotting.plot_expected_purchases_over_time>`\ \(model\, ...\)
es: :py:obj:`plot_expected_purchases_over_time <pymc_marketing.clv.plotting.plot_expected_purchases_over_time>`\ \(modelo\, ...\)

source: Plot actual and expected purchases over time for a fitted ``BetaGeoModel`` or ``ParetoNBDModel``.
es: Grafique las compras reales y esperadas a lo largo del tiempo para un ``BetaGeoModel`` o ``ParetoNBDModel`` ajustado.

source: :py:obj:`plot_expected_purchases_ppc <pymc_marketing.clv.plotting.plot_expected_purchases_ppc>`\ \(model\[\, ppc\, ...\]\)
es: :py:obj:`plot_expected_purchases_ppc <pymc_marketing.clv.plotting.plot_expected_purchases_ppc>`\ \(modelo\[\, ppc\, ...\]\)

source: Plot a prior or posterior predictive check for the customer purchase frequency distribution.
es: Trace un chequeo predictivo previo o posterior para la distribución de frecuencia de compras del cliente.

source: :py:obj:`plot_frequency_recency_matrix <pymc_marketing.clv.plotting.plot_frequency_recency_matrix>`\ \(model\[\, ...\]\)
es: :py:obj:`plot_frequency_recency_matrix <pymc_marketing.clv.plotting.plot_frequency_recency_matrix>`\ \(modelo\[\, ...\]\)

source: Plot expected purchases in *future_t* time periods as a heatmap based on customer population *frequency* and *recency*.
es: Representar las compras esperadas en *future_t* períodos de tiempo como un mapa de calor basado en la población de clientes *frequency* y *recency*.

source: :py:obj:`plot_probability_alive_matrix <pymc_marketing.clv.plotting.plot_probability_alive_matrix>`\ \(model\[\, ...\]\)
es: :py:obj:`plot_probability_alive_matrix <pymc_marketing.clv.plotting.plot_probability_alive_matrix>`\ \(modelo\[\, ...\]\)

source: Plot probability alive matrix as a heatmap based on customer population *frequency* and *recency*.
es: Trazar la matriz de probabilidad de supervivencia como un mapa de calor basado en la *frecuencia* y *recencia* de la población de clientes.
