Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.prior.po
Languages: es

source: prior
es: anterior

source: Class that represents a prior distribution.
es: Clase que representa una distribución a priori.

source: The `Prior` class is a wrapper around PyMC distributions that allows the user to create outside of the PyMC model.
es: La clase `Prior` es un contenedor para las distribuciones de PyMC que permite al usuario crear fuera del modelo de PyMC.

source: This module has been deprecated and is moved to `pymc_extras.prior`.
es: Este módulo ha sido desaprobado y se ha trasladado a `pymc_extras.prior`.

source: This is the alternative to using the dictionaries in PyMC-Marketing models.
es: Esta es la alternativa a utilizar los diccionarios en los modelos de PyMC-Marketing.

source: Examples
es: Ejemplos

source: Create a normal prior.
es: Cree un prior normal.

source: Create a hierarchical normal prior by using distributions for the parameters and specifying the dims.
es: Cree un prior normal jerárquico utilizando distribuciones para los parámetros y especificando las dimensiones.

source: Create a non-centered hierarchical normal prior with the `centered` parameter.
es: Cree un prior normal jerárquico no centrado con el parámetro `centered`.

source: Create a hierarchical beta prior by using Beta distribution, distributions for the parameters, and specifying the dims.
es: Cree un prior beta jerárquico utilizando la distribución Beta, distribuciones para los parámetros y especificando las dimensiones.

source: Create a transformed hierarchical normal prior by using the `transform` parameter. Here the "sigmoid" transformation comes from `pm.math`.
es: Cree un prior normal jerárquico transformado utilizando el parámetro `transform`. Aquí la transformación "sigmoide" proviene de `pm.math`.

source: Create a prior with a custom transform function by registering it with `register_tensor_transform`.
es: Cree un previo con una función de transformación personalizada registrándola con `register_tensor_transform`.

source: Functions
es: Funciones

source: :py:obj:`deserialize_alternative_prior <pymc_marketing.prior.deserialize_alternative_prior>`\ \(data\)
es: :py:obj:`deserialize_alternative_prior <pymc_marketing.prior.deserialize_alternative_prior>`\ \(datos\)

source: Alternative deserializer that recursively handles all nested parameters.
es: Deserializador alternativo que maneja recursivamente todos los parámetros anidados.

source: :py:obj:`is_alternative_prior <pymc_marketing.prior.is_alternative_prior>`\ \(data\)
es: msgid: :py:obj:`is_alternative_prior <pymc_marketing.prior.is_alternative_prior>`\ \(data\) msgstr: :py:obj:`is_alternative_prior <pymc_marketing.prior.is_alternative_prior>`\ \(data\)

source: Check if the data is a dictionary representing a Prior (alternative check).
es: Verifique si los datos son un diccionario que representa un Prior (verificación alternativa).

source: Warn about the deprecation of this module.
es: Advertir sobre la descontinuación de este módulo.

source: Warn about the deprecation of this function.
es: Advertir sobre la descontinuación de esta función.

source: Classes
es: Clases

source: :py:obj:`Censored <pymc_marketing.prior.Censored>`\ \(distribution\[\, lower\, upper\]\)
es: :py:obj:`Censurado <pymc_marketing.prior.Censurado>`\ \(distribución\[\, inferior\, superior\]\)

source: Backwards-compatible wrapper for the CensoredPrior class.
es: Wrapper compatible hacia atrás para la clase CensoredPrior.

source: Backwards-compatible wrapper for the Prior class.
es: Envoltura compatible hacia atrás para la clase Prior.

source: Backwards-compatible wrapper for the ScaledPrior class.
es: Envoltura compatible hacia atrás para la clase ScaledPrior.
