Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.bass.model.po
Languages: es

source: model
es: modelo

source: Bass diffusion model for product adoption.
es: Modelo de difusión de Bass para la adopción de productos.

source: Adapted from Wiki: https://en.wikipedia.org/wiki/Bass_diffusion_model
es: Adaptado de Wiki: https://es.wikipedia.org/wiki/Modelo_de_difusi%C3%B3n_de_Bass

source: The Bass diffusion model, developed by Frank Bass in 1969, is a mathematical model that describes the process of how new products get adopted in a population over time. It is widely used in marketing, forecasting, and innovation studies to predict the adoption rates of new products and technologies.
es: El modelo de difusión de Bass, desarrollado por Frank Bass en 1969, es un modelo matemático que describe el proceso de cómo los nuevos productos son adoptados en una población a lo largo del tiempo. Se utiliza ampliamente en marketing, pronósticos y estudios de innovación para predecir las tasas de adopción de nuevos productos y tecnologías.

source: Mathematical Formulation
es: Formulación Matemática

source: The model is based on a differential equation that describes the rate of adoption:
es: El modelo se basa en una ecuación diferencial que describe la tasa de adopción:

source: Where:
es: Dónde:

source: :math:`F(t)` is the installed base fraction (cumulative proportion of adopters)
es: :math:`F(t)` es la fracción de base instalada (proporción acumulativa de adoptantes)

source: :math:`f(t)` is the rate of change of the installed base fraction (:math:`f(t) = F'(t)`)
es: :math:`f(t)` es la tasa de cambio de la fracción de la base instalada (:math:`f(t) = F'(t)`)

source: :math:`p` is the coefficient of innovation or external influence
es: :math:`p` es el coeficiente de innovación o influencia externa

source: :math:`q` is the coefficient of imitation or internal influence
es: :math:`q` es el coeficiente de imitación o influencia interna

source: The solution to this equation gives the adoption curve:
es: La solución a esta ecuación proporciona la curva de adopción:

source: The adoption rate at time t is given by:
es: La tasa de adopción en el tiempo t se da por:

source: Key Parameters
es: Parámetros clave

source: The model has three main parameters:
es: El modelo tiene tres parámetros principales:

source: :math:`m`: Market potential (total number of eventual adopters)
es: :math:`m`: Potencial de mercado (número total de posibles adoptantes)

source: :math:`p`: Coefficient of innovation (external influence) - typically 0.01-0.03
es: :math:`p`: Coeficiente de innovación (influencia externa) - típicamente 0.01-0.03

source: :math:`q`: Coefficient of imitation (internal influence) - typically 0.3-0.5
es: :math:`q`: Coeficiente de imitación (influencia interna) - típicamente 0.3-0.5

source: Parameter Interpretation
es: Interpretación de Parámetros

source: A higher :math:`p` value indicates stronger external influence (advertising, marketing)
es: Un valor de :math:`p` más alto indica una influencia externa más fuerte (publicidad, marketing)

source: A higher :math:`q` value indicates stronger internal influence (word-of-mouth, social interactions)
es: Un valor de :math:`q` más alto indica una influencia interna más fuerte (boca a boca, interacciones sociales)

source: The ratio :math:`q/p` indicates the relative strength of internal vs. external influences
es: La relación :math:`q/p` indica la fuerza relativa de las influencias internas frente a las externas.

source: The peak of adoption occurs at time :math:`t^* = \frac{\ln(q/p)}{p+q}`
es: El pico de adopción ocurre en el tiempo :math:`t^* = \frac{\ln(q/p)}{p+q}`

source: Applications
es: Aplicaciones

source: The Bass model has been applied to forecast the adoption of various products and technologies:
es: El modelo Bass se ha aplicado para predecir la adopción de diversos productos y tecnologías:

source: Consumer durables (TVs, refrigerators)
es: Bienes de consumo duraderos (televisores, refrigeradores)

source: Technology products (smartphones, software)
es: Productos tecnológicos (smartphones, software)

source: Pharmaceutical products
es: Productos farmacéuticos

source: Entertainment products
es: Productos de entretenimiento

source: Services and subscriptions
es: Servicios y suscripciones

source: This implementation provides a Bayesian version of the Bass model using PyMC, allowing for: - Uncertainty quantification through prior distributions - Hierarchical modeling for multiple products/markets - Extension to incorporate additional factors
es: Esta implementación proporciona una versión bayesiana del modelo de Bass utilizando PyMC, lo que permite: - Cuantificación de la incertidumbre a través de distribuciones a priori - Modelado jerárquico para múltiples productos/mercados - Extensión para incorporar factores adicionales

source: Examples
es: Ejemplos

source: Create a basic Bass model for multiple products:
es: Cree un modelo Bass básico para múltiples productos:

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-bass-model-1.pdf>`)

source: Functions
es: Funciones

source: Installed base fraction (cumulative adoption proportion).
es: Fracción de base instalada (proporción de adopción acumulativa).

source: :py:obj:`create_bass_model <pymc_marketing.bass.model.create_bass_model>`\ \(t\, observed\, priors\, coords\)
es: :py:obj:`create_bass_model <pymc_marketing.bass.model.create_bass_model>`\ \(t\, observados\, priors\, coords\)

source: Define a Bass diffusion model for product adoption forecasting.
es: Defina un modelo de difusión de Bass para la previsión de la adopción de productos.

source: Installed base fraction rate of change (adoption rate).
es: Tasa de cambio de la fracción de base instalada (tasa de adopción).
