Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.model_builder.create_idata_accessor.po
Languages: es

source: Create a property accessor for an InferenceData object.
es: Cree un accesor de propiedad para un objeto InferenceData.

source: Underlying object must have an InferenceData object attribute named 'idata'.
es: El objeto subyacente debe tener un atributo de objeto InferenceData llamado 'idata'.

source: Parameters
es: Par√°metros

source: **value** : :class:`python:str`
es: **valor** : :class:`python:str`

source: The value to access in the InferenceData object.
es: El valor a acceder en el objeto InferenceData.

source: **message** : :class:`python:str`
es: **mensaje** : :class:`python:str`

source: The error message to raise if the value is not found in the InferenceData object.
es: El mensaje de error que se debe generar si el valor no se encuentra en el objeto InferenceData.

source: Returns
es: Devoluciones

source: :obj:`property`
es: :obj:`propiedad`

source: The property accessor for the InferenceData object.
es: El accesor de propiedad para el objeto InferenceData.
