Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.prior.Censored.po
Languages: es

source: Censored
es: Censurado

source: Backwards-compatible wrapper for the CensoredPrior class.
es: Envoltura compatible hacia atrás para la clase CensoredPrior.

source: Methods
es: Métodos

source: Initialize the CensoredPrior class with the given arguments.
es: Inicializa la clase CensoredPrior con los argumentos dados.

source: :py:obj:`Censored.create_likelihood_variable <pymc_marketing.prior.Censored.create_likelihood_variable>`\ \(name\, ...\)
es: :py:obj:`Censored.create_likelihood_variable <pymc_marketing.prior.Censored.create_likelihood_variable>`\ \(nombre\, ...\)

source: Create observed censored variable.
es: Crear variable censurada observada.

source: :py:obj:`Censored.create_variable <pymc_marketing.prior.Censored.create_variable>`\ \(name\)
es: :py:obj:`Censored.create_variable <pymc_marketing.prior.Censored.create_variable>`\ \(nombre\)

source: Create censored random variable.
es: Crear variable aleatoria censurada.

source: :py:obj:`Censored.from_dict <pymc_marketing.prior.Censored.from_dict>`\ \(data\)
es: :py:obj:`Censored.from_dict <pymc_marketing.prior.Censored.from_dict>`\ \(datos\)

source: Create a censored distribution from a dictionary.
es: Cree una distribución censurada a partir de un diccionario.

source: Sample the prior distribution for the variable.
es: Muestre la distribución previa para la variable.

source: Convert the censored distribution to a dictionary.
es: Convierte la distribución censurada a un diccionario.

source: Generate a graph of the variables.
es: Generar un gráfico de las variables.

source: Attributes
es: Atributos

source: The dims from the distribution to censor.
es: Los tonos de la distribución para censurar.

source: :py:obj:`distribution <pymc_marketing.prior.Censored.distribution>`\
es: :py:obj:`distribución <pymc_marketing.prior.Censored.distribución>`\
