Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utility.mean_tightness_score.po
Languages: es

source: mean\_tightness\_score
es: puntuación\_de\_apretamiento\_promedio

source: Calculate the Mean Tightness Score (MTS).
es: Calcule el Puntaje Medio de Ajuste (MTS).

source: MTS balances the posterior mean against a symmetric, quantile-based tail spread and returns a dimensionless, normalized score:
es: MTS equilibra la media posterior contra un rango de cola simétrico basado en cuantiles y devuelve una puntuación normalizada adimensional:

source: where:
es: donde:

source: :math:`\mu` is the posterior mean of the samples.
es: :math:`\mu` es la media posterior de las muestras.

source: :math:`T_p(X) = |Q_p - \mu| + |\mu - Q_{1-p}|` is a symmetric tail distance.
es: :math:`T_p(X) = |Q_p - \mu| + |\mu - Q_{1-p}|` es una distancia de cola simétrica.

source: Larger :math:`T_p` indicates a more dispersed posterior and thus a lower score.
es: Un mayor :math:`T_p` indica una posterior más dispersa y, por lo tanto, una puntuación más baja.

source: This formulation makes the following properties explicit:
es: Esta formulación hace explícitas las siguientes propiedades:

source: :math:`\alpha` controls risk aversion: increasing :math:`\alpha` increases the penalty on dispersion, so the score decreases for more spread posteriors (all else equal).
es: :math:`\alpha` controla la aversión al riesgo: aumentar :math:`\alpha` incrementa la penalización por dispersión, por lo que la puntuación disminuye para posteriors más dispersos (todo lo demás igual).

source: With :math:`\alpha = 0`, the score is identically 1 for any samples (no preference signal).
es: Con :math:`\alpha = 0`, la puntuación es idénticamente 1 para cualquier muestra (sin señal de preferencia).

source: For fixed :math:`X` and :math:`p`, the score is linear and non-increasing in :math:`\alpha`.
es: Para un :math:`X` y :math:`p` fijos, la puntuación es lineal y no creciente en :math:`\alpha`.

source: For fixed :math:`X` and :math:`\alpha`, the score is non-increasing in :math:`p` (since :math:`Q_p - Q_{1-p}` widens as :math:`p` moves away from 0.5).
es: Para un :math:`X` y un :math:`\alpha` fijos, la puntuación no aumenta en :math:`p` (ya que :math:`Q_p - Q_{1-p}` se amplía a medida que :math:`p` se aleja de 0.5).

source: Parameters
es: Parámetros

source: **alpha** : :class:`python:float`, optional
es: **alpha** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: Risk-aversion weight. Larger values increase the penalty from tail spread (default 0.5).
es: Peso de aversión al riesgo. Valores más grandes aumentan la penalización por la dispersión de colas (valor predeterminado 0.5).

source: **confidence_level** : :class:`python:float`, optional
es: **nivel_de_confianza** : :class:`python:float`, opcional

source: Quantile probability :math:`p \in (0, 1)` used to compute :math:`T_p`. Typical choices are :math:`p \in [0.6, 0.9]` (default 0.75).
es: Probabilidad cuántica :math:`p \in (0, 1)` utilizada para calcular :math:`T_p`. Las elecciones típicas son :math:`p \in [0.6, 0.9]` (predeterminado 0.75).

source: Returns
es: Devoluciones

source: A function that calculates the normalized mean tightness score given samples and budgets.
es: Una función que calcula la puntuación de ajuste media normalizada dada muestras y presupuestos.

source: Raises
es: Aumentos

source: If ``confidence_level`` is not between 0 and 1.
es: Si ``confidence_level`` no está entre 0 y 1.
