Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.plot.create_legend_handles.po
Languages: es

source: create\_legend\_handles
es: crear_manejadores_de_leyenda

source: Create the legend handles for the given colors.
es: Cree los controladores de leyenda para los colores dados.

source: Parameters
es: Parámetros

source: **colors** : :obj:`Iterable`\[:class:`python:str`]
es: **colores** : :obj:`Iterable`\[:class:`python:str`]

source: The colors to create the legend handles.
es: Los colores para crear los manejadores de la leyenda.

source: **alpha** : :class:`python:float`, optional
es: **alpha** : :class:`python:float`, opcional

source: python:float, optional
es: python:flotante, opcional

source: The alpha value for the patches, by default 0.5.
es: El valor alfa para los parches, por defecto 0.5.

source: **line** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **línea** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to include the line, by default True.
es: Si incluir la línea, por defecto Verdadero.

source: **patch** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **patch** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to include the patch, by default True.
es: Si incluir el parche, por defecto Verdadero.

source: Returns
es: Devoluciones

source: The legend handles.
es: La leyenda maneja.
