Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.tvp.po
Languages: es

source: Time Varying Gaussian Process Multiplier for Marketing Mix Modeling (MMM).
es: Multiplicador de Proceso Gaussiano Variable en el Tiempo para Modelado de Mezcla de Marketing (MMM).

source: Designed to model time-varying effects in marketing mix models (MMM).
es: Diseñado para modelar efectos variables en el tiempo en modelos de mezcla de marketing (MMM).

source: This module provides a time-varying Gaussian Process (GP) multiplier, using the Hilbert Space Gaussian Process (HSGP) approximation.
es: Este módulo proporciona un multiplicador de Proceso Gaussiano (GP) que varía en el tiempo, utilizando la aproximación del Proceso Gaussiano en Espacio de Hilbert (HSGP).

source: Examples
es: Ejemplos

source: Create a basic PyMC model using the time-varying GP multiplier:
es: Cree un modelo básico de PyMC utilizando el multiplicador GP variable en el tiempo:

source: Functions
es: Funciones

source: :py:obj:`create_time_varying_gp_multiplier <pymc_marketing.mmm.tvp.create_time_varying_gp_multiplier>`\ \(name\, ...\)
es: :py:obj:`create_time_varying_gp_multiplier <pymc_marketing.mmm.tvp.create_time_varying_gp_multiplier>`\ \(nombre\, ...\)

source: Create a time-varying Gaussian Process multiplier.
es: Cree un multiplicador de Proceso Gaussiano que varíe en el tiempo.

source: Infer the time-index given a new dataset.
es: Infiera el índice de tiempo dado un nuevo conjunto de datos.

source: :py:obj:`time_varying_prior <pymc_marketing.mmm.tvp.time_varying_prior>`\ \(name\, X\, dims\[\, X\_mid\, ...\]\)
es: :py:obj:`time_varying_prior <pymc_marketing.mmm.tvp.time_varying_prior>`\ \(nombre\, X\, dimensiones\[\, X\_mid\, ...\]\)

source: Time varying prior, based on the Hilbert Space Gaussian Process (HSGP).
es: Prior variable en el tiempo, basado en el Proceso Gaussiano del Espacio de Hilbert (HSGP).
