Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.transformers.michaelis_menten.po
Languages: es

source: Evaluate the Michaelis-Menten function for given values of x, alpha, and lambda.
es: Evalúe la función de Michaelis-Menten para los valores dados de x, alpha y lambda.

source: where:
es: donde:

source: :math:`x`: Channel spend.
es: :math:`x`: Gasto del canal.

source: :math:`\alpha`: Maximum contribution.
es: :math:`\alpha`: Contribución máxima.

source: :math:`\lambda` (k): The half-saturation point.
es: :math:`\lambda` (k): El punto de media saturación.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-1.pdf>`)

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_00_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_00_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_00_00.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_00_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_00_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_00_00.pdf>`)

source: (:download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_01_00.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_01_00.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_01_00.pdf>`)
es: (:descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_01_00.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_01_00.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-transformers-michaelis_menten-2_01_00.pdf>`)

source: Parameters
es: Parámetros

source: The spent on a channel.
es: El gasto en un canal.

source: The saturation point. It represents the maximium number of customers that could be acquired through this channel at any point time. Must be non-negative.
es: El punto de saturación. Representa el número máximo de clientes que se podrían adquirir a través de este canal en cualquier momento. Debe ser no negativo.

source: The half-saturation point. Larger values represent less efficient channels.
es: El punto de media saturación. Valores más grandes representan canales menos eficientes.

source: Returns
es: Devoluciones

source: The value of the Michaelis-Menten function given the parameters.
es: El valor de la función de Michaelis-Menten dado los parámetros.
