Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.model_config.parse_model_config.po
Languages: es

source: Parse the model config dictionary.
es: Analiza el diccionario de configuración del modelo.

source: Parameters
es: Parámetros

source: The model configuration dictionary.
es: El diccionario de configuración del modelo.

source: **hsgp_kwargs_fields** : :class:`python:list`\[:class:`python:str`], optional
es: **hsgp_kwargs_fields** : :class:`python:list`\[:class:`python:str`], opcional

source: python:list[python:str], optional
es: python:list[python:str], opcional

source: A list of keys to parse as HSGP kwargs.
es: Una lista de claves para analizar como argumentos de palabras clave HSGP.

source: **non_distributions** : :class:`python:list`\[:class:`python:str`], optional
es: **non_distributions** : :class:`python:list`\[:class:`python:str`], opcional

source: A list of keys to ignore when parsing the model configuration dictionary due to them not being distributions.
es: Una lista de claves a ignorar al analizar el diccionario de configuración del modelo debido a que no son distribuciones.

source: Returns
es: Devoluciones

source: The parsed model configuration dictionary.
es: El diccionario de configuración del modelo analizado.

source: Examples
es: Ejemplos

source: Parse all keys in model configuration but ignore the key "tvp_intercept".
es: Analiza todas las claves en la configuración del modelo, pero ignora la clave "tvp_intercept".

source: Parsing with an error:
es: Analizando con un error:
