Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.events.EventEffect.po
Languages: es

source: EventEffect
es: EfectoEvento

source: Event effect associated with an event model.
es: Efecto del evento asociado con un modelo de evento.

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabras clave.

source: :py:obj:`EventEffect.apply <pymc_marketing.mmm.events.EventEffect.apply>`\ \(X\[\, name\]\)
es: :py:obj:`EventEffect.apply <pymc_marketing.mmm.events.EventEffect.apply>`\ \(X\[\, nombre\]\)

source: Apply the event effect to the data.
es: Aplica el efecto del evento a los datos.

source: :py:obj:`EventEffect.copy <pymc_marketing.mmm.events.EventEffect.copy>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`EventEffect.copy <pymc_marketing.mmm.events.EventEffect.copy>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`EventEffect.dict <pymc_marketing.mmm.events.EventEffect.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`EventEffect.dict <pymc_marketing.mmm.events.EventEffect.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: :py:obj:`EventEffect.from_dict <pymc_marketing.mmm.events.EventEffect.from_dict>`\ \(data\)
es: :py:obj:`EventEffect.from_dict <pymc_marketing.mmm.events.EventEffect.from_dict>`\ \(datos\)

source: Create an event effect from a dictionary.
es: Cree un efecto de evento a partir de un diccionario.

source: :py:obj:`EventEffect.json <pymc_marketing.mmm.events.EventEffect.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`EventEffect.json <pymc_marketing.mmm.events.EventEffect.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`EventEffect.model_copy <pymc_marketing.mmm.events.EventEffect.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`EventEffect.model_copy <pymc_marketing.mmm.events.EventEffect.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`EventEffect.model_dump <pymc_marketing.mmm.events.EventEffect.model_dump>`\ \(\*\[\, mode\, include\, ...\]\)
es: :py:obj:`EventEffect.model_dump <pymc_marketing.mmm.events.EventEffect.model_dump>`\ \(\*\[\, modo\, incluir\, ...\]\)

source: :py:obj:`EventEffect.model_json_schema <pymc_marketing.mmm.events.EventEffect.model_json_schema>`\ \(\[by\_alias\, ...\]\)
es: :py:obj:`EventEffect.model_json_schema <pymc_marketing.mmm.events.EventEffect.model_json_schema>`\ \(\[por\_alias\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para parametrizaciones de clases genéricas.

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`EventEffect.model_rebuild <pymc_marketing.mmm.events.EventEffect.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`EventEffect.model_rebuild <pymc_marketing.mmm.events.EventEffect.model_rebuild>`\ \(\*\[\, forzar\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: :py:obj:`EventEffect.model_validate <pymc_marketing.mmm.events.EventEffect.model_validate>`\ \(obj\, \*\[\, strict\, ...\]\)
es: :py:obj:`EventEffect.model_validate <pymc_marketing.mmm.events.EventEffect.model_validate>`\ \(obj\, \*\[\, estricto\, ...\]\)

source: Validate a pydantic model instance.
es: Valide una instancia de modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: :py:obj:`EventEffect.parse_file <pymc_marketing.mmm.events.EventEffect.parse_file>`\ \(path\, \*\[\, ...\]\)
es: :py:obj:`EventEffect.parse_file <pymc_marketing.mmm.events.EventEffect.parse_file>`\ (ruta\, \*\[\, ...\]\)

source: :py:obj:`EventEffect.parse_raw <pymc_marketing.mmm.events.EventEffect.parse_raw>`\ \(b\, \*\[\, content\_type\, ...\]\)
es: :py:obj:`EventEffect.parse_raw <pymc_marketing.mmm.events.EventEffect.parse_raw>`\ \(b\, \*\[\, tipo\_de\_contenido\, ...\]\)

source: :py:obj:`EventEffect.schema <pymc_marketing.mmm.events.EventEffect.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`EventEffect.schema <pymc_marketing.mmm.events.EventEffect.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`EventEffect.schema_json <pymc_marketing.mmm.events.EventEffect.schema_json>`\ \(\*\[\, by\_alias\, ...\]\)
es: :py:obj:`EventEffect.schema_json <pymc_marketing.mmm.events.EventEffect.schema_json>`\ \(\*\[\, por\_alias\, ...\]\)

source: :py:obj:`EventEffect.to_dict <pymc_marketing.mmm.events.EventEffect.to_dict>`\ \(\)
es: msgid: :py:obj:`EventEffect.to_dict <pymc_marketing.mmm.events.EventEffect.to_dict>`\ \(\) msgstr: :py:obj:`EventEffect.to_dict <pymc_marketing.mmm.events.EventEffect.to_dict>`\ \(\)

source: Convert the event effect to a dictionary.
es: Convierte el efecto del evento a un diccionario.

source: :py:obj:`EventEffect.validate <pymc_marketing.mmm.events.EventEffect.validate>`\ \(value\)
es: :py:obj:`EventEffect.validate <pymc_marketing.mmm.events.EventEffect.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.

source: :py:obj:`effect_size <pymc_marketing.mmm.events.EventEffect.effect_size>`\
es: :py:obj:`tamaño_efecto <pymc_marketing.mmm.events.EventEffect.tamaño_efecto>`\
