Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.models.po
Languages: es

source: models
es: modelos

source: CLV models.
es: Modelos de CLV.

source: Modules
es: Módulos

source: :py:obj:`basic <pymc_marketing.clv.models.basic>`\
es: :py:obj:`básico <pymc_marketing.clv.models.basic>`\

source: CLV Model base class.
es: Clase base del modelo CLV.

source: Beta-Geometric Negative Binomial Distribution (BG/NBD) model for a non-contractual customer population across continuous time.
es: Modelo de distribución binomial negativa geométrica beta (BG/NBD) para una población de clientes no contractuales a lo largo del tiempo continuo.

source: Beta-Geometric/Beta-Binomial Model.
es: Modelo Beta-Geométrico/Beta-Binomial.

source: Gamma-Gamma Model for expected future monetary value.
es: Modelo Gamma-Gamma para el valor monetario futuro esperado.

source: Modified Beta-Geometric Negative Binomial Distribution (MBG/NBD) model for a non-contractual customer population across continuous time.
es: Modelo de distribución binomial negativa geométrica modificada (MBG/NBD) para una población de clientes no contractuales a lo largo del tiempo continuo.

source: Pareto NBD Model.
es: Modelo NBD de Pareto.

source: Shifted Beta Geometric model.
es: Modelo geométrico beta desplazado.
