Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.utils.po
Languages: es

source: utils
es: utilidades

source: Utility functions for the Marketing Mix Modeling module.
es: Funciones utilitarias para el módulo de Modelado de Mezcla de Marketing.

source: Functions
es: Funciones

source: :py:obj:`add_noise_to_channel_allocation <pymc_marketing.mmm.utils.add_noise_to_channel_allocation>`\ \(df\, channels\)
es: msgid: :py:obj:`add_noise_to_channel_allocation <pymc_marketing.mmm.utils.add_noise_to_channel_allocation>`\ \(df\, channels\) msgstr: :py:obj:`add_noise_to_channel_allocation <pymc_marketing.mmm.utils.add_noise_to_channel_allocation>`\ \(df\, channels\)

source: Return *df* with additive Gaussian noise applied to *channels* columns.
es: Devuelve *df* con ruido gaussiano aditivo aplicado a las columnas *channels*.

source: :py:obj:`apply_sklearn_transformer_across_dim <pymc_marketing.mmm.utils.apply_sklearn_transformer_across_dim>`\ \(data\, ...\)
es: :py:obj:`apply_sklearn_transformer_across_dim <pymc_marketing.mmm.utils.apply_sklearn_transformer_across_dim>`\ \(datos\, ...\)

source: Apply a scikit-learn transformer across a dimension of an xarray DataArray.
es: Aplique un transformador de scikit-learn a través de una dimensión de un xarray DataArray.

source: Create an index to take the first dimension of a tensor based on the provided dimensions.
es: Cree un índice para tomar la primera dimensión de un tensor basado en las dimensiones proporcionadas.

source: :py:obj:`create_new_spend_data <pymc_marketing.mmm.utils.create_new_spend_data>`\ \(spend\, ...\[\, ...\]\)
es: :py:obj:`create_new_spend_data <pymc_marketing.mmm.utils.create_new_spend_data>`\ \(gasto\, ...\[\, ...\]\)

source: Create new spend data for the channel forward pass.
es: Cree nuevos datos de gasto para el canal de pase hacia adelante.

source: :py:obj:`create_zero_dataset <pymc_marketing.mmm.utils.create_zero_dataset>`\ \(model\, start\_date\, end\_date\)
es: :py:obj:`create_zero_dataset <pymc_marketing.mmm.utils.create_zero_dataset>`\ \(modelo\, fecha\_de\_inicio\, fecha\_de\_fin\)

source: Create a DataFrame for future prediction, with zeros (or supplied constants).
es: Cree un DataFrame para la predicción futura, con ceros (o constantes suministradas).

source: :py:obj:`transform_1d_array <pymc_marketing.mmm.utils.transform_1d_array>`\ \(transform\, y\)
es: :py:obj:`transform_1d_array <pymc_marketing.mmm.utils.transform_1d_array>`\ \(transformar\, y\)

source: Transform a 1D array using a scikit-learn transformer.
es: Transformar un array unidimensional utilizando un transformador de scikit-learn.
