Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.additive_effect.LinearTrendEffect.po
Languages: es

source: LinearTrendEffect
es: EfectoTendenciaLineal

source: Wrapper for LinearTrend to use with MMM's MuEffect protocol.
es: Envoltorio para LinearTrend para usar con el protocolo MuEffect de MMM.

source: This class adapts the LinearTrend component to be used as an additive effect in the MMM model.
es: Esta clase adapta el componente LinearTrend para ser utilizado como un efecto aditivo en el modelo MMM.

source: Parameters
es: Parámetros

source: **trend** : :obj:`LinearTrend`
es: **tendencia** : :obj:`LinearTrend`

source: LinearTrend
es: TendenciaLineal

source: The LinearTrend instance to wrap.
es: La instancia LinearTrend a envolver.

source: **prefix** : :class:`python:str`
es: **prefijo** : :class:`python:str`

source: The prefix to use for variables in the model.
es: El prefijo a utilizar para las variables en el modelo.

source: Examples
es: Ejemplos

source: Out of sample predictions:
es: Predicciones fuera de muestra:

source: No new changepoints are used for the out of sample predictions. The trend effect is linearly extrapolated from the last changepoint.
es: No se utilizan nuevos puntos de cambio para las predicciones fuera de la muestra. El efecto de tendencia se extrapola linealmente a partir del último punto de cambio.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.pdf>`)
es: (:descargar:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.py>`, :descargar:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.png>`, :descargar:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.hires.png>`, :descargar:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-additive_effect-LinearTrendEffect-1.pdf>`)

source: Methods
es: Métodos

source: :py:obj:`LinearTrendEffect.__init__ <pymc_marketing.mmm.additive_effect.LinearTrendEffect.__init__>`\ \(trend\, prefix\[\, ...\]\)
es: :py:obj:`LinearTrendEffect.__init__ <pymc_marketing.mmm.additive_effect.LinearTrendEffect.__init__>`\ \(tendencia\, prefijo\[\, ...\]\)

source: Create the required data in the model.
es: Cree los datos requeridos en el modelo.

source: Create the trend effect in the model.
es: Cree el efecto de tendencia en el modelo.

source: :py:obj:`LinearTrendEffect.set_data <pymc_marketing.mmm.additive_effect.LinearTrendEffect.set_data>`\ \(mmm\, model\, X\)
es: :py:obj:`LinearTrendEffect.set_data <pymc_marketing.mmm.additive_effect.LinearTrendEffect.set_data>`\ \(mmm\, modelo\, X\)

source: Set the data for new predictions.
es: Establezca los datos para nuevas predicciones.
