Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.components.saturation.HillSaturation.po
Languages: es

source: HillSaturation
es: SaturaciónDeColina

source: Wrapper around Hill saturation function.
es: Envoltorio alrededor de la función de saturación de Hill.

source: For more information, see :func:`pymc_marketing.mmm.transformers.hill_function`.
es: Para más información, consulte :func:`pymc_marketing.mmm.transformers.hill_function`.

source: (:download:`Source code <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.pdf>`)
es: (:download:`Código fuente <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.py>`, :download:`png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.png>`, :download:`hires.png <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.hires.png>`, :download:`pdf <../../../gettext/plot_directive/api/generated/pymc_marketing-mmm-components-saturation-HillSaturation-1.pdf>`)

source: Methods
es: Métodos

source: Call within a model context.
es: Llamar dentro de un contexto de modelo.

source: :py:obj:`HillSaturation.function <pymc_marketing.mmm.components.saturation.HillSaturation.function>`\ \(x\, slope\, kappa\, beta\)
es: :py:obj:`HillSaturation.function <pymc_marketing.mmm.components.saturation.HillSaturation.function>`\ \(x\, pendiente\, kappa\, beta\)

source: Hill saturation function.
es: Función de saturación de colina.

source: :py:obj:`HillSaturation.plot_curve <pymc_marketing.mmm.components.saturation.HillSaturation.plot_curve>`\ \(curve\[\, ...\]\)
es: :py:obj:`HillSaturation.plot_curve <pymc_marketing.mmm.components.saturation.HillSaturation.plot_curve>`\ \(curva\[\, ...\]\)

source: Plot curve HDI and samples.
es: Trazar curva HDI y muestras.

source: :py:obj:`HillSaturation.plot_curve_hdi <pymc_marketing.mmm.components.saturation.HillSaturation.plot_curve_hdi>`\ \(curve\[\, ...\]\)
es: :py:obj:`HillSaturation.plot_curve_hdi <pymc_marketing.mmm.components.saturation.HillSaturation.plot_curve_hdi>`\ \(curva\[\, ...\]\)

source: Plot the HDI of the curve.
es: Trace el IDH de la curva.

source: Plot samples from the curve.
es: Trazar muestras de la curva.

source: :py:obj:`HillSaturation.sample_curve <pymc_marketing.mmm.components.saturation.HillSaturation.sample_curve>`\ \(\[parameters\, ...\]\)
es: :py:obj:`HillSaturation.sample_curve <pymc_marketing.mmm.components.saturation.HillSaturation.sample_curve>`\ \(\[parámetros\, ...\]\)

source: Sample the curve of the saturation transformation given parameters.
es: Muestree la curva de la transformación de saturación dadas las parámetros.

source: Sample the priors for the transformation.
es: Muestree las distribuciones a priori para la transformación.

source: :py:obj:`HillSaturation.set_dims_for_all_priors <pymc_marketing.mmm.components.saturation.HillSaturation.set_dims_for_all_priors>`\ \(dims\)
es: msgid: :py:obj:`HillSaturation.set_dims_for_all_priors <pymc_marketing.mmm.components.saturation.HillSaturation.set_dims_for_all_priors>`\ \(dims\) msgstr: :py:obj:`HillSaturation.set_dims_for_all_priors <pymc_marketing.mmm.components.saturation.HillSaturation.set_dims_for_all_priors>`\ \(dims\)

source: Set the dims for all priors.
es: Establezca las dimensiones para todos los antecedentes.

source: :py:obj:`HillSaturation.to_dict <pymc_marketing.mmm.components.saturation.HillSaturation.to_dict>`\ \(\)
es: msgid: :py:obj:`HillSaturation.to_dict <pymc_marketing.mmm.components.saturation.HillSaturation.to_dict>`\ \(\) msgstr: :py:obj:`HillSaturation.to_dict <pymc_marketing.mmm.components.saturation.HillSaturation.to_dict>`\ \(\)

source: Convert the transformation to a dictionary.
es: Convierte la transformación a un diccionario.

source: Update the priors for a function after initialization.
es: Actualiza los antecedentes para una función después de la inicialización.

source: Attributes
es: Atributos

source: Get the combined dims for all the parameters.
es: Obtenga las dimensiones combinadas para todos los parámetros.

source: Get the priors for the function.
es: Obtenga los priors para la función.

source: Mapping from variable name to prior for the model.
es: Mapeo del nombre de la variable a la prior para el modelo.

source: Mapping from parameter name to variable name in the model.
es: Mapeo del nombre del parámetro al nombre de la variable en el modelo.
