Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.lift_test.add_saturation_observations.po
Languages: es

source: add\_saturation\_observations
es: agregar\_observaciones\_de\_saturación

source: Add saturation observations to the likelihood of the model.
es: Agregue observaciones de saturación a la probabilidad del modelo.

source: General function to add lift measurements to the likelihood of the model.
es: Función general para añadir mediciones de elevación a la probabilidad del modelo.

source: Not to be used directly for general use. Use :func:`MMM.add_lift_test_measurements` or :func:`add_lift_measurements_to_likelihood_from_saturation` instead.
es: No debe utilizarse directamente para uso general. Utilice :func:`MMM.add_lift_test_measurements` o :func:`add_lift_measurements_to_likelihood_from_saturation` en su lugar.

source: Parameters
es: Parámetros

source: DataFrame with lift test results with at least the following columns:
es: DataFrame con los resultados de la prueba de elevación con al menos las siguientes columnas:

source: `x`: x axis value of the lift test.
es: `x`: valor del eje x de la prueba de elevación.

source: `delta_x`: change in x axis value of the lift test.
es: `delta_x`: cambio en el valor del eje x de la prueba de elevación.

source: `delta_y`: change in y axis value of the lift test.
es: `delta_y`: cambio en el valor del eje y de la prueba de elevación.

source: `sigma`: standard deviation of the lift test.
es: `sigma`: desviación estándar de la prueba de elevación.

source: Any additional columns are assumed to be coordinates in the model.
es: Se asume que cualquier columna adicional son coordenadas en el modelo.

source: Dictionary of variable names to dimensions.
es: Diccionario de nombres de variables a dimensiones.

source: Function that takes spend and returns saturation.
es: Función que toma el gasto y devuelve la saturación.

source: **model** : :obj:`Optional`\[:obj:`pm.Model`], optional
es: **modelo** : :obj:`Opcional`\[:obj:`pm.Model`], opcional

source: Optional[pm.Model], optional
es: Opcional[pm.Model], opcional

source: PyMC model with arbitrary number of coordinates, by default None
es: Modelo PyMC con un número arbitrario de coordenadas, por defecto None

source: **dist** : :obj:`pm.Distribution` :obj:`class`, optional
es: **dist** : :obj:`pm.Distribution` :obj:`clase`, opcional

source: pm.Distribution class, optional
es: clase pm.Distribution, opcional

source: PyMC distribution to use for the likelihood, by default pm.Gamma
es: Distribución de PyMC a utilizar para la verosimilitud, por defecto pm.Gamma

source: **name** : :class:`python:str`, optional
es: **nombre** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: Name of the likelihood, by default "lift_measurements"
es: Nombre de la probabilidad, por defecto "lift_measurements"

source: **get_indices** : :obj:`Callable`\[[:obj:`pd.DataFrame`, :obj:`pm.Model`], :obj:`Indices`], optional
es: **get_indices** : :obj:`Callable`\[[:obj:`pd.DataFrame`, :obj:`pm.Model`], :obj:`Indices`], opcional

source: Callable[[pd.DataFrame, pm.Model], Indices], optional
es: Callable[[pd.DataFrame, pm.Model], Indices], opcional

source: Function to get the indices of the DataFrame in the model, by default exact_row_indices which assumes that the columns map exactly to the model coordinates.
es: Función para obtener los índices del DataFrame en el modelo, por defecto exact_row_indices que asume que las columnas se mapean exactamente a las coordenadas del modelo.

source: **variable_indexer_factory** : :obj:`Callable`\[[:obj:`pm.Model`, :obj:`Indices`], :obj:`Callable`\[[:class:`python:str`], :class:`~pytensor.tensor.TensorVariable`]], optional
es: **variable_indexer_factory** : :obj:`Callable`\[[:obj:`pm.Model`, :obj:`Indices`], :obj:`Callable`\[[:class:`python:str`], :class:`~pytensor.tensor.TensorVariable`]], opcional

source: Callable[[pm.Model, Indices], Callable[[python:str], TensorVariable]], optional
es: Callable[[pm.Model, Indices], Callable[[python:str], TensorVariable]], opcional

source: Function to create a variable indexer, by default create_variable_indexer which creates a function to index variables in the model. This is used determine the values of the parameters to evaluate the saturation function.
es: Función para crear un indexador de variables, por defecto create_variable_indexer, que crea una función para indexar variables en el modelo. Esto se utiliza para determinar los valores de los parámetros para evaluar la función de saturación.

source: Examples
es: Ejemplos

source: Add lift tests for time-varying saturation to a model:
es: Agregar pruebas de elevación para la saturación variable en el tiempo a un modelo:

source: Use the saturation classes to add lift tests to a model. NOTE: This is what happens internally of :class:`MMM`.
es: Utilice las clases de saturación para añadir pruebas de elevación a un modelo. NOTA: Esto es lo que sucede internamente en :class:`MMM`.

source: Add lift tests for channel, geo saturation functions.
es: Añadir pruebas de elevación para funciones de canal y saturación geográfica.
