Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.po
Languages: es

source: A class for optimizing budget allocation in a marketing mix model.
es: Una clase para optimizar la asignación de presupuesto en un modelo de mezcla de marketing.

source: The goal of this optimization is to maximize the total expected response by allocating the given budget across different marketing channels. The optimization is performed using the Sequential Least Squares Quadratic Programming (SLSQP) method, which is a gradient-based optimization algorithm suitable for solving constrained optimization problems.
es: El objetivo de esta optimización es maximizar la respuesta total esperada al asignar el presupuesto dado entre diferentes canales de marketing. La optimización se realiza utilizando el método de Programación Cuadrática de Mínimos Cuadrados Secuenciales (SLSQP), que es un algoritmo de optimización basado en gradientes adecuado para resolver problemas de optimización con restricciones.

source: For more information on the SLSQP algorithm, refer to the documentation: https://docs.scipy.org/doc/scipy/reference/generated/scipy.optimize.minimize.html
es: Para más información sobre el algoritmo SLSQP, consulte la documentación: https://docs.scipy.org/doc/scipy/reference/generated/scipy.optimize.minimize.html

source: Parameters
es: Parámetros

source: Number of time units at the desired time granularity to allocate budget for.
es: Número de unidades de tiempo en la granularidad de tiempo deseada para asignar presupuesto.

source: **model** : :obj:`MMMModel`
es: **modelo** : :obj:`MMMModel`

source: MMMModel
es: MMMModelo

source: The marketing mix model to optimize.
es: El modelo de mezcla de marketing para optimizar.

source: **response_variable** : :class:`python:str`, optional
es: **response_variable** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The response variable to optimize. Default is "total_contribution".
es: La variable de respuesta a optimizar. El valor predeterminado es "total_contribution".

source: **utility_function** : :obj:`UtilityFunctionType`, optional
es: **utility_function** : :obj:`UtilityFunctionType`, opcional

source: UtilityFunctionType, optional
es: TipoDeFunciónUtilidad, opcional

source: The utility function to maximize. Default is the mean of the response distribution.
es: La función de utilidad a maximizar. El valor predeterminado es la media de la distribución de respuestas.

source: **budgets_to_optimize** : :obj:`xarray.DataArray`, optional
es: **presupuestos_a_optimizar** : :obj:`xarray.DataArray`, opcional

source: xarray.DataArray, optional
es: xarray.DataArray, opcional

source: Mask defining a subset of budgets to optimize. Non-optimized budgets remain fixed at 0.
es: Máscara que define un subconjunto de presupuestos a optimizar. Los presupuestos no optimizados permanecen fijos en 0.

source: **custom_constraints** : :obj:`Sequence`\[:obj:`Constraint`], optional
es: **custom_constraints** : :obj:`Secuencia`\[:obj:`Restricción`], opcional

source: Sequence[Constraint], optional
es: Secuencia[Restricción], opcional

source: Custom constraints for the optimizer.
es: Restricciones personalizadas para el optimizador.

source: **default_constraints** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **default_constraints** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to add a default sum constraint on the total budget. Default is True.
es: Si se debe agregar una restricción de suma predeterminada sobre el presupuesto total. El valor predeterminado es True.

source: **budget_distribution_over_period** : :obj:`xarray.DataArray`, optional
es: **distribución_presupuestaria_a_lo_largo_del_período** : :obj:`xarray.DataArray`, opcional

source: Distribution factors for budget allocation over time. Should have dims ("date", *budget_dims) where date dimension has length num_periods. Values along date dimension should sum to 1 for each combination of other dimensions. If None, budget is distributed evenly across periods.
es: Factores de distribución para la asignación del presupuesto a lo largo del tiempo. Debe tener dimensiones ("fecha", *budget_dims) donde la dimensión de fecha tiene una longitud de num_periods. Los valores a lo largo de la dimensión de fecha deben sumar 1 para cada combinación de las otras dimensiones. Si es None, el presupuesto se distribuye de manera uniforme entre los períodos.

source: Methods
es: Métodos

source: Create a new model by parsing and validating input data from keyword arguments.
es: Cree un nuevo modelo analizando y validando los datos de entrada de los argumentos de palabras clave.

source: :py:obj:`BudgetOptimizer.allocate_budget <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.allocate_budget>`\ \(total\_budget\)
es: :py:obj:`BudgetOptimizer.allocate_budget <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.allocate_budget>`\ \(presupuesto\_total\)

source: Allocate the budget based on `total_budget`, optional `budget_bounds`, and custom constraints.
es: Asigne el presupuesto basado en `total_budget`, `budget_bounds` opcionales y restricciones personalizadas.

source: :py:obj:`BudgetOptimizer.copy <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.copy>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`BudgetOptimizer.copy <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.copy>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: :py:obj:`BudgetOptimizer.dict <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.dict>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`BudgetOptimizer.dict <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.dict>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Extract the response distribution graph, conditioned on posterior parameters.
es: Extraiga el gráfico de distribución de respuestas, condicionado a los parámetros posteriores.

source: :py:obj:`BudgetOptimizer.json <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.json>`\ \(\*\[\, include\, exclude\, ...\]\)
es: :py:obj:`BudgetOptimizer.json <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.json>`\ \(\*\[\, incluir\, excluir\, ...\]\)

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: :py:obj:`BudgetOptimizer.model_copy <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.model_copy>`\ \(\*\[\, update\, deep\]\)
es: :py:obj:`BudgetOptimizer.model_copy <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.model_copy>`\ \(\*\[\, actualizar\, profundo\]\)

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: :py:obj:`BudgetOptimizer.model_dump <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.model_dump>`\ \(\*\[\, mode\, ...\]\)
es: :py:obj:`BudgetOptimizer.model_dump <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.model_dump>`\ \(\*\[\, modo\, ...\]\)

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: Compute the class name for parametrizations of generic classes.
es: Calcule el nombre de la clase para las parametrizaciones de clases genéricas.

source: Override this method to perform additional initialization after `__init__` and `model_construct`.
es: Sobrescriba este método para realizar una inicialización adicional después de `__init__` y `model_construct`.

source: :py:obj:`BudgetOptimizer.model_rebuild <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.model_rebuild>`\ \(\*\[\, force\, ...\]\)
es: :py:obj:`BudgetOptimizer.model_rebuild <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.model_rebuild>`\ \(\*\[\, forzar\, ...\]\)

source: Try to rebuild the pydantic-core schema for the model.
es: Intente reconstruir el esquema de pydantic-core para el modelo.

source: Validate a pydantic model instance.
es: Valide una instancia del modelo pydantic.

source: Validate the given object with string data against the Pydantic model.
es: Valide el objeto dado con datos de cadena contra el modelo de Pydantic.

source: :py:obj:`BudgetOptimizer.parse_file <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.parse_file>`\ \(path\, \*\[\, ...\]\)
es: :py:obj:`BudgetOptimizer.parse_file <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.parse_file>`\ \(ruta\, \*\[\, ...\]\)

source: :py:obj:`BudgetOptimizer.schema <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.schema>`\ \(\[by\_alias\, ref\_template\]\)
es: :py:obj:`BudgetOptimizer.schema <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.schema>`\ \(\[por\_alias\, ref\_template\]\)

source: :py:obj:`BudgetOptimizer.schema_json <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.schema_json>`\ \(\*\[\, by\_alias\, ...\]\)
es: :py:obj:`BudgetOptimizer.schema_json <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.schema_json>`\ \(\*\[\, por\_alias\, ...\]\)

source: :py:obj:`BudgetOptimizer.set_constraints <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.set_constraints>`\ \(constraints\)
es: :py:obj:`BudgetOptimizer.set_constraints <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.set_constraints>`\ \(restricciones\)

source: Set constraints for the optimizer.
es: Establecer restricciones para el optimizador.

source: :py:obj:`BudgetOptimizer.validate <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.validate>`\ \(value\)
es: :py:obj:`BudgetOptimizer.validate <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.validate>`\ \(valor\)

source: Attributes
es: Atributos

source: Configuration for the model, should be a dictionary conforming to [`ConfigDict`][pydantic.config.ConfigDict].
es: Configuración para el modelo, debe ser un diccionario que cumpla con [`ConfigDict`][pydantic.config.ConfigDict].

source: Get extra fields set during validation.
es: Obtener campos adicionales establecidos durante la validación.

source: Returns the set of fields that have been explicitly set on this model instance.
es: Devuelve el conjunto de campos que han sido establecidos explícitamente en esta instancia del modelo.

source: :py:obj:`budgets_to_optimize <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.budgets_to_optimize>`\
es: msgid: :py:obj:`budgets_to_optimize <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.budgets_to_optimize>` msgstr: :py:obj:`budgets_to_optimize <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.budgets_to_optimize>`

source: :py:obj:`budget_distribution_over_period <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.budget_distribution_over_period>`\
es: :py:obj:`distribución_del_presupuesto_a_lo_largo_del_período <pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.budget_distribution_over_period>`
