Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/pymc_marketing.clv.utils.po
Languages: es

source: utils
es: utilidades

source: Utilities for the CLV module.
es: Utilidades para el módulo CLV.

source: Functions
es: Funciones

source: :py:obj:`customer_lifetime_value <pymc_marketing.clv.utils.customer_lifetime_value>`\ \(transaction\_model\, data\)
es: :py:obj:`customer_lifetime_value <pymc_marketing.clv.utils.customer_lifetime_value>`\ \(modelo\_de\_transacción\, datos\)

source: Compute customer lifetime value.
es: Calcular el valor de vida del cliente.

source: :py:obj:`rfm_segments <pymc_marketing.clv.utils.rfm_segments>`\ \(transactions\, customer\_id\_col\, ...\)
es: :py:obj:`rfm_segments <pymc_marketing.clv.utils.rfm_segments>`\ \(transacciones\, customer\_id\_col\, ...\)

source: Assign customers to segments based on spending behavior derived from RFM scores.
es: Asigne clientes a segmentos basados en el comportamiento de gasto derivado de las puntuaciones RFM.

source: :py:obj:`rfm_summary <pymc_marketing.clv.utils.rfm_summary>`\ \(transactions\, customer\_id\_col\, ...\)
es: :py:obj:`rfm_summary <pymc_marketing.clv.utils.rfm_summary>`\ \(transacciones\, customer\_id\_col\, ...\)

source: Summarize transaction data for use in CLV modeling or RFM segmentation.
es: Resuma los datos de transacciones para su uso en la modelización de CLV o en la segmentación RFM.

source: :py:obj:`rfm_train_test_split <pymc_marketing.clv.utils.rfm_train_test_split>`\ \(transactions\, ...\[\, ...\]\)
es: :py:obj:`rfm_train_test_split <pymc_marketing.clv.utils.rfm_train_test_split>`\ \(transacciones\, ...\[\, ...\]\)

source: Summarize transaction data and split into training and tests datasets for CLV modeling.
es: Resume los datos de transacciones y divídelos en conjuntos de datos de entrenamiento y prueba para el modelado de CLV.

source: Convert vector arrays to xarray with a common dim (default "customer_id").
es: Convierte arreglos vectoriales a xarray con una dimensión común (por defecto "customer_id").
