Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/getting_started/installation/index.po
Languages: es

source: Installing PyMC-Marketing
es: Instalando PyMC-Marketing

source: PyMC-Marketing requires **Python 3.10 or greater**.
es: PyMC-Marketing requiere **Python 3.10 o superior**.

source: Install and activate an environment (e.g. `marketing_env`) with the `pymc-marketing` package from [conda-forge](https://conda-forge.org). It may look something like the following:
es: Instale y active un entorno (por ejemplo, `marketing_env`) con el paquete `pymc-marketing` de [conda-forge](https://conda-forge.org). Puede parecerse a lo siguiente:

source: You can also install the development version of PyMC-Marketing with:
es: También puede instalar la versión de desarrollo de PyMC-Marketing con:

source: Next, we you can create a new Jupyter notebook with either JupyterLab or VS Code.
es: A continuación, puede crear un nuevo cuaderno de Jupyter con JupyterLab o VS Code.

source: After installing the `pymc-marketing` package (see above), run the following with `marketing_env` activated:
es: Después de instalar el paquete `pymc-marketing` (ver arriba), ejecute lo siguiente con `marketing_env` activado:

source: VS Code Notebook
es: Cuaderno de VS Code

source: Start VS Code and ensure that the "Jupyter" extension is installed. Press Ctrl + Shift + P and type "Python: Select Interpreter". Ensure that `marketing_env` is selected. Press Ctrl + Shift + P and type "Create: New Jupyter Notebook".
es: Inicie VS Code y asegúrese de que la extensión "Jupyter" esté instalada. Presione Ctrl + Shift + P y escriba "Python: Seleccionar Intérprete". Asegúrese de que `marketing_env` esté seleccionado. Presione Ctrl + Shift + P y escriba "Crear: Nuevo Cuaderno Jupyter".

source: Installation for developers
es: Instalación para desarrolladores

source: If you are a developer of pymc-marketing, or want to start contributing, [refer to the contributing guide](https://github.com/pymc-labs/pymc-marketing/blob/main/CONTRIBUTING.md) to get started.
es: Si usted es un desarrollador de pymc-marketing, o desea comenzar a contribuir, [consulte la guía de contribución](https://github.com/pymc-labs/pymc-marketing/blob/main/CONTRIBUTING.md) para comenzar.

source: See the official [PyMC installation guide](https://www.pymc.io/projects/docs/en/latest/installation.html) if more detail is needed.
es: Consulte la [guía de instalación oficial de PyMC](https://www.pymc.io/projects/docs/en/latest/installation.html) si se necesita más detalle.
