Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/mmm/mmm_intro.po
Languages: es

source: • Budget Optimization: Efficiently allocate your marketing budget across various channels to maximize ROI. The package includes tools to help you determine the optimal spend for each channel.
es: • Optimización del presupuesto: Asigna eficientemente tu presupuesto de marketing entre varios canales para maximizar el ROI. El paquete incluye herramientas para ayudarte a determinar el gasto óptimo por canal.

source: • Experiment Calibration: Fine-tune your model based on empirical experiments, such as lift tests, to create a more unified and accurate view of your marketing efforts. This feature helps bridge the gap between model predictions and real-world results.
es: • Calibración con experimentos: Ajusta finamente tu modelo con base en experimentos empíricos, como pruebas de lift, para crear una visión más unificada y precisa de tus esfuerzos de marketing. Esta función ayuda a cerrar la brecha entre las predicciones del modelo y los resultados del mundo real.

source: Each of these features is supported by extensive documentation and example notebooks, allowing you to dive deeper into their implementation and use cases.
es: Cada una de estas funcionalidades cuenta con amplia documentación y cuadernos de ejemplo que te permiten profundizar en su implementación y casos de uso.

source: PyMC-Marketing in Production
es: PyMC‑Marketing en producción

source: PyMC-Marketing can be seamlessly integrated into production environments using modern PyData stack MLOps tools. This allows for automated, scalable, and reproducible media mix modeling workflows. Here are some key aspects of running PyMC-Marketing in production:
es: PyMC‑Marketing puede integrarse sin fricciones en entornos de producción utilizando herramientas MLOps modernas del stack PyData. Esto permite flujos de trabajo de modelado del mix de medios automatizados, escalables y reproducibles. Estos son algunos aspectos clave para ejecutar PyMC‑Marketing en producción:

source: Containerization with Docker:
es: Contenerización con Docker:

source: Encapsulate your PyMC-Marketing environment and dependencies in a Docker container.
es: Encapsula tu entorno y dependencias de PyMC‑Marketing en un contenedor Docker.

source: Ensure consistency across different environments (development, testing, production).
es: Garantiza la consistencia entre distintos entornos (desarrollo, pruebas, producción).

source: Simplify deployment and scaling of your MMM pipelines.
es: Simplifica el despliegue y el escalado de tus canalizaciones de MMM.

source: Experiment Tracking with MLflow:
es: Seguimiento de experimentos con MLflow:

source: Log model parameters, metrics, and artifacts using MLflow.
es: Registra parámetros, métricas y artefactos del modelo con MLflow.

source: Compare different model versions and track experiments over time.
es: Compara distintas versiones del modelo y realiza seguimiento de experimentos a lo largo del tiempo.

source: Easily reproduce results and share insights with team members.
es: Reproduce resultados con facilidad y comparte insights con los miembros del equipo.

source: Workflow Orchestration:
es: Orquestación de flujos de trabajo:

source: Use tools like Apache Airflow or Prefect, for example, to schedule and orchestrate your MMM pipelines.
es: Utiliza herramientas como Apache Airflow o Prefect, por ejemplo, para programar y orquestar tus canalizaciones de MMM.

source: Automate data ingestion, model training, and result generation on a regular basis.
es: Automatiza la ingesta de datos, el entrenamiento del modelo y la generación de resultados de forma periódica.

source: Monitoring and Alerting:
es: Monitoreo y alertas:

source: Implement monitoring for model performance and data drift.
es: Implementa monitoreo del desempeño del modelo y del drift de datos.

source: Set up alerts for unexpected changes in model outputs or data quality issues.
es: Configura alertas ante cambios inesperados en las salidas del modelo o problemas de calidad de datos.

source: By leveraging these tools, you can create a robust, automated MMM pipeline that continuously provides insights for your marketing strategies.
es: Al aprovechar estas herramientas, puedes crear una canalización de MMM robusta y automatizada que proporcione continuamente insights para tus estrategias de marketing.

source: For more information on these tools, visit:
es: Para obtener más información sobre estas herramientas, visita:

source: How to get started?
es: ¿Cómo empezar?

source: To see how all these different components come together, you can review the {ref}`MMM Example notebook <mmm_example>` and [MMM Explainer App](https://pymc-marketing-app.streamlit.app/).
es: Para ver cómo se integran todos estos componentes, puedes revisar el {ref}`cuaderno de ejemplo de MMM <mmm_example>` y la [aplicación explicativa de MMM](https://pymc-marketing-app.streamlit.app/).
