Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/mmm/mmm_intro.po
Languages: es

source: Introduction to Media Mix Modeling
es: Introducción al modelado del mix de medios

source: A problem faced by many companies is how to allocate marketing budgets across different media channels. For example, how should funds be allocated across TV, radio, social media, direct mail, or daily deals?
es: Un problema al que se enfrentan muchas empresas es cómo asignar los presupuestos de marketing entre distintos canales de medios. Por ejemplo, ¿cómo deberían distribuirse los fondos entre TV, radio, redes sociales, correo directo u ofertas diarias?

source: One approach might be to use heuristics, i.e. sensible rules of thumb, about what might be most appropriate for your company. For instance, a widely used approach is to simply set your marketing budget as a percentage of expected revenues. But this involves guesswork - something we want to avoid regardless of the size of the marketing budget involved.
es: Un enfoque podría ser usar heurísticas, es decir, reglas empíricas sensatas sobre lo que podría ser más adecuado para tu empresa. Por ejemplo, un enfoque muy utilizado es fijar el presupuesto de marketing como un porcentaje de los ingresos esperados. Pero esto implica conjeturas, algo que queremos evitar independientemente del tamaño del presupuesto de marketing.

source: Fortunately, with Bayesian modeling, we can do better than this! So-called Media Mix Modeling (MMM) can estimate how effective each advertising channel is in driving our outcome measure of interest, whether that is sales, new customer acquisitions, or any other key performance indicator (KPI). Once we have estimated each channel's effectiveness we can optimize our budget allocation to maximize our KPI.
es: Afortunadamente, con el modelado bayesiano podemos hacerlo mejor. El llamado Media Mix Modeling (MMM) puede estimar cuán eficaz es cada canal publicitario para impulsar nuestra métrica de interés, ya sean ventas, adquisición de nuevos clientes u otro indicador clave de desempeño (KPI). Una vez estimada la eficacia de cada canal, podemos optimizar la asignación del presupuesto para maximizar nuestro KPI.

source: What can you do with Media Mix Modeling?
es: ¿Qué puedes hacer con el modelado del mix de medios?

source: Media Mix Modeling (MMM) is a powerful tool that provides actionable insights for businesses. Here are some key ways you can leverage MMM to drive strategic decisions and improve your marketing ROI:
es: El Media Mix Modeling (MMM) es una herramienta potente que proporciona información accionable para las empresas. Estas son algunas formas clave de aprovechar MMM para impulsar decisiones estratégicas y mejorar el retorno de la inversión (ROI) en marketing:

source: Understand the effectiveness of different media channels in driving customer acquisition. Not only can you learn from data about the most influential media channels for your business, but you can update this understanding over time. By incorporating new marketing and customer acquisition data on an ongoing basis, you can learn about the changing effectiveness of each channel over time.
es: Comprender la eficacia de distintos canales de medios para impulsar la adquisición de clientes. No solo puedes aprender de los datos cuáles son los canales más influyentes para tu negocio, sino que también puedes actualizar este conocimiento con el tiempo. Al incorporar de forma continua nuevos datos de marketing y de adquisición de clientes, puedes aprender cómo cambia la eficacia de cada canal con el tiempo.

source: Optimize Budget Allocation: Use MMM to determine the most effective distribution of your marketing budget across different channels. By understanding the impact of each channel on your KPIs, you can allocate resources where they'll generate the highest return.
es: Optimizar la asignación del presupuesto: Usa MMM para determinar la distribución más eficaz de tu presupuesto de marketing entre diferentes canales. Al comprender el impacto de cada canal en tus KPI, puedes asignar recursos donde generen el mayor retorno.

source: Enhance ROI Forecasting: Develop more accurate forecasts of expected returns for different marketing scenarios. This allows you to set realistic goals and make data-driven decisions about future campaigns.
es: Mejorar el pronóstico de ROI: Desarrolla previsiones más precisas de los retornos esperados para distintos escenarios de marketing. Esto te permite fijar objetivos realistas y tomar decisiones basadas en datos sobre campañas futuras.

source: Identify Synergies Between Channels: Uncover how different marketing channels interact and complement each other. This insight can help you create more cohesive, integrated marketing strategies that leverage cross-channel effects.
es: Identificar sinergias entre canales: Descubre cómo interactúan y se complementan distintos canales de marketing. Este conocimiento te ayuda a crear estrategias más cohesionadas e integradas que aprovechen los efectos cruzados entre canales.

source: Adapt to Market Changes: Continuously update your model with new data to track changes in channel effectiveness over time. This allows you to quickly adapt your strategy to evolving market conditions, consumer behaviors, or competitive landscapes.
es: Adaptarte a los cambios del mercado: Actualiza continuamente tu modelo con nuevos datos para seguir los cambios en la eficacia de los canales a lo largo del tiempo. Esto te permite ajustar rápidamente tu estrategia a condiciones de mercado, comportamientos de consumidores o entornos competitivos en evolución.

source: Justify Marketing Investments: Use concrete data to demonstrate the value of marketing activities to stakeholders. MMM provides a quantitative basis for marketing budget discussions and helps align marketing goals with overall business objectives.
es: Justificar las inversiones en marketing: Usa datos concretos para demostrar el valor de las actividades de marketing a las partes interesadas. MMM aporta una base cuantitativa para las discusiones sobre presupuestos de marketing y ayuda a alinear los objetivos de marketing con los objetivos generales del negocio.

source: Optimize Timing and Frequency: Determine the optimal timing and frequency of your marketing efforts across different channels. This can help you avoid oversaturation and maximize the impact of your campaigns.
es: Optimizar el momento y la frecuencia: Determina el momento y la frecuencia óptimos de tus esfuerzos de marketing en distintos canales. Esto puede ayudarte a evitar la sobresaturación y maximizar el impacto de tus campañas.

source: Scenario Planning: Run "what-if" analyses to evaluate potential outcomes of different marketing strategies before implementing them. This can help mitigate risks and identify the most promising opportunities.
es: Planificación de escenarios: Ejecuta análisis de “qué pasaría si” para evaluar los posibles resultados de diferentes estrategias de marketing antes de implementarlas. Esto ayuda a mitigar riesgos e identificar las oportunidades más prometedoras.

source: Personalize Marketing Strategies: Use insights from MMM to tailor your marketing approach for different customer segments or geographic regions, maximizing relevance and effectiveness.
es: Personalizar las estrategias de marketing: Usa los insights de MMM para adaptar tu enfoque de marketing a diferentes segmentos de clientes o regiones geográficas, maximizando la relevancia y la eficacia.

source: Benchmark Performance: Compare your marketing performance against industry standards or historical data to identify areas for improvement and set competitive targets.
es: Comparar el desempeño: Compara tu desempeño de marketing con estándares del sector o datos históricos para identificar áreas de mejora y establecer objetivos competitivos.

source: Guide Long-term Strategy: Use MMM insights to inform long-term marketing and business strategies, ensuring that your marketing efforts align with and support your company's broader goals and vision.
es: Orientar la estrategia a largo plazo: Usa los insights de MMM para informar las estrategias de marketing y de negocio a largo plazo, asegurando que tus esfuerzos de marketing se alineen con los objetivos y la visión más amplios de la empresa.

source: By leveraging these actionable insights from Media Mix Modeling, businesses can make more informed, data-driven decisions that lead to improved marketing effectiveness, increased ROI, and sustainable growth.
es: Al aprovechar estas ideas accionables del Media Mix Modeling, las empresas pueden tomar decisiones más informadas y basadas en datos que se traduzcan en una mayor eficacia de marketing, un ROI superior y un crecimiento sostenible.

source: Brief history of Media Mix Models
es: Breve historia de los modelos de mix de medios

source: Media Mix Models (MMMs) have a rich history dating back to the 1950s and 1960s when they were first developed by marketing pioneers. Here's a brief overview of their evolution:
es: Los Modelos de Mix de Medios (MMM) tienen una rica historia que se remonta a las décadas de 1950 y 1960, cuando fueron desarrollados por pioneros del marketing. A continuación, un breve repaso de su evolución:

source: 1950s-1960s: The concept of MMMs emerged as marketers sought to quantify the impact of different advertising channels on sales.
es: Años 1950-1960: El concepto de los MMM surgió cuando los mercadólogos buscaban cuantificar el impacto de diferentes canales publicitarios en las ventas.

source: 1970s-1980s: With the advent of more sophisticated statistical techniques and computing power, MMMs became more widespread in the advertising industry.
es: Años 1970-1980: Con la llegada de técnicas estadísticas más sofisticadas y mayor potencia de cómputo, los MMM se extendieron en la industria publicitaria.

source: 1990s: The rise of scanner data and loyalty card programs provided more granular data, allowing for more detailed and accurate models.
es: Años 1990: El auge de los datos de escáner y los programas de fidelización proporcionó datos más granulares, permitiendo modelos más detallados y precisos.

source: 2000s: The digital revolution introduced new challenges and opportunities. MMMs had to adapt to incorporate digital channels and deal with the increased complexity of the media landscape.
es: Años 2000: La revolución digital introdujo nuevos retos y oportunidades. Los MMM tuvieron que adaptarse para incorporar canales digitales y lidiar con la mayor complejidad del panorama mediático.

source: 2010s: Big data and machine learning techniques began to be incorporated into MMMs, allowing for more complex models and real-time optimization.
es: Años 2010: Se empezaron a incorporar técnicas de big data y aprendizaje automático en los MMM, permitiendo modelos más complejos y optimización en tiempo real.

source: Present day: Modern Bayesian approaches, like those used in PyMC-Marketing. These offer several advantages, including the ability to incorporate prior knowledge, handle uncertainty more robustly, calibrate the models through lift tests, and provide more interpretable results.
es: Actualmente: Enfoques bayesianos modernos, como los utilizados en PyMC‑Marketing. Ofrecen varias ventajas, incluida la capacidad de incorporar conocimiento previo, manejar la incertidumbre de forma más robusta, calibrar los modelos mediante pruebas de lift y proporcionar resultados más interpretables.

source: Throughout this evolution, the core goal of MMMs has remained the same: to help marketers understand and optimize the effectiveness of their marketing spend across different channels. As the media landscape continues to evolve, so too will the techniques and applications of Media Mix Modeling.
es: A lo largo de esta evolución, el objetivo central de los MMM ha permanecido igual: ayudar a los responsables de marketing a comprender y optimizar la eficacia de su gasto en distintos canales. A medida que el panorama de medios continúa evolucionando, también lo harán las técnicas y aplicaciones del Media Mix Modeling.

source: How does Media Mix Modeling work?
es: ¿Cómo funciona el Media Mix Modeling?

source: In simple terms, we can understand MMMs as regression modeling applied to business data. The goal is to estimate the impact of marketing activities and other drivers on a metric of interest, such as the number of new customers per week.
es: En términos sencillos, podemos entender los MMM como modelos de regresión aplicados a datos de negocio. El objetivo es estimar el impacto de las actividades de marketing y otros impulsores sobre una métrica de interés, como el número de clientes nuevos por semana.

source: To do this, we use two main types of predictor variables:
es: Para ello, usamos dos tipos principales de variables predictoras:

source: The level of spend for each media channel over time.
es: El nivel de gasto de cada canal de medios a lo largo del tiempo.

source: A set of control measurements that could capture seasonality or economic indicators. The basic approach to MMMs uses linear regression to estimate a set of coefficients for the relative importance of each of these predictors, but real-world MMMs commonly incorporate also non-linear factors to more accurately capture the effect of marketing activities on consumer behaviour:
es: Un conjunto de mediciones de control que pueda capturar la estacionalidad o indicadores económicos. El enfoque básico de los MMM usa regresión lineal para estimar un conjunto de coeficientes que reflejen la importancia relativa de cada uno de estos predictores, pero los MMM del mundo real suelen incorporar también factores no lineales para capturar con mayor precisión el efecto de las actividades de marketing en el comportamiento del consumidor:

source: The reach (or saturation) function
es: La función de alcance (o saturación)

source: Rather than model our KPI as a linear function of marketing spend, the reach function models the potential saturation of different channels: While the initial money spent on an advertising channel might have a big impact on customer acquisition, further investment will often lead to diminishing returns as people get used to the message. When we think about optimization, modeling this effect is critical. Some channels may be nowhere close to being saturated and yield significant increases in customer acquisitions for spending for that channel. Knowing the saturation of each channel is vital in making future marketing spend decisions.
es: En lugar de modelar nuestro KPI como una función lineal del gasto en marketing, la función de alcance modela la posible saturación de los distintos canales: mientras que el gasto inicial en un canal publicitario puede tener un gran impacto en la adquisición de clientes, inversiones adicionales a menudo conllevan rendimientos decrecientes a medida que la gente se acostumbra al mensaje. Al pensar en optimización, modelar este efecto es fundamental. Algunos canales pueden estar lejos de saturarse y generar aumentos significativos de adquisiciones al invertir en ese canal. Conocer la saturación de cada canal es vital para tomar decisiones sobre el gasto de marketing futuro.

source: The adstock function
es: La función de adstock

source: The marketing spend for a given channel may have a short-term effect or long-term impact. Remember that jingle from a TV ad you've seen 20 years ago? That's a great long-term impact. The adstock function captures these time-course effects of different advertising channels. Knowing this is crucial - if we know some channels have short-term effects that quickly decay over time, we could plan to do more frequent marketing. But suppose another channel has a long, drawn-out impact on driving customer acquisitions. In that case, it may be more effective to use that channel more infrequently.
es: El gasto de marketing en un canal dado puede tener un efecto a corto plazo o un impacto a largo plazo. ¿Recuerdas esa melodía de un anuncio de TV que viste hace 20 años? Ese es un gran impacto a largo plazo. La función de adstock captura estos efectos temporales de los distintos canales publicitarios. Conocer esto es crucial: si sabemos que algunos canales tienen efectos a corto plazo que se desvanecen rápidamente, podemos planificar campañas más frecuentes. Pero si otro canal tiene un impacto prolongado en la adquisición de clientes, puede ser más eficaz usar ese canal con menor frecuencia.

source: Thus we can summarize the full MMM with this image:
es: Así podemos resumir el MMM completo con esta imagen:

source: Data Requirements
es: Requisitos de datos

source: To effectively implement a Media Mix Model (MMM), you need to gather specific types of data. Here are the key data requirements:
es: Para implementar eficazmente un Media Mix Model (MMM), necesitas recopilar tipos específicos de datos. Estos son los requisitos clave:

source: Sales or KPI Data:
es: Datos de ventas o KPI:

source: Time series data of your target variable (e.g., sales, conversions, new customers)
es: Series temporales de tu variable objetivo (p. ej., ventas, conversiones, clientes nuevos).

source: Typically at a weekly or daily granularity
es: Normalmente con granularidad semanal o diaria.

source: Should cover a sufficient time period (ideally 2-3 years) to capture seasonality and trends
es: Debe abarcar un periodo de tiempo suficiente (idealmente 2–3 años) para capturar estacionalidad y tendencias.

source: Marketing Spend Data:
es: Datos de gasto en marketing:

source: Time series data of marketing expenditures (or impressions) for each channel (e.g., TV, radio, digital, print)
es: Series temporales del gasto en marketing (o impresiones) para cada canal (p. ej., TV, radio, digital, prensa).

source: Should match the granularity of your sales data
es: Debe coincidir con la granularidad de tus datos de ventas.

source: Include all significant marketing channels used during the period
es: Incluir todos los canales de marketing significativos utilizados durante el periodo.

source: Control Variables:
es: Variables de control:

source: Economic indicators (e.g., GDP, unemployment rate)
es: Indicadores económicos (p. ej., PIB, tasa de desempleo).

source: Competitor activities (if available)
es: Actividades de la competencia (si están disponibles).

source: Seasonal factors (e.g., holidays, special events)
es: Factores estacionales (p. ej., festivos, eventos especiales).

source: Price changes or promotions
es: Cambios de precio o promociones.

source: External Factors:
es: Factores externos:

source: Weather data (if relevant to your business)
es: Datos meteorológicos (si son relevantes para tu negocio).

source: Industry-specific factors
es: Factores específicos del sector.

source: Geographic Data:
es: Datos geográficos:

source: If running regional campaigns, include location information
es: Si ejecutas campañas regionales, incluye información de ubicación.

source: Ideally, you have some lift tests or other experiments that you can use to calibrate your model.
es: Idealmente, cuentas con pruebas de lift u otros experimentos que puedas usar para calibrar tu modelo.

source: Remember, the quality and completeness of your data directly impact the accuracy and usefulness of your Media Mix Model. It's crucial to ensure data consistency, handle missing values appropriately, and validate data quality before building your model.
es: Recuerda: la calidad y la completitud de tus datos impactan directamente en la precisión y utilidad de tu Media Mix Model. Es crucial garantizar la consistencia de los datos, tratar adecuadamente los valores faltantes y validar la calidad de los datos antes de construir tu modelo.

source: PyMC-Marketing Media Mix Modeling features
es: Características de Media Mix Modeling en PyMC‑Marketing

source: PyMC-Marketing offers a comprehensive suite of features for Media Mix Modeling:
es: PyMC‑Marketing ofrece un conjunto completo de funcionalidades para Media Mix Modeling:

source: • Custom Priors and Likelihoods: Incorporate domain-specific knowledge into your model through customizable prior distributions, allowing you to tailor the model to your unique business needs.
es: • Priors y verosimilitudes personalizadas: Incorpora conocimiento específico del dominio mediante distribuciones a priori personalizables, lo que te permite adaptar el modelo a las necesidades únicas de tu negocio.

source: • Adstock Transformation: Optimize the carry-over effects in your marketing channels to better understand how past marketing efforts impact current performance.
es: • Transformación de adstock: Optimiza los efectos de arrastre en tus canales de marketing para comprender mejor cómo los esfuerzos de marketing pasados impactan el rendimiento actual.

source: • Saturation Effects: Model and analyze the diminishing returns on media investments, helping you identify the point of optimal spending for each channel.
es: • Efectos de saturación: Modela y analiza los rendimientos decrecientes de las inversiones en medios, ayudándote a identificar el punto de gasto óptimo para cada canal.

source: • Customizable Adstock and Saturation Functions: Choose from a variety of pre-built functions or implement your own custom functions to model adstock and saturation effects. Refer to the documentation guide for more details.
es: • Funciones de adstock y saturación personalizables: Elige entre diversas funciones preconstruidas o implementa tus propias funciones para modelar adstock y saturación. Consulta la guía de documentación para más detalles.

source: • Time-varying Intercept: Capture baseline contributions that change over time using advanced Gaussian process approximation methods. This allows for more accurate modeling of underlying trends in your data.
es: • Intercepto variable en el tiempo: Captura contribuciones de base que cambian con el tiempo usando métodos avanzados de aproximación con procesos gaussianos. Esto permite modelar con mayor precisión las tendencias subyacentes de tus datos.

source: • Time-varying Media Contribution: Model the efficiency of media channels as it changes over time, again utilizing efficient Gaussian process approximation methods. This feature provides insights into how the effectiveness of different channels evolves.
es: • Contribución de medios variable en el tiempo: Modela la eficiencia de los canales de medios a medida que cambia con el tiempo, nuevamente utilizando métodos eficientes de aproximación con procesos gaussianos. Esta funcionalidad ofrece información sobre cómo evoluciona la eficacia de los distintos canales.

source: • Visualization and Model Diagnostics: Get a comprehensive view of your model's performance through various visualization tools and diagnostic metrics, helping you interpret results and validate your model.
es: • Visualización y diagnósticos del modelo: Obtén una visión completa del desempeño de tu modelo mediante diversas herramientas de visualización y métricas de diagnóstico, lo que te ayuda a interpretar resultados y validar tu modelo.

source: • Flexible Inference Algorithms: Choose from multiple NUTS (No-U-Turn Sampler) implementations, including BlackJax, NumPyro, and Nutpie, to best suit your inference needs.
es: • Algoritmos de inferencia flexibles: Elige entre múltiples implementaciones de NUTS (No‑U‑Turn Sampler), incluidas BlackJax, NumPyro y Nutpie, para ajustarse mejor a tus necesidades de inferencia.

source: • Out-of-sample Predictions: Generate forecasts for future marketing performance, complete with credible intervals. This feature is invaluable for simulations and scenario planning.
es: • Predicciones fuera de muestra: Genera pronósticos del rendimiento de marketing futuro con intervalos creíbles. Esta función es muy útil para simulaciones y planificación de escenarios.
