Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/mmm/resources.po
Languages: es

source: Resources
es: Recursos

source: Bayesian Marketing Science - Solving Marketing's 3 Biggest Problems
es: Ciencia del Marketing Bayesiano - Resolviendo los 3 Problemas Más Grandes del Marketing

source: In this talk I will present two new open-source packages that make up a powerful and state-of-the-art marketing analytics toolbox. Specifically, PyMC-Marketing is a new library built on top of the popular Bayesian modeling library PyMC. PyMC-Marketing allows robust estimation of customer acquisition costs (via media mix modeling) as well as customer lifetime value. In addition, I will show how we can estimate the effectiveness of marketing campaigns using a new Bayesian causal inference package called CausalPy. The talk will be applied with a real-world case-study and many code examples. Special emphasis will be placed on the interplay between these tools and how they can be combined together to make optimal marketing budget decisions in complex scenarios.
es: En esta charla presentaré dos nuevos paquetes de código abierto que conforman una poderosa y avanzada caja de herramientas de análisis de marketing. Específicamente, PyMC-Marketing es una nueva biblioteca construida sobre la popular biblioteca de modelado bayesiano PyMC. PyMC-Marketing permite la estimación robusta de los costos de adquisición de clientes (a través de la modelización de mezcla de medios) así como el valor de vida del cliente. Además, mostraré cómo podemos estimar la efectividad de las campañas de marketing utilizando un nuevo paquete de inferencia causal bayesiana llamado CausalPy. La charla se aplicará con un estudio de caso del mundo real y muchos ejemplos de código. Se hará un énfasis especial en la interacción entre estas herramientas y cómo se pueden combinar para tomar decisiones óptimas sobre el presupuesto de marketing en escenarios complejos.

source: Click through the video thumbnail below to [watch the video](https://www.youtube.com/watch?v=RY-M0tvN77s).
es: Haz clic en la miniatura del video a continuación para [ver el video](https://www.youtube.com/watch?v=RY-M0tvN77s).

source: [![Youtube video thumbnail image](https://img.youtube.com/vi/RY-M0tvN77s/maxresdefault.jpg)](https://www.youtube.com/watch?v=RY-M0tvN77s)
es: [![Imagen en miniatura del video de Youtube](https://img.youtube.com/vi/RY-M0tvN77s/maxresdefault.jpg)](https://www.youtube.com/watch?v=RY-M0tvN77s)

source: Youtube video thumbnail image
es: Imagen en miniatura del video de Youtube

source: Bayesian Marketing Mix models: State of the Art and their Future
es: Modelos de Mezcla de Marketing Bayesianos: Estado del Arte y su Futuro

source: The video below is a discussion, recorded in 2022, about the state of the art of Bayesian Marketing Mix Models (MMM) and their future. Click through the video thumbnail below to [watch the video](https://www.youtube.com/watch?v=xVx91prC81g).
es: El video a continuación es una discusión, grabada en 2022, sobre el estado del arte de los Modelos de Mezcla de Marketing Bayesianos (MMM) y su futuro. Haz clic en la miniatura del video a continuación para [ver el video](https://www.youtube.com/watch?v=xVx91prC81g).

source: [![Youtube video thumbnail image](https://img.youtube.com/vi/xVx91prC81g/maxresdefault.jpg)](https://www.youtube.com/watch?v=xVx91prC81g)
es: [![Imagen en miniatura del video de Youtube](https://img.youtube.com/vi/xVx91prC81g/maxresdefault.jpg)](https://www.youtube.com/watch?v=xVx91prC81g)

source: PyMC-Marketing: Bayesian Approach to Marketing Data Science
es: PyMC-Marketing: Enfoque Bayesiano para la Ciencia de Datos de Marketing

source: In this webinar, you'll learn about the history and development of PyMC-Marketing from Ben Vincent, and why using an open source package like this can be advantageous for your marketing analytics needs.
es: En este seminario web, aprenderás sobre la historia y el desarrollo de PyMC-Marketing de Ben Vincent, y por qué usar un paquete de código abierto como este puede ser ventajoso para tus necesidades de análisis de marketing.

source: The two main components of PyMC-Marketing - media mix modelling and customer lifetime value - will be presented by Ben Vincent, with input from Niall Oulton, and Christian Luhmann with input from Colt Allen, respectively. You will learn how PyMC-Marketing can be used to accurately model marketing campaigns and determine their effectiveness, as well as how it can help businesses understand and optimize their customer lifetime value. Click through the video thumbnail below to [watch the video](https://youtu.be/7a_HL5BRB-s?si=fitQK_GrQcoSNWJq)
es: Los dos componentes principales de PyMC-Marketing - modelado de mezcla de medios y valor de vida del cliente - serán presentados por Ben Vincent, con la participación de Niall Oulton, y Christian Luhmann con la participación de Colt Allen, respectivamente. Aprenderás cómo PyMC-Marketing se puede utilizar para modelar con precisión campañas de marketing y determinar su efectividad, así como cómo puede ayudar a las empresas a entender y optimizar su valor de vida del cliente. Haz clic en la miniatura del video a continuación para [ver el video](https://youtu.be/7a_HL5BRB-s?si=fitQK_GrQcoSNWJq)

source: [![Youtube video thumbnail image](https://img.youtube.com/vi/7a_HL5BRB-s/maxresdefault.jpg)](https://youtu.be/7a_HL5BRB-s?si=fitQK_GrQcoSNWJq)
es: [![Imagen en miniatura del video de Youtube](https://img.youtube.com/vi/7a_HL5BRB-s/maxresdefault.jpg)](https://youtu.be/7a_HL5BRB-s?si=fitQK_GrQcoSNWJq)

source: Bolt's Evolution towards MMM with PyMC with Carlos Agostini
es: La evolución de Bolt hacia MMM con PyMC con Carlos Agostini

source: The video below is a discussion highlighting Bolt's adoption of PyMC for building Marketing Mix Models (MMM) and more. This webinar will take you through the various approaches Bolt initially considered for its MMM before ultimately deciding on PyMC. Click through the video thumbnail below to [watch the video](https://youtu.be/djXoPq60bRM?si=fitQK_GrQcoSNWJq)
es: El video a continuación es una discusión que destaca la adopción de PyMC por parte de Bolt para construir Modelos de Mezcla de Marketing (MMM) y más. Este seminario web te llevará a través de los diversos enfoques que Bolt consideró inicialmente para su MMM antes de decidirse finalmente por PyMC. Haz clic en la miniatura del video a continuación para [ver el video](https://youtu.be/djXoPq60bRM?si=fitQK_GrQcoSNWJq)

source: [![Youtube video thumbnail image](https://img.youtube.com/vi/djXoPq60bRM/maxresdefault.jpg)](https://youtu.be/djXoPq60bRM?si=fitQK_GrQcoSNWJq)
es: [![Imagen en miniatura del video de Youtube](https://img.youtube.com/vi/djXoPq60bRM/maxresdefault.jpg)](https://youtu.be/djXoPq60bRM?si=fitQK_GrQcoSNWJq)

source: PyMC-Marketing Yearly Catch-up & New Use Cases with Niall Oulton and Carlos Agostini
es: PyMC-Marketing Reunión Anual y Nuevos Casos de Uso con Niall Oulton y Carlos Agostini

source: We're excited to present a live demo, meticulously designed to showcase a selection of compelling use cases. These cases are not just theoretical constructs; they are real-world applications demonstrated by actual users of PyMC-Marketing. Witness firsthand how our platform has been instrumental in their success.
es: Estamos emocionados de presentar una demostración en vivo, meticulosamente diseñada para mostrar una selección de casos de uso atractivos. Estos casos no son solo construcciones teóricas; son aplicaciones del mundo real demostradas por usuarios reales de PyMC-Marketing. Sea testigo de primera mano de cómo nuestra plataforma ha sido fundamental en su éxito.

source: To add more substance to our session and ensure it's not just informative but also engaging, we've planned a unique segment featuring the new GPT model developed by Niall. The new GPT will be the most powerful assistant to create MMM models. Click through the video thumbnail below to [watch the video](https://youtu.be/ikCK76gq65Q?si=fitQK_GrQcoSNWJq)
es: Para añadir más sustancia a nuestra sesión y asegurarnos de que no sea solo informativa sino también atractiva, hemos planeado un segmento único con el nuevo modelo GPT desarrollado por Niall. El nuevo GPT será el asistente más poderoso para crear modelos MMM. Haz clic en la miniatura del video a continuación para [ver el video](https://youtu.be/ikCK76gq65Q?si=fitQK_GrQcoSNWJq)

source: [![Youtube video thumbnail image](https://img.youtube.com/vi/ikCK76gq65Q/maxresdefault.jpg)](https://youtu.be/ikCK76gq65Q?si=fitQK_GrQcoSNWJq)
es: [![Imagen en miniatura del video de Youtube](https://img.youtube.com/vi/ikCK76gq65Q/maxresdefault.jpg)](https://youtu.be/ikCK76gq65Q?si=fitQK_GrQcoSNWJq)

source: Business Cases
es: Casos de Negocio

source: PyMC Labs: [Bayesian Media Mix Models: Modelling changes in marketing effectiveness over time](https://www.pymc-labs.com/blog-posts/modelling-changes-marketing-effectiveness-over-time/)
es: PyMC Labs: [Modelos de Mezcla de Medios Bayesianos: Modelando cambios en la efectividad del marketing a lo largo del tiempo](https://www.pymc-labs.com/blog-posts/modelling-changes-marketing-effectiveness-over-time/)

source: Bolt: [Better budgeting with Bayesian models: Bolt’s story with PyMC-Marketing](https://bolt.eu/en/blog/budgeting-with-bayesian-models-pymc-marketing/)
es: Bolt: [Mejor presupuesto con modelos bayesianos: la historia de Bolt con PyMC-Marketing](https://bolt.eu/en/blog/budgeting-with-bayesian-models-pymc-marketing/)

source: Shell & Databricks: [Revolutionizing Tech Marketing: The Synergy of PyMC and Databricks](https://www.databricks.com/blog/revolutionizing-tech-marketing)
es: Shell y Databricks: [Revolucionando el Marketing Tecnológico: La Sinergia de PyMC y Databricks](https://www.databricks.com/blog/revolutionizing-tech-marketing)

source: Blogposts
es: Publicaciones de blog

source: PyMC Labs: [Improving the Speed and Accuracy of Bayesian Media Mix Models](https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/)
es: PyMC Labs: [Mejorando la Velocidad y Precisión de los Modelos de Mezcla de Medios Bayesianos](https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/)

source: 1749: [Measuring Marketing Effectiveness Over the Long-Term](https://1749.io/resource-center/f/measuring-marketing-effectiveness-over-the-long-term)
es: 1749: [Midiendo la Efectividad del Marketing a Largo Plazo](https://1749.io/resource-center/f/midiendo-la-efectividad-del-marketing-a-largo-plazo)

source: 1749: [Marketing Mix Modeling in a Modern Era: Time-Varying Parameters](https://1749.io/resource-center/f/marketing-mix-modeling-in-a-modern-era-time-varying-parameters)
es: 1749: [Modelado de Mezcla de Marketing en una Era Moderna: Parámetros que Varían con el Tiempo](https://1749.io/resource-center/f/marketing-mix-modeling-in-a-modern-era-time-varying-parameters)

source: 1749: [A Comprehensive Guide to Marketing-Mix Modeling](https://1749.io/resource-center/f/a-comprehensive-guide-to-bayesian-marketing-mix-modeling)
es: 1749: [Una Guía Completa para el Modelado de Mezcla de Marketing](https://1749.io/resource-center/f/a-comprehensive-guide-to-bayesian-marketing-mix-modeling)

source: Juan Orduz: [Media Effect Estimation with Orbit's KTR Model](https://juanitorduz.github.io/orbit_mmm/)
es: Juan Orduz: [Estimación del Efecto Mediático con el Modelo KTR de Orbit](https://juanitorduz.github.io/orbit_mmm/)

source: Juan Orduz: [Media Effect Estimation with PyMC: Adstock, Saturation & Diminishing Returns](https://juanitorduz.github.io/pymc_mmm/)
es: Juan Orduz: [Estimación del Efecto de Medios con PyMC: Adstock, Saturación y Rendimientos Decrecientes](https://juanitorduz.github.io/pymc_mmm/)

source: Juan Orduz: [Media Mix Model and Experimental Calibration: A Simulation Study](https://juanitorduz.github.io/mmm_roas/)
es: Juan Orduz: [Modelo de Mezcla de Medios y Calibración Experimental: Un Estudio de Simulación](https://juanitorduz.github.io/mmm_roas/)

source: Dr. Robert Kübler: [Convenient Bayesian Marketing Mix Modeling with PyMC-Marketing](https://towardsdatascience.com/convenient-bayesian-marketing-mix-modeling-with-pymc-marketing-8b02a9a9c4aa)
es: Dr. Robert Kübler: [Modelado de Mezcla de Marketing Bayesiano Conveniente con PyMC-Marketing](https://towardsdatascience.com/convenient-bayesian-marketing-mix-modeling-with-pymc-marketing-8b02a9a9c4aa)

source: Ryan O'Sullivan, [Is Multi-Collinearity Destroying Your Causal Inferences In Marketing Mix Modelling?](https://towardsdatascience.com/is-multi-collinearity-destroying-your-causal-inferences-in-marketing-mix-modelling-78cb56017c73)
es: Ryan O'Sullivan, [¿Está la multi-colinealidad destruyendo tus inferencias causales en el modelado de mezcla de marketing?](https://towardsdatascience.com/is-multi-collinearity-destroying-your-causal-inferences-in-marketing-mix-modelling-78cb56017c73)

source: Tutorials
es: Tutoriales

source: [Example Problem: JellyPop](https://github.com/PhilClarkPhD/mmm)
es: [Ejemplo de problema: JellyPop](https://github.com/PhilClarkPhD/mmm)

source: MMM Explainer App
es: MMM Aplicación Explicativa

source: [MMM Explainer App](https://pymc-marketing-app.streamlit.app/). Dynamic and interactive visualization of key Marketing Mix Modeling (MMM) concepts, including adstock, saturation, and the use of Bayesian priors.
es: [MMM Explainer App](https://pymc-marketing-app.streamlit.app/). Visualización dinámica e interactiva de conceptos clave del Modelado de Mezcla de Marketing (MMM), incluyendo adstock, saturación y el uso de priors bayesianos.
