Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/*_nbd.po
Languages: es

source: BG/NBD Model
es: Modelo BG/NBD

source: In this notebook we show how to fit a BG/NBD model in PyMC-Marketing. We compare the results with the [`lifetimes`](https://github.com/CamDavidsonPilon/lifetimes) package (no longer maintained). The model is presented in the paper: Fader, P. S., Hardie, B. G., & Lee, K. L. (2005). [“Counting your customers” the easy way: An alternative to the Pareto/NBD model. Marketing science, 24(2), 275-284.](http://www.brucehardie.com/papers/bgnbd_2004-04-20.pdf)
es: En este cuaderno mostramos cómo ajustar un modelo BG/NBD en PyMC-Marketing. Comparamos los resultados con el paquete [`lifetimes`](https://github.com/CamDavidsonPilon/lifetimes) (ya no mantenido). El modelo se presenta en el artículo: Fader, P. S., Hardie, B. G., & Lee, K. L. (2005). [“Contando a tus clientes” de manera sencilla: Una alternativa al modelo Pareto/NBD. Marketing science, 24(2), 275-284.](http://www.brucehardie.com/papers/bgnbd_2004-04-20.pdf)

source: Prepare Notebook
es: Preparar Notebook

source: Read Data
es: Leer datos

source: We use the `CDNOW` dataset (see lifetimes [quick-start](https://lifetimes.readthedocs.io/en/latest/Quickstart.html)).
es: Utilizamos el conjunto de datos `CDNOW` (ver el [inicio rápido](https://lifetimes.readthedocs.io/en/latest/Quickstart.html) de lifetimes).

source: Recall from the `lifetimes` documentation the following definitions:
es: Recuerde de la documentación de `lifetimes` las siguientes definiciones:

source: `frequency` represents the number of repeat purchases the customer has made. This means that it’s one less than the total number of purchases. This is actually slightly wrong. It’s the count of time periods the customer had a purchase in. So if using days as units, then it’s the count of days the customer had a purchase on.
es: `frequency` representa el número de compras repetidas que ha realizado el cliente. Esto significa que es uno menos que el número total de compras. En realidad, esto es ligeramente incorrecto. Es el conteo de los períodos de tiempo en los que el cliente realizó una compra. Así que, si se utilizan días como unidades, entonces es el conteo de días en los que el cliente realizó una compra.

source: `T` represents the age of the customer in whatever time units chosen (weekly, in the above dataset). This is equal to the duration between a customer’s first purchase and the end of the period under study.
es: `T` representa la edad del cliente en las unidades de tiempo elegidas (semanalmente, en el conjunto de datos anterior). Esto es igual a la duración entre la primera compra de un cliente y el final del período bajo estudio.

source: `recency` represents the age of the customer when they made their most recent purchases. This is equal to the duration between a customer’s first purchase and their latest purchase. (Thus if they have made only 1 purchase, the recency is 0.)
es: `recency` representa la antigüedad del cliente en el momento de sus compras más recientes. Esto es igual a la duración entre la primera compra de un cliente y su última compra. (Por lo tanto, si solo ha realizado 1 compra, la recency es 0.)

source: We rename the index column to `customer_id` as this is required by the model
es: Renombramos la columna del índice a `customer_id`, ya que esto es requerido por el modelo.

source: Model Specification
es: Especificación del Modelo

source: The BG/NBD model is a probabilistic model that describes the buying behavior of a customer in the non-contractual setting. It is based on the following assumptions for each customer:
es: El modelo BG/NBD es un modelo probabilístico que describe el comportamiento de compra de un cliente en un entorno no contractual. Se basa en las siguientes suposiciones para cada cliente:

source: Frequency Process
es: Proceso de Frecuencia

source: While active, the time between transactions is distributed exponential with transaction rate, i.e.,
es: Mientras está activo, el tiempo entre transacciones se distribuye de manera exponencial con la tasa de transacciones, es decir,

source: Heterogeneity in $\lambda$ follows a gamma distribution with pdf
es: La heterogeneidad en $\lambda$ sigue una distribución gamma con pdf

source: Dropout Process
es: Proceso de abandono

source: After any transaction, a customer becomes inactive with probability $p$.
es: Después de cualquier transacción, un cliente se vuelve inactivo con una probabilidad de $p$.

source: Heterogeneity in $p$ follows a beta distribution with pdf
es: La heterogeneidad en $p$ sigue una distribución beta con pdf

source: f(p|a, b) = \frac{\Gamma(a + b)}{\Gamma(a) \Gamma(b)} p^{a - 1}(1 - p)^{b - 1}, \quad 0 \leq p \leq 1
es: msgid: f(p|a, b) = \frac{\Gamma(a + b)}{\Gamma(a) \Gamma(b)} p^{a - 1}(1 - p)^{b - 1}, \quad 0 \leq p \leq 1 msgstr: f(p|a, b) = \frac{\Gamma(a + b)}{\Gamma(a) \Gamma(b)} p^{a - 1}(1 - p)^{b - 1}, \quad 0 \leq p \leq 1

source: The transaction rate $\lambda$ and the dropout probability $p$ vary independently across customers.
es: La tasa de transacción $\lambda$ y la probabilidad de abandono $p$ varían de manera independiente entre los clientes.

source: Instead of estimating $\lambda$ and $p$ for each specific customer, we do it for a randomly chosen customer, i.e. we work with the expected values of the parameters. Hence, we are interesting in finding the posterior distribution of the parameters $r$, $\alpha$, $a$, and $b$.
es: En lugar de estimar $\lambda$ y $p$ para cada cliente específico, lo hacemos para un cliente elegido al azar, es decir, trabajamos con los valores esperados de los parámetros. Por lo tanto, estamos interesados en encontrar la distribución posterior de los parámetros $r$, $\alpha$, $a$ y $b$.

source: Model Fitting
es: Ajuste del Modelo

source: Estimating such parameters is very easy in PyMC-Marketing. We instantiate the model in a similar way:
es: Estimar tales parámetros es muy fácil en PyMC-Marketing. Instanciamos el modelo de manera similar:

source: And *build* the model to see the model configuration:
es: Y *construya* el modelo para ver la configuración del modelo:

source: Notice the additional `phi_dropout` and `kappa_dropout` priors. These were added to the default configuration to improve performance, but can be omitted when specifying a custom `model_config` with `a` and `b`.
es: Observe los priors adicionales `phi_dropout` y `kappa_dropout`. Estos se añadieron a la configuración predeterminada para mejorar el rendimiento, pero se pueden omitir al especificar una `model_config` personalizada con `a` y `b`.

source: The specified model structure can also be visualized:
es: La estructura del modelo especificado también se puede visualizar:

source: We can now fit the model. The default sampler in PyMC-Marketing is the No-U-Turn Sampler (NUTS). We use the default $4$ chains and $1000$ draws per chain.
es: Ahora podemos ajustar el modelo. El muestreador predeterminado en PyMC-Marketing es el Muestreador No-U-Turn (NUTS). Utilizamos las $4$ cadenas predeterminadas y $1000$ muestras por cadena.

source: It is not necessary to build the model before fitting it. We can fit the model directly.
es: No es necesario construir el modelo antes de ajustarlo. Podemos ajustar el modelo directamente.

source: We can look into the summary table:
es: Podemos consultar la tabla de resumen:

source: We see that the `r_hat` values are close to $1$, which indicates convergence.
es: Vemos que los valores de `r_hat` están cerca de $1$, lo que indica convergencia.

source: We can also plot posterior distributions of the parameters and the rank plots:
es: También podemos trazar distribuciones posteriores de los parámetros y los gráficos de rango:

source: Using MAP fit
es: Usando el ajuste MAP

source: CLV models such as `BetaGeoModel`, can provide the maximum a posteriori estimates using a numerical optimizer (`L-BFGS-B` from `scipy.optimize`) under the hood.
es: Los modelos de CLV, como `BetaGeoModel`, pueden proporcionar las estimaciones máximas a posteriori utilizando un optimizador numérico (`L-BFGS-B` de `scipy.optimize`) en segundo plano.

source: This time we get point estimates for the parameters.
es: Esta vez obtenemos estimaciones puntuales para los parámetros.

source: Comparing with the `lifetimes` package
es: Comparando con el paquete `lifetimes`

source: For the sake of comparison, let's fit the model using the `lifetimes` package.
es: Para fines de comparación, ajustemos el modelo utilizando el paquete `lifetimes`.

source: The `r` and `alpha` purchase rate parameters are quite similar for all three models, but the `a` and `b` dropout parameters are better approximated with the default parameters when fitted with MCMC.
es: Los parámetros de tasa de compra `r` y `alpha` son bastante similares para los tres modelos, pero los parámetros de abandono `a` y `b` se aproximan mejor con los parámetros predeterminados cuando se ajustan con MCMC.

source: Prior and Posterior Predictive Checks
es: Comprobaciones Predictivas Anteriores y Posteriores

source: PPCs allow us to check the efficacy of our priors, and the peformance of the fitted posteriors.
es: Los PPCs nos permiten verificar la eficacia de nuestras distribuciones a priori y el rendimiento de los posteriors ajustados.

source: Let's see how the model performs in a *prior* predictive check, where we sample from the default priors before fitting the model:
es: Veamos cómo se desempeña el modelo en un chequeo predictivo *previo*, donde muestreamos de las distribuciones a priori predeterminadas antes de ajustar el modelo:

source: Some Applications
es: Algunas Aplicaciones

source: Now that you have fitted the model, we can use it to make predictions. For example, we can predict the expected probability of a customer being alive as a function of time (steps). Here is a snippet of code to do that:
es: Ahora que ha ajustado el modelo, podemos utilizarlo para hacer predicciones. Por ejemplo, podemos predecir la probabilidad esperada de que un cliente esté vivo en función del tiempo (pasos). Aquí hay un fragmento de código para hacerlo:

source: Expected Number of Purchases
es: Número Esperado de Compras

source: Let us take a sample of users:
es: Tomemos una muestra de usuarios:

source: Observe that the last two customers are *frequent buyers* as compared to the others.
es: Observe que los últimos dos clientes son *compradores frecuentes* en comparación con los demás.

source: We can plot the expected number of purchases for the next $90$ periods:
es: Podemos trazar el número esperado de compras para los próximos $90$ períodos:

source: Note that the *frequent buyers* are expected to make more purchases in the future.
es: Tenga en cuenta que se espera que los *compradores frecuentes* realicen más compras en el futuro.

source: Probability of a Customer Being Alive
es: Probabilidad de que un Cliente esté Vivo

source: We now look into the probability of a customer being alive for the next $90$ periods:
es: Ahora examinamos la probabilidad de que un cliente esté vivo durante los próximos $90$ períodos:

source: Here are some general remarks:
es: Aquí hay algunas observaciones generales:

source: **These plots assume no future purchases.**
es: **Estos gráficos suponen que no habrá compras futuras.**

source: The decay probability is not the same as it depends in the purchase history of the customer.
es: La probabilidad de descomposición no es la misma, ya que depende del historial de compras del cliente.

source: The probability of being alive is always decreasing as we are assuming there is no change in the other parameters.
es: La probabilidad de estar vivo siempre está disminuyendo, ya que asumimos que no hay cambios en los otros parámetros.

source: These probabilities are always non-negative, as expected.
es: Estas probabilidades son siempre no negativas, como se esperaba.

source: For the frequent buyers, the probability of being alive drops very fast as we are assuming no future purchases. It is very important to keep this in mind when interpreting the results.
es: Para los compradores frecuentes, la probabilidad de estar vivos disminuye muy rápidamente ya que asumimos que no habrá compras futuras. Es muy importante tener esto en cuenta al interpretar los resultados.

source: Probability of a Customer Making Zero Purchases in a time range
es: Probabilidad de que un cliente no realice ninguna compra en un rango de tiempo

source: We now look into the probability of a customer making 0 purchases between now, and the next $t$ periods between 0 and 30.
es: Ahora analizamos la probabilidad de que un cliente realice 0 compras entre ahora y los próximos $t$ períodos, que van de 0 a 30.
