Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/clv_quickstart.po
Languages: es

source: CLV Quickstart
es: CLV Inicio Rápido

source: Customer Lifetime Value (CLV) is the measure of a customer's contribution over time to a business. This metric is used to inform spending levels on new customer acquisition, retention, and other marketing and sales efforts, so reliable estimation is essential.
es: El Valor del Tiempo de Vida del Cliente (CLV) es la medida de la contribución de un cliente a un negocio a lo largo del tiempo. Esta métrica se utiliza para informar los niveles de gasto en la adquisición de nuevos clientes, la retención y otros esfuerzos de marketing y ventas, por lo que una estimación fiable es esencial.

source: PyMC-Marketing provides tools to segment customers on their past behavior (see [RFM Segmentation](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.clv.utils.rfm_segments.html#pymc_marketing.clv.utils.rfm_segments)) as well as the following Buy Till You Die (BTYD) probabilistic models to predict future behavior:
es: PyMC-Marketing proporciona herramientas para segmentar a los clientes según su comportamiento pasado (ver [Segmentación RFM](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.clv.utils.rfm_segments.html#pymc_marketing.clv.utils.rfm_segments)) así como los siguientes modelos probabilísticos Buy Till You Die (BTYD) para predecir el comportamiento futuro:

source: **[BG/NBD model](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/bg_nbd.html)** for continuous time, non-contractual modeling
es: **[Modelo BG/NBD](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/bg_nbd.html)** para modelado en tiempo continuo y no contractual

source: **[Pareto/NBD model](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/pareto_nbd.html)** for continuous time, non-contractual modeling with covariates
es: **[Modelo Pareto/NBD](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/pareto_nbd.html)** para modelado en tiempo continuo, no contractual, con covariables

source: **Exponential Gamma model** for discrete time, contractual modeling (coming soon)
es: **Modelo Gamma Exponencial** para tiempo discreto, modelado contractual (próximamente)

source: **[Gamma-Gamma model](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/gamma_gamma.html)** for expected monetary value
es: **[Modelo Gamma-Gamma](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/gamma_gamma.html)** para el valor monetario esperado

source: **[Modified BG/NBD model](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/mbg_nbd.html)**, similar to the BG/NBD model, but assumes non-repeat customers are still active.
es: **[Modelo BG/NBD modificado](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/mbg_nbd.html)**, similar al modelo BG/NBD, pero asume que los clientes no recurrentes aún están activos.

source: This table contains a breakdown of the four BTYD modeling domains, and examples for each:
es: Esta tabla contiene un desglose de los cuatro dominios de modelado BTYD y ejemplos para cada uno:

source: **Non-contractual**
es: **No contractual**

source: **Continuous**
es: **Continuo**

source: online purchases
es: compras en línea

source: ad conversion time
es: tiempo de conversión de anuncios

source: **Discrete**
es: **Discreto**

source: concerts & sports events
es: conciertos y eventos deportivos

source: recurring subscriptions
es: suscripciones recurrentes

source: In this notebook we will demonstrate how to estimate future purchasing activity and CLV with the CDNOW dataset, a popular benchmarking dataset in CLV and BTYD research. Data is available [here](https://www.brucehardie.com/datasets/), with additional details [here](https://www.brucehardie.com/notes/026/).
es: En este cuaderno, demostraremos cómo estimar la actividad de compra futura y el CLV con el conjunto de datos de CDNOW, un conjunto de datos de referencia popular en la investigación de CLV y BTYD. Los datos están disponibles {aquí}, con detalles adicionales {aquí}.

source: 1.1 Data Requirements
es: 1.1 Requisitos de Datos

source: For all models, the following nomenclature is used:
es: Para todos los modelos, se utiliza la siguiente nomenclatura:

source: `customer_id` represents a unique identifier for each customer.
es: `customer_id` representa un identificador único para cada cliente.

source: `frequency` represents the number of _repeat_ purchases that a customer has made, i.e. one less than the total number of purchases.
es: `frequency` representa el número de compras _repetidas_ que un cliente ha realizado, es decir, uno menos que el total de compras.

source: `T` represents a customer's "age", i.e. the duration between a customer's first purchase and the end of the period of study. In this example notebook, the units of time are in weeks.
es: `T` representa la "edad" de un cliente, es decir, la duración entre la primera compra de un cliente y el final del período de estudio. En este cuaderno de ejemplo, las unidades de tiempo están en semanas.

source: `recency` represents the time period when a customer made their most recent purchase. This is equal to the duration between a customer’s first and last purchase. If a customer has made only 1 purchase, their recency is 0.
es: `recency` representa el período de tiempo en el que un cliente realizó su compra más reciente. Esto es igual a la duración entre la primera y la última compra de un cliente. Si un cliente ha realizado solo 1 compra, su recency es 0.

source: `monetary_value` represents the average value of a given customer’s repeat purchases. Customers who have only made a single purchase have monetary values of zero.
es: `monetary_value` representa el valor promedio de las compras repetidas de un cliente dado. Los clientes que solo han realizado una única compra tienen valores monetarios de cero.

source: The `rfm_summary` function can be used to preprocess raw transaction data for modeling:
es: La función `rfm_summary` se puede utilizar para preprocesar datos de transacciones en bruto para la modelización:

source: It is important to note these definitions differ from that used in RFM segmentation, where the first purchase is included, `T` is not used, and `recency` is the number of time periods since a customer's most recent purchase.
es: Es importante señalar que estas definiciones difieren de las utilizadas en la segmentación RFM, donde se incluye la primera compra, no se utiliza `T`, y `recencia` es el número de períodos de tiempo desde la compra más reciente de un cliente.

source: To visualize data in RFM format, we can plot the recency and T of the customers with the `plot_customer_exposure` function. We see a large chunk (>60%) of customers haven't made another purchase in a while.
es: Para visualizar datos en formato RFM, podemos trazar la recencia y T de los clientes con la función `plot_customer_exposure`. Observamos que un gran porcentaje (>60%) de los clientes no ha realizado otra compra en un tiempo.

source: Predicting Future Purchasing Behavior with the BG/NBD Model
es: Predicción del Comportamiento de Compra Futuro con el Modelo BG/NBD

source: This dataset is an example of continuous time, noncontractual transactions because it comprises purchases from an online music store. PyMC-Marketing provides several models for this use case:
es: Este conjunto de datos es un ejemplo de transacciones no contractuales en tiempo continuo, ya que comprende compras de una tienda de música en línea. PyMC-Marketing ofrece varios modelos para este caso de uso:

source: [Beta-Geometric/Negative Binomial Distribution (BG/NBD)](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/bg_nbd.html)
es: [Distribución Beta-Geométrica/Binomial Negativa (BG/NBD)](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/bg_nbd.html)

source: [Pareto/Negative Binomial Distribution (Pareto/NBD)](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/pareto_nbd.html)
es: [Pareto/Distribución Binomial Negativa (Pareto/NBD)](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/pareto_nbd.html)

source: [Modified Beta-Geometric/Negative Binomial Distribution (MBG/NBD)](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/mbg_nbd.html)
es: [Distribución Beta-Geométrica/Binomial Negativa Modificada (MBG/NBD)](https://pymc-marketing.readthedocs.io/en/stable/notebooks/clv/mbg_nbd.html)

source: We will be using the BG/NBD model in this notebook because it works well for basic use cases. For more comprehensive modeling, the Pareto/NBD and MBG/NBD models have expanded functionality and fewer limitations.
es: Usaremos el modelo BG/NBD en este cuaderno porque funciona bien para casos de uso básicos. Para un modelado más completo, los modelos Pareto/NBD y MBG/NBD tienen una funcionalidad ampliada y menos limitaciones.

source: Let's take a look at the underlying structure of the BG/NBD model:
es: Veamos la estructura subyacente del modelo BG/NBD:

source: The default priors for the `r` and `alpha` purchase rate parameters follow a HalfFlat distribution, which is an uninformative positive distribution. The `a` and `b` dropout parameters are pooled with the hierarchical `kappa_dropout` and `phi_dropout` priors for improved performance.
es: Los priors predeterminados para los parámetros de tasa de compra `r` y `alpha` siguen una distribución HalfFlat, que es una distribución positiva no informativa. Los parámetros de abandono `a` y `b` se agrupan con los priors jerárquicos `kappa_dropout` y `phi_dropout` para mejorar el rendimiento.

source: More informative priors can be specified in a custom model configuration by passing a dictionary with keys for prior names, and values as distributions defined with the `Prior` class in PyMC-Marketing.
es: Se pueden especificar priors más informativos en una configuración de modelo personalizada pasando un diccionario con claves para los nombres de los priors y valores como distribuciones definidas con la clase `Prior` en PyMC-Marketing.

source: Having specified the model, we can now fit it.
es: Habiendo especificado el modelo, ahora podemos ajustarlo.

source: Model Fitting with MAP
es: Ajuste de Modelo con MAP

source: By default, `fit` generates full Bayesian posteriors via [MCMC](https://en.wikipedia.org/wiki/Markov_chain_Monte_Carlo) sampling. For extremely large datasets where uncertainty estimates are not needed and/or MCMC is too slow, [maximum a posteriori](https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation) can be used to estimate point estimates for model parameters.
es: Por defecto, `fit` genera posteriors bayesianos completos a través del muestreo de [MCMC](https://en.wikipedia.org/wiki/Markov_chain_Monte_Carlo). Para conjuntos de datos extremadamente grandes donde no se necesitan estimaciones de incertidumbre y/o MCMC es demasiado lento, se puede utilizar [máximo a posteriori](https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation) para estimar estimaciones puntuales de los parámetros del modelo.

source: Use `rfm_train_test_split` for train/test splits. Here we are training on 52 weeks of data, and withholding the remaining 26 weeks for testing:
es: Utilice `rfm_train_test_split` para dividir en entrenamiento/prueba. Aquí estamos entrenando con 52 semanas de datos y reteniendo las 26 semanas restantes para las pruebas:

source: Note any customers who made their first purchase during the testing period will be excluded. Use `rfm_summary` to retain all customers for the final model.
es: Tenga en cuenta que cualquier cliente que haya realizado su primera compra durante el período de prueba será excluido. Utilice `rfm_summary` para retener a todos los clientes para el modelo final.

source: Let's evaluate model performance by tracking predictions against historical purchases.
es: Evaluemos el rendimiento del modelo al rastrear las predicciones en comparación con las compras históricas.

source: Looks like MAP is over-predicting the number of purchases during the testing period, and these predictions also don't have any uncertainty estimates.
es: Parece que MAP está sobreestimando el número de compras durante el período de prueba, y estas predicciones tampoco tienen estimaciones de incertidumbre.

source: Model Fitting with MCMC
es: Ajuste de Modelo con MCMC

source: MCMC sampling is recommended to illustrate uncertainty in parameter estimates and create credibility intervals around predictions.
es: Se recomienda el muestreo MCMC para ilustrar la incertidumbre en las estimaciones de parámetros y crear intervalos de credibilidad en torno a las predicciones.

source: We can use [ArviZ](https://python.arviz.org/en/stable/), a Python library tailored to produce visualizations for Bayesian models, to plot the posterior distribution of each parameter.
es: Podemos utilizar [ArviZ](https://python.arviz.org/en/stable/), una biblioteca de Python diseñada para producir visualizaciones de modelos bayesianos, para trazar la distribución posterior de cada parámetro.

source: 1.2.1. Visualizing Predictions over Time
es: 1.2.1. Visualizando Predicciones a lo Largo del Tiempo

source: Looking at the time plots again, we can see results track much more closely when fit with MCMC:
es: Al observar nuevamente los gráficos de tiempo, podemos ver que los resultados se ajustan mucho más de cerca cuando se utilizan MCMC:

source: Purchases can be plotting cumulatively as well as incrementally:
es: Las compras pueden ser trazadas de manera acumulativa así como incremental:

source: Note how the model is able to respond to trend changes over time.
es: Observe cómo el modelo es capaz de responder a los cambios de tendencia a lo largo del tiempo.

source: Visualizing Prediction Matrices
es: Visualizando Matrices de Predicción

source: We can see our best customers have been active for over 60 weeks and have made over 20 purchases (bottom-right). Note the “tail” sweeping up towards the upper-left corner - these customers are infrequent and/or may not have purchased recently. What is the probability they are still active?
es: Podemos ver que nuestros mejores clientes han estado activos durante más de 60 semanas y han realizado más de 20 compras (esquina inferior derecha). Observe la "cola" que se eleva hacia la esquina superior izquierda; estos clientes son poco frecuentes y/o pueden no haber comprado recientemente. ¿Cuál es la probabilidad de que sigan activos?

source: Note that all non-repeat customers have an alive probability of 1, which is one of the quirks of `BetaGeoModel`. In many use cases this is still a valid assumption, but if non-repeat customers are a key focus in your use case, you may want to try `ParetoNBDModel` instead.
es: Tenga en cuenta que todos los clientes no recurrentes tienen una probabilidad de vida de 1, lo cual es una de las peculiaridades de `BetaGeoModel`. En muchos casos de uso, esta sigue siendo una suposición válida, pero si los clientes no recurrentes son un enfoque clave en su caso de uso, puede que desee probar `ParetoNBDModel` en su lugar.

source: Looking at the probability alive matrix, we can infer that customers who have made fewer purchases are less likely to return, and may be worth targeting for retention.
es: Al observar la matriz de probabilidad de permanencia, podemos inferir que los clientes que han realizado menos compras tienen menos probabilidades de regresar, y puede ser conveniente enfocarse en ellos para la retención.

source: Ranking customers from best to worst
es: Clasificando a los clientes de mejor a peor

source: Having fit the model, we can ask what is the expected number of purchases for our customers over the next 10 time periods. Let's look at the four more promising customers.
es: Habiendo ajustado el modelo, podemos preguntar cuál es el número esperado de compras para nuestros clientes durante los próximos 10 períodos de tiempo. Veamos a los cuatro clientes más prometedores.

source: We can also plot credibility intervals for the expected purchases:
es: También podemos trazar intervalos de credibilidad para las compras esperadas:

source: Predicting purchase behavior of a new customer
es: Predicción del comportamiento de compra de un nuevo cliente

source: We can use the fitted model to predict the number of purchases for a fresh new customer.
es: Podemos utilizar el modelo ajustado para predecir el número de compras de un nuevo cliente.

source: Customer Probability Histories
es: Historiales de Probabilidad de Clientes

source: Given a customer transaction history, we can calculate their historical probability of being alive, according to our trained model.
es: Dada la historia de transacciones de un cliente, podemos calcular su probabilidad histórica de estar vivo, según nuestro modelo entrenado.

source: Let look at active customer 1516 and assess the change in probability that the user will ever return if they do no other purchases in the next 9 time periods.
es: Veamos al cliente activo 1516 y evaluemos el cambio en la probabilidad de que el usuario regrese alguna vez si no realiza ninguna otra compra en los próximos 9 períodos de tiempo.

source: We can see that, if no purchases are being made in the next 9 weeks, the model has low confidence that the costumer will ever return. What if they had done one purchase in between?
es: Podemos ver que, si no se realizan compras en las próximas 9 semanas, el modelo tiene baja confianza en que el cliente regrese alguna vez. ¿Qué pasaría si hubieran realizado una compra en el intermedio?

source: From the plot above, say that customer 1516 makes a purchase at week 73.5, just over 6 weeks after they have made their last recorded purchase. We can see that the probability of the customer returning quickly goes back up!
es: Del gráfico anterior, se puede decir que el cliente 1516 realiza una compra en la semana 73.5, poco más de 6 semanas después de haber realizado su última compra registrada. ¡Podemos ver que la probabilidad de que el cliente regrese rápidamente vuelve a aumentar!

source: Estimating Customer Lifetime Value Using the Gamma-Gamma Model
es: Estimando el Valor de Vida del Cliente Utilizando el Modelo Gamma-Gamma

source: Until now we’ve focused mainly on transaction frequencies and probabilities, but to estimate economic value we can use the Gamma-Gamma model.
es: Hasta ahora nos hemos centrado principalmente en las frecuencias y probabilidades de transacción, pero para estimar el valor económico podemos utilizar el modelo Gamma-Gamma.

source: The Gamma-Gamma model assumes at least 1 repeat transaction has been observed per customer. As such we filter out those with zero repeat purchases.
es: El modelo Gamma-Gamma asume que se ha observado al menos 1 transacción repetida por cliente. Por lo tanto, filtramos aquellos con cero compras repetidas.

source: If computing the monetary value from your own data, note that it is the *mean* of a given customer’s value, *not* the sum. `monetary_value` can be used to represent profit, or revenue, or any value as long as it is consistently calculated for each customer.
es: Si está calculando el valor monetario a partir de sus propios datos, tenga en cuenta que es la *media* del valor de un cliente dado, *no* la suma. `monetary_value` se puede utilizar para representar ganancias, ingresos o cualquier valor siempre que se calcule de manera consistente para cada cliente.

source: The Gamma-Gamma model relies upon the important assumption there is no relationship between the monetary value and the purchase frequency. In practice we need to check whether the Pearson correlation is less than 0.3:
es: El modelo Gamma-Gamma se basa en la importante suposición de que no existe relación entre el valor monetario y la frecuencia de compra. En la práctica, necesitamos verificar si la correlación de Pearson es menor que 0.3:

source: Transaction frequencies and monetary values are uncorrelated; we can now fit our Gamma-Gamma model to predict average spend and expected lifetime values of our customers
es: Las frecuencias de transacción y los valores monetarios no están correlacionados; ahora podemos ajustar nuestro modelo Gamma-Gamma para predecir el gasto promedio y los valores de vida esperados de nuestros clientes.

source: The Gamma-Gamma model takes in a 'data' parameter, a pandas DataFrame with 3 columns representing Customer ID, average spend of repeat purchases, and number of repeat purchase for that customer. As with the BG/NBD model, these parameters are given HalfFlat priors which can be too diffuse for small datasets. For this example, we will use the default priors, but other priors can be specified just like with the BG/NBD example above.
es: El modelo Gamma-Gamma recibe un parámetro 'data', un DataFrame de pandas con 3 columnas que representan el ID del cliente, el gasto promedio de compras repetidas y el número de compras repetidas para ese cliente. Al igual que con el modelo BG/NBD, estos parámetros se les asignan priors HalfFlat, que pueden ser demasiado difusos para conjuntos de datos pequeños. Para este ejemplo, utilizaremos los priors predeterminados, pero se pueden especificar otros priors de la misma manera que en el ejemplo de BG/NBD mencionado anteriormente.

source: Predicting spend value of customers
es: Predicción del valor de gasto de los clientes

source: Having fit our model, we can now use it to predict the conditional, expected average lifetime value of our customers, including those with zero repeat purchases.
es: Habiendo ajustado nuestro modelo, ahora podemos utilizarlo para predecir el valor promedio de vida condicional esperado de nuestros clientes, incluidos aquellos con cero compras repetidas.

source: We can also look at the average expected mean spend across all customers
es: También podemos analizar el gasto medio esperado promedio entre todos los clientes.

source: Predicting spend value of a new customer
es: Predicción del valor de gasto de un nuevo cliente

source: Estimating CLV
es: Estimando el CLV

source: Finally, we can combine the GG with the BG/NBD model to obtain an estimate of the customer lifetime value. This relies on the [discounted cash flow](https://en.wikipedia.org/wiki/Discounted_cash_flow) model, adjusting for cost of capital.
es: Finalmente, podemos combinar el GG con el modelo BG/NBD para obtener una estimación del valor de vida del cliente. Esto se basa en el modelo de [flujo de caja descontado](https://es.wikipedia.org/wiki/Flujo_de_caja_descontado), ajustando por el costo de capital.

source: If computational issues are encountered, use the `thin_fit_result` method prior to estimating CLV.
es: Si se encuentran problemas computacionales, utilice el método `thin_fit_result` antes de estimar el CLV.

source: According to our models, customer[6] has a much higher expected CLV. There is also a large variability in this estimate that arises solely from uncertainty in the parameters of the BG/NBD and GG models.
es: Según nuestros modelos, el cliente[6] tiene un CLV esperado mucho más alto. También hay una gran variabilidad en esta estimación que surge únicamente de la incertidumbre en los parámetros de los modelos BG/NBD y GG.

source: In general, these models tend to induce a strong correlation between expected CLV and uncertainty. This modelling of uncertainty can be very useful when making marketing decisions.
es: En general, estos modelos tienden a inducir una fuerte correlación entre el CLV esperado y la incertidumbre. Este modelado de la incertidumbre puede ser muy útil al tomar decisiones de marketing.
