Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/gamma_gamma.po
Languages: es

source: Gamma-gamma Model
es: Modelo gamma-gamma

source: In this notebook we show how to fit a Gamma-Gamma model in PyMC-Marketing. We compare the results with the [`lifetimes`](https://github.com/CamDavidsonPilon/lifetimes) package (no longer maintained and last meaningful update was July 2020). The model is presented in the paper: Fader, P. S., & Hardie, B. G. (2013). [The Gamma-Gamma model of monetary value](http://www.brucehardie.com/notes/025/gamma_gamma.pdf). February, 2, 1-9.
es: En este cuaderno mostramos cómo ajustar un modelo Gamma-Gamma en PyMC-Marketing. Comparamos los resultados con el paquete [`lifetimes`](https://github.com/CamDavidsonPilon/lifetimes) (que ya no se mantiene y la última actualización significativa fue en julio de 2020). El modelo se presenta en el artículo: Fader, P. S., & Hardie, B. G. (2013). [El modelo Gamma-Gamma del valor monetario](http://www.brucehardie.com/notes/025/gamma_gamma.pdf). Febrero, 2, 1-9.

source: Prepare Notebook
es: Preparar el cuaderno

source: Load Data
es: Cargar Datos

source: We start by loading the `CDNOW` dataset.
es: Comenzamos cargando el conjunto de datos `CDNOW`.

source: For the Gamma-Gamma model, we need to filter out customers who have made only one purchase.
es: Para el modelo Gamma-Gamma, necesitamos filtrar a los clientes que han realizado solo una compra.

source: Model Specification
es: Especificación del modelo

source: Here we briefly describe the assumptions and the parametrization of the Gamma-Gamma model from the paper above.
es: Aquí describimos brevemente las suposiciones y la parametrización del modelo Gamma-Gamma del artículo mencionado.

source: The model of spend per transaction is based on the following three general assumptions:
es: El modelo de gasto por transacción se basa en las siguientes tres suposiciones generales:

source: The monetary value of a customer’s given transaction varies randomly around their average transaction value.
es: El valor monetario de una transacción dada por un cliente varía aleatoriamente en torno a su valor promedio de transacción.

source: Average transaction values vary across customers but do not vary over time for any given individual.
es: Los valores promedio de transacción varían entre los clientes, pero no varían con el tiempo para ningún individuo en particular.

source: The distribution of average transaction values across customers is independent of the transaction process.
es: La distribución de los valores promedio de transacción entre los clientes es independiente del proceso de transacción.

source: For a customer with x transactions, let $z_1, z_2, \ldots, z_x$ denote the value of each transaction. The customer’s observed average transaction value by
es: Para un cliente con x transacciones, sea $z_1, z_2, \ldots, z_x$ el valor de cada transacción. El valor promedio de transacción observado del cliente por

source: Now let's describe the parametrization:
es: Ahora describamos la parametrización:

source: We assume that $z_i \sim \text{Gamma}(p, ν)$, with $E(Z_i| p, ν) = \xi = p/ν$.
es: Asumimos que $z_i \sim \text{Gamma}(p, ν)$, con $E(Z_i| p, ν) = \xi = p/ν$.

source: – Given the convolution properties of the gamma, it follows that total spend across x transactions is distributed $\text{Gamma}(px, ν)$.
es: – Dadas las propiedades de convolución de la gamma, se deduce que el gasto total en x transacciones se distribuye como $\text{Gamma}(px, ν)$.

source: – Given the scaling property of the gamma distribution, it follows that $\bar{z} \sim \text{Gamma}(px, νx)$.
es: – Dada la propiedad de escalado de la distribución gamma, se deduce que $\bar{z} \sim \text{Gamma}(px, νx)$.

source: We assume $ν \sim \text{Gamma}(q, \gamma)$.
es: Asumimos $ν \sim \text{Gamma}(q, \gamma)$.

source: We are interested in estimating the parameters $p$, $q$ and $ν$.
es: Estamos interesados en estimar los parámetros $p$, $q$ y $ν$.

source: The Gamma-Gamma model assumes that there is no relationship between the monetary value and the purchase frequency. We can check this assumption by calculating the correlation between the average spend and the frequency of purchases.
es: El modelo Gamma-Gamma asume que no existe relación entre el valor monetario y la frecuencia de compra. Podemos verificar esta suposición calculando la correlación entre el gasto promedio y la frecuencia de compras.

source: The value of this correlation is close to $0.11$, which in practice is considered low enough to proceed with the model.
es: El valor de esta correlación es cercano a $0.11$, lo cual en la práctica se considera lo suficientemente bajo como para proceder con el modelo.

source: Lifetimes Implementation
es: Implementación de Lifetimes

source: First, we fit the model using the `lifetimes` package.
es: Primero, ajustamos el modelo utilizando el paquete `lifetimes`.

source: Once the model is fitted we can use the following method to compute the conditional expectation of the average profit per transaction for a group of one or more customers.
es: Una vez que el modelo está ajustado, podemos utilizar el siguiente método para calcular la expectativa condicional del beneficio promedio por transacción para un grupo de uno o más clientes.

source: PyMC-Marketing Implementation
es: Implementación de PyMC-Marketing

source: We can use the pre-built PyMC-Marketing implementation of the Gamma-Gamma model, which also provides nice plotting and prediction methods:
es: Podemos utilizar la implementación preconstruida de PyMC-Marketing del modelo Gamma-Gamma, que también ofrece métodos de representación gráfica y predicción agradables:

source: We can *build* the model so that we can see the model specification:
es: Podemos *construir* el modelo para que podamos ver la especificación del modelo:

source: It is not necessary to build the model before fitting it. We can fit the model directly.
es: No es necesario construir el modelo antes de ajustarlo. Podemos ajustar el modelo directamente.

source: Using MAP
es: Usando MAP

source: To begin with, lets use a numerical optimizer (`L-BFGS-B`) from `scipy.optimize` to find the maximum a posteriori (MAP) estimate of the parameters.
es: Para comenzar, utilicemos un optimizador numérico (`L-BFGS-B`) de `scipy.optimize` para encontrar la estimación de máxima a posteriori (MAP) de los parámetros.

source: These values are very close to the ones obtained by the `lifetimes` package.
es: Estos valores son muy cercanos a los obtenidos por el paquete `lifetimes`.

source: We can also use MCMC to sample from the posterior distribution of the parameters. MCMC is a more robust method than MAP and provides uncertainty estimates for the parameters.
es: También podemos utilizar MCMC para muestrear de la distribución posterior de los parámetros. MCMC es un método más robusto que MAP y proporciona estimaciones de incertidumbre para los parámetros.

source: We can see some statistics of the posterior distribution of the parameters.
es: Podemos ver algunas estadísticas de la distribución posterior de los parámetros.

source: Let's visualize the posterior distributions and the rank plot:
es: Visualicemos las distribuciones posteriores y el gráfico de rangos:

source: We can compare the results with the ones obtained by the `lifetimes` package and the MAP estimation.
es: Podemos comparar los resultados con los obtenidos por el paquete `lifetimes` y la estimación MAP.

source: We see that the `lifetimes` and MAP estimates are essentially the same. Both of them are close to the mean of the posterior distribution obtained by MCMC.
es: Vemos que las estimaciones de `lifetimes` y MAP son esencialmente las mismas. Ambas están cerca de la media de la distribución posterior obtenida mediante MCMC.

source: Expected Customer Spend
es: Gasto Esperado del Cliente

source: Once we have the posterior distribution of the parameters, we can use the `expected_average_profit` method to compute the conditional expectation of the average profit per transaction for a group of one or more customers.
es: Una vez que tengamos la distribución posterior de los parámetros, podemos utilizar el método `expected_average_profit` para calcular la expectativa condicional del beneficio promedio por transacción para un grupo de uno o más clientes.

source: Let's see how it looks for a subset of customers.
es: Veamos cómo se ve para un subconjunto de clientes.

source: Finally, lets look at some statistics and the distribution for the whole dataset.
es: Finalmente, veamos algunas estadísticas y la distribución para todo el conjunto de datos.
