Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/pareto_nbd.po
Languages: es

source: Pareto/NBD Model
es: Modelo Pareto/NBD

source: The Pareto/Negative-Binomial Distribution model was the first Buy-Till-You-Die (BTYD) model for estimating non-contractual customer activity over a continuous time period. First introduced by Schmittlein, et. al. in 1987 and developed further by Bruce Hardie and Peter Fader, it is frequently used as a benchmark in CLV research due to its robust performance and wide range of functionality. For detailed derivations of this model please refer to ["A Note on Deriving the Pareto/NBD Model and Related Expressions."](https://www.brucehardie.com/notes/009/pareto_nbd_derivations_2005-11-05.pdf)
es: El modelo de Distribución Pareto/Binomial Negativa fue el primer modelo Buy-Till-You-Die (BTYD) para estimar la actividad de clientes no contractuales a lo largo de un periodo de tiempo continuo. Introducido por primera vez por Schmittlein, et. al. en 1987 y desarrollado posteriormente por Bruce Hardie y Peter Fader, se utiliza frecuentemente como un referente en la investigación de CLV debido a su sólido rendimiento y amplia gama de funcionalidades. Para derivaciones detalladas de este modelo, por favor consulte ["A Note on Deriving the Pareto/NBD Model and Related Expressions."](https://www.brucehardie.com/notes/009/pareto_nbd_derivations_2005-11-05.pdf)

source: In this notebook we will use Bayesian inference to fit a Pareto/NBD model in PyMC-Marketing, and compare results with the frequentist [`lifetimes`](https://github.com/CamDavidsonPilon/lifetimes) library (no longer maintained). We will also demonstrate the predictive functionality of this model, along with an example for time-invariant covariates.
es: En este cuaderno utilizaremos la inferencia bayesiana para ajustar un modelo Pareto/NBD en PyMC-Marketing y compararemos los resultados con la biblioteca frecuentista [`lifetimes`](https://github.com/CamDavidsonPilon/lifetimes) (ya no mantenida). También demostraremos la funcionalidad predictiva de este modelo, junto con un ejemplo para covariables invariantes en el tiempo.

source: Setup Notebook
es: Configurar el Notebook

source: Load Data
es: Cargar Datos

source: In this notebook we will be using the CDNOW sample dataset, a popular benchmarking dataset in CLV and BTYD modeling research. Refer [here](https://www.brucehardie.com/notes/026/) for more information about the dataset.
es: En este cuaderno utilizaremos el conjunto de datos de muestra CDNOW, un conjunto de datos de referencia popular en la investigación de modelado de CLV y BTYD. Consulte [aquí](https://www.brucehardie.com/notes/026/) para obtener más información sobre el conjunto de datos.

source: The only requirements for modeling spending behaviour with `ParetoNBDModel` are a customer identifier column, and a datetime column for each purchase. The number of CDs purchased and money spent per transaction could also be useful covariates, so we'll keep them in mind for later.
es: Los únicos requisitos para modelar el comportamiento de gasto con `ParetoNBDModel` son una columna de identificador de cliente y una columna de fecha y hora para cada compra. El número de CDs comprados y el dinero gastado por transacción también podrían ser covariables útiles, así que los tendremos en cuenta para más adelante.

source: It is common for customer transaction databases to also contain returns, discount values, etc., so let's do a quick validation check:
es: Es común que las bases de datos de transacciones de clientes también contengan devoluciones, valores de descuento, etc., así que hagamos una rápida verificación de validación:

source: Note there were some transactions with spend values of 0! Perhaps these were returns or promotional giveaways. Instances such as this are not true purchasing activities, and should be excluded from modeling.
es: Tenga en cuenta que hubo algunas transacciones con valores de gasto de 0. ¡Quizás se trató de devoluciones o regalos promocionales! Casos como este no son actividades de compra reales y deben ser excluidos del modelado.

source: Use the `rfm_summary` utility to aggregate data for modeling:
es: Utilice la utilidad `rfm_summary` para agregar datos para el modelado:

source: Recall the data aggregation definitions from the [CLV Quickstart](https://www.pymc-marketing.io/en/stable/notebooks/clv/clv_quickstart.html):
es: Recuerde las definiciones de agregación de datos del [CLV Quickstart](https://www.pymc-marketing.io/en/stable/notebooks/clv/clv_quickstart.html):

source: `customer_id` is an index of a unique identifiers for each customer.
es: `customer_id` es un índice de identificadores únicos para cada cliente.

source: `frequency` is the number of repeat purchases that a customer has made (i.e., total number of purchases minus one).
es: `frequency` es el número de compras repetidas que un cliente ha realizado (es decir, el número total de compras menos uno).

source: `recency` indicates the time period when a customer made their most recent purchase. If a customer has only made 1 purchase, recency is 0.
es: `recency` indica el período de tiempo en el que un cliente realizó su compra más reciente. Si un cliente solo ha realizado 1 compra, la recency es 0.

source: `T` is a customer's "age", or the number of time periods since their first purchase.
es: `T` es la "edad" de un cliente, o el número de períodos de tiempo desde su primera compra.

source: Model Definition
es: Definición del Modelo

source: The Pareto/NBD model is based on the following assumptions for each customer:
es: El modelo Pareto/NBD se basa en las siguientes suposiciones para cada cliente:

source: Customers are active for an unobserved period of time, then become permanently inactive.
es: Los clientes están activos durante un período de tiempo no observado, y luego se vuelven permanentemente inactivos.

source: Purchasing Process
es: Proceso de Compra

source: While active, the the number of transactions made by a customer follows a Poisson process with transaction rate $\lambda$:
es: Mientras está activo, el número de transacciones realizadas por un cliente sigue un proceso de Poisson con una tasa de transacción $\lambda$:

source: This is equivalent to assuming time between transactions is exponentially distributed with transaction rate $\lambda$:
es: Esto es equivalente a suponer que el tiempo entre transacciones se distribuye exponencialmente con una tasa de transacción $\lambda$:

source: Where $t$ is the time period of the $j$th purchase.
es: Donde $t$ es el período de tiempo de la $j$-ésima compra.

source: Heterogeneity in $\lambda$ follows a Gamma distribution with shape parameter $r$ and scale parameter $\alpha$:
es: La heterogeneidad en $\lambda$ sigue una distribución Gamma con parámetro de forma $r$ y parámetro de escala $\alpha$:

source: Dropout Process
es: Proceso de abandono

source: The duration of a customer's unobserved active lifetime is exponentially distributed with dropout rate $\mu$.
es: La duración de la vida activa no observada de un cliente se distribuye exponencialmente con una tasa de abandono $\mu$.

source: Heterogeneity in $\mu$ also follows a Gamma distribution with shape parameter $s$ and scale parameter $\beta$:
es: La heterogeneidad en $\mu$ también sigue una distribución Gamma con parámetro de forma $s$ y parámetro de escala $\beta$:

source: Transaction rate $\lambda$ and time until dropout $\mu$ vary independently for each customer.
es: La tasa de transacción $\lambda$ y el tiempo hasta la deserción $\mu$ varían de manera independiente para cada cliente.

source: If we take the expectation across the distributions of $\lambda$ and $\mu$, we can derive a likelihood function to estimate parameters $r$, $\alpha$, $s$, and $\beta$ across the customer population. For more details on the `ParetoNBD` likelihood please refer to the [docs](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.clv.distributions.ParetoNBD.html#pymc_marketing.clv.distributions.ParetoNBD).
es: Si tomamos la expectativa a través de las distribuciones de $\lambda$ y $\mu$, podemos derivar una función de verosimilitud para estimar los parámetros $r$, $\alpha$, $s$ y $\beta$ en la población de clientes. Para más detalles sobre la verosimilitud de `ParetoNBD`, por favor consulte la [documentación](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.clv.distributions.ParetoNBD.html#pymc_marketing.clv.distributions.ParetoNBD).

source: Model Fitting
es: Ajuste del modelo

source: `lifetimes` Benchmark Model
es: Modelo de referencia de `lifetimes`

source: Let's time travel back to July 2020 and use the old `lifetimes` library to fit a Pareto/NBD model with Maximum Likelihood Estimation (MLE). The `Nelder-Mead` optimizer from `scipy.optimize` is ran under the hood to estimate scalar values for $r$, $\alpha$, $s$, and $\beta$.
es: Hagamos un viaje en el tiempo de regreso a julio de 2020 y utilicemos la antigua biblioteca `lifetimes` para ajustar un modelo Pareto/NBD con Estimación de Máxima Verosimilitud (MLE). El optimizador `Nelder-Mead` de `scipy.optimize` se ejecuta en segundo plano para estimar valores escalares para $r$, $\alpha$, $s$ y $\beta$.

source: The Bayesian equivalent of MLE is Maximum a Posteriori(MAP), in which the returned scalar values are regularized with priors during estimation.
es: El equivalente bayesiano de MLE es el Máximo a Posteriori (MAP), en el cual los valores escalares devueltos son regularizados con priors durante la estimación.

source: A "Flat" prior indicates the user is agnostic, holding no prior beliefs or assumptions about the data. $r$, $\alpha$, $s$, and $\beta$ must also be positive values, so let's configure our Bayesian `ParetoNBDModel` with `HalfFlat` priors:
es: Un prior "plano" indica que el usuario es agnóstico, sin creencias o suposiciones previas sobre los datos. $r$, $\alpha$, $s$ y $\beta$ también deben ser valores positivos, así que configuremos nuestro `ParetoNBDModel` bayesiano con priors `HalfFlat`:

source: Build the model to view the choice of Priors used for modeling:
es: Construya el modelo para ver la elección de Priors utilizados para el modelado:

source: Note it is not necessary to build a model prior to modeling.
es: Tenga en cuenta que no es necesario construir un modelo antes de la modelización.

source: Now let's fit our `ParetoNBDModel` with MAP.
es: Ahora ajustemos nuestro `ParetoNBDModel` con MAP.

source: For MAP fitting `pymc-marketing` uses the `L-BGFS-B` optimizer from `scipy.optimize`, a faster and more stable alternative to `Nelder-Mead`.
es: Para el ajuste de MAP, `pymc-marketing` utiliza el optimizador `L-BGFS-B` de `scipy.optimize`, una alternativa más rápida y estable a `Nelder-Mead`.

source: Model parameter estimations are equivalent between the frequentist MLE fit from `lifetimes`, and a Bayesian `pymc-marketing` model fit with flat priors. However, the CDNOW sample we're working with is quite small and comprises only 10% of the total CDNOW dataset, so it's quite likely these estimates are overfitting if we attempt to run predictions on the full dataset.
es: Las estimaciones de parámetros del modelo son equivalentes entre el ajuste MLE frecuentista de `lifetimes` y un ajuste del modelo bayesiano `pymc-marketing` con priors uniformes. Sin embargo, la muestra de CDNOW con la que estamos trabajando es bastante pequeña y comprende solo el 10% del conjunto de datos total de CDNOW, por lo que es muy probable que estas estimaciones estén sobreajustadas si intentamos realizar predicciones en el conjunto de datos completo.

source: With prior distributions, we can inform model fitting with our own subjective domain knowledge, and even improve the speed of model fits. The default prior configuration for `ParetoNBDModel` works well for a variety of use cases:
es: Con distribuciones a priori, podemos informar el ajuste del modelo con nuestro propio conocimiento subjetivo del dominio e incluso mejorar la velocidad de los ajustes del modelo. La configuración a priori predeterminada para `ParetoNBDModel` funciona bien para una variedad de casos de uso:

source: Prior and Posterior Predictive Checks
es: Comprobaciones Predictivas Anteriores y Posteriores

source: PPCs allow us to check the efficacy of our priors, and the peformance of the fitted posteriors. PPCs aren't usually an option with MAP fitted models, but here we're actually sampling from the latent $\lambda$ and $\mu$ Gamma distributions, so PPCs are possible for `ParetoNBDModel` regardless of the fit method!
es: Los PPCs nos permiten verificar la eficacia de nuestros priors y el rendimiento de los posteriors ajustados. Los PPCs generalmente no son una opción con modelos ajustados por MAP, pero aquí en realidad estamos muestreando de las distribuciones Gamma latentes $\lambda$ y $\mu$, por lo que los PPCs son posibles para `ParetoNBDModel` independientemente del método de ajuste.

source: Let's see how the model performs in a *prior* predictive check, where we sample from the default priors before fitting the model:
es: Veamos cómo se desempeña el modelo en un chequeo predictivo *previo*, donde muestreamos de las distribuciones a priori predeterminadas antes de ajustar el modelo:

source: Here the `ParetoNBDModel` is simulating customer purchases from the prior distributions to compare against the obseved data. The default priors look reasonable for non-repeat customers, but do not model repeat customers well.
es: Aquí el `ParetoNBDModel` está simulando las compras de los clientes a partir de las distribuciones previas para compararlas con los datos observados. Las distribuciones previas por defecto parecen razonables para los clientes no recurrentes, pero no modelan bien a los clientes recurrentes.

source: Let's fit our model and run a *posterior* predictive check for comparison:
es: Ajustemos nuestro modelo y realicemos un chequeo predictivo *posterior* para comparación:

source: Our fitted model is able to reliably simulate customer behavior!
es: ¡Nuestro modelo ajustado es capaz de simular de manera confiable el comportamiento del cliente!

source: Full Bayesian Inference
es: Inferencia Bayesiana Completa

source: MAP fits estimate only scalar values for $r$, $\alpha$, $s$, and $\beta$, but with full Bayesian sampling we can infer the posterior probability distributions for these parameters, illustrating uncertainty in our estimates as well as enabling prediction intervals.
es: MAP solo ajusta valores escalares para $r$, $\alpha$, $s$ y $\beta$, pero con un muestreo bayesiano completo podemos inferir las distribuciones de probabilidad posterior para estos parámetros, ilustrando la incertidumbre en nuestras estimaciones así como permitiendo intervalos de predicción.

source: NUTS is the default sampler in `pymc-marketing`, which samples from the posterior by exploring the gradients of the probability space. However, NUTS sampling with `ParetoNBDModel` can be quite slow due to the complexity of the likelihood expression. In fact, the mathematical complexity of this model is what motivated the development of the [`BetaGeoModel`](https://www.pymc-marketing.io/en/stable/notebooks/clv/bg_nbd.html) in 2005. The BG/NBD model makes some simplifying assumptions and sacrifices functionality in customer dropout estimation for better computational performance.
es: NUTS es el muestreador predeterminado en `pymc-marketing`, que muestrea de la posterior explorando los gradientes del espacio de probabilidad. Sin embargo, el muestreo NUTS con `ParetoNBDModel` puede ser bastante lento debido a la complejidad de la expresión de verosimilitud. De hecho, la complejidad matemática de este modelo fue lo que motivó el desarrollo del [`BetaGeoModel`](https://www.pymc-marketing.io/en/stable/notebooks/clv/bg_nbd.html) en 2005. El modelo BG/NBD hace algunas suposiciones simplificadoras y sacrifica funcionalidad en la estimación de abandono de clientes para mejorar el rendimiento computacional.

source: To save time and computational costs, it is recommended to use the gradient-free DEMetropolisZ sampler. This often requires more samples during fitting, so if any `rhat statistic` warnings are encountered, increase the size of the `tune` and `draw` parameters until the warning no longer appears.
es: Para ahorrar tiempo y costos computacionales, se recomienda utilizar el muestreador DEMetropolisZ sin gradiente. Esto a menudo requiere más muestras durante el ajuste, por lo que si se encuentran advertencias de `estadística rhat`, aumente el tamaño de los parámetros `tune` y `draw` hasta que la advertencia ya no aparezca.

source: Use `thin_fit_result` if the large number of draws are causing computational issues. Keeping every second sample will reduce the number of draws by half:
es: Utilice `thin_fit_result` si la gran cantidad de extracciones está causando problemas computacionales. Mantener cada segunda muestra reducirá el número de extracciones a la mitad:

source: Let's see how the DEMZ posteriors compare to the MAP estimations:
es: Veamos cómo se comparan los posteriores de DEMZ con las estimaciones MAP:

source: After fitting, models can be persisted with `pnbd_pymc.save("pnbd.nc")` and `pnbd_pymc.load("pnbd.nc")`.
es: Después de ajustar, los modelos se pueden guardar con `pnbd_pymc.save("pnbd.nc")` y cargar con `pnbd_pymc.load("pnbd.nc")`.

source: Predictive Methods
es: Métodos Predictivos

source: The Pareto/NBD model supports a variety of predictive methods:
es: El modelo Pareto/NBD admite una variedad de métodos predictivos:

source: `expected_purchases`
es: `compras_esperadas`

source: `expected_probability_alive`
es: `probabilidad_esperada_viva`

source: `expected_purchases_new_customer`
es: compras_esperadas_nuevo_cliente

source: `expected_purchase_probability`
es: probabilidad_de_compra_esperada

source: Let's take a small sample of users:
es: Tomemos una pequeña muestra de usuarios:

source: Observe customers 5 & 10 are *non-repeat buyers*, whereas 1413 and 46 are *frequent buyers*.
es: Observe que los clientes 5 y 10 son *compradores no recurrentes*, mientras que 1413 y 46 son *compradores frecuentes*.

source: Expected Number of Purchases
es: Número Esperado de Compras

source: Let's plot each customer's expected number of purchases over the next $90$ time periods:
es: Vamos a trazar el número esperado de compras de cada cliente durante los próximos $90$ períodos de tiempo:

source: Note the HDI prediction intervals are only available if the model is fit with full posteriors.
es: Tenga en cuenta que los intervalos de predicción del IDH solo están disponibles si el modelo se ajusta con posteriors completos.

source: Observe the large number of purchases expected from the frequent buyers (Customers 46 and 1413) whereas little or no future activity is expected of the remaining customers.
es: Observe el gran número de compras que se esperan de los compradores frecuentes (Clientes 46 y 1413), mientras que se espera poca o ninguna actividad futura de los demás clientes.

source: Expected Probability Alive
es: Probabilidad Esperada de Estar Vivo

source: Let's check the probability our customers are still alive and compare against the MAP results.
es: Verifiquemos la probabilidad de que nuestros clientes sigan vivos y comparemos con los resultados del MAP.

source: Customer 1413 has a rather low alive probability despite being a frequent purchaser. This would be a good example of a customer to target with a special offer for retention.
es: El cliente 1413 tiene una probabilidad de permanencia bastante baja a pesar de ser un comprador frecuente. Este sería un buen ejemplo de un cliente al que dirigirse con una oferta especial para la retención.

source: These probabilities are estimated at time period 0, but we can also estimate the probabilities customers will still be active in the future. Let's calculate the posterior densities 90 time periods from now and compare to the MAP at time period 0:
es: Estas probabilidades se estiman en el período de tiempo 0, pero también podemos estimar las probabilidades de que los clientes sigan activos en el futuro. Calculemos las densidades posteriores 90 períodos de tiempo a partir de ahora y comparemos con el MAP en el período de tiempo 0:

source: Pay attention to the x-axes for each customer - The probabilities barely changed for the *non-repeat* customers, but there is a significant delta for *frequent buyers*.
es: Preste atención a los ejes x para cada cliente - Las probabilidades apenas cambiaron para los *clientes no recurrentes*, pero hay un delta significativo para los *compradores frecuentes*.

source: A good rule of thumb is that an alive probability of .25-.30 usually indicates an at-risk or inactive customer. Future projections can give additional insight into customer churn risk.
es: Una buena regla general es que una probabilidad de actividad de .25-.30 suele indicar un cliente en riesgo o inactivo. Las proyecciones futuras pueden proporcionar información adicional sobre el riesgo de deserción de clientes.

source: Probability of $n$ Purchases over Time $t$
es: Probabilidad de $n$ Compras a lo largo del Tiempo $t$

source: Customer 46 is our best customer in this small sample set, and is expected to make at least $15$ purchases over the next $90$ time periods. What is the probability of this many purchases being made, and how will it change over time?
es: El cliente 46 es nuestro mejor cliente en este pequeño conjunto de muestras y se espera que realice al menos $15$ compras en los próximos $90$ períodos de tiempo. ¿Cuál es la probabilidad de que se realicen tantas compras y cómo cambiará con el tiempo?

source: Let's plot a heatmap to paint the full picture:
es: Vamos a trazar un mapa de calor para pintar el panorama completo:

source: This heatmap highlights how Customer 46 is expected to make at least 15 purchases *up to* time period 90, but the odds of 15 purchases being made before time period 75 or even time period 60 are slightly higher. Also note these probabilities assume exact expectations (i.e., there's a 6.2% chance of the 15th purchase being made precisely during time period 60.)
es: Este mapa de calor destaca cómo se espera que el Cliente 46 realice al menos 15 compras *hasta* el período de tiempo 90, pero las probabilidades de que se realicen 15 compras antes del período de tiempo 75 o incluso del período de tiempo 60 son ligeramente más altas. También tenga en cuenta que estas probabilidades asumen expectativas exactas (es decir, hay un 6.2% de probabilidad de que la 15ª compra se realice precisamente durante el período de tiempo 60).

source: Expected Number of Purchases for New Customers
es: Número Esperado de Compras para Nuevos Clientes

source: So far we've only been running predictions for existing customers, but we can also estimate the expected number of transactions over time for a new customer:
es: Hasta ahora, solo hemos estado realizando predicciones para clientes existentes, pero también podemos estimar el número esperado de transacciones a lo largo del tiempo para un nuevo cliente:

source: Let's see how these estimates change when we add covariates to the model.
es: Veamos cómo cambian estas estimaciones cuando añadimos covariables al modelo.

source: Time-Invariant Covariates
es: Covariables Invariantes en el Tiempo

source: Recall $\alpha$, and $\beta$ represent the scale parameters for the purchase and dropout rate distributions, respectively. To model for time-invariant covariates, we simply modify these parameters as follows:
es: Recuerde que $\alpha$ y $\beta$ representan los parámetros de escala para las distribuciones de la tasa de compra y de abandono, respectivamente. Para modelar covariables invariables en el tiempo, simplemente modificamos estos parámetros de la siguiente manera:
