Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/pareto_nbd.po
Languages: es

source: Where $\gamma_1$ and $\gamma_2$ are coefficients capturing the impact of the covariates, and $z_1$ and $z_2$ the covariate arrays for each customer.
es: Donde $\gamma_1$ y $\gamma_2$ son coeficientes que capturan el impacto de las covariables, y $z_1$ y $z_2$ son los arreglos de covariables para cada cliente.

source: Let's take a look at the covariates available in the raw data:
es: Echemos un vistazo a las covariables disponibles en los datos en bruto:

source: One-tailed distributions with large values like this will complicate model fitting, so let's log and standardize our covariates:
es: Las distribuciones de una cola con valores grandes como este complicarán el ajuste del modelo, así que registremos y estandaricemos nuestras covariables:

source: To parametrize `ParetoNBDModel` with covariates, join the covariates to the existing RFM data and specify the column names in the `model_config`. Covariates for the purchase and dropout rates can be specified separately, enabling experimentation with various combinations to find what works best:
es: Para parametrizar `ParetoNBDModel` con covariables, une las covariables a los datos RFM existentes y especifica los nombres de las columnas en la `model_config`. Las covariables para las tasas de compra y abandono pueden especificarse por separado, lo que permite experimentar con varias combinaciones para encontrar lo que mejor funciona:

source: The additional parameters are automatically created when covariates are added.
es: Los parámetros adicionales se crean automáticamente cuando se añaden covariables.

source: Let's do a quick MAP fit and check the results:
es: Hagamos un ajuste rápido del MAP y verifiquemos los resultados:

source: The `purchase_coefficient` and `dropout_coefficient` parameters indicate the respective impacts of each covariate - a negative sign can be interpreted as "less likely to make a purchase or drop out".
es: Los parámetros `purchase_coefficient` y `dropout_coefficient` indican los respectivos impactos de cada covariable; un signo negativo puede interpretarse como "menos probable que realice una compra o que abandone".

source: We can see the average number of CDs per purchase only has a small impact on the time between purchases, but a rather large impact on the dropout rate. Customers who frequently purchase multiple CDs are the least likely to dropout.
es: Podemos ver que el número promedio de CDs por compra solo tiene un pequeño impacto en el tiempo entre compras, pero un impacto bastante grande en la tasa de abandono. Los clientes que compran múltiples CDs con frecuencia son los menos propensos a abandonar.

source: The average spend per purchase is significant for both purchasing and time until dropout, but note that if using the [Gamma-Gamma model](https://www.pymc-marketing.io/en/stable/notebooks/clv/gamma_gamma.html) to estimate customer lifetime value per the [Quickstart](https://www.pymc-marketing.io/en/stable/notebooks/clv/clv_quickstart.html), then *average spend cannot be used as a covariate* because an important modeling assumption for the Gamma-Gamma model is that spend and frequency are uncorrelated.
es: El gasto promedio por compra es significativo tanto para la compra como para el tiempo hasta la deserción, pero tenga en cuenta que si utiliza el [modelo Gamma-Gamma](https://www.pymc-marketing.io/en/stable/notebooks/clv/gamma_gamma.html) para estimar el valor de vida del cliente según el [Inicio Rápido](https://www.pymc-marketing.io/en/stable/notebooks/clv/clv_quickstart.html), entonces *el gasto promedio no puede ser utilizado como una covariable* porque una suposición importante del modelo Gamma-Gamma es que el gasto y la frecuencia son no correlacionados.
