Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/sBG.po
Languages: es

source: Shifted Beta Geometric model with individual customer data
es: Modelo geométrico beta desplazado con datos individuales de clientes

source: In this notebook we replicate the main results and figures from
es: En este cuaderno replicamos los principales resultados y figuras de

source: Fader, P. S., & Hardie, B. G. (2007). How to project customer retention. Journal of Interactive Marketing, 21(1), 76-90. https://journals.sagepub.com/doi/pdf/10.1002/dir.20074
es: Fader, P. S., & Hardie, B. G. (2007). Cómo proyectar la retención de clientes. Journal of Interactive Marketing, 21(1), 76-90. https://journals.sagepub.com/doi/pdf/10.1002/dir.20074

source: The authors describe the Shifted Beta Geometric (sBG) model for customer behavior in a discrete contractual setting. It assumes that:
es: Los autores describen el modelo de Beta Geométrica Desplazada (sBG) para el comportamiento del cliente en un entorno contractual discreto. Se asume que:

source: At the end of each period, a customer has a probability `theta` of renewing the contract and `1-theta` of cancelling
es: Al final de cada período, un cliente tiene una probabilidad `theta` de renovar el contrato y `1-theta` de cancelarlo.

source: The probability `theta` does not change over time for a given customer
es: La probabilidad `theta` no cambia con el tiempo para un cliente dado.

source: The probability `theta` varies across customers according to a Beta prior distribution with hyperparameters `alpha` and `beta`.
es: La probabilidad `theta` varía entre los clientes de acuerdo con una distribución previa Beta con hiperparámetros `alpha` y `beta`.

source: Recreating the dataset
es: Recreando el conjunto de datos

source: The dataset contains the percentage of customers still enrolled in the service after each time period. There are two distinct groups of users: regular and high-end, believed to have different attrition rates. Each group had 1000 customers at the start.
es: El conjunto de datos contiene el porcentaje de clientes que aún están inscritos en el servicio después de cada período de tiempo. Hay dos grupos distintos de usuarios: regular y de alta gama, que se cree que tienen diferentes tasas de deserción. Cada grupo tenía 1000 clientes al inicio.

source: As in the original paper, we will fit the data from the first 7 time periods only, and use the following periods for validation.
es: Como en el documento original, ajustaremos los datos solo de los primeros 7 períodos de tiempo y utilizaremos los siguientes períodos para la validación.

source: The implemented pymc-marketing model fits each individual `theta`, in contrast to the paper approach where the inidividual parameters are marginalized out.
es: El modelo pymc-marketing implementado ajusta cada `theta` individual, en contraste con el enfoque del artículo donde los parámetros individuales se marginalizan.

source: For our analysis we wil have to create a synthetic dataset with individual data, following the aggregate group trends.
es: Para nuestro análisis, tendremos que crear un conjunto de datos sintético con datos individuales, siguiendo las tendencias del grupo agregado.

source: Customers which haven't churned have `t_churn == T == 8`. The model will handle these differently, as their lifetimes are [censored](https://en.wikipedia.org/wiki/Censoring_(statistics)).
es: Los clientes que no han abandonado tienen `t_churn == T == 8`. El modelo manejará estos casos de manera diferente, ya que sus vidas útiles están [censuradas](https://en.wikipedia.org/wiki/Censoring_(statistics)).

source: Fitting the sBG models for high end and regular users
es: Ajustando los modelos sBG para usuarios de alta gama y usuarios regulares

source: Contrasting posterior inferences with the repo MLE estimates
es: Contrastando las inferencias posteriores con las estimaciones MLE del repositorio

source: The sBG model has 2 population parameters of interest: `alpha` and `beta`. These parameters define the population distribution of the individual customer's churn rates `theta`. The larger the values of `alpha` and `beta` the more homogenous the churn rates are across different customers.
es: El modelo sBG tiene 2 parámetros poblacionales de interés: `alpha` y `beta`. Estos parámetros definen la distribución poblacional de las tasas de abandono individuales de los clientes `theta`. Cuanto mayores sean los valores de `alpha` y `beta`, más homogéneas serán las tasas de abandono entre diferentes clientes.

source: The ratio of `alpha` to `beta` tells us the expected churn rates. If `alpha/beta == 0.1`, we expect the average customer to have a `0.1` probability of churning between each time period.
es: La relación de `alpha` a `beta` nos indica las tasas de cancelación esperadas. Si `alpha/beta == 0.1`, esperamos que el cliente promedio tenga una probabilidad de `0.1` de cancelar entre cada período de tiempo.

source: The model fitting agrees with the Maximum Likelihood estimates described in the original paper. In addition, MCMC sampling, gives us useful information about the uncertainty of the fits.
es: El ajuste del modelo concuerda con las estimaciones de Máxima Verosimilitud descritas en el artículo original. Además, el muestreo MCMC nos proporciona información útil sobre la incertidumbre de los ajustes.

source: Recreating main results and figures from the paper
es: Recreando los resultados y figuras principales del artículo

source: Figure 6 from the paper shows the group distribution of `theta` churn rates.
es: La Figura 6 del documento muestra la distribución grupal de las tasas de abandono de `theta`.

source: The inferred distributions are relatively wide in both groups, which follows directly from the fact that both `alpha` and `beta` were inferred to be < 10.
es: Las distribuciones inferidas son relativamente amplias en ambos grupos, lo que sigue directamente del hecho de que tanto `alpha` como `beta` se inferieron como < 10.

source: It is still clear that the distribution of `theta` for the highend users has much more mass near lower values, suggesting highend users have lower attrition rates on average, when compared with regular users.
es: Aún está claro que la distribución de `theta` para los usuarios de alto nivel tiene mucha más masa cerca de valores bajos, lo que sugiere que los usuarios de alto nivel tienen tasas de deserción más bajas en promedio, en comparación con los usuarios regulares.

source: Figures 4 and 5 show the predicted average churn and retention trends for the two groups. We can see that predictions nicely match the observed data (black line), even when extrapolating into the time periods that were held-out when fitting the model.
es: Las Figuras 4 y 5 muestran las tendencias promedio de abandono y retención predichas para los dos grupos. Podemos observar que las predicciones coinciden perfectamente con los datos observados (línea negra), incluso al extrapolar en los períodos de tiempo que se excluyeron al ajustar el modelo.

source: The plots also highlight an interesting implication from the model: the retention rates are expected to increase over time, as the more precarious customers gradually drop out. This is a direct consequence of modelling individual churn rates as being fixed over time.
es: Los gráficos también destacan una implicación interesante del modelo: se espera que las tasas de retención aumenten con el tiempo, a medida que los clientes más precarios vayan abandonando gradualmente. Esta es una consecuencia directa de modelar las tasas de abandono individuales como fijas a lo largo del tiempo.
