Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/gallery/gallery.po
Languages: es

source: Example Gallery
es: Galería de Ejemplo

source: Introduction
es: Introducción

source: Welcome to the PyMC-Marketing example gallery! This gallery provides visual navigation to all of our example notebooks to help you quickly find the techniques and models relevant to your marketing analytics needs.
es: Bienvenido a la galería de ejemplos de PyMC-Marketing! Esta galería proporciona navegación visual a todos nuestros cuadernos de ejemplo para ayudarte a encontrar rápidamente las técnicas y modelos relevantes para tus necesidades de análisis de marketing.

source: Marketing Mix Models (MMM)
es: Modelos de Mezcla de Marketing (MMM)

source: Fundamentals
es: Fundamentos

source: MMM Quickstart Guide
es: Guía rápida de MMM

source: MMM Example: Extensive Introduction Notebook
es: MMM Ejemplo: Cuaderno de Introducción Extensa

source: Beyond MMMs: adding GAMs or anything else to your model.
es: Más allá de los MMM: añadiendo GAM o cualquier otra cosa a tu modelo.

source: MMM Multidimensional Example Notebook (e.g. Geo-MMM)
es: MMM Cuaderno de Ejemplo Multidimensional (por ejemplo, Geo-MMM)

source: Build MMM from YAML Configuration
es: Construir MMM a partir de la configuración YAML

source: Sensitivity Analysis and Marginal Effects
es: Análisis de sensibilidad y efectos marginales

source: Custom Models with MMM components
es: Modelos personalizados con componentes MMM

source: Data Connectors
es: Conectores de Datos

source: MMM Fivetran Connectors
es: MMM Conectores de Fivetran

source: Budget Allocation
es: Asignación de Presupuesto

source: Budget Allocation Example
es: Ejemplo de Asignación de Presupuesto

source: Budget Allocation and Risk Assessment
es: Asignación de Presupuesto y Evaluación de Riesgos

source: Multi-Objective Optimization
es: { "singular": "Optimización Multi-Objetivo", "plural": "Optimización Multi-Objetivo" }

source: Lift Test Calibration
es: Calibración de Prueba de Elevación

source: Introduction to Lift Test Calibration
es: Introducción a la Calibración de Pruebas de Elevación

source: Case Study: Unobserved Confounders, ROAS and Lift Tests
es: Estudio de Caso: Confusores No Observados, ROAS y Pruebas de Incremento

source: Time-Varying Parameters
es: Parámetros que varían con el tiempo

source: MMM with time-varying media baseline
es: MMM con línea base de medios variable en el tiempo

source: MMM with time-varying parameters
es: MMM con parámetros que varían con el tiempo

source: Model Evaluation
es: Evaluación del Modelo

source: Cross-Validation
es: Validación cruzada

source: Metrics and Model Evaluation
es: Métricas y Evaluación del Modelo

source: Causal Inference
es: Inferencia Causal

source: Causal Identification
es: Identificación Causal

source: MMMs and Pearl's ladder of causal inference
es: MMMs y la escalera de inferencia causal de Pearl

source: Case Studies
es: Estudios de Caso

source: MMM End-to-End Case Study
es: MMM Estudio de Caso de Extremo a Extremo

source: Customer Lifetime Value (CLV) Models
es: Modelos de Valor del Tiempo de Vida del Cliente (CLV)

source: CLV Quickstart
es: CLV Guía Rápida

source: BG/NBD Model
es: Modelo BG/NBD

source: MBG/NBD Model
es: Modelo MBG/NBD

source: Pareto/NBD Model
es: Modelo Pareto/NBD

source: Gamma-Gamma Model
es: Modelo Gamma-Gamma

source: sBG Model
es: Modelo sBG

source: Customer Choice Models
es: Modelos de Elección del Cliente

source: MV-ITS Saturated
es: MV-ITS Saturado

source: MV-ITS Unsaturated
es: MV-ITS No saturado

source: Multinomial Logit Discrete Choice
es: Logit Multinomial de Elección Discreta

source: Nested Logit Discrete Choice
es: Logit Anidado de Elección Discreta

source: Bass Diffusion Model
es: Modelo de Difusión de Bass

source: Bass Diffusion Model Example
es: Ejemplo de Modelo de Difusión de Bass

source: General Tutorials
es: Tutoriales Generales

source: Model Configuration
es: Configuración del Modelo

source: Prior Predictive Checks
es: Comprobaciones Predictivas Previas

source: NUTS Samplers
es: Muestras de NUTS
