Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/gallery/README.po
Languages: es

source: PyMC-Marketing Example Gallery
es: Galería de Ejemplos de PyMC-Marketing

source: This directory contains the gallery view for the PyMC-Marketing example notebooks.
es: Este directorio contiene la vista de galería para los cuadernos de ejemplo de PyMC-Marketing.

source: Gallery Structure
es: Estructura de la Galería

source: The gallery displays thumbnails and links to all example notebooks, organized by category.
es: La galería muestra miniaturas y enlaces a todos los cuadernos de ejemplo, organizados por categoría.

source: Adding New Examples to the Gallery
es: Agregando Nuevos Ejemplos a la Galería

source: When adding new example notebooks:
es: Al agregar nuevos cuadernos de ejemplo:

source: Add the notebook to the appropriate directory in `docs/source/notebooks/`
es: Agrega el cuaderno al directorio apropiado en `docs/source/notebooks/`

source: Update the gallery entry in `gallery.md`
es: Actualiza la entrada de la galería en `gallery.md`

source: Create a thumbnail image for the notebook (ideally a screenshot of a key visualization from the notebook) and place it in the `images/` directory
es: Crea una imagen en miniatura para el cuaderno (idealmente una captura de pantalla de una visualización clave del cuaderno) y colócala en el directorio `images/`

source: Run `python create_gallery_images.py` to generate a placeholder thumbnail if you don't have a specific image
es: Ejecuta `python create_gallery_images.py` para generar una miniatura de marcador de posición si no tienes una imagen específica.

source: Gallery Images
es: Imágenes de la galería

source: The gallery uses thumbnail images to provide visual navigation. For best results:
es: La galería utiliza imágenes en miniatura para proporcionar navegación visual. Para obtener los mejores resultados:

source: Images should be in PNG format
es: Las imágenes deben estar en formato PNG

source: Images should have a 4:3 aspect ratio
es: Las imágenes deben tener una relación de aspecto de 4:3

source: Size should be approximately 600x450 pixels
es: El tamaño debe ser aproximadamente 600x450 píxeles

source: Names should match the notebook filename
es: Los nombres deben coincidir con el nombre del archivo del cuaderno.

source: Updating the Gallery
es: Actualizando la Galería

source: The gallery is structured using the Sphinx Design extension's grid layout. See the [Sphinx Design documentation](https://sphinx-design.readthedocs.io/en/latest/grids.html) for more information on customizing the grid layout.
es: La galería está estructurada utilizando el diseño de cuadrícula de la extensión Sphinx Design. Consulta la [documentación de Sphinx Design](https://sphinx-design.readthedocs.io/en/latest/grids.html) para obtener más información sobre cómo personalizar el diseño de cuadrícula.
