Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/benefits/model_deployment.po
Languages: es

source: Model deployment
es: Despliegue del modelo

source: One of the main goals of PyMC-Marketing is to facilitate the deployment of its models.
es: Uno de los principales objetivos de PyMC-Marketing es facilitar el despliegue de sus modelos.

source: This is achieved by building our models on top of [ModelBuilder](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.model_builder.ModelBuilder.html#pymc_marketing.model_builder.ModelBuilder) that offers a scikit-learn-like API and makes PyMC models easy to deploy.
es: Esto se logra construyendo nuestros modelos sobre [ModelBuilder](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.model_builder.ModelBuilder.html#pymc_marketing.model_builder.ModelBuilder) que ofrece una API similar a scikit-learn y facilita el despliegue de modelos PyMC.

source: PyMC-marketing models inherit 2 easy-to-use methods: `save` and `load` that can be used after the model has been fitted. All models can be configured with two standard dictionaries: `model_config` and `sampler_config` that are serialized during `save` and persisted after `load`, allowing model reuse across workflows.
es: Los modelos de PyMC-marketing heredan 2 métodos fáciles de usar: `save` y `load` que se pueden utilizar después de que el modelo ha sido ajustado. Todos los modelos se pueden configurar con dos diccionarios estándar: `model_config` y `sampler_config` que se serializan durante `save` y se persisten después de `load`, permitiendo la reutilización del modelo a través de flujos de trabajo.

source: We will illustrate this functionality with the example model described in the [MMM Example Notebook](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html). For sake of generality, we ommit most technical details here.
es: Ilustraremos esta funcionalidad con el modelo de ejemplo descrito en el [Cuaderno de Ejemplo MMM](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html). Por el bien de la generalidad, omitimos la mayoría de los detalles técnicos aquí.

source: Let's load the dataset:
es: Carguemos el conjunto de datos:

source: But for our model we need much smaller dataset, many of the previous features were contributing to generation of others, now as our target variable is computed we can filter out not needed columns:
es: Pero para nuestro modelo necesitamos un conjunto de datos mucho más pequeño, muchas de las características anteriores estaban contribuyendo a la generación de otras, ahora que nuestra variable objetivo se ha calculado podemos filtrar las columnas que no son necesarias:

source: Model and sampling configuration
es: Configuración del modelo y muestreo

source: Model configuration
es: Configuración del modelo

source: We first illustrate the use of `model_config` to define custom priors within the model.
es: Primero ilustramos el uso de `model_config` para definir priors personalizados dentro del modelo.

source: Because there are potentially many variables that can be configured, each model provides a `default_model_config` attribute. This will allow you to see which settings are available by default and only define the ones you need to change.
es: Porque hay potencialmente muchas variables que se pueden configurar, cada modelo proporciona un atributo `default_model_config`. Esto te permitirá ver qué configuraciones están disponibles por defecto y solo definir las que necesitas cambiar.

source: We need to create a dummy model to be able to see the configuration dictionary.
es: Necesitamos crear un modelo ficticio para poder ver el diccionario de configuración.

source: We can change the parameters that go into the distribution of each term. In this case we'll just simply replace the `sigma` for `saturation_beta` with a custom one:
es: Podemos cambiar los parámetros que se utilizan en la distribución de cada término. En este caso, simplemente reemplazaremos el `sigma` por `saturation_beta` con uno personalizado:

source: As mentioned in the original notebook: _"For the prior specification there is no right or wrong answer. It all depends on the data, the context and the assumptions you are willing to make. It is always recommended to do some prior predictive sampling and sensitivity analysis to check the impact of the priors on the posterior. We skip this here for the sake of simplicity. If you are not sure about specific priors, the `MMM` class has some default priors that you can use as a starting point."_
es: Como se mencionó en el cuaderno original: _"Para la especificación previa no hay una respuesta correcta o incorrecta. Todo depende de los datos, el contexto y las suposiciones que estés dispuesto a hacer. Siempre se recomienda hacer un muestreo predictivo previo y un análisis de sensibilidad para verificar el impacto de las priors en el posterior. Saltamos esto aquí por el bien de la simplicidad. Si no estás seguro sobre priors específicos, la clase `MMM` tiene algunos priors predeterminados que puedes usar como punto de partida."_

source: Sampling configuration
es: Configuración de muestreo

source: The second feature we can customize is `sampler_config`. Similar to `model_config`, it's a dictionary that gets saved and contains things you would usually pass to the `fit()` kwargs. It's not mandatory to create your own `sampler_config`. The default `MMM.sampler_config` is empty because the default sampling parameters usually prove sufficient for a start.
es: La segunda característica que podemos personalizar es `sampler_config`. Similar a `model_config`, es un diccionario que se guarda y contiene cosas que normalmente pasarías a los kwargs de `fit()`. No es obligatorio crear tu propio `sampler_config`. El `MMM.sampler_config` por defecto está vacío porque los parámetros de muestreo por defecto suelen ser suficientes para comenzar.

source: Let's finally assemble our model!
es: ¡Finalmente ensamblamos nuestro modelo!

source: We can confirm our settings are being used
es: Podemos confirmar que se están utilizando nuestras configuraciones.

source: Model Fitting
es: Ajuste del modelo

source: Note that we didn't pass the dataset to the class constructor itself. This is done to mimick the `scikit-learn` API, and make it easier to get started on PyMC-Marketing models.
es: Nota que no pasamos el conjunto de datos al constructor de la clase en sí. Esto se hace para imitar la API de `scikit-learn` y facilitar el inicio en los modelos de PyMC-Marketing.

source: All that's left now is to finally fit the model:
es: Todo lo que queda ahora es finalmente ajustar el modelo:

source: As you can see below, you can still pass the sampler kwargs directly to `fit()` method. However, only those kwargs passed using `sampler_config` will be saved and reused after loading the model.
es: Como puedes ver a continuación, aún puedes pasar los kwargs del muestreador directamente al método `fit()`. Sin embargo, solo aquellos kwargs pasados usando `sampler_config` serán guardados y reutilizados después de cargar el modelo.

source: The `fit()` method automatically builds the model using the priors from `model_config`, and assigns the created model to our instance. You can access it as a normal attribute.
es: El método `fit()` construye automáticamente el modelo utilizando los priors de `model_config`, y asigna el modelo creado a nuestra instancia. Puedes acceder a él como un atributo normal.

source: posterior trace can be accessed by `fit_result` attribute
es: el rastro posterior se puede acceder a través del atributo `fit_result`

source: If you wish to inspect the entire inference data, use the `idata` attribute. Within `idata`, you can find the entire dataset passed to the model under `fit_data`.
es: Si deseas inspeccionar todos los datos de inferencia, utiliza el atributo `idata`. Dentro de `idata`, puedes encontrar todo el conjunto de datos pasado al modelo bajo `fit_data`.

source: Saving and loading a fitted model
es: Guardando y cargando un modelo ajustado

source: All the data passed to the model on initialization is stored in `idata.attrs`. This will be used later in the `save()` method to convert both this data and all the fit data into the netCDF format. You can read more about this format [here](https://python.arviz.org/en/stable/getting_started/XarrayforArviZ.html).
es: Todos los datos pasados al modelo en la inicialización se almacenan en `idata.attrs`. Esto se utilizará más tarde en el método `save()` para convertir tanto estos datos como todos los datos de ajuste en el formato netCDF. Puedes leer más sobre este formato [aquí](https://python.arviz.org/en/stable/getting_started/XarrayforArviZ.html).

source: The `save` and `load` method only require a path to inform where the model should be saved and loaded from.
es: El método `save` y el método `load` solo requieren una ruta para informar dónde se debe guardar y cargar el modelo.

source: A loaded model is ready to be used for sampling and prediction, making use of the previous fitting results and data if needed.
es: Un modelo cargado está listo para ser utilizado para muestreo y predicción, aprovechando los resultados de ajuste anteriores y los datos si es necesario.

source: Other models
es: Otros modelos

source: Even though this introduction is using `MMM`, all other PyMC-Marketing models (MMM and CLV) provide these functionalities as well.
es: Aunque esta introducción está utilizando `MMM`, todos los demás modelos de PyMC-Marketing (MMM y CLV) también ofrecen estas funcionalidades.

source: Summary
es: Resumen

source: The PyMC-Marketing functionalities described here are intended to facilitate model sharing among data science teams without demanding extensive modelling technical knowledge for everyone involved. We are still iterating on our API and would love to hear more feedback from our users!
es: Las funcionalidades de PyMC-Marketing descritas aquí están destinadas a facilitar el intercambio de modelos entre equipos de ciencia de datos sin exigir un amplio conocimiento técnico de modelado para todos los involucrados. ¡Todavía estamos iterando en nuestra API y nos encantaría recibir más comentarios de nuestros usuarios!
