Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/benefits/why_pymc_marketing.po
Languages: es

source: Why PyMC-Marketing?
es: ¿Por qué PyMC-Marketing?

source: Open source
es: Código abierto

source: PyMC-Marketing is open source, developed by a team of [PyMC Labs](https://www.pymc-labs.com) researchers and a community of experts. PyMC Labs has deep expertise in building Bayesian models to provide business insights. Pairing that with input from a community with strong applied marketing expertise and experience makes for a winning combination. See {doc}`why_open_source` for more on this.
es: PyMC-Marketing es de código abierto, desarrollado por un equipo de investigadores de [PyMC Labs](https://www.pymc-labs.com) y una comunidad de expertos. PyMC Labs tiene una profunda experiencia en la construcción de modelos bayesianos para proporcionar información empresarial. Combinar eso con la aportación de una comunidad con una sólida experiencia y conocimiento en marketing aplicado crea una combinación ganadora. Consulta {doc}`why_open_source` para más información sobre esto.

source: Independent and unbiased
es: Independiente y imparcial

source: We (PyMC Labs) do not have our own advertising channel and we have no vested interests in one media channel over another. So you can be sure that the output of our Media Mix Models are based entirely on what your data (and prior beliefs) tell the models.
es: Nosotros (PyMC Labs) no tenemos nuestro propio canal de publicidad y no tenemos intereses en un canal de medios sobre otro. Así que puedes estar seguro de que la salida de nuestros Modelos de Mezcla de Medios se basa completamente en lo que tus datos (y creencias previas) le dicen a los modelos.

source: PyMC-Marketing is written in Python, an excellent choice to build a data science stack on due to its popularity, existing use in industry, very large community of Python programmers, and suitability to deploying in production.
es: PyMC-Marketing está escrito en Python, una excelente elección para construir un stack de ciencia de datos debido a su popularidad, uso existente en la industria, una comunidad muy grande de programadores de Python y su idoneidad para desplegar en producción.

source: Reliability
es: Confiabilidad

source: PyMC-Marketing places an emphasis on modularity and rigour, ensured by a comprehensive suite of software tests.
es: PyMC-Marketing pone énfasis en la modularidad y el rigor, garantizados por un conjunto completo de pruebas de software.

source: Bayesian
es: Bayesiano

source: PyMC-Marketing is fully Bayesian, built on top of [PyMC](https://www.pymc.io/welcome.html), the popular Bayesian statistical modeling package in Python. PyMC itself is well-established, widely-used, road-tested, and has been a [NumFOCUS Sponsored Project](https://numfocus.org/project/pymc) since 2016. Read more about {doc}`why_bayesian` for more on this.
es: PyMC-Marketing es completamente bayesiano, construido sobre [PyMC](https://www.pymc.io/welcome.html), el popular paquete de modelado estadístico bayesiano en Python. PyMC en sí es bien establecido, ampliamente utilizado, probado en la práctica y ha sido un [Proyecto Patrocinado por NumFOCUS](https://numfocus.org/project/pymc) desde 2016. Lee más sobre {doc}`why_bayesian` para más información sobre esto.
