Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/benefits/why_open_source.po
Languages: es

source: Why embrace open source?
es: ¿Por qué adoptar el código abierto?

source: In recent years, there has been a significant shift across many data-intensive industries to build upon open source foundations. There are several advantages in building your marketing data science stack on an open source core:
es: En los últimos años, ha habido un cambio significativo en muchas industrias intensivas en datos para basarse en fundamentos de código abierto. Hay varias ventajas en construir tu pila de ciencia de datos de marketing sobre un núcleo de código abierto:

source: Cost savings
es: Ahorro de costos

source: Avoid paying for proprietary software licenses.
es: Evita pagar por licencias de software propietario.

source: Avoid vendor lock-in
es: Evitar el bloqueo del proveedor

source: Keep flexibility and control, with the ability to switch to other options or to customise your data science models on top of an open source core.
es: Mantén la flexibilidad y el control, con la capacidad de cambiar a otras opciones o de personalizar tus modelos de ciencia de datos sobre un núcleo de código abierto.

source: Flexibility and customization
es: Flexibilidad y personalización

source: Open source software is customizable and can be tailored to meet the specific needs of your business. This allows you to create a data science stack that is uniquely suited to your business and can give you a competitive advantage.
es: El software de código abierto es personalizable y se puede adaptar para satisfacer las necesidades específicas de tu negocio. Esto te permite crear un stack de ciencia de datos que se ajuste de manera única a tu negocio y puede brindarte una ventaja competitiva.

source: In-housing
es: In-house

source: There are pro’s and con’s of running your marketing analytics [in-house](https://www.campaignlive.co.uk/article/in-housing-everything-need-know/1492428) versus outsourcing through external marketing agencies bespoke consultancies. But if you were going to in-house, it makes sense to build your data science stack on an open core - it allows your data science team to focus on customisation for *your* business rather than building and maintaining the foundations that others have already built.
es: Hay ventajas y desventajas de ejecutar tus análisis de marketing [internamente](https://www.campaignlive.co.uk/article/in-housing-everything-need-know/1492428) en comparación con externalizar a través de agencias de marketing externas o consultorías personalizadas. Pero si vas a hacerlo internamente, tiene sentido construir tu pila de ciencia de datos sobre un núcleo abierto; permite que tu equipo de ciencia de datos se enfoque en la personalización para *tu* negocio en lugar de construir y mantener las bases que otros ya han creado.

source: Innovation
es: Innovación

source: Open source software is often at the forefront of innovation in data science, with new tools and techniques being developed and shared by the community. By building your data science stack on an open source core, you can stay up-to-date with the latest advances in the field and take advantage of new developments and improvements as they arise.
es: El software de código abierto a menudo está a la vanguardia de la innovación en la ciencia de datos, con nuevas herramientas y técnicas que son desarrolladas y compartidas por la comunidad. Al construir tu pila de ciencia de datos sobre un núcleo de código abierto, puedes mantenerte al día con los últimos avances en el campo y aprovechar los nuevos desarrollos y mejoras a medida que surgen.

source: Community support
es: Soporte comunitario

source: PyMC-Marketing and [PyMC](https://www.pymc.io/) (the Bayesian engine that powers PyMC-Marketing) are supported by a large, active community of developers who contribute to the development of these libraries and provide support and guidance to users. For example the [the PyMC-Marketing Discussions on Github](https://github.com/pymc-labs/pymc-marketing/discussions) allows members of our community to connect with and ask questions of peers, core developers, and members of [PyMC Labs](https://www.pymc-labs.com). The [PyMC Discouse](https://discourse.pymc.io) is a similar forum for users of PyMC (the engine that powers PyMC-Marketing). This thriving community can be invaluable for businesses that don't have the resources to hire their own team of data scientists.
es: PyMC-Marketing y [PyMC](https://www.pymc.io/) (el motor bayesiano que impulsa PyMC-Marketing) son respaldados por una gran y activa comunidad de desarrolladores que contribuyen al desarrollo de estas bibliotecas y brindan apoyo y orientación a los usuarios. Por ejemplo, las [discusiones de PyMC-Marketing en Github](https://github.com/pymc-labs/pymc-marketing/discussions) permiten a los miembros de nuestra comunidad conectarse y hacer preguntas a sus pares, desarrolladores principales y miembros de [PyMC Labs](https://www.pymc-labs.com). El [Discurso de PyMC](https://discourse.pymc.io) es un foro similar para los usuarios de PyMC (el motor que impulsa PyMC-Marketing). Esta próspera comunidad puede ser invaluable para las empresas que no tienen los recursos para contratar su propio equipo de científicos de datos.

source: Talent acquisition and onboarding
es: Adquisición de talento y incorporación

source: Using open source software as a foundation for your data science stack can help attract top talent to your company. Developers and data scientists are often drawn to companies that use cutting-edge tools and contribute to the larger open source community.
es: Usar software de código abierto como base para tu pila de ciencia de datos puede ayudar a atraer talento de primer nivel a tu empresa. Los desarrolladores y científicos de datos a menudo se sienten atraídos por empresas que utilizan herramientas de vanguardia y contribuyen a la comunidad de código abierto más amplia.
