Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/guide/benefits/why_bayesian.po
Languages: es

source: Why Bayesian?
es: ¿Por qué Bayesiano?

source: Data such as customer transactions and advertising expenditure can be low resolution (e.g. monthly), contain measurement errors, and have missing values. This kind of noisy data environment can be a challenge for traditional methods that rely solely upon data to draw their conclusions.
es: Los datos como las transacciones de los clientes y el gasto en publicidad pueden tener baja granularidad (por ejemplo, mensual), contener errores de medición y tener valores faltantes. Este tipo de entorno de datos ruidosos puede ser un desafío para los métodos tradicionales que se basan únicamente en los datos para sacar sus conclusiones.

source: Bayesian approaches allow your team’s valuable domain expertise to be incorporated in the modelling process in the form of Bayesian prior beliefs. This can make a massive difference - especially when data are noisy and uncertain. Rather than your model contorting itself in strange ways to best fit complex and noisy data, Bayesian priors can keep your model right, leading to much more sensible insights that fit with your domain expertise.
es: Los enfoques bayesianos permiten que la valiosa experiencia en el dominio de su equipo se incorpore en el proceso de modelado en forma de creencias previas bayesianas. Esto puede hacer una gran diferencia, especialmente cuando los datos son ruidosos e inciertos. En lugar de que su modelo se contorsione de maneras extrañas para ajustarse mejor a datos complejos y ruidosos, las creencias previas bayesianas pueden mantener su modelo en el camino correcto, lo que lleva a percepciones mucho más sensatas que se alinean con su experiencia en el dominio.

source: Frequentist approaches can require two or more years worth of historical data. Bayesian methods can work with very short-run data, meaning you don't have to wait a long time collecting data before getting insights. The certainty in your estimates will grow as your dataset increases.
es: Los enfoques frecuentistas pueden requerir dos o más años de datos históricos. Los métodos bayesianos pueden trabajar con datos de muy corto plazo, lo que significa que no tienes que esperar mucho tiempo recolectando datos antes de obtener información. La certeza en tus estimaciones crecerá a medida que tu conjunto de datos aumente.

source: Bayesian approaches excel at modelling hierarchical or nested data. This is particularly useful if you have just launched a new product, or operate in a new region, or are dealing with a new cohort or demographic of customers and don’t have many observations. Bayesian hierarchical models allow information learnt about some categories to intelligently inform you about novel categories.
es: Los enfoques bayesianos destacan en la modelización de datos jerárquicos o anidados. Esto es particularmente útil si acabas de lanzar un nuevo producto, o si operas en una nueva región, o si estás tratando con una nueva cohorte o demografía de clientes y no tienes muchas observaciones. Los modelos jerárquicos bayesianos permiten que la información aprendida sobre algunas categorías te informe de manera inteligente sobre categorías novedosas.

source: Bayesian methods provide *the* way to make decisions under uncertainty. This enables you to generate and predict future scenarios - knowing how certain or not you are of those predictions. You can run optimisation processes to decide what actions to take in the future, fully taking uncertainty into account. This helps manage your risk.
es: Los métodos bayesianos proporcionan *la* manera de tomar decisiones bajo incertidumbre. Esto te permite generar y predecir escenarios futuros, sabiendo cuán seguro o no estás de esas predicciones. Puedes ejecutar procesos de optimización para decidir qué acciones tomar en el futuro, teniendo en cuenta completamente la incertidumbre. Esto ayuda a gestionar tu riesgo.

source: Find out more
es: Descubre más

source: To find out more, click through the video thumbnail below to watch the talk [Solving Real-World Business Problems with Bayesian Modeling](https://www.youtube.com/watch?v=twpZhNqVExc) by Thomas Wiecki, recorded at PyData London 2022.
es: Para obtener más información, haz clic en la miniatura del video a continuación para ver la charla [Solving Real-World Business Problems with Bayesian Modeling](https://www.youtube.com/watch?v=twpZhNqVExc) de Thomas Wiecki, grabada en PyData London 2022.

source: [![Youtube video thumbnail image](https://img.youtube.com/vi/twpZhNqVExc/maxresdefault.jpg)](https://www.youtube.com/watch?v=twpZhNqVExc)
es: [![Imagen en miniatura del video de Youtube](https://img.youtube.com/vi/twpZhNqVExc/maxresdefault.jpg)](https://www.youtube.com/watch?v=twpZhNqVExc)

source: Youtube video thumbnail image
es: Imagen en miniatura del video de Youtube
