Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/general/model_configuration.po
Languages: es

source: Model Configuration
es: Configuración del modelo

source: This notebook provides details about the model configuration in PyMC-Marketing. This API provides a very flexible way to express the model Priors and likelihoods so that we can have enough expressiveness to build custom models.
es: Este cuaderno proporciona detalles sobre la configuración del modelo en PyMC-Marketing. Esta API ofrece una forma muy flexible de expresar los Priors y las verosimilitudes del modelo para que podamos tener suficiente expresividad para construir modelos personalizados.

source: Setup
es: Configuración

source: Prior Distributions
es: Distribuciones Previas

source: The {class}`~pymc_extras.prior.Prior` class is our way to expression distributions and relationships between them.
es: La clase {class}`~pymc_extras.prior.Prior` es nuestra forma de expresar distribuciones y relaciones entre ellas.

source: Basic Usage
es: Uso básico

source: Every prior will need a distribution name that comes from `PyMC`. View the full list in the documentation [here](https://www.pymc.io/projects/docs/en/stable/api/distributions.html).
es: Cada distribución anterior necesitará un nombre de distribución que provenga de `PyMC`. Vea la lista completa en la documentación [aquí](https://www.pymc.io/projects/docs/en/stable/api/distributions.html).

source: If not, then an exception will be raised.
es: Si no, se generará una excepción.

source: Specific parameters can be passed as **keyword arguments** but are not required if the `PyMC` distribution has defaults.
es: Se pueden pasar parámetros específicos como **argumentos de palabra clave**, pero no son obligatorios si la distribución `PyMC` tiene valores predeterminados.

source: There will be a check at initialization against the `PyMC` distribution.
es: Se realizará una verificación en la inicialización contra la distribución `PyMC`.

source: However, there are some limitations to that. Take this invalid parameterization below:
es: Sin embargo, hay algunas limitaciones a eso. Tenga en cuenta esta parametrización inválida a continuación:

source: The `create_variable` method is used to make variables from this distribution and it isn't until then that there is an error.
es: El método `create_variable` se utiliza para crear variables a partir de esta distribución y no es hasta entonces que se produce un error.

source: This goes for incorrect values as well!
es: ¡Esto se aplica también a los valores incorrectos!

source: The `dims` parameter are used to express the dimensions of the distribution. This variable is not part of a model so the values are not reflected with the distribution itself.
es: El parámetro `dims` se utiliza para expresar las dimensiones de la distribución. Esta variable no forma parte de un modelo, por lo que los valores no se reflejan en la distribución misma.

source: If there are dimensions, then the coords need to exist in the larger model. But they exist separately and can defined in advance.
es: Si hay dimensiones, entonces las coordenadas deben existir en el modelo más grande. Pero existen por separado y pueden definirse de antemano.

source: Each `Prior` instance is just instructions to create a variable, so they can be used multiple times!
es: Cada instancia de `Prior` son simplemente instrucciones para crear una variable, ¡así que se pueden usar múltiples veces!

source: If the coords were not specified then this would cause a PyMC error.
es: Si las coordenadas no se especificaron, esto causaría un error de PyMC.

source: The variables can get arbitrarily large as well by providing additional dims in a tuple.
es: Las variables también pueden volverse arbitrariamente grandes al proporcionar dimensiones adicionales en una tupla.

source: Hierarchical Variables
es: Variables Jerárquicas

source: Hierarchical variables can be defined by using distributions as the parameters of another distribution. The parent distributions will usually have a larger dimensionality than each of the parameters.
es: Las variables jerárquicas se pueden definir utilizando distribuciones como los parámetros de otra distribución. Las distribuciones parentales generalmente tendrán una dimensionalidad mayor que cada uno de los parámetros.

source: We can use the `to_graph` method to create visualize the variable with dummy coordinates.
es: Podemos utilizar el método `to_graph` para visualizar la variable con coordenadas ficticias.

source: No need to worry about variable naming! The child parameters will all be automatically named based on the parent.
es: ¡No hay necesidad de preocuparse por la nomenclatura de variables! Los parámetros hijos se nombrarán automáticamente en función del padre.

source: The validity of the parameter values will not be checked.
es: La validez de los valores de los parámetros no será verificada.

source: There can be negative sigma parameter in a Normal distribution whether that comes from value or another distribution!
es: Puede haber un parámetro sigma negativo en una distribución Normal, ya sea que provenga de un valor o de otra distribución.

source: Model reparamterizations can help with model convergence depending on the model posterior!
es: Las reparametrizaciones del modelo pueden ayudar con la convergencia del modelo dependiendo de la posterior del modelo.

source: For Normal distribution, the common non-centered parameterization is supported with the `centered` flag.
es: Para la distribución Normal, se admite la parametrización no centrada común con la bandera `centered`.

source: Other distributions can be hierarchical as well. Just use distributions for parameters of a parent distribution. For instance, the Beta distribution has two positive parameters, `alpha` and `beta` which can be reflect as HalfNormal distributions.
es: Otras distribuciones también pueden ser jerárquicas. Simplemente use distribuciones para los parámetros de una distribución padre. Por ejemplo, la distribución Beta tiene dos parámetros positivos, `alpha` y `beta`, que pueden reflejarse como distribuciones HalfNormal.

source: Transformations
es: Transformaciones

source: The `transform` variable can be used for any of the distributions to change its domain.
es: La variable `transform` se puede utilizar para cualquiera de las distribuciones para cambiar su dominio.

source: These transformations will be taken from `pytensor.tensor` or `pm.math` in that order.
es: Estas transformaciones se tomarán de `pytensor.tensor` o `pm.math` en ese orden.

source: Below is a non-centered hierarchical Normal distribution that is put through a sigmoid function in order to change the domain to (0, 1).
es: A continuación se presenta una distribución Normal jerárquica no centrada que se somete a una función sigmoide con el fin de cambiar el dominio a (0, 1).

source: Prior Visualization
es: Visualización previa

source: For scalar distributions, make use of the `preliz` attribute of the model in order to visualize.
es: Para distribuciones escalares, utilice el atributo `preliz` del modelo para visualizar.

source: Defaults for the parameters will have to be provided or there will be an error.
es: Se deberán proporcionar valores predeterminados para los parámetros o se producirá un error.

source: Using the `constrain` method can help hone in on a prior. It is a wrapper around [PreliZ's `maxent` function](https://preliz.readthedocs.io/en/latest/api_reference.html#preliz.unidimensional.maxent).
es: Utilizar el método `constrain` puede ayudar a centrarse en un previo. Es un envoltorio alrededor de la función `maxent` de [PreliZ](https://preliz.readthedocs.io/en/latest/api_reference.html#preliz.unidimensional.maxent).

source: To keep a parameter value fixed, pass it to the Prior instance. In the following example, the mean is fixed at 2.
es: Para mantener un valor de parámetro fijo, pásalo a la instancia de Prior. En el siguiente ejemplo, la media está fija en 2.

source: For more complicated distributions, consider using the `sample_prior` method in order to access the prior. Or PreliZ's functions like [predictive explorer](https://preliz.readthedocs.io/en/latest/examples/observed_space_examples.html#predictive-explorer).
es: Para distribuciones más complicadas, considere utilizar el método `sample_prior` para acceder al previo. O las funciones de PreliZ como [explorador predictivo](https://preliz.readthedocs.io/en/latest/examples/observed_space_examples.html#predictive-explorer).

source: Any coordinates will have to be passed like in `pm.Model`.
es: Cualquier coordenada deberá ser pasada como en `pm.Model`.

source: The prior variables can be visualized in whatever way works best. Here is a KDE of the variables to see the marginal distributions.
es: Las variables anteriores se pueden visualizar de la manera que mejor funcione. Aquí hay un KDE de las variables para ver las distribuciones marginales.

source: Use any workflow to make sense of the prior distribution! For instance, the joint distribution which shows these two channels are correlated due to the hierarchical generation.
es: ¡Utilice cualquier flujo de trabajo para dar sentido a la distribución previa! Por ejemplo, la distribución conjunta que muestra que estos dos canales están correlacionados debido a la generación jerárquica.

source: Automatic Broadcasting
es: Transmisión Automática

source: The broadcasting of the dims will be handled automatically.
es: La transmisión de los niveles se manejará automáticamente.

source: For instance, the `mu` of the variable needs to be transposed in order to work with `("channel", "geo")` dims.
es: Por ejemplo, el `mu` de la variable necesita ser transpuesto para trabajar con las dimensiones `("channel", "geo")`.

source: With all this functionality, we can see that the prior distributions can become quite expressive!
es: Con toda esta funcionalidad, podemos ver que las distribuciones previas pueden volverse bastante expresivas.

source: And the user can spend more time thinking about just the assumptions of the variables rather than logic to ensure the dimensions work.
es: Y el usuario puede dedicar más tiempo a reflexionar sobre las suposiciones de las variables en lugar de la lógica para asegurar que las dimensiones funcionen.

source: Serialization
es: Serialización

source: The `to_dict` and `from_dict` methods can be helpful for storage of the distributions.
es: Los métodos `to_dict` y `from_dict` pueden ser útiles para el almacenamiento de las distribuciones.

source: Use in PyMC-Marketing
es: Usar en PyMC-Marketing

source: Distributions will be expressed in this manner throughout the package including but not limited to:
es: Las distribuciones se expresarán de esta manera a lo largo del paquete, incluyendo pero no limitándose a:

source: MMM components
es: Componentes MMM

source: [media transformations](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_components.html#media-transformations)
es: [transformaciones de medios](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_components.html#media-transformations)

source: Backwards compatibility
es: Compatibilidad hacia atrás

source: The `from_dict` method will create a `Prior` instance from the previous format.
es: El método `from_dict` creará una instancia de `Prior` a partir del formato anterior.

source: For instance, take this previous configuration:
es: Por ejemplo, tome esta configuración anterior:

source: This can be parsed with the `Prior.from_dict` constructor for each key. Much more consise too!
es: Esto se puede analizar con el constructor `Prior.from_dict` para cada clave. ¡Mucho más conciso también!

source: The `parse_model_config` function will do just this and is used internally. It also provides some deprecation warnings.
es: La función `parse_model_config` hará exactamente esto y se utiliza internamente. También proporciona algunas advertencias de desaprobación.

source: As well as the ability to catch some errors while parsing.
es: Así como la capacidad de detectar algunos errores durante el análisis.

source: Appendix: Validation
es: Apéndice: Validación

source: Behind the scenes, the `Prior` class uses th `validate_call` from [`Pydantic`](https://docs.pydantic.dev/latest/concepts/validators/) to ensure that the parameters are valid.`
es: Detrás de escena, la clase `Prior` utiliza `validate_call` de [`Pydantic`](https://docs.pydantic.dev/latest/concepts/validators/) para asegurar que los parámetros sean válidos.
