Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/general/other_nuts_samplers.po
Languages: es

source: Other NUTS Samplers
es: Otros muestreadores NUTS

source: In this notebook we show how to fit a CLV model with other NUTS samplers. These alternative samplers can be significantly faster and also sample on the GPU.
es: En este cuaderno mostramos cómo ajustar un modelo de CLV con otros muestreadores NUTS. Estos muestreadores alternativos pueden ser significativamente más rápidos y también muestrear en la GPU.

source: You need to install these packages in your Python environment.
es: Necesita instalar estos paquetes en su entorno de Python.

source: You can pass the exact same `nuts_sampler` argument to the MMM models.
es: Puede pasar el mismo argumento `nuts_sampler` exactamente a los modelos MMM.

source: GPU support only works with select samplers in PyMC that use the [JAX](https://github.com/jax-ml/jax) backend. These samplers include `numpyro`, `blackjax`, and `nutpie`.
es: El soporte de GPU solo funciona con selectos muestreadores en PyMC que utilizan el backend de [JAX](https://github.com/jax-ml/jax). Estos muestreadores incluyen `numpyro`, `blackjax` y `nutpie`.

source: Make sure the GPU is registered, follow the instructions [here](https://github.com/jax-ml/jax?tab=readme-ov-file#installation).
es: Asegúrese de que la GPU esté registrada, siga las instrucciones [aquí](https://github.com/jax-ml/jax?tab=readme-ov-file#installation).

source: For the purpose of illustration, we will use the same data and model as in the other CLV notebooks.
es: A efectos de ilustración, utilizaremos los mismos datos y modelo que en los otros cuadernos de CLV.

source: We can pass the keyword argument `nuts_sampler` to the `fit` method of the `CLV` model to specify the NUTS sampler to use. In addition, we can pass additional keyword arguments which will be passed to the [`pymc.sample`](https://www.pymc.io/projects/docs/en/stable/api/generated/pymc.sampling.mcmc.sample.html#pymc.sampling.mcmc.sample) method via the model builder layer. For example, we can use the `numpyro` sampler as:
es: Podemos pasar el argumento de palabra clave `nuts_sampler` al método `fit` del modelo `CLV` para especificar el muestreador NUTS a utilizar. Además, podemos pasar argumentos de palabra clave adicionales que se transmitirán al método [`pymc.sample`](https://www.pymc.io/projects/docs/en/stable/api/generated/pymc.sampling.mcmc.sample.html#pymc.sampling.mcmc.sample) a través de la capa del constructor del modelo. Por ejemplo, podemos utilizar el muestreador `numpyro` de la siguiente manera:

source: Similarly, we can use the `blackjax` sampler as:
es: De manera similar, podemos utilizar el muestreador `blackjax` de la siguiente manera:

source: Finally, we can use the `nutpie` which is a Rust implementation of NUTS.
es: Finalmente, podemos utilizar `nutpie`, que es una implementación en Rust de NUTS.

source: The results from the samplers are almost identical:
es: Los resultados de los muestreadores son casi idénticos:
