Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/general/prior_predictive.po
Languages: es

source: Prior Predictive Modeling
es: Modelado Predictivo Anterior

source: This guide provides an introduction to prior predictive modeling using PyMC (and PyMC-Marketing) and the {class}`Prior <pymc_extras.prior.Prior>` class from PyMC-Marketing. We start by looking into a simpler example and then we will see how to apply to real case scenarios with marketing mix models in PyMC-Marketing.
es: Esta guía proporciona una introducción a la modelización predictiva previa utilizando PyMC (y PyMC-Marketing) y la clase `{class}`Prior <pymc_extras.prior.Prior>` de PyMC-Marketing. Comenzamos examinando un ejemplo más simple y luego veremos cómo aplicarlo a escenarios de casos reales con modelos de mezcla de marketing en PyMC-Marketing.

source: Before diving into the technical details, let's understand why priors are crucial in Bayesian analysis and their practical importance in industry applications.
es: Antes de profundizar en los detalles técnicos, comprendamos por qué los priors son cruciales en el análisis bayesiano y su importancia práctica en las aplicaciones industriales.

source: Understanding Bayesian Inference
es: Comprendiendo la Inferencia Bayesiana

source: Bayesian inference is based on Bayes' theorem, which provides a formal way to update our beliefs about parameters $\theta$ (say, saturation or decay rate in a marketing mix models) given observed data $y$:
es: La inferencia bayesiana se basa en el teorema de Bayes, que proporciona una forma formal de actualizar nuestras creencias sobre los parámetros $\theta$ (por ejemplo, la tasa de saturación o de decaimiento en modelos de mezcla de marketing) dado los datos observados $y$:

source: Where:
es: Dónde:

source: $p(\theta|y)$ is the posterior probability (what we want to learn)
es: $p(\theta|y)$ es la probabilidad posterior (lo que queremos aprender)

source: $p(y|\theta)$ is the likelihood (how the data is generated)
es: $p(y|\theta)$ es la verosimilitud (cómo se generan los datos)

source: $p(\theta)$ is the prior probability (our initial beliefs)
es: $p(\theta)$ es la probabilidad a priori (nuestras creencias iniciales)

source: $p(y)$ is the evidence (a normalizing constant), which can be written as $p(y) = \displaystyle{ \int p(y|\theta)p(\theta)d\theta }$
es: $p(y)$ es la evidencia (una constante de normalización), que se puede escribir como $p(y) = \displaystyle{ \int p(y|\theta)p(\theta)d\theta }$

source: The posterior distribution combines our prior knowledge with the observed data to give us updated beliefs about the parameters. In practice, we often work with the unnormalized posterior:
es: La distribución posterior combina nuestro conocimiento previo con los datos observados para proporcionarnos creencias actualizadas sobre los parámetros. En la práctica, a menudo trabajamos con la posterior no normalizada:

source: This is because the normalizing constant $p(y)$ is often intractable to compute directly.
es: Esto se debe a que la constante de normalización $p(y)$ a menudo es intractable de calcular directamente.

source: Why Priors Matter in Industry
es: Por qué los priors son importantes en la industria

source: In industry applications, priors serve several crucial purposes:
es: En aplicaciones industriales, los priors cumplen varios propósitos cruciales:

source: **Domain Knowledge Integration**:
es: **Integración del Conocimiento del Dominio**:

source: Incorporating expert knowledge into models
es: Incorporando conocimiento experto en modelos

source: Leveraging historical data from similar projects
es: Aprovechando datos históricos de proyectos similares

source: Encoding business constraints and requirements
es: Codificación de restricciones y requisitos empresariales

source: **Risk Management**:
es: **Gestión de Riesgos**:

source: Preventing unrealistic predictions
es: Prevención de predicciones poco realistas

source: Ensuring stable model behavior
es: Asegurando un comportamiento estable del modelo

source: Managing uncertainty in decision-making
es: Gestionar la incertidumbre en la toma de decisiones

source: **Data Efficiency**:
es: **Eficiencia de Datos**:

source: Making models work with limited data
es: Haciendo que los modelos funcionen con datos limitados

source: Faster convergence to reasonable solutions
es: Convergencia más rápida hacia soluciones razonables

source: Robust predictions in new scenarios
es: Predicciones robustas en nuevos escenarios

source: **Model Regularization**:
es: **Regularización del Modelo**:

source: Preventing overfitting
es: Prevención del sobreajuste

source: Handling multicollinearity
es: Manejo de la multicolinealidad

source: Dealing with sparse data
es: Tratando con datos escasos

source: Common Prior Specification Scenarios
es: Escenarios Comunes de Especificación de Prioridades

source: In marketing analytics, you'll often encounter these scenarios:
es: En el análisis de marketing, a menudo se encontrará con estos escenarios:

source: **Marketing Mix Models**:
es: **Modelos de Mezcla de Marketing**:

source: Media channel effectiveness (typically positive)
es: Efectividad del canal de medios (típicamente positiva)

source: Diminishing returns (shape constraints)
es: Rendimientos decrecientes (restricciones de forma)

source: Lift tests calibration
es: Calibración de pruebas de elevación

source: **Customer Lifetime Value**:
es: **Valor del Tiempo de Vida del Cliente**:

source: Purchase rates (positive values)
es: Tasas de compra (valores positivos)

source: Churn probabilities (between 0 and 1)
es: Probabilidades de deserción (entre 0 y 1)

source: Monetary value distributions (positive, often log-normal)
es: Distribuciones de valor monetario (positivas, a menudo logarítmicamente normales)

source: **A/B Testing**:
es: msgid: **A/B Testing** msgstr: **Pruebas A/B**

source: Conversion rates (bounded between 0 and 1)
es: Tasas de conversión (limitadas entre 0 y 1)

source: Lift measurements (centered around small effects)
es: Mediciones de elevación (centradas en efectos pequeños)

source: Revenue impacts (potentially heavy-tailed)
es: Impactos en los ingresos (potencialmente de cola pesada)

source: A/B tests is a fascinating field where Bayesian methods can provide huge benefits. Still, omiting prior predictive analysis can lead to bad results as described in the great article ["The Bet Test: Spotting Problems in Bayesian A/B Test Analysis"](https://www.geteppo.com/blog/the-bet-test-problems-in-bayesian-ab-test-analysis) by Tyler Buffington.
es: Las pruebas A/B son un campo fascinante donde los métodos bayesianos pueden ofrecer enormes beneficios. Sin embargo, omitir el análisis predictivo previo puede llevar a resultados negativos, como se describe en el excelente artículo ["The Bet Test: Spotting Problems in Bayesian A/B Test Analysis"](https://www.geteppo.com/blog/the-bet-test-problems-in-bayesian-ab-test-analysis) de Tyler Buffington.

source: What is Prior Predictive Modeling?
es: ¿Qué es el Modelado Predictivo Previo?

source: Prior predictive modeling is a crucial step in Bayesian workflow that helps us validate our prior choices before seeing the actual data. The process involves:
es: El modelado predictivo previo es un paso crucial en el flujo de trabajo bayesiano que nos ayuda a validar nuestras elecciones previas antes de ver los datos reales. El proceso implica:

source: **Specification**:
es: **Especificación**:

source: Define prior distributions for model parameters
es: Defina distribuciones a priori para los parámetros del modelo

source: Encode domain knowledge and constraints
es: Codificar el conocimiento del dominio y las restricciones

source: Document assumptions and choices
es: Documentar suposiciones y elecciones

source: **Simulation**:
es: **Simulación**:

source: Sample parameters from prior distributions
es: Parámetros de muestra de distribuciones anteriores

source: Generate synthetic data using the model structure
es: Generar datos sintéticos utilizando la estructura del modelo

source: Create multiple scenarios of possible outcomes
es: Cree múltiples escenarios de posibles resultados

source: **Validation**:
es: **Validación**:

source: Check if simulated data matches domain expertise
es: Verifique si los datos simulados coinciden con la experiencia del dominio.

source: Verify that impossible scenarios are excluded
es: Verifique que se excluyan los escenarios imposibles.

source: Ensure reasonable coverage of possible outcomes
es: Asegure una cobertura razonable de los posibles resultados.

source: Benefits in Practice
es: Beneficios en la Práctica

source: **Early Problem Detection**:
es: **Detección Temprana de Problemas**:

source: Identify unrealistic assumptions
es: Identificar suposiciones poco realistas

source: Catch numerical issues before model fitting
es: Detectar problemas numéricos antes del ajuste del modelo

source: Validate model structure
es: Validar la estructura del modelo

source: **Stakeholder Communication**:
es: **Comunicación con las partes interesadas**:

source: Visualize model implications
es: Visualizar las implicaciones del modelo

source: Justify modeling choices
es: Justificar las elecciones de modelado

source: Set realistic expectations
es: Establecer expectativas realistas

source: **Model Development**:
es: **Desarrollo de Modelos**:

source: Iterate on prior choices efficiently
es: Iterar sobre elecciones anteriores de manera eficiente

source: Compare alternative specifications
es: Comparar especificaciones alternativas

source: Document model evolution
es: Evolución del modelo de documento

source: **Risk Assessment**:
es: **Evaluación de Riesgos**:

source: Understand model limitations
es: Entender las limitaciones del modelo

source: Identify edge cases
es: Identificar casos límite

source: Plan for failure modes
es: Plan para modos de fallo

source: The prior predictive distribution $p(y)$ represents our beliefs about the data before we observe it. Mathematically, it's the distribution of the data marginalized over the prior:
es: La distribución predictiva previa $p(y)$ representa nuestras creencias sobre los datos antes de observarlos. Matemáticamente, es la distribución de los datos marginalizada sobre la previa:

source: In practice, we can sample from this distribution by:
es: En la práctica, podemos muestrear de esta distribución mediante:

source: Drawing parameters from the prior: $\theta^{(s)} \sim p(\theta)$
es: Extrayendo parámetros de lo anterior: $\theta^{(s)} \sim p(\theta)$

source: Generating data from the likelihood: $y^{(s)} \sim p(y|\theta^{(s)})$
es: Generando datos a partir de la verosimilitud: $y^{(s)} \sim p(y|\theta^{(s)})$

source: This process helps us validate our model in several ways:
es: Este proceso nos ayuda a validar nuestro modelo de varias maneras:

source: **Parameter Space Coverage**: The samples $\{\theta^{(s)}\}_{s=1}^S$ show us what parameter values we consider plausible
es: **Cobertura del Espacio de Parámetros**: Las muestras $\{\theta^{(s)}\}_{s=1}^S$ nos muestran qué valores de parámetros consideramos plausibles.

source: **Data Space Coverage**: The samples $\{y^{(s)}\}_{s=1}^S$ show us what data our model can generate
es: **Cobertura del Espacio de Datos**: Las muestras $\{y^{(s)}\}_{s=1}^S$ nos muestran qué datos puede generar nuestro modelo.

source: **Model Sensitivity**: The relationship between $\theta^{(s)}$ and $y^{(s)}$ shows how parameters influence predictions
es: **Sensibilidad del Modelo**: La relación entre $\theta^{(s)}$ y $y^{(s)}$ muestra cómo los parámetros influyen en las predicciones.

source: Let's explore these concepts through practical examples using the {class}`Prior <pymc_extras.prior.Prior>` class from PyMC-Marketing.
es: Exploramos estos conceptos a través de ejemplos prácticos utilizando la clase {class}`Prior <pymc_extras.prior.Prior>` de PyMC-Marketing.

source: Prepare Notebook
es: Preparar el cuaderno

source: Simple Example: Normal Distribution
es: Ejemplo simple: Distribución normal

source: Let's start with a simple example using a normal distribution. We'll:
es: Comencemos con un ejemplo simple utilizando una distribución normal. Vamos a:

source: Generate a synthetic dataset
es: Generar un conjunto de datos sintético

source: Study the observed distribution
es: Estudie la distribución observada

source: Set a prior for the mean and standard deviation
es: Establezca un prior para la media y la desviación estándar.

source: Sample from its prior predictive distribution
es: Muestra de su distribución predictiva previa

source: First we generate a synthetic dataset from a normal distribution with mean one and standard deviation two.
es: Primero generamos un conjunto de datos sintético a partir de una distribución normal con una media de uno y una desviación estándar de dos.

source: Let's visualize the observed data.
es: Visualicemos los datos observados.

source: We assume we do not know the true mean and standard deviation of the data (as in almost all cases). Our idea is to fit a bayesian model to try to recover the true parameters.
es: Asumimos que no conocemos la media verdadera y la desviación estándar de los datos (como en casi todos los casos). Nuestra idea es ajustar un modelo bayesiano para intentar recuperar los parámetros verdaderos.

source: We consider the parametric form of the data:
es: Consideramos la forma paramétrica de los datos:

source: What could be sensible priors for the mean and standard deviation? This is where the prior predictive modeling comes in.
es: ¿Cuáles podrían ser priors sensatos para la media y la desviación estándar? Aquí es donde entra el modelado predictivo previo.

source: Fixed Mean and Standard Deviation
es: Media y Desviación Estándar Fijas

source: First, we consider the simple case where we set fixed values for the mean and standard deviation and we sample from the prior predictive distribution (the normal distribution).
es: Primero, consideramos el caso simple en el que establecemos valores fijos para la media y la desviación estándar y muestreamos de la distribución predictiva previa (la distribución normal).

source: Consider the following values for the mean and standard deviation:
es: Considere los siguientes valores para la media y la desviación estándar:

source: Given these values, we can simply sample from a normal distribution with these parameters and compare it with the observed data.
es: Dado estos valores, podemos simplemente muestrear de una distribución normal con estos parámetros y compararlo con los datos observados.

source: Looking at the plots above, we can see how different combinations of mean (μ) and standard deviation (σ) parameters affect the fit to our observed data:
es: Al observar los gráficos anteriores, podemos ver cómo diferentes combinaciones de los parámetros de media (μ) y desviación estándar (σ) afectan el ajuste a nuestros datos observados:

source: $\mu=-2, \sigma=0.5$: The distribution is too narrow and centered too far to the left
es: $\mu=-2, \sigma=0.5$: La distribución es demasiado estrecha y está centrada demasiado a la izquierda.

source: $\mu=-2, \sigma=3$: Better spread but still centered too far left
es: $\mu=-2, \sigma=3$: Mejor dispersión pero aún centrado demasiado a la izquierda

source: $\mu=0, \sigma=0.5$: Better centered but too narrow
es: $\mu=0, \sigma=0.5$: Mejor centrado pero demasiado estrecho

source: $\mu=0, \sigma=3$: This appears to be the best fit, with both good center and spread matching the observed data
es: $\mu=0, \sigma=3$: Esto parece ser el mejor ajuste, con un buen centro y dispersión que coinciden con los datos observados.

source: This visual comparison helps us understand that priors centered around $\mu=0$ with a wider standard deviation ($\sigma=3$) may be more appropriate for our data.
es: Esta comparación visual nos ayuda a entender que las distribuciones previas centradas alrededor de $\mu=0$ con una desviación estándar más amplia ($\sigma=3$) pueden ser más apropiadas para nuestros datos.

source: Prior Predictive Sampling
es: Muestreo Predictivo Previo

source: Now we can take a step forward and instead of fixing the mean and standard deviation, we can set a prior for them. To start, we set the following priors for the mean and standard deviation:
es: Ahora podemos dar un paso adelante y, en lugar de fijar la media y la desviación estándar, podemos establecer un prior para ellas. Para comenzar, establecemos los siguientes priors para la media y la desviación estándar:

source: We first sample from the model parameters.
es: Primero muestreamos de los parámetros del modelo.

source: Next, we pass these samples through a normal distribution to get the prior predictive samples.
es: A continuación, pasamos estas muestras a través de una distribución normal para obtener las muestras predictivas previas.

source: The prior predictive check shows a good agreement between our simulated data and the prior predictive samples. The overlapping densities indicate that our chosen prior distributions for the mean (normal) and standard deviation (exponential) are reasonable and can generate data similar to what we observe. This suggests our prior specifications are appropriate for this modeling task.
es: La verificación predictiva previa muestra una buena concordancia entre nuestros datos simulados y las muestras predictivas previas. Las densidades superpuestas indican que nuestras distribuciones previas elegidas para la media (normal) y la desviación estándar (exponencial) son razonables y pueden generar datos similares a los que observamos. Esto sugiere que nuestras especificaciones previas son apropiadas para esta tarea de modelado.

source: Prior Predictive Sampling with PyMC
es: Muestreo Predictivo Previo con PyMC

source: We start by defining the model in PyMC. Note that we do not need to pass the observed data (yet) in order to sample from the prior predictive distribution.
es: Comenzamos definiendo el modelo en PyMC. Tenga en cuenta que no necesitamos pasar los datos observados (aún) para muestrear de la distribución predictiva a priori.

source: PyMC offers a convenient way to sample from the prior predictive distribution using the {func}`pymc.sample_prior_predictive <pymc.sample_prior_predictive>` function.
es: PyMC ofrece una forma conveniente de muestrear de la distribución predictiva previa utilizando la función `pymc.sample_prior_predictive <pymc.sample_prior_predictive>`.

source: The prior predictive samples are very similar to the ones obtained from the manual sampling.
es: Las muestras predictivas anteriores son muy similares a las obtenidas a partir del muestreo manual.

source: Posterior Predictive Sampling
es: Muestreo Predictivo Posterior

source: Now we can fit the model to the observed data and sample from the posterior predictive distribution.
es: Ahora podemos ajustar el modelo a los datos observados y muestrear de la distribución predictiva posterior.

source: Let's plot the posterior distributions of the mean and standard deviation parameters.
es: Vamos a trazar las distribuciones posteriores de los parámetros de la media y la desviación estándar.

source: We obtain values very close to the true values (this is known as parameter recovery).
es: Obtenemos valores muy cercanos a los valores verdaderos (esto se conoce como recuperación de parámetros).

source: We can compare the prior and posterior distributions of the mean and standard deviation parameters. These plots are very handy to understand the impact of the data on the parameters.
es: Podemos comparar las distribuciones previas y posteriores de los parámetros de la media y la desviación estándar. Estos gráficos son muy útiles para entender el impacto de los datos en los parámetros.

source: Finally, we can plot the posterior predictive distribution vs the observed data.
es: Finalmente, podemos trazar la distribución predictiva posterior frente a los datos observados.

source: We see that the posterior predictive distribution is very similar to the observed data. This is a good sign that our model is well specified.
es: Vemos que la distribución predictiva posterior es muy similar a los datos observados. Esto es una buena señal de que nuestro modelo está bien especificado.

source: When working with generalized linear models (GLMs), and models with non linear transformations (for example, media mix models), normal priors on coefficients can sometimes lead to unexpected behavior due to the non-linear link functions. Make sure to check the prior predictive distribution for these models carefully. This is beautifully explained in the (fantastic!) book ["Statistical Rethinking"](https://xcelab.net/rm/) by [Richard McElreath](https://www.eva.mpg.de/ecology/staff/richard-mcelreath/).
es: Al trabajar con modelos lineales generalizados (GLMs) y modelos con transformaciones no lineales (por ejemplo, modelos de mezcla de medios), las distribuciones a priori normales sobre los coeficientes pueden, en ocasiones, conducir a comportamientos inesperados debido a las funciones de enlace no lineales. Asegúrese de revisar cuidadosamente la distribución predictiva a priori para estos modelos. Esto se explica de manera excelente en el (fantástico) libro ["Statistical Rethinking"](https://xcelab.net/rm/) de [Richard McElreath](https://www.eva.mpg.de/ecology/staff/richard-mcelreath/).

source: Prior Predictive Sampling for Marketing Mix Models
es: Muestreo Predictivo Previos para Modelos de Mezcla de Marketing

source: In the section we we focus on how to do prior predictive sampling for marketing mix models. We will use the same data from the {ref}`mmm_example` notebook. In particular, we focus on the ROAS of the two channels `x1` and `x2`.
es: En esta sección nos enfocamos en cómo realizar muestreo predictivo previo para modelos de mezcla de marketing. Utilizaremos los mismos datos del cuaderno {ref}`mmm_example`. En particular, nos centramos en el ROAS de los dos canales `x1` y `x2`.

source: Read Data
es: Leer datos

source: We start by reading the data.
es: Comenzamos leyendo los datos.

source: Recall we want to understand the ROAS and contribution of the two channels `x1` and `x2` to the sales data `y`. Let's plot the data.
es: Recuerde que queremos entender el ROAS y la contribución de los dos canales `x1` y `x2` a los datos de ventas `y`. Vamos a graficar los datos.

source: Internally, during the fitting process via the class {class}`MMM <pymc_marketing.mmm.mmm.MMM>` , the channels and target variables are scaled by dividing by the maximum value (per variable). Let's visualize the scaled data.
es: Internamente, durante el proceso de ajuste a través de la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>`, los canales y las variables objetivo se escalan dividiendo por el valor máximo (por variable). Visualicemos los datos escalados.

source: We see there is a mild trend component and some seasonality (please refer to the {ref}`mmm_example` notebook for more details).
es: Vemos que hay un componente de tendencia leve y algo de estacionalidad (por favor, consulte el cuaderno {ref}`mmm_example` para más detalles).

source: Priors Specification on the Media Parameters
es: Especificación de Priors sobre los Parámetros de Medios
