Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/general/prior_predictive.po
Languages: es

source: We now describe a way to think about the priors specification on the media parameters. In real applications, the modeler usually has additional valuable domain kwowledge and information to be incorporated into the model through priors (e.g lift tests, benchmarks, etc). In this example, we simply set priors from the input spend data.
es: Ahora describimos una forma de pensar sobre la especificación de los priors en los parámetros de los medios. En aplicaciones reales, el modelador generalmente tiene conocimientos y información valiosos adicionales del dominio que se pueden incorporar al modelo a través de priors (por ejemplo, pruebas de elevación, puntos de referencia, etc.). En este ejemplo, simplemente establecemos priors a partir de los datos de gasto de entrada.

source: Recall that the idea of these types of media mix models is to pass the media spend through an adstock transformation and then through a saturation function (both, non linear functions) before adding them to the linear model to add other control variables. These non linear transformations are controlled by the parameters $\alpha$ (adstock) , $\lambda$ (saturation) and $\beta$ (regression) coefficients. We must specify priors for these parameters. Nevertheless, the {class}`MMM <pymc_marketing.mmm.mmm.MMM>` class provides reasonable defaults priors.
es: Recuerde que la idea de estos tipos de modelos de mezcla de medios es pasar el gasto en medios a través de una transformación de adstock y luego a través de una función de saturación (ambas, funciones no lineales) antes de sumarlas al modelo lineal para añadir otras variables de control. Estas transformaciones no lineales están controladas por los parámetros $\alpha$ (adstock), $\lambda$ (saturación) y los coeficientes $\beta$ (regresión). Debemos especificar priors para estos parámetros. Sin embargo, la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>` proporciona priors razonables por defecto.

source: Let's start by looking into the adstock parameter. The adstock parameter controls the decay rate of the media effect over time. A higher value of $\alpha$ indicates a slower decay, meaning the media effect persists longer. The value of $\alpha$ is usually between 0 and 1. For many digital channels we expect this parameter to be close to $0$ whereas for offline channels (like TV) we expect this parameter to be close to $1$.
es: Comencemos examinando el parámetro de adstock. El parámetro de adstock controla la tasa de decaimiento del efecto mediático a lo largo del tiempo. Un valor más alto de $\alpha$ indica un decaimiento más lento, lo que significa que el efecto mediático persiste por más tiempo. El valor de $\alpha$ suele estar entre 0 y 1. Para muchos canales digitales, esperamos que este parámetro esté cerca de $0$, mientras que para los canales offline (como la televisión) esperamos que este parámetro esté cerca de $1$.

source: Assuming that $x_1$ and $x_2$ are digital channels, we expect the adstock parameter to be close to $0$. We can set a prior for the adstock parameter as follows:
es: Asumiendo que $x_1$ y $x_2$ son canales digitales, esperamos que el parámetro de adstock esté cerca de $0$. Podemos establecer un prior para el parámetro de adstock de la siguiente manera:

source: We can look into the implications of the adstock decay rate on the media effect.
es: Podemos analizar las implicaciones de la tasa de decaimiento del adstock en el efecto de los medios.

source: Saturation
es: Saturación

source: Next we look into the saturation parameter. The saturation parameter controls the saturation level of the media effect. A higher value of $\lambda$ indicates a higher saturation level, meaning the media effect saturates faster. The value of $\lambda$ is always positive. a reasonable prior to start with is something between $0$ and $3$ centered around $1$.
es: A continuación, examinamos el parámetro de saturación. El parámetro de saturación controla el nivel de saturación del efecto de medios. Un valor más alto de $\lambda$ indica un nivel de saturación más alto, lo que significa que el efecto de medios se satura más rápidamente. El valor de $\lambda$ es siempre positivo. Un valor previo razonable para comenzar es algo entre $0$ y $3$, centrado alrededor de $1$.

source: For the regression coefficients we can use the costs distributions. Without seeing the data is reasonable to expect the larger the channels (in terms of spend) the larger the effect (in terms of ROAS). This is not a constrain, but at least a starting point (we can also use the same priors for all the channels if we do not wanna make any assumption). We use the spend share as a proxy for the effect size trough the width of the prior (half normal distribution, as we want to ensure we have positive values).
es: Para los coeficientes de regresión podemos utilizar las distribuciones de costos. Sin ver los datos, es razonable esperar que cuanto mayores sean los canales (en términos de gasto), mayor será el efecto (en términos de ROAS). Esto no es una restricción, sino al menos un punto de partida (también podemos usar los mismos priors para todos los canales si no queremos hacer ninguna suposición). Utilizamos la participación del gasto como un proxy para el tamaño del efecto a través del ancho del prior (distribución normal truncada, ya que queremos asegurarnos de tener valores positivos).

source: Similarly as above, we can look into the implications of the saturation parameter on the media effect.
es: De manera similar a lo anterior, podemos analizar las implicaciones del parámetro de saturación en el efecto mediático.

source: These visualizations, together with the business context, can help us to set the priors for the media mix model! Make sure you make them part of your workflow.
es: Estas visualizaciones, junto con el contexto empresarial, pueden ayudarnos a establecer las prioridades para el modelo de mezcla de medios. Asegúrate de incluirlas en tu flujo de trabajo.

source: Priors on the Time-Varying Intercept
es: Priors sobre el Intercepto Variable en el Tiempo

source: In contrast with the {ref}`mmm_example` notebook, we now include a time-varying intercept. This is a way to model the trend component of the data without assuming any specific functional form. We use a Hilbert Space Gaussian Process (HSGP) to model the time-varying intercept. If you are not familiar with HSGPs, please refer to the ["Gaussian Processes: HSGP Reference & First Steps"](https://www.pymc.io/projects/examples/en/latest/gaussian_processes/HSGP-Basic.html) PyMC example notebook or the video ["A conceptual and practical introduction to Hilbert Space Gaussian Process (HSGP) approximation methods"](https://www.youtube.com/watch?v=SvefEqtoaxg).
es: En contraste con el cuaderno {ref}`mmm_example`, ahora incluimos un intercepto que varía con el tiempo. Esta es una forma de modelar el componente de tendencia de los datos sin asumir ninguna forma funcional específica. Utilizamos un Proceso Gaussiano en Espacio de Hilbert (HSGP) para modelar el intercepto que varía con el tiempo. Si no está familiarizado con los HSGP, consulte el cuaderno de ejemplo de PyMC ["Procesos Gaussianos: Referencia HSGP y Primeros Pasos"](https://www.pymc.io/projects/examples/en/latest/gaussian_processes/HSGP-Basic.html) o el video ["Una introducción conceptual y práctica a los métodos de aproximación del Proceso Gaussiano en Espacio de Hilbert (HSGP)"](https://www.youtube.com/watch?v=SvefEqtoaxg).

source: As we will set priors on the length scales of the time component, we need to have in mind the number of data points we have:
es: Dado que estableceremos priors sobre las escalas de longitud del componente temporal, debemos tener en cuenta el número de puntos de datos que tenemos:

source: The length scale parameter represents the distance between two points in the time series where we expect a change in the intercept. In our particular case, as we have weekly data and expect to capture a long term trend, we are want to consider length scales of around two or three weeks. The default prior for the length scale in PyMC-Marketing is an inverse gamma distribution. This distribution has many desirable properties: (1) is positive, (2) it goes to zero very fast (so we do not divide by zero) and (3) it has a long tail. In order to translate the length scale intuition into the inverse gamma parameters we can use a very handy function that maximizes the entropy (for a great explanation and motivation of maximum entropy see Chapter 10 in [Statistical Rethinking](https://xcelab.net/rm/)) of the distribution within a given expected interval:
es: El parámetro de escala de longitud representa la distancia entre dos puntos en la serie temporal donde esperamos un cambio en la intersección. En nuestro caso particular, dado que tenemos datos semanales y esperamos capturar una tendencia a largo plazo, queremos considerar escalas de longitud de alrededor de dos o tres semanas. El prior por defecto para la escala de longitud en PyMC-Marketing es una distribución gamma inversa. Esta distribución tiene muchas propiedades deseables: (1) es positiva, (2) tiende a cero muy rápidamente (por lo que no dividimos por cero) y (3) tiene una cola larga. Para traducir la intuición de la escala de longitud en los parámetros gamma inversos, podemos utilizar una función muy útil que maximiza la entropía (para una excelente explicación y motivación de la entropía máxima, consulte el Capítulo 10 en [Statistical Rethinking](https://xcelab.net/rm/)) de la distribución dentro de un intervalo esperado dado:

source: We also need to specify the amplitude of the Gaussian process. The default prior distribution in in PyMC-Marketing is an exponential distribution (note it has to be positive) As we are scaling the data, a good default is set this to one.
es: También necesitamos especificar la amplitud del proceso gaussiano. La distribución a priori predeterminada en PyMC-Marketing es una distribución exponencial (tenga en cuenta que debe ser positiva). Dado que estamos escalando los datos, un buen valor predeterminado es establecer esto en uno.

source: We can now encode these parameters into a {class}`HSGPKwargs <pymc_marketing.hsgp_kwargs.HSGPKwargs>` object.
es: Ahora podemos codificar estos parámetros en un objeto {class}`HSGPKwargs <pymc_marketing.hsgp_kwargs.HSGPKwargs>`.

source: Media Mix Model Prior Configuration
es: Configuración previa del modelo de mezcla de medios

source: We can do similar analysis for the rest of the components and pass our custom priors to the {class}`MMM <pymc_marketing.mmm.mmm.MMM>` class as a dictionary configuration.
es: Podemos realizar un análisis similar para el resto de los componentes y pasar nuestros priors personalizados a la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>` como una configuración de diccionario.

source: Having the configuration, we can now initialize the model object:
es: Teniendo la configuración, ahora podemos inicializar el objeto del modelo:

source: With the model initialized, we can now sample from the prior predictive distribution.
es: Con el modelo inicializado, ahora podemos muestrear de la distribución predictiva a priori.

source: Let's start by looking into the expected sales (remember this is before fitting the model).
es: Comencemos por analizar las ventas esperadas (recuerde que esto es antes de ajustar el modelo).

source: The range covers our seen data and it ios in the same order of magnitude (tenths). The prior predictive mean is very correlated with the observed data. This can be explained by the fact that the, in this particular example, we are setting tied priors for the media parameters and the media variables are hte ones will explain most of the variance in the data.
es: El rango abarca nuestros datos observados y está en el mismo orden de magnitud (décimas). La media predictiva previa está muy correlacionada con los datos observados. Esto puede explicarse por el hecho de que, en este ejemplo particular, estamos estableciendo priors atados para los parámetros de la media y las variables de la media son las que explicarán la mayor parte de la varianza en los datos.

source: It is always good to look the Gaussian process components:
es: Siempre es bueno observar los componentes del proceso gaussiano:

source: We confirm that the level of fluctuations is tin the order of months, as expected.
es: Confirmamos que el nivel de fluctuaciones está en el orden de meses, como se esperaba.

source: Next, we can look into the channel ROAS, which is what we want to understand. We simply compute them by dividing the channel contribution by the spend.
es: A continuación, podemos analizar el ROAS del canal, que es lo que queremos entender. Simplemente los calculamos dividiendo la contribución del canal por el gasto.

source: As expected, the ROAS are positive! Moreover, for our particular case, the set of plausible values are very reasonable (as we own the simulation 😉). We can not stress enough how important this step is! If the expected ROAS are not reasonable, before seeing the data it is most likely that the model will not fit the data well. Also, conceptually the model would be very flawed. So if you take anything from this notebook, please always do prior predictive checks on the quantities you want to infer 🙂.
es: Como era de esperar, ¡los ROAS son positivos! Además, para nuestro caso particular, el conjunto de valores plausibles es muy razonable (ya que poseemos la simulación 😉). No podemos enfatizar lo suficiente cuán importante es este paso. Si los ROAS esperados no son razonables, antes de ver los datos, es muy probable que el modelo no se ajuste bien a los datos. Además, conceptualmente, el modelo estaría muy defectuoso. Así que, si hay algo que debes llevarte de este cuaderno, por favor, siempre realiza verificaciones predictivas previas sobre las cantidades que deseas inferir 🙂.

source: There is a little detail regarding the computation of the ROAS as we are not considering the adstock contributions and we should be more precise about the time intervals, see formula (10) in ["Bayesian Methods for Media Mix Modeling with Carryover and Shape Effects"](https://research.google/pubs/bayesian-methods-for-media-mix-modeling-with-carryover-and-shape-effects/). We do not want to get lost in details here because our goal is to show the prior predictive sampling and we expect this small correction to have little impact on this example.
es: Hay un pequeño detalle respecto al cálculo del ROAS, ya que no estamos considerando las contribuciones del adstock y deberíamos ser más precisos sobre los intervalos de tiempo, ver fórmula (10) en ["Métodos Bayesianos para la Modelización de Mezclas de Medios con Efectos de Continuidad y Forma"](https://research.google/pubs/bayesian-methods-for-media-mix-modeling-with-carryover-and-shape-effects/). No queremos perdernos en detalles aquí porque nuestro objetivo es mostrar el muestreo predictivo previo y esperamos que esta pequeña corrección tenga poco impacto en este ejemplo.

source: Model Fit
es: Ajuste del modelo

source: We are ready to fit the model to the data.
es: Estamos listos para ajustar el modelo a los datos.

source: For more model diagnostics and error analysis, please refer to the {ref}`mmm_example` notebook.
es: Para obtener más diagnósticos del modelo y análisis de errores, consulte el cuaderno {ref}`mmm_example`.

source: Finally, we can look into the posterior predictive distribution.
es: Finalmente, podemos analizar la distribución predictiva posterior.

source: The fitted sales data looks very good!
es: Los datos de ventas ajustados se ven muy bien.

source: We can not look into the model components:
es: No podemos examinar los componentes del modelo:

source: Wee see how the model has captured a mild trend and a nice yearly seasonality component. The results look very consistent with the {ref}`mmm_example` notebook.
es: Vemos cómo el modelo ha capturado una leve tendencia y un agradable componente de estacionalidad anual. Los resultados son muy consistentes con el cuaderno {ref}`mmm_example`.

source: Let's look into the channel ROAS.
es: Analicemos el ROAS del canal.

source: These are the same as the one obtained in the {ref}`mmm_example` notebook (and therefore close to the true values).
es: Estos son los mismos que los obtenidos en el cuaderno {ref}`mmm_example` (y, por lo tanto, cercanos a los valores verdaderos).

source: A final tip is to compare the prior and posterior ROAS distributions. This can help us to understand the impact of the data on the parameters.
es: Un consejo final es comparar las distribuciones de ROAS anteriores y posteriores. Esto puede ayudarnos a entender el impacto de los datos en los parámetros.

source: We clearly see how the data has shrunk the prior distribution to have a finer posterior estimate.
es: Vemos claramente cómo los datos han reducido la distribución previa para tener una estimación posterior más precisa.

source: We can use lift tests to calibrate our model in PyMC-Marketing using an additional calibration likelihood as explained in {ref}`mmm_lift_test`. This way we do not need to "guess" the media parameters to constrain the model to match the expected range from lift tests.
es: Podemos utilizar pruebas de lift para calibrar nuestro modelo en PyMC-Marketing utilizando una probabilidad de calibración adicional como se explica en {ref}`mmm_lift_test`. De esta manera, no necesitamos "adivinar" los parámetros de los medios para restringir el modelo a que coincida con el rango esperado de las pruebas de lift.

source: An alternative approach is to parametrize the model using the ROAS directly, as suggested in ["Media Mix Model Calibration With Bayesian Priors"](https://research.google/pubs/media-mix-model-calibration-with-bayesian-priors/). Please find more details on these approaches in the example notebook {ref}`mmm_roas`.
es: Un enfoque alternativo es parametrizar el modelo utilizando directamente el ROAS, como se sugiere en ["Calibración del Modelo de Mezcla de Medios con Priors Bayesianos"](https://research.google/pubs/media-mix-model-calibration-with-bayesian-priors/). Por favor, encuentre más detalles sobre estos enfoques en el cuaderno de ejemplo {ref}`mmm_roas`.

source: Key Takeaways
es: Conclusiones clave

source: Prior predictive modeling helps us validate our model assumptions before using real data
es: La modelización predictiva previa nos ayuda a validar nuestras suposiciones del modelo antes de utilizar datos reales.

source: The {class}`Prior <pymc_extras.prior.prior.Prior>` class provides a convenient interface for:
es: La clase {class}`Prior <pymc_extras.prior.prior.Prior>` proporciona una interfaz conveniente para:

source: Creating and visualizing prior distributions
es: Creando y visualizando distribuciones a priori

source: Sampling from prior predictive distributions
es: Muestreo de distribuciones predictivas anteriores

source: Always visualize your prior predictive distributions to ensure they align with your domain knowledge
es: Siempre visualice sus distribuciones predictivas anteriores para asegurarse de que se alineen con su conocimiento del dominio.

source: Common Pitfalls and Best Practices
es: Errores Comunes y Mejores Prácticas

source: **Always Check Your Scales**
es: **Siempre Verifique Sus Escalas**

source: Make sure your priors are on the right scale for your data
es: Asegúrese de que sus priors estén en la escala correcta para sus datos.

source: Use domain knowledge to set reasonable bounds
es: Utilice el conocimiento del dominio para establecer límites razonables.

source: **Constraint Considerations**
es: **Consideraciones sobre las restricciones**

source: Use constraints when you have clear bounds (e.g., rates between 0 and 1)
es: Utilice restricciones cuando tenga límites claros (por ejemplo, tasas entre 0 y 1)

source: Be careful not to over-constrain your priors
es: Tenga cuidado de no sobreconstruir sus priors.

source: **Visualization is Key**
es: **La visualización es clave**

source: Always plot your prior distributions
es: Siempre grafique sus distribuciones previas

source: Check prior predictive samples against domain knowledge
es: Verifique las muestras predictivas anteriores en comparación con el conocimiento del dominio.

source: The main takeaway from this notebook is that prior predictive checks are a fundamental component of the modeling workflow and it should **never** be skipped. Observe that the prior predictive analysis enables the modeler to model even without using data. This is a great superpower to use simulations to challenge the model assumptions.
es: La conclusión principal de este cuaderno es que las verificaciones predictivas previas son un componente fundamental del flujo de trabajo de modelado y **nunca** deben ser omitidas. Observe que el análisis predictivo previo permite al modelador realizar modelados incluso sin utilizar datos. Este es un gran superpoder para usar simulaciones que desafíen las suposiciones del modelo.

source: Where to learn more? There are many great resources online. A great reference is the [Stan: Prior Choice Recommendations Guide](https://github.com/stan-dev/stan/wiki/prior-choice-recommendations). Here you can find great tips and additional references on how to set priors.
es: ¿Dónde aprender más? Hay muchos recursos excelentes en línea. Una gran referencia es la [Guía de Recomendaciones de Elección de Priors de Stan](https://github.com/stan-dev/stan/wiki/prior-choice-recommendations). Aquí puedes encontrar excelentes consejos y referencias adicionales sobre cómo establecer priors.
