Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/customer_choice/mv_its_unsaturated.po
Languages: es

source: Multivariate ITS model for unsaturated markets
es: Modelo ITS multivariado para mercados no saturados

source: This notebook showcases how to use the Multivariate Interrupted Time Series (MVITS) model to estimate where new product sales came from in the case of an unsaturated market. That is, when a new product can lead to (some) reductions in sales of existing products, but some of the new product sales are in the form of growing the market.
es: Este cuaderno muestra cómo utilizar el modelo de Series de Tiempo Interrumpidas Multivariadas (MVITS) para estimar de dónde provienen las ventas de nuevos productos en el caso de un mercado no saturado. Es decir, cuando un nuevo producto puede provocar (algunas) reducciones en las ventas de productos existentes, pero algunas de las ventas del nuevo producto se dan en forma de crecimiento del mercado.

source: We will also see a scenario like this which the MVITS model is (at least currently) not able to handle. It is important to be aware of the limitations of the model and whether your dataset fits the assumptions of the model.
es: También veremos un escenario como este que el modelo MVITS no puede manejar (al menos actualmente). Es importante ser consciente de las limitaciones del modelo y de si su conjunto de datos se ajusta a las suposiciones del modelo.

source: Notebook setup
es: Configuración del cuaderno

source: An unsaturated market example
es: Un ejemplo de mercado no saturado

source: Let's explore a situation where a new product is released, and it sells reasonably well. _Some_ of those new product sales are coming from existing products, but _some_ are coming from new customers.
es: Exploremos una situación en la que se lanza un nuevo producto y se vende razonablemente bien. _Algunas_ de esas ventas del nuevo producto provienen de productos existentes, pero _algunas_ provienen de nuevos clientes.

source: So the total sales increase, but importantly, those additional sales are directed to the new product. This is likely a pretty common scenario in the real world. A new product is released and perhaps it is far better than existing products. So if it sells 1000 units, then some of those sales will be 'taken' from sales of existing products, but the new product is so good that it attracts new customers that would not have purchased any of the existing products. This could happen if the new product falls below a psychologically significant price point, or is associated with new marketing, or simply has a new feature that attracts new customers.
es: Así que el aumento total de ventas, pero lo importante es que esas ventas adicionales se dirigen al nuevo producto. Este es probablemente un escenario bastante común en el mundo real. Se lanza un nuevo producto y quizás sea mucho mejor que los productos existentes. Así que si se venden 1000 unidades, algunas de esas ventas serán 'tomadas' de las ventas de productos existentes, pero el nuevo producto es tan bueno que atrae a nuevos clientes que no habrían comprado ninguno de los productos existentes. Esto podría suceder si el nuevo producto cae por debajo de un punto de precio psicológicamente significativo, o si está asociado con un nuevo marketing, o simplemente tiene una nueva característica que atrae a nuevos clientes.

source: So the key properties of this example are:
es: Las propiedades clave de este ejemplo son:

source: The total sales increase when the new product is released.
es: El aumento total de ventas se produce cuando se lanza el nuevo producto.

source: Some of the new product sales come from existing products. We can tell this because a) the existing products' sales decrease, and b) the new product's sales are greater than the decrease in existing products' sales.
es: Algunas de las ventas del nuevo producto provienen de productos existentes. Podemos deducir esto porque a) las ventas de los productos existentes disminuyen, y b) las ventas del nuevo producto son mayores que la disminución en las ventas de los productos existentes.

source: The absolute sales numbers for existing products decrease. This is one of the key assumptions of the MVITS model.
es: Los números de ventas absolutos de los productos existentes disminuyen. Esta es una de las suposiciones clave del modelo MVITS.

source: We can see that the model does a reasonable job of accounting for the data in that it capures the pre-introduction sales levels and the reduction in sales at the point the new product is introduced.
es: Podemos ver que el modelo hace un trabajo razonable al tener en cuenta los datos, ya que captura los niveles de ventas previos a la introducción y la reducción en las ventas en el momento en que se introduce el nuevo producto.

source: The counterfactual plot also looks good. The model estimates the counterfactual sales of the existing products would have continued as they were from before the new product was introduced.
es: El gráfico contrafactual también se ve bien. El modelo estima que las ventas contrafactuales de los productos existentes habrían continuado como estaban antes de la introducción del nuevo producto.

source: The model shows that introduction of the new product caused a decline in the sales of existing products.
es: El modelo muestra que la introducción del nuevo producto causó una disminución en las ventas de los productos existentes.

source: And looking at the $\beta$ parameters, we can see:
es: Y al observar los parámetros $\beta$, podemos ver:

source: `beta_all[competitor]` shows that about 33% of the new product sales are incremental, in that they are taken from competitor sales.
es: `beta_all[competitor]` muestra que aproximadamente el 33% de las ventas del nuevo producto son incrementales, en el sentido de que se toman de las ventas de los competidores.

source: `beta_all[own]` shows that about 27% of the new product sales are cannibalisations, in that they are taken from your own companies existing product sales.
es: `beta_all[own]` muestra que aproximadamente el 27% de las ventas del nuevo producto son canibalizaciones, en el sentido de que se toman de las ventas de productos existentes de su propia empresa.

source: `beta_all[new]` shows that about 40% of the new product sales are from growing the market.
es: `beta_all[new]` muestra que aproximadamente el 40% de las ventas del nuevo producto provienen del crecimiento del mercado.

source: Beta variables
es: Variables beta

source: When we model unsaturated markets using the `saturated_market=False` kwarg in the MVITS model, we need to use the `beta_all` variable, not the `beta` variable.
es: Cuando modelamos mercados no saturados utilizando el argumento `saturated_market=False` en el modelo MVITS, necesitamos usar la variable `beta_all`, no la variable `beta`.

source: Limits to the MVITS model
es: Límites del modelo MVITS

source: In this section we will explore a scenario which the MVITS is incapable of modeling, at least in its current form. Namely, it cannot deal with situations where the sales of existing products _increase_ after the introduction of the new product. This is because the MVITS model assumes that the sales of existing products are constant over time, and that the new product only affects the sales of the existing products negatively.
es: En esta sección exploraremos un escenario que el MVITS es incapaz de modelar, al menos en su forma actual. Es decir, no puede manejar situaciones en las que las ventas de productos existentes _aumentan_ después de la introducción del nuevo producto. Esto se debe a que el modelo MVITS asume que las ventas de los productos existentes son constantes a lo largo del tiempo y que el nuevo producto solo afecta negativamente las ventas de los productos existentes.

source: Warning
es: Advertencia

source: This section is meant to demonstrate a data scenario that the MVITS is _not_ capable of modeling well. At least, not in its current form.
es: Esta sección tiene como objetivo demostrar un escenario de datos que el MVITS _no_ es capaz de modelar bien. Al menos, no en su forma actual.

source: In this scenario:
es: En este escenario:

source: The market share of competitor products starts at 70% and reduces to 65% when the new product is introduced.
es: La cuota de mercado de los productos de la competencia comienza en 70% y se reduce a 65% cuando se introduce el nuevo producto.

source: The market share of our own company products starts at 30% and reduces to 25% when the new product is introduced.
es: La cuota de mercado de nuestros propios productos comienza en un 30% y se reduce al 25% cuando se introduce el nuevo producto.

source: The new product gains 10% market share when it is introduced.
es: El nuevo producto gana un 10% de cuota de mercado cuando se introduce.

source: However, the introduction of the new product also increases the total size of the market from 1000 to 1400 units on average.
es: Sin embargo, la introducción del nuevo producto también aumenta el tamaño total del mercado de 1000 a 1400 unidades en promedio.

source: This means that while the market shares of the existing products are reduced, their sales actually increase.
es: Esto significa que, aunque las cuotas de mercado de los productos existentes se reducen, sus ventas en realidad aumentan.

source: It is this increase in sales numbers that the MV-ITS model (as currently implemented) cannot handle.
es: Es este aumento en los números de ventas que el modelo MV-ITS (tal como está implementado actualmente) no puede manejar.

source: Let's explore how this fails.
es: Exploremos cómo esto falla.

source: First, we can see that the model does not do a good job of accounting for the data. The posterior predictive checks show that the model is not accurately capturing the sales data prior to the new product introduction.
es: Primero, podemos ver que el modelo no hace un buen trabajo al contabilizar los datos. Las verificaciones predictivas posteriores muestran que el modelo no está capturando con precisión los datos de ventas antes de la introducción del nuevo producto.

source: Equally, the counterfactual predictions are poor in that they do not represent what we'd expect to see. Namely, we'd expect the relatively constant sales numbers to continue on as they were after the new product was introduced.
es: Igualmente, las predicciones contrafactuales son deficientes en el sentido de que no representan lo que esperaríamos ver. Es decir, esperaríamos que los números de ventas relativamente constantes continuaran como estaban después de la introducción del nuevo producto.

source: If we examine the parameters (in the unsaturated market case we examine `beta_all`, not `beta`) we can see that the model attributes a near zero reduction in the existing competitor and own company products. There is no reduction of course, the sales numbers actually _increased_ despite the market share decreasing.
es: Si examinamos los parámetros (en el caso del mercado no saturado examinamos `beta_all`, no `beta`), podemos ver que el modelo atribuye una reducción casi nula en los productos de la empresa competidora existente y de la propia empresa. No hay reducción, por supuesto, los números de ventas en realidad _aumentaron_ a pesar de que la cuota de mercado disminuyó.
