Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/customer_choice/mv_its_saturated.po
Languages: es

source: So we have seen how it is possible to extend the simplified "our" versus "competitor" analysis to a more detailed analysis of individual products. This is more realistic, but it is still a quite simple scenario. In the real world we would likely have to deal with more complex data, and the MVITS model may not be able to handle these complexities.
es: Así que hemos visto cómo es posible extender el análisis simplificado de "nuestro" frente a "competidor" a un análisis más detallado de productos individuales. Esto es más realista, pero sigue siendo un escenario bastante simple. En el mundo real, probablemente tendríamos que lidiar con datos más complejos, y el modelo MVITS puede que no sea capaz de manejar estas complejidades.
