Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/customer_choice/nested_logit.po
Languages: es

source: Nested Logit and Non-Proportional Patterns of Substitution
es: Logit anidado y patrones de sustitución no proporcionales

source: In this notebook we will re-use the same heating choice data set seen in the Multinomial Logit example and apply a few different specifications of a nested logit model.
es: En este cuaderno reutilizaremos el mismo conjunto de datos de elección de calefacción visto en el ejemplo de Logit Multinomial y aplicaremos algunas especificaciones diferentes de un modelo de logit anidado.

source: Single Layer Nesting
es: Anidamiento de Capa Única

source: The important addition gained through the nested logit specification is the ability to specify "nests" of products in this way we can partition the market into "natural" groups of competing products ensuring that there is an inherent bias in the model towards a selective pattern of preference. As before we specify the models using formulas, but now we also add a nesting structure.
es: La importante adición obtenida a través de la especificación de logit anidado es la capacidad de especificar "nidos" de productos; de esta manera, podemos dividir el mercado en grupos "naturales" de productos en competencia, asegurando que haya un sesgo inherente en el modelo hacia un patrón selectivo de preferencia. Como antes, especificamos los modelos utilizando fórmulas, pero ahora también añadimos una estructura de anidamiento.

source: We will dwell a bit on the manner in which these nests are specified and why. The nested logit model partitions the choice set into nests of alternatives that share common unobserved attributes (i.e., are more similar to each other). It computes the overall probability of choosing an alternative as the product of (1) The probability of choosing a nest (marginal probability), and (2) the probability of choosing an alternative within that nest (conditional probability, given that nest). In our case we want to isolate the probability of choosing a central heatings system and a room based heating system.
es: Nos detendremos un poco en la manera en que se especifican estos nidos y por qué. El modelo logit anidado divide el conjunto de opciones en nidos de alternativas que comparten atributos no observados comunes (es decir, son más similares entre sí). Calcula la probabilidad total de elegir una alternativa como el producto de (1) la probabilidad de elegir un nido (probabilidad marginal), y (2) la probabilidad de elegir una alternativa dentro de ese nido (probabilidad condicional, dado ese nido). En nuestro caso, queremos aislar la probabilidad de elegir un sistema de calefacción central y un sistema de calefacción por habitación.

source: Each of the alternatives `alt` is indexed to a nest. So that we can determine (§) the marginal probability of choosing `room` or `central` and (2) conditional probability of choosing `ec` given that you have chosen `central`. Our utilities are decomposed into contributions from fixed_covariates and alternative specific covariates:
es: Cada una de las alternativas `alt` está indexada a un nido. De modo que podemos determinar (§) la probabilidad marginal de elegir `room` o `central` y (2) la probabilidad condicional de elegir `ec` dado que ha elegido `central`. Nuestras utilidades se descomponen en contribuciones de fixed_covariates y covariables específicas de la alternativa:

source: and the probabilities are derived from these decomposed utilitiies in the following manner.
es: y las probabilidades se derivan de estas utilidades descompuestas de la siguiente manera.

source: P(i) = P(\text{choose nest B}) \cdot P(\text{choose i} | \text{ i} \in \text{B})
es: msgid: P(i) = P(\text{choose nest B}) \cdot P(\text{choose i} | \text{ i} \in \text{B}) msgstr: P(i) = P(\text{choose nest B}) \cdot P(\text{choose i} | \text{ i} \in \text{B})

source: where
es: donde

source: and
es: y

source: while the inclusive term $I_{k}$ is:
es: mientras que el término inclusivo $I_{k}$ es:

source: such that $I_{k}$ is used to "aggregate" utilities within a nest a "bubble up" their contribution to decision through the product of the marginal and conditional probabilities. More extensive details of this mathematical formulation can be found in Kenneth Train's "Discrete Choice Methods with Simulation".
es: de tal manera que $I_{k}$ se utiliza para "agregar" utilidades dentro de un nido y "elevar" su contribución a la decisión a través del producto de las probabilidades marginales y condicionales. Detalles más extensos de esta formulación matemática se pueden encontrar en "Discrete Choice Methods with Simulation" de Kenneth Train.

source: The model structure is quite a bit more complicated now than the simpler multinomial logit as we need to calculate the marginal and conditional probabilities within each of the nests seperately and then "bubble up" the probabilies as a product over the branching nests. These probabilities are deterministic functions of the summed utilities and are then fed into our categorical likelihood to calibrate our parameters against the observed data.
es: La estructura del modelo es considerablemente más complicada ahora que el logit multinomial más simple, ya que necesitamos calcular las probabilidades marginales y condicionales dentro de cada uno de los nidos por separado y luego "elevar" las probabilidades como un producto sobre los nidos ramificados. Estas probabilidades son funciones deterministas de las utilidades sumadas y luego se introducen en nuestra verosimilitud categórica para calibrar nuestros parámetros en función de los datos observados.

source: But again we are able to derive parameter estimates for the drivers of consumer choice and consult the model implications is in a standard Bayesian model.
es: Pero nuevamente podemos derivar estimaciones de parámetros para los factores que influyen en la elección del consumidor y consultar las implicaciones del modelo en un modelo bayesiano estándar.

source: Here we see additionally lambda parameters for each of the nests. These terms measure how strongly correlated the unobserved utility components are for alternatives within the same nest. Closer to 0 indicates a high correlation, substitution happens mostly within the nest. Whereas a value closer to 1 implies lower within nest correlation suggesting IIA approximately holds within the nest. The options available for structuring a market can be quite extensive. As we might have "nests within nests" where the conditional probabilities flow through successive choices within segments of the market.
es: Aquí vemos además los parámetros lambda para cada uno de los nidos. Estos términos miden cuán fuertemente correlacionados están los componentes de utilidad no observados para las alternativas dentro del mismo nido. Un valor más cercano a 0 indica una alta correlación, la sustitución ocurre principalmente dentro del nido. Mientras que un valor más cercano a 1 implica una menor correlación dentro del nido, sugiriendo que la IIA se mantiene aproximadamente dentro del nido. Las opciones disponibles para estructurar un mercado pueden ser bastante extensas. Como podríamos tener "nidos dentro de nidos" donde las probabilidades condicionales fluyen a través de elecciones sucesivas dentro de segmentos del mercado.

source: Two Layer Nesting
es: Dos capas de anidación

source: In this PyMC marketing implementation we allow for the specification of a two-layer nesting representing succesive choices over a root nest and then nests within the child nests.
es: En esta implementación de marketing de PyMC, permitimos la especificación de un anidamiento de dos capas que representa elecciones sucesivas sobre un nido raíz y luego nidos dentro de los nidos hijos.

source: Again the parameter estimates seem to be recovered sensibly on the beta coefficients, but the question remains as to whether this additional nesting structure will help support plausible counterfactual reasoning. Note how the model struggles to identify the the intercept terms and places weight on
es: Nuevamente, las estimaciones de los parámetros parecen recuperarse de manera sensata en los coeficientes beta, pero la pregunta sigue siendo si esta estructura de anidamiento adicional ayudará a respaldar un razonamiento contrafactual plausible. Observe cómo el modelo tiene dificultades para identificar los términos de intercepción y coloca peso en

source: Both models seem to recover posterior predictive distributions well, but vary slightly in the estimate parameters. Let's check the counterfactual inferences.
es: Ambos modelos parecen recuperar bien las distribuciones predictivas posteriores, pero varían ligeramente en los parámetros estimados. Verifiquemos las inferencias contrafactuales.

source: Making Interventions in Structured Markets
es: Realizando intervenciones en mercados estructurados

source: Here we can see that both nesting structures recover non-proportional patterns of product substitution. We have elided the IIA feature of the multinomial logit and can continue to assess whether or not the behaviour implications of these utility theory makes sense.
es: Aquí podemos ver que ambas estructuras de anidamiento recuperan patrones de sustitución de productos no proporcionales. Hemos elidido la característica IIA del logit multinomial y podemos continuar evaluando si las implicaciones de comportamiento de esta teoría de la utilidad tienen sentido.

source: Visualising the Substitution Patterns
es: Visualizando los Patrones de Sustitución

source: We can additionally test counterfactuals about the removal of products from the market.
es: msgid: We can additionally test counterfactuals about the removal of products from the market. msgstr: También podemos probar contrafactuales sobre la eliminación de productos del mercado.

source: A Different Market
es: Un Mercado Diferente

source: Let's now briefly look at a different market that highlights a limitation of the nested logit model.
es: Veamos ahora brevemente un mercado diferente que destaca una limitación del modelo logit anidado.

source: This model suggests plausibly that price increases have a strongly negative effect of the purchase probability of crackers. However, we should note that we're ignoring information when we use the nested logit in this context. The data set records multiple purchasing decisions for each individual and by failing to model this fact we lose insight into individual heterogeneity in their responses to price shifts. To gain more insight into this aspect of the purchasing decisions of individuals we might augment our model with hierarchical components or switch to alternative Mixed logit model.
es: Este modelo sugiere de manera plausible que los aumentos de precio tienen un efecto negativamente fuerte en la probabilidad de compra de galletas. Sin embargo, debemos señalar que estamos ignorando información al utilizar el logit anidado en este contexto. El conjunto de datos registra múltiples decisiones de compra para cada individuo y, al no modelar este hecho, perdemos información sobre la heterogeneidad individual en sus respuestas a los cambios de precio. Para obtener más información sobre este aspecto de las decisiones de compra de los individuos, podríamos aumentar nuestro modelo con componentes jerárquicos o cambiar a un modelo logit mixto alternativo.

source: Choosing a Market Structure
es: Eligiendo una Estructura de Mercado

source: Causal inference is hard and predicting the counterfactual actions of agents in a competitive market is very hard. There is no guarantee that a nested logit model will accurately represent the choice of any particular agent, but you can be hopeful that it highlights expected patterns of choice when the nesting structure reflects the natural segmentation of a market. Nests should group alternatives that share unobserved similarities, ideally driven by a transparent theory of the market structure. Well-specified nests should show stronger substitution within nests than across nests, and you can inspect the substitution patterns as above. Ideally you can always try and hold out some test data to evaluate the implications of your fitted model. Discrete choice models are causal inference models and their structural specification should support generalisable inference across future and counterfactual situations.
es: La inferencia causal es difícil y predecir las acciones contrafactuales de los agentes en un mercado competitivo es muy complicado. No hay garantía de que un modelo logit anidado represente con precisión la elección de un agente en particular, pero se puede tener la esperanza de que resalte patrones de elección esperados cuando la estructura de anidamiento refleja la segmentación natural de un mercado. Los nidos deberían agrupar alternativas que compartan similitudes no observadas, idealmente impulsadas por una teoría transparente de la estructura del mercado. Los nidos bien especificados deberían mostrar una mayor sustitución dentro de los nidos que entre nidos, y se pueden inspeccionar los patrones de sustitución como se mencionó anteriormente. Idealmente, siempre se puede intentar reservar algunos datos de prueba para evaluar las implicaciones de su modelo ajustado. Los modelos de elección discreta son modelos de inferencia causal y su especificación estructural debería respaldar inferencias generalizables en situaciones futuras y contrafactuales.
