Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModelIndividual.save.po
Languages: es

source: ShiftedBetaGeoModelIndividual.save
es: ShiftedBetaGeoModelIndividual.guardar

source: Save the model's inference data to a file.
es: Guarde los datos de inferencia del modelo en un archivo.

source: Parameters
es: Parámetros

source: The name and path of the file to save the inference data with model parameters.
es: El nombre y la ruta del archivo para guardar los datos de inferencia con los parámetros del modelo.

source: Additional keyword arguments to pass to arviz.InferenceData.to_netcdf(). Common options include: - engine : str, optional (default "netcdf4")
es: Argumentos de palabras clave adicionales para pasar a arviz.InferenceData.to_netcdf(). Las opciones comunes incluyen: - engine : str, opcional (predeterminado "netcdf4")

source: Library to use for writing files.
es: Biblioteca para usar para escribir archivos.

source: groups
es: grupos

source: list of str, optional
es: lista de str, opcional

source: Groups to save to netcdf. If None, all groups are saved.
es: Grupos para guardar en netcdf. Si es None, se guardan todos los grupos.

source: Returns
es: Devoluciones

source: Raises
es: Aumentos

source: If the model hasn't been fit yet (no inference data available).
es: Si el modelo aún no ha sido ajustado (no hay datos de inferencia disponibles).

source: Examples
es: Ejemplos

source: This method is meant to be overridden and implemented by subclasses. It should not be called directly on the base abstract class or its instances.
es: Este método está destinado a ser sobrescrito e implementado por las subclases. No debe ser llamado directamente en la clase abstracta base o en sus instancias.
