Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_probability_alive.po
Languages: es

source: ShiftedBetaGeoModel.expected\_probability\_alive
es: { "singular": "ShiftedBetaGeoModel.expected_probabilidad_viva", "plural": "ShiftedBetaGeoModel.expected_probabilidad_vivas" }

source: Compute expected probability of contract renewal by cohort.
es: { "singular": "Calcule la probabilidad esperada de renovación del contrato por cohorte.", "plural": "Calcule la probabilidad esperada de renovación de los contratos por cohortes." }

source: The *data* parameter is only required for out-of-sample customers.
es: { "singular": { "msgid": "The *data* parameter is only required for out-of-sample customers.", "msgstr": "El parámetro *data* solo es necesario para clientes fuera de muestra." }, "plural": { "msgid": "The *data* parameter is only required for out-of-sample customers.", "msgstr": "El parámetro *data* solo es necesario para clientes fuera de muestra." } }

source: Adapted from equation (6) in [Rd106291fdaca-1]_.
es: { "singular": "Adaptado de la ecuación (6) en [Rd106291fdaca-1]_.", "plural": "Adaptado de la ecuación (6) en [Rd106291fdaca-1]_." }

source: Parameters
es: { "singular": { "msgid": "Parameters", "msgstr": "Parámetro" }, "plural": { "msgid": "Parameters", "msgstr": "Parámetros" } }

source: **future_t** : :class:`python:int`, :term:`numpy:array_like`
es: { "singular": "**future_t** : :class:`python:int`, :term:`numpy:array_like`", "plural": "**future_t** : :class:`python:int`, :term:`numpy:array_like`" }

source: python:int, numpy:array_like
es: { "singular": "python:int, numpy:array_like", "plural": "python:int, numpy:array_like" }

source: Number of time periods in the future to predict probability of being active.
es: { "singular": "Número de períodos de tiempo en el futuro para predecir la probabilidad de estar activo.", "plural": "Número de períodos de tiempo en el futuro para predecir la probabilidad de estar activos." }

source: **data** : :obj:`~pandas.DataFrame`
es: { "singular": "**datos** : :obj:`~pandas.DataFrame`", "plural": "**datos** : :obj:`~pandas.DataFrame`" }

source: DataFrame
es: { "singular": "DataFrame", "plural": "DataFrames" }

source: Optional dataframe containing the following columns: * `customer_id`: Unique customer identifier * `T`: Number of time periods customer has been active * `cohort`: Customer cohort label
es: { "singular": "Dataframe opcional que contiene las siguientes columnas: * `customer_id`: Identificador único del cliente * `T`: Número de períodos de tiempo en los que el cliente ha estado activo * `cohort`: Etiqueta de cohorte del cliente", "plural": "Dataframes opcionales que contienen las siguientes columnas: * `customer_id`: Identificadores únicos de los clientes * `T`: Números de períodos de tiempo en los que los clientes han estado activos * `cohort`: Etiquetas de cohortes de los clientes" }

source: References
es: { "singular": "Referencia", "plural": "Referencias" }

source: Fader, P. S., & Hardie, B. G. (2007). How to project customer retention. Journal of Interactive Marketing, 21(1), 76-90. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf
es: { "singular": "Fader, P. S., & Hardie, B. G. (2007). Cómo proyectar la retención de clientes. Journal of Interactive Marketing, 21(1), 76-90. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf", "plural": "Fader, P. S., & Hardie, B. G. (2007). Cómo proyectar la retención de clientes. Journal of Interactive Marketing, 21(1), 76-90. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf" }

source: [Rd106291fdaca-1]_
es: { "singular": "[Rd106291fdaca-1]_", "plural": "[Rd106291fdaca-1]_" }
