Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.data.fivetran.FivetranAccessor.process_ad_reporting.po
Languages: es

source: FivetranAccessor.process\_ad\_reporting
es: FivetranAccessor.procesar\_informe\_publicitario

source: Process Fivetran Ad Reporting tables into wide, model-ready features.
es: Procesar las tablas de informes de Fivetran en características amplias y listas para el modelo.

source: Compatible with Fivetran's Ad Reporting schema tables:
es: Compatible con las tablas del esquema de informes de anuncios de Fivetran:

source: ad_reporting__account_report: daily metrics by account
es: ad_reporting__account_report: métricas diarias por cuenta

source: ad_reporting__campaign_report: daily metrics by campaign and account
es: ad_reporting__campaign_report: métricas diarias por campaña y cuenta

source: ad_reporting__ad_group_report: daily metrics by ad group, campaign and account
es: ad_reporting__ad_group_report: métricas diarias por grupo de anuncios, campaña y cuenta

source: ad_reporting__ad_report: daily metrics by ad, ad group, campaign and account
es: ad_reporting__ad_report: métricas diarias por anuncio, grupo de anuncios, campaña y cuenta

source: The input data must include a date column, a platform column (e.g., vendor name), and one or more metric columns such as ``spend`` or ``impressions``. The output is a wide dataframe with one row per date and columns named ``{platform}_{metric}``.
es: Los datos de entrada deben incluir una columna de fecha, una columna de plataforma (por ejemplo, nombre del proveedor) y una o más columnas de métricas como ``gasto`` o ``impresiones``. La salida es un dataframe amplio con una fila por fecha y columnas nombradas ``{platform}_{metric}``.

source: Parameters
es: Parámetros

source: Input dataframe in long format with at least the date, platform, and metric columns.
es: Entrada de dataframe en formato largo con al menos las columnas de fecha, plataforma y métrica.

source: **value_columns** : :class:`python:str` or :obj:`Sequence`\[:class:`python:str`], default "impressions"
es: **value_columns** : :class:`python:str` o :obj:`Sequence`\[:class:`python:str`], predeterminado "impressions"

source: python:str or Sequence[python:str], default "impressions"
es: python:str o Secuencia[python:str], predeterminado "impressions"

source: Column name(s) to aggregate and pivot. Example: "spend" or ["spend", "impressions"].
es: Nombre(s) de columna para agregar y pivotar. Ejemplo: "spend" o ["spend", "impressions"].

source: **date_col** : :class:`python:str`, default "date_day"
es: **date_col** : :class:`python:str`, predeterminado "date_day"

source: python:str, default "date_day"
es: python:str, predeterminado "date_day"

source: Name of the date column.
es: Nombre de la columna de fecha.

source: **platform_col** : :class:`python:str`, default "platform"
es: **platform_col** : :class:`python:str`, predeterminado "platform"

source: python:str, default "platform"
es: python:str, predeterminado "plataforma"

source: Name of the platform (vendor) column.
es: Nombre de la columna de la plataforma (proveedor).

source: **agg** : :class:`python:str`, default "sum"
es: **agg** : :class:`python:str`, predeterminado "sum"

source: python:str, default "sum"
es: python:str, predeterminado "sum"

source: Aggregation method applied during groupby.
es: Método de agregación aplicado durante el agrupamiento.

source: **fill_value** : :class:`python:float` or :data:`python:None`, default 0.0
es: **fill_value** : :class:`python:float` o :data:`python:None`, valor por defecto 0.0

source: python:float or python:None, default 0.0
es: python:float o python:None, predeterminado 0.0

source: Value used to fill missing values in the wide output. If ``None``, missing values are left as NaN.
es: Valor utilizado para rellenar los valores faltantes en la salida amplia. Si ``None``, los valores faltantes se dejan como NaN.

source: **include_missing_dates** : :ref:`bool <python:bltin-boolean-values>`, default :data:`python:False`
es: **include_missing_dates** : :ref:`bool <python:bltin-boolean-values>`, predeterminado :data:`python:False`

source: bool, default python:False
es: bool, valor predeterminado python:False

source: If ``True``, include a continuous date range and fill missing dates using ``fill_value``.
es: Si ``True``, incluya un rango de fechas continuo y complete las fechas faltantes utilizando ``fill_value``.

source: **freq** : :class:`python:str`, default "D"
es: **freq** : :class:`python:str`, predeterminado "D"

source: python:str, default "D"
es: python:str, predeterminado "D"

source: Frequency used when ``include_missing_dates`` is ``True``.
es: Frecuencia utilizada cuando ``include_missing_dates`` es ``True``.

source: **rename_date_to** : :class:`python:str` or :data:`python:None`, default "date"
es: **rename_date_to** : :class:`python:str` o :data:`python:None`, por defecto "date"

source: python:str or python:None, default "date"
es: python:str o python:None, predeterminado "date"

source: If provided, rename the date column in the result to this value. If ``None``, keep ``date_col``.
es: Si se proporciona, renombre la columna de fecha en el resultado a este valor. Si es ``None``, mantenga ``date_col``.

source: Returns
es: Devoluciones

source: A wide-format dataframe with one row per date and columns for each ``{platform}_{metric}`` combination.
es: Un dataframe de formato amplio con una fila por fecha y columnas para cada combinación de ``{platform}_{metric}``.
