Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump.po
Languages: es

source: CustomModelWrapper.model\_dump
es: { "singular": "CustomModelWrapper.model_dump", "plural": "CustomModelWrapper.model_dump" }

source: !!! abstract "Usage Documentation"
es: { "singular": "!!! abstract \"Documentación de Uso\"", "plural": "!!! abstract \"Documentación de Uso\"" }

source: [`model_dump`](../concepts/serialization.md#python-mode)
es: { "singular": { "msgid": "`model_dump`", "msgstr": "`model_dump`" }, "plural": { "msgid": "`model_dump`", "msgstr": "`model_dump`" } }

source: Generate a dictionary representation of the model, optionally specifying which fields to include or exclude.
es: { "singular": "Genera una representación de diccionario del modelo, especificando opcionalmente qué campos incluir o excluir.", "plural": "Generen una representación de diccionario del modelo, especificando opcionalmente qué campos incluir o excluir." }

source: Args:
es: { "singular": { "msgid": "Args:", "msgstr": "Args:" }, "plural": { "msgid": "Args:", "msgstr": "Args:" } }

source: mode: The mode in which `to_python` should run.
es: { "singular": { "msgid": "mode: The mode in which `to_python` should run.", "msgstr": "modo: El modo en el que `to_python` debería ejecutarse." }, "plural": { "msgid": "mode: The mode in which `to_python` should run.", "msgstr": "modo: El modo en el que `to_python` debería ejecutarse." } }

source: If mode is 'json', the output will only contain JSON serializable types. If mode is 'python', the output may contain non-JSON-serializable Python objects.
es: { "singular": "Si el modo es 'json', la salida solo contendrá tipos serializables en JSON. Si el modo es 'python', la salida puede contener objetos de Python no serializables en JSON.", "plural": "Si los modos son 'json', las salidas solo contendrán tipos serializables en JSON. Si los modos son 'python', las salidas pueden contener objetos de Python no serializables en JSON." }

source: include: A set of fields to include in the output. exclude: A set of fields to exclude from the output. context: Additional context to pass to the serializer. by_alias: Whether to use the field's alias in the dictionary key if defined. exclude_unset: Whether to exclude fields that have not been explicitly set. exclude_defaults: Whether to exclude fields that are set to their default value. exclude_none: Whether to exclude fields that have a value of `None`. exclude_computed_fields: Whether to exclude computed fields.
es: { "singular": { "msgid": "include: A set of fields to include in the output.", "msgstr": "include: Un conjunto de campos a incluir en la salida." }, "plural": { "msgid": "exclude: A set of fields to exclude from the output.", "msgstr": "exclude: Un conjunto de campos a excluir de la salida." }, "context": { "msgid": "context: Additional context to pass to the serializer.", "msgstr": "context: Contexto adicional para pasar al serializador." }, "by_alias": { "msgid": "by_alias: Whether to use the field's alias in the dictionary key if defined.", "msgstr": "by_alias: Si se debe usar el alias del campo en la clave del diccionario si está definido." }, "exclude_unset": { "msgid": "exclude_unset: Whether to exclude fields that have not been explicitly set.", "msgstr": "exclude_unset: Si se deben excluir los campos que no han sido establecidos explícitamente." }, "exclude_defaults": { "msgid": "exclude_defaults: Whether to exclude fields that are set to their default value.", "msgstr": "exclude_defaults: Si se deben excluir los campos que están establecidos en su valor predeterminado." }, "exclude_none": { "msgid": "exclude_none: Whether to exclude fields that have a value of `None`.", "msgstr": "exclude_none: Si se deben excluir los campos que tienen un valor de `None`." }, "exclude_computed_fields": { "msgid": "exclude_computed_fields: Whether to exclude computed fields.", "msgstr": "exclude_computed_fields: Si se deben excluir los campos computados." } }

source: While this can be useful for round-tripping, it is usually recommended tu use the dedicated `round_trip` parameter instead.
es: { "singular": "Si bien esto puede ser útil para el intercambio de ida y vuelta, generalmente se recomienda utilizar el parámetro dedicado `round_trip` en su lugar.", "plural": "Si bien esto puede ser útil para el intercambio de ida y vuelta, generalmente se recomienda utilizar el parámetro dedicado `round_trip` en su lugar." }

source: round_trip: If True, dumped values should be valid as input for non-idempotent types such as Json[T]. warnings: How to handle serialization errors. False/"none" ignores them, True/"warn" logs errors,
es: { "singular": "round_trip: Si es verdadero, los valores volcado deben ser válidos como entrada para tipos no idempotentes como Json[T]. advertencias: Cómo manejar errores de serialización. Falso/\"ninguno\" los ignora, Verdadero/\"advertir\" registra errores,", "plural": "round_trip: Si son verdaderos, los valores volcado deben ser válidos como entrada para tipos no idempotentes como Json[T]. advertencias: Cómo manejar errores de serialización. Falsos/\"ninguno\" los ignoran, Verdaderos/\"advertir\" registran errores," }

source: "error" raises a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].
es: { "singular": "El \"error\" genera un [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].", "plural": "Los \"errores\" generan un [`PydanticSerializationError`][pydantic_core.PydanticSerializationError]." }

source: fallback: A function to call when an unknown value is encountered. If not provided,
es: { "singular": "fallback: Una función a llamar cuando se encuentra un valor desconocido. Si no se proporciona,", "plural": "fallback: Una función a llamar cuando se encuentran valores desconocidos. Si no se proporcionan," }

source: a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError] error is raised.
es: { "singular": "se genera un error [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].", "plural": "se generan errores [`PydanticSerializationError`][pydantic_core.PydanticSerializationError]." }

source: serialize_as_any: Whether to serialize fields with duck-typing serialization behavior.
es: { "singular": "serialize_as_any: Si se deben serializar los campos con un comportamiento de serialización de tipo pato.", "plural": "serialize_as_any: Si se deben serializar los campos con un comportamiento de serialización de tipo pato." }

source: Returns:
es: { "singular": "Devuelve:", "plural": "Devuelven:" }

source: A dictionary representation of the model.
es: { "singular": "Una representación de diccionario del modelo.", "plural": "Representaciones de diccionario del modelo." }
