Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_retention_elasticity.po
Languages: es

source: Compute expected retention elasticity for each customer.
es: msgid: Compute expected retention elasticity for each customer. msgstr: Calcule la elasticidad de retención esperada para cada cliente.

source: This is the percent increase in expected residual lifetime given a 1% increase in the retention rate, subject to a discount rate for net present value (NPV) calculations. It is recommended to set a discount rate > 0 to avoid infinite retention elasticity estimates.
es: msgid: This is the percent increase in expected residual lifetime given a 1% increase in the retention rate, subject to a discount rate for net present value (NPV) calculations. It is recommended to set a discount rate > 0 to avoid infinite retention elasticity estimates. msgstr: Este es el aumento porcentual en la vida residual esperada dado un aumento del 1% en la tasa de retención, sujeto a una tasa de descuento para cálculos del valor presente neto (VPN). Se recomienda establecer una tasa de descuento > 0 para evitar estimaciones de elasticidad de retención infinitas.

source: Adapted from equation (8) in [R7c2bf73cac9b-1]_.
es: Adaptado de la ecuación (8) en [R7c2bf73cac9b-1]_.

source: Parameters
es: msgid: Parameters msgstr: Parámetros

source: python:float
es: msgid: python:float msgstr: python:float

source: Discount rate to apply for net present value estimations.
es: Tasa de descuento a aplicar para estimaciones del valor presente neto.

source: **data** : :obj:`~pandas.DataFrame`
es: msgid: **data** : :obj:`~pandas.DataFrame` msgstr: **data** : :obj:`~pandas.DataFrame`

source: DataFrame
es: msgid: DataFrame msgstr: DataFrame

source: Optional dataframe containing the following columns: * `customer_id`: Unique customer identifier * `T`: Number of time periods customer has been active * `cohort`: Customer cohort label
es: msgid: Optional dataframe containing the following columns: * `customer_id`: Unique customer identifier * `T`: Number of time periods customer has been active * `cohort`: Customer cohort label msgstr: Dataframe opcional que contiene las siguientes columnas: * `customer_id`: Identificador único del cliente * `T`: Número de períodos de tiempo en los que el cliente ha estado activo * `cohort`: Etiqueta de cohorte del cliente

source: References
es: msgid: References msgstr: Referencias

source: Fader, P. S., & Hardie, B. G. (2010). "Customer-Base Valuation in a Contractual Setting: The Perils of Ignoring Heterogeneity". Marketing Science, 29(1), 85-93. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf
es: msgid: Fader, P. S., & Hardie, B. G. (2010). "Customer-Base Valuation in a Contractual Setting: The Perils of Ignoring Heterogeneity". Marketing Science, 29(1), 85-93. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf msgstr: Fader, P. S., & Hardie, B. G. (2010). "Valoración de la Base de Clientes en un Entorno Contractual: Los Peligros de Ignorar la Heterogeneidad". Marketing Science, 29(1), 85-93. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf

source: [R7c2bf73cac9b-1]_
es: msgid: [R7c2bf73cac9b-1] msgstr: [R7c2bf73cac9b-1]
