Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.allocate_budget.po
Languages: es

source: BudgetOptimizer.allocate\_budget
es: BudgetOptimizer.asignar\_presupuesto

source: Allocate the budget based on `total_budget`, optional `budget_bounds`, and custom constraints.
es: Asigne el presupuesto basado en `total_budget`, `budget_bounds` opcional y restricciones personalizadas.

source: The default sum constraint ensures that the sum of the optimized budget equals `total_budget`. If `budget_bounds` are not provided, each channel will be constrained to lie in [0, total_budget].
es: La restricción de suma predeterminada asegura que la suma del presupuesto optimizado sea igual a `total_budget`. Si no se proporcionan `budget_bounds`, cada canal estará restringido a estar en [0, total_budget].

source: Parameters
es: Parámetros

source: The total budget to allocate.
es: El presupuesto total a asignar.

source: **budget_bounds** : :obj:`DataArray` or :class:`python:dict`, optional
es: **límites_presupuesto** : :obj:`DataArray` o :class:`python:dict`, opcional

source: DataArray or python:dict, optional
es: DataArray o python:dict, opcional

source: If None, default bounds of [0, total_budget] per channel are assumed.
es: Si es None, se asumen los límites predeterminados de [0, total_budget] por canal.

source: If a dict, must map each channel to (low, high) budget pairs (only valid if there's one dimension).
es: Si es un diccionario, debe asignar cada canal a pares de presupuesto (bajo, alto) (solo válido si hay una dimensión).

source: If an xarray.DataArray, must have dims (*budget_dims, "bound"), specifying [low, high] per channel cell.
es: Si es un xarray.DataArray, debe tener dimensiones (*budget_dims, "bound"), especificando [bajo, alto] por celda de canal.

source: **x0** : :obj:`np.ndarray <numpy.ndarray>`, optional
es: **x0** : :obj:`np.ndarray <numpy.ndarray>`, opcional

source: np.ndarray, optional
es: np.ndarray, opcional

source: Initial guess. Array of real elements of size (n,), where n is the number of driver budgets to optimize. If None, the total budget is spread uniformly across all drivers to be optimized.
es: Suposición inicial. Array de elementos reales de tamaño (n,), donde n es el número de presupuestos de conductores a optimizar. Si es None, el presupuesto total se distribuye uniformemente entre todos los conductores a optimizar.

source: **minimize_kwargs** : :class:`python:dict`, optional
es: **minimize_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Extra kwargs for `scipy.optimize.minimize`. Defaults to method="SLSQP", ftol=1e-9, maxiter=1_000.
es: Argumentos adicionales para `scipy.optimize.minimize`. Por defecto, method="SLSQP", ftol=1e-9, maxiter=1_000.

source: **return_if_fail** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **return_if_fail** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Return output even if optimization fails. Default is False.
es: Devolver la salida incluso si la optimización falla. El valor predeterminado es False.

source: **callback** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **callback** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to return callback information tracking optimization progress. When True, returns a third element containing a list of dictionaries with optimization information at each iteration including 'x' (parameter values), 'fun' (objective value), 'jac' (gradient), and constraint information. Default is False for backward compatibility.
es: Si se debe devolver información de seguimiento de la optimización del progreso de la devolución de llamada. Cuando es True, devuelve un tercer elemento que contiene una lista de diccionarios con información de optimización en cada iteración, incluyendo 'x' (valores de parámetros), 'fun' (valor objetivo), 'jac' (gradiente) e información de restricciones. El valor predeterminado es False para mantener la compatibilidad con versiones anteriores.

source: Returns
es: Devoluciones

source: The optimized budget allocation across channels.
es: La asignación de presupuesto optimizada a través de los canales.

source: **result** : :obj:`OptimizeResult`
es: **resultado** : :obj:`OptimizeResult`

source: OptimizeResult
es: OptimizarResultado

source: The raw scipy optimization result.
es: El resultado bruto de optimización de scipy.

source: **callback_info** : :class:`python:list`\[:class:`python:dict`\[:class:`python:str`, :obj:`Any`]], optional
es: **callback_info** : :class:`python:list`\[:class:`python:dict`\[:class:`python:str`, :obj:`Any`]], opcional

source: python:list[python:dict[python:str, Any]], optional
es: python:list[python:dict[python:str, Any]], opcional

source: Only returned if callback=True. List of dictionaries containing optimization information at each iteration.
es: Solo se devuelve si callback=True. Lista de diccionarios que contienen información de optimización en cada iteración.

source: Raises
es: Aumentos

source: If the optimization fails for any reason, the exception message will contain the details.
es: Si la optimización falla por cualquier motivo, el mensaje de excepción contendrá los detalles.
