Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.components.saturation.InverseScaledLogisticSaturation.apply.po
Languages: es

source: InverseScaledLogisticSaturation.apply
es: InverseScaledLogisticSaturation.aplicar

source: Call within a model context.
es: Llamar dentro de un contexto de modelo.

source: Used internally of the MMM to apply the transformation to the data.
es: Utilizado internamente en el MMM para aplicar la transformación a los datos.

source: Parameters
es: Parámetros

source: pt.TensorLike
es: pt.TensorComo

source: The data to be transformed.
es: Los datos que se van a transformar.

source: **dims** : :class:`python:str`, :term:`python:sequence`\[:class:`python:str`], optional
es: **dims** : :class:`python:str`, :term:`python:sequence`\[:class:`python:str`], opcional

source: python:str, python:sequence[python:str], optional
es: python:str, python:secuencia[python:str], opcional

source: The dims of the parameters. Defaults to None. Not the dims of the data!
es: Las dimensiones de los parámetros. Por defecto es None. ¡No son las dimensiones de los datos!

source: Returns
es: Devoluciones

source: The transformed data.
es: Los datos transformados.

source: Examples
es: Ejemplos

source: Call the function for custom use-case
es: Llama a la función para un caso de uso personalizado
