Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.causal.CausalGraphModel.build_graphical_model.po
Languages: es

source: CausalGraphModel.build\_graphical\_model
es: CausalGraphModel.construir\_modelo\_gráfico

source: Create a CausalGraphModel from a string representation of a graph.
es: Cree un CausalGraphModel a partir de una representación en cadena de un grafo.

source: Parameters
es: Parámetros

source: **graph** : :class:`python:str`
es: **gráfico** : :class:`python:str`

source: A string representation of the graph (e.g., String in DOT format).
es: Una representación en cadena del grafo (por ejemplo, cadena en formato DOT).

source: **treatment** : :class:`python:list`\[:class:`python:str`]
es: **tratamiento** : :class:`python:list`\[:class:`python:str`]

source: A list of treatment variable names.
es: Una lista de nombres de variables de tratamiento.

source: **outcome** : :class:`python:str`
es: **resultado** : :class:`python:str`

source: The outcome variable name.
es: El nombre de la variable de resultado.

source: Returns
es: Devoluciones

source: An instance of CausalGraphModel constructed from the given graph string.
es: Una instancia de CausalGraphModel construida a partir de la cadena de gráfico dada.
