Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MultiDimensionalBudgetOptimizerWrapper.sample_response_distribution.po
Languages: es

source: MultiDimensionalBudgetOptimizerWrapper.sample\_response\_distribution
es: MultiDimensionalBudgetOptimizerWrapper.muestra\_distribución\_respuesta

source: Generate synthetic dataset and sample posterior predictive based on allocation.
es: Generar un conjunto de datos sintético y muestrear la predicción posterior basada en la asignación.

source: Parameters
es: Parámetros

source: **allocation_strategy** : :obj:`DataArray`
es: **estrategia_de_asignación** : :obj:`DataArray`

source: The allocation strategy for the channels.
es: La estrategia de asignación para los canales.

source: **noise_level** : :class:`python:float`
es: **nivel_de_ruido** : :class:`python:float`

source: The relative level of noise to add to the data allocation.
es: El nivel relativo de ruido a añadir a la asignación de datos.

source: Additional variable names to include in the posterior predictive sampling.
es: Nombres de variables adicionales para incluir en el muestreo predictivo posterior.

source: Whether to include the last observations for continuity.
es: Si incluir las últimas observaciones para la continuidad.

source: Whether to include carryover effects.
es: Si incluir efectos de arrastre.

source: **budget_distribution_over_period** : :obj:`xr.DataArray` | :data:`python:None`
es: **distribución_presupuestaria_a_lo_largo_del_período** : :obj:`xr.DataArray` | :data:`python:None`

source: Distribution factors for budget allocation over time. Should have dims ("date", *budget_dims) where date dimension has length num_periods. Values along date dimension should sum to 1 for each combination of other dimensions. If provided, multiplies the noise values by this distribution.
es: Factores de distribución para la asignación del presupuesto a lo largo del tiempo. Debe tener dimensiones ("fecha", *budget_dims) donde la dimensión de fecha tiene una longitud de num_periods. Los valores a lo largo de la dimensión de fecha deben sumar 1 para cada combinación de otras dimensiones. Si se proporciona, multiplica los valores de ruido por esta distribución.

source: Returns
es: Devoluciones

source: The posterior predictive samples based on the synthetic dataset.
es: Las muestras predictivas posteriores basadas en el conjunto de datos sintético.
