Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.plot.MMMPlotSuite.plot_sensitivity_analysis.po
Languages: es

source: MMMPlotSuite.plot\_sensitivity\_analysis
es: MMMPlotSuite.plot\_análisis\_de\_sensibilidad

source: Plot counterfactual uplift or marginal effects curves.
es: Trazar curvas de aumento contrafactual o efectos marginales.

source: Handles additional (non sweep/date/chain/draw) dimensions by creating one subplot per combination of those dimensions - consistent with other plot_* methods.
es: Maneja dimensiones adicionales (no barrido/fecha/cadena/sorteo) creando un subplot por cada combinación de esas dimensiones, de manera consistente con otros métodos plot_*.

source: Parameters
es: Parámetros

source: **hdi_prob** : :class:`python:float`, default 0.94
es: **hdi_prob** : :class:`python:float`, valor predeterminado 0.94

source: python:float, default 0.94
es: python:float, valor predeterminado 0.94

source: HDI probability mass.
es: Masa de probabilidad del HDI.

source: **ax** : :obj:`plt.Axes`, optional
es: **ax** : :obj:`plt.Axes`, opcional

source: plt.Axes, optional
es: plt.Axes, opcional

source: Only used when there are no extra dimensions (single panel case).
es: Solo se utiliza cuando no hay dimensiones adicionales (caso de panel único).

source: **marginal** : :ref:`bool <python:bltin-boolean-values>`, default :data:`python:False`
es: **marginal** : :ref:`bool <python:bltin-boolean-values>`, predeterminado :data:`python:False`

source: bool, default python:False
es: bool, python predeterminado:False

source: Plot marginal effects instead of uplift.
es: Trazar efectos marginales en lugar de aumento.

source: **percentage** : :ref:`bool <python:bltin-boolean-values>`, default :data:`python:False`
es: **porcentaje** : :ref:`bool <python:bltin-boolean-values>`, predeterminado :data:`python:False`

source: Express uplift as a percentage of actual (not supported for marginal).
es: Expresar el aumento como un porcentaje del real (no soportado para marginal).

source: **sharey** : :ref:`bool <python:bltin-boolean-values>`, default :data:`python:True`
es: **sharey** : :ref:`bool <python:bltin-boolean-values>`, predeterminado :data:`python:True`

source: bool, default python:True
es: bool, predeterminado python:True

source: Share y-axis across subplots (only relevant for multi-panel case).
es: Compartir el eje y entre los subgráficos (solo relevante para el caso de múltiples paneles).

source: Returns
es: Devoluciones

source: (:obj:`fig`, :obj:`axes`) :obj:`if` multi-panel, :obj:`else` :obj:`a` :obj:`single` :obj:`Axes` (:obj:`backwards` :obj:`compatible` single-dim :obj:`case`).
es: (:obj:`fig`, :obj:`axes`) :obj:`si` es un panel múltiple, :obj:`de lo contrario` :obj:`un` :obj:`solo` :obj:`Axes` (:obj:`compatible` :obj:`con` :obj:`versiones anteriores` caso unidimensional :obj:`simple`).
