Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.plot.MMMPlotSuite.posterior_predictive.po
Languages: es

source: MMMPlotSuite.posterior\_predictive
es: MMMPlotSuite.predicción\_posterior

source: Plot time series from the posterior predictive distribution.
es: Grafique series temporales de la distribución predictiva posterior.

source: By default, if both `var` and `idata` are not provided, uses `self.idata.posterior_predictive` and defaults the variable to `["y"]`.
es: Por defecto, si tanto `var` como `idata` no se proporcionan, utiliza `self.idata.posterior_predictive` y establece la variable por defecto en `["y"]`.

source: Parameters
es: Parámetros

source: **var** : :class:`python:list` of :class:`python:str`, optional
es: **var** : :class:`python:list` de :class:`python:str`, opcional

source: python:list of python:str, optional
es: python:lista de python:str, opcional

source: A list of variable names to plot. Default is ["y"] if not provided.
es: Una lista de nombres de variables a graficar. El valor predeterminado es ["y"] si no se proporciona.

source: **idata** : :obj:`xarray.Dataset`, optional
es: **idata** : :obj:`xarray.Dataset`, opcional

source: xarray.Dataset, optional
es: xarray.Dataset, opcional

source: The posterior predictive dataset to plot. If not provided, tries to use `self.idata.posterior_predictive`.
es: El conjunto de datos predictivo posterior para graficar. Si no se proporciona, intenta usar `self.idata.posterior_predictive`.

source: **hdi_prob: float, optional**
es: **hdi_prob: flotante, opcional**

source: The probability mass of the highest density interval to be displayed. Default is 0.85.
es: La masa de probabilidad del intervalo de mayor densidad que se mostrará. El valor predeterminado es 0.85.

source: Returns
es: Devoluciones

source: The Figure object containing the subplots.
es: El objeto Figura que contiene los subgráficos.

source: **axes** : :obj:`np.ndarray <numpy.ndarray>` of :obj:`matplotlib.axes.Axes`
es: **ejes** : :obj:`np.ndarray <numpy.ndarray>` de :obj:`matplotlib.axes.Axes`

source: np.ndarray of matplotlib.axes.Axes
es: np.ndarray de matplotlib.axes.Axes

source: Array of Axes objects corresponding to each subplot row.
es: Array de objetos Axes que corresponden a cada fila de subgráficas.

source: Raises
es: Aumentos

source: If no `idata` is provided and `self.idata.posterior_predictive` does not exist, instructing the user to run `MMM.sample_posterior_predictive()`. If `hdi_prob` is not between 0 and 1, instructing the user to provide a valid value.
es: Si no se proporciona `idata` y `self.idata.posterior_predictive` no existe, instruya al usuario para que ejecute `MMM.sample_posterior_predictive()`. Si `hdi_prob` no está entre 0 y 1, instruya al usuario para que proporcione un valor válido.
