Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.*.MMMModelBuilder.plot_prior_vs_posterior.po
Languages: es

source: Plot the prior vs posterior distribution for a specified variable in a 3 columngrid layout.
es: Trace la distribución previa frente a la distribución posterior para una variable especificada en un diseño de cuadrícula de 3 columnas.

source: This function generates KDE plots for each MMM channel, showing the prior predictive and posterior distributions with their respective means highlighted. It sorts the plots either alphabetically or based on the difference between the posterior and prior means, with the largest difference (posterior - prior) at the top.
es: Esta función genera gráficos KDE para cada canal MMM, mostrando las distribuciones predictivas anteriores y posteriores con sus respectivas medias resaltadas. Ordena los gráficos ya sea alfabéticamente o en función de la diferencia entre las medias posteriores y anteriores, con la mayor diferencia (posterior - anterior) en la parte superior.

source: Parameters
es: Parámetros

source: The variable to analyze (e.g., 'adstock_alpha').
es: La variable a analizar (por ejemplo, 'adstock_alpha').

source: **alphabetical_sort: bool, optional**
es: **orden_alfabético: bool, opcional**

source: Whether to sort the channels alphabetically (True) or by the difference between the posterior and prior means (False). Default is True.
es: Si se deben ordenar los canales alfabéticamente (Verdadero) o por la diferencia entre las medias posterior y previa (Falso). El valor predeterminado es Verdadero.

source: **figsize** : :class:`python:tuple` of :class:`python:int`, optional
es: **figsize** : :class:`python:tuple` de :class:`python:int`, opcional

source: python:tuple of python:int, optional
es: python:tupla de python:int, opcional

source: Figure size in inches. If None, it will be calculated based on the number of channels.
es: Tamaño de la figura en pulgadas. Si es None, se calculará en función del número de canales.

source: Returns
es: Devoluciones

source: The matplotlib figure object
es: El objeto figura de matplotlib

source: Raises
es: Aumentos

source: If the required attributes (prior, posterior) were not found.
es: Si no se encontraron los atributos requeridos (anterior, posterior).

source: If var_name is not a string.
es: Si {var_name} no es una cadena.
