Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MMM.sample_posterior_predictive.po
Languages: es

source: MMM.sample\_posterior\_predictive
es: MMM.muestra\_predictiva\_posterior

source: Sample from the model's posterior predictive distribution.
es: Muestra de la distribución predictiva posterior del modelo.

source: Parameters
es: Parámetros

source: Input data for prediction, with the same structure as the training data.
es: Datos de entrada para la predicción, con la misma estructura que los datos de entrenamiento.

source: **y** : :obj:`pd.Series`, optional
es: **y** : :obj:`pd.Series`, opcional

source: pd.Series, optional
es: pd.Series, opcional

source: Optional target data for validation or alignment. Default is None.
es: Datos de destino opcionales para validación o alineación. El valor predeterminado es None.

source: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to add predictions to the inference data object. Defaults to True.
es: Si se deben agregar predicciones al objeto de datos de inferencia. Por defecto es True.

source: **combined** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **combinado** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Combine chain and draw dimensions into a single sample dimension. Defaults to True.
es: Combina la cadena y las dimensiones de dibujo en una sola dimensión de muestra. Por defecto es Verdadero.

source: **include_last_observations** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **include_last_observations** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to include the last observations of the training data for continuity (useful for adstock transformations). Defaults to False.
es: Si incluir las últimas observaciones de los datos de entrenamiento para continuidad (útil para transformaciones de adstock). Por defecto es False.

source: **clone_model** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **clone_model** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to clone the model. Defaults to True.
es: Si se debe clonar el modelo. Por defecto es True.

source: Additional arguments for `pm.sample_posterior_predictive`.
es: Argumentos adicionales para `pm.sample_posterior_predictive`.

source: Returns
es: Devoluciones

source: Posterior predictive samples.
es: Muestras predictivas posteriores.
