Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.fourier.FourierBase.apply.po
Languages: es

source: FourierBase.apply
es: FourierBase.aplicar

source: Apply fourier seasonality to day of year.
es: Aplicar la estacionalidad de Fourier al día del año.

source: Must be used within a PyMC model context.
es: Debe ser utilizado dentro del contexto de un modelo PyMC.

source: Parameters
es: Parámetros

source: **dayofperiod** : :obj:`pt.TensorLike`
es: **día del período** : :obj:`pt.TensorLike`

source: pt.TensorLike
es: pt.TensorComo

source: Day of year or weekday
es: Día del año o día de la semana

source: **result_callback** : :obj:`Callable`\[[:obj:`pt.TensorVariable`], :data:`python:None`], optional
es: **result_callback** : :obj:`Callable`\[[:obj:`pt.TensorVariable`], :data:`python:None`], opcional

source: Callable[[pt.TensorVariable], python:None], optional
es: Callable[[pt.TensorVariable], python:None], opcional

source: Callback function to apply to the result, by default None
es: Función de devolución de llamada que se aplicará al resultado, por defecto None

source: Returns
es: Devoluciones

source: Fourier seasonality
es: Estacionalidad de Fourier

source: Examples
es: Ejemplos

source: Save off the result before summing through the prefix dimension.
es: Guarde el resultado antes de sumar a través de la dimensión de prefijo.
