Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MultiDimensionalBudgetOptimizerWrapper.optimize_budget.po
Languages: es

source: MultiDimensionalBudgetOptimizerWrapper.optimize\_budget
es: MultiDimensionalBudgetOptimizerWrapper.optimizar\_presupuesto

source: Optimize the budget allocation for the model.
es: Optimice la asignación del presupuesto para el modelo.

source: Parameters
es: Parámetros

source: **budget** : :class:`python:float` | :class:`python:int`
es: **presupuesto** : :class:`python:float` | :class:`python:int`

source: Total budget to allocate.
es: msgid: Total budget to allocate. msgstr: Presupuesto total a asignar.

source: **budget_bounds** : :obj:`xr.DataArray` | :data:`python:None`
es: **límites_presupuesto** : :obj:`xr.DataArray` | :data:`python:None`

source: xr.DataArray | python:None
es: xr.DataArray | python:Ninguno

source: Budget bounds per channel.
es: Límites de presupuesto por canal.

source: Response variable to optimize.
es: Variable de respuesta a optimizar.

source: UtilityFunctionType
es: TipoDeFunciónUtilidad

source: Utility function to maximize.
es: Función de utilidad para maximizar.

source: **constraints** : :obj:`Sequence`\[:class:`python:dict`\[:class:`python:str`, :obj:`Any`]]
es: **restricciones** : :obj:`Secuencia`\[:class:`python:dict`\[:class:`python:str`, :obj:`Cualquiera`]]

source: Sequence[python:dict[python:str, Any]]
es: Secuencia[python:dict[python:str, Any]]

source: Custom constraints for the optimizer.
es: Restricciones personalizadas para el optimizador.

source: Whether to add default constraints.
es: Si se deben agregar restricciones predeterminadas.

source: **budgets_to_optimize** : :obj:`xr.DataArray` | :data:`python:None`
es: **presupuestos_a_optimizar** : :obj:`xr.DataArray` | :data:`python:None`

source: Mask defining which budgets to optimize.
es: Máscara que define qué presupuestos optimizar.

source: **budget_distribution_over_period** : :obj:`xr.DataArray` | :data:`python:None`
es: **distribución_presupuestaria_a_lo_largo_del_período** : :obj:`xr.DataArray` | :data:`python:None`

source: Distribution factors for budget allocation over time. Should have dims ("date", *budget_dims) where date dimension has length num_periods. Values along date dimension should sum to 1 for each combination of other dimensions. If None, budget is distributed evenly across periods.
es: Factores de distribución para la asignación del presupuesto a lo largo del tiempo. Debe tener dimensiones ("fecha", *budget_dims) donde la dimensión de fecha tiene una longitud de num_periods. Los valores a lo largo de la dimensión de fecha deben sumar 1 para cada combinación de las otras dimensiones. Si es None, el presupuesto se distribuye de manera uniforme entre los períodos.

source: Whether to return callback information tracking optimization progress.
es: Si se debe devolver información de seguimiento de la optimización del progreso de la devolución de llamada.

source: Additional arguments for the optimizer.
es: Argumentos adicionales para el optimizador.

source: Returns
es: Devoluciones

source: Optimal budgets and optimization result. If callback=True, also returns a list of dictionaries with optimization information at each iteration.
es: Presupuestos óptimos y resultado de optimización. Si callback=True, también devuelve una lista de diccionarios con información de optimización en cada iteración.
