Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.*.MMMModelBuilder.approximate_fit.po
Languages: es

source: MMMModelBuilder.approximate\_fit
es: MMMModelBuilder.ajuste\_aproximado

source: Fit a model using Variational Inference and return InferenceData.
es: Ajuste un modelo utilizando Inferencia Variacional y devuelva InferenceData.

source: This performs variational inference via `pymc.fit`, then draws posterior samples from the fitted approximation via `Approximation.sample`, returning an `arviz.InferenceData` compatible with the rest of the API (same structure as `.fit`).
es: Esto realiza inferencia variacional a través de `pymc.fit`, luego extrae muestras posteriores de la aproximación ajustada mediante `Approximation.sample`, devolviendo un `arviz.InferenceData` compatible con el resto de la API (misma estructura que `.fit`).

source: Parameters
es: Parámetros

source: numpy:array_like | array, shape (n_obs, n_features)
es: numpy:array_like | arreglo, forma (n_obs, n_features)

source: The training input samples. If scikit-learn is available, array-like, otherwise array.
es: Los ejemplos de entrada de entrenamiento. Si scikit-learn está disponible, tipo array, de lo contrario, array.

source: numpy:array_like | array, shape (n_obs,)
es: numpy:array_like | arreglo, forma (n_obs,)

source: The target values (real numbers). If scikit-learn is available, array-like, otherwise array.
es: Los valores objetivo (números reales). Si scikit-learn está disponible, tipo array, de lo contrario array.

source: **progressbar** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **barra de progreso** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Specifies whether the fitting/sample progress bar should be displayed. Defaults to True.
es: Especifica si se debe mostrar la barra de progreso de ajuste/muestra. Por defecto es True.

source: **random_seed** : :obj:`Optional`\[:obj:`RandomState <numpy.random.RandomState>`]
es: **random_seed** : :obj:`Opcional`\[:obj:`RandomState <numpy.random.RandomState>`]

source: Optional[RandomState]
es: Opcional[EstadoAleatorio]

source: Provides stochastic procedures with initial random seed for reproducibility.
es: Proporciona procedimientos estocásticos con una semilla aleatoria inicial para la reproducibilidad.

source: **fit_kwargs** : :class:`python:dict`, optional
es: **fit_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Extra keyword arguments forwarded to `pymc.fit` (e.g., {"n": 10_000, "method": "advi"}).
es: Argumentos adicionales de palabras clave enviados a `pymc.fit` (por ejemplo, {"n": 10_000, "method": "advi"}).

source: **sample_kwargs** : :class:`python:dict`, optional
es: **sample_kwargs** : :class:`python:dict`, opcional

source: Extra keyword arguments forwarded to `Approximation.sample` (e.g., {"draws": 1_000}).
es: Argumentos adicionales de palabras clave enviados a `Approximation.sample` (por ejemplo, {"draws": 1_000}).

source: Returns
es: Devoluciones

source: Inference data of the variationally fitted model.
es: Datos de inferencia del modelo ajustado variacionalmente.
