Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.BaseMMM.plot_waterfall_components_decomposition.po
Languages: es

source: Create a waterfall plot.
es: Cree un gráfico de cascada.

source: The plot shows the decomposition of the target into its components.
es: El gráfico muestra la descomposición del objetivo en sus componentes.

source: Parameters
es: Parámetros

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If True, the contributions are plotted in the original scale of the target.
es: Si es verdadero, las contribuciones se representan en la escala original del objetivo.

source: **figsize** : :class:`python:tuple`\[:class:`python:int`, :class:`python:int`], optional
es: **figsize** : :class:`python:tuple`\[:class:`python:int`, :class:`python:int`], opcional

source: python:tuple[python:int, python:int], optional
es: python:tuple[python:int, python:int], opcional

source: The size of the figure. The default is (14, 7).
es: El tamaño de la figura. El valor predeterminado es (14, 7).

source: Additional keyword arguments to pass to the matplotlib `subplots` function.
es: Argumentos adicionales de palabras clave para pasar a la función `subplots` de matplotlib.

source: Returns
es: Devoluciones

source: The matplotlib figure object.
es: El objeto figura de matplotlib.
