Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.hsgp.HSGPPeriodic.sample_prior.po
Languages: es

source: HSGPPeriodic.sample\_prior
es: HSGPPeriodic.muestra\_previa

source: Sample from the prior distribution.
es: Muestra de la distribución previa.

source: Parameters
es: Parámetros

source: **coords** : :class:`python:dict`, optional
es: **coords** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: The coordinates for the prior. By default it is None.
es: Las coordenadas para el anterior. Por defecto, es None.

source: **sample_prior_predictive_kwargs**
es: **muestra_prior_predicativa_kwargs**

source: Additional keyword arguments for `pm.sample_prior_predictive`.
es: Argumentos adicionales de palabras clave para `pm.sample_prior_predictive`.

source: Returns
es: Devoluciones

source: The prior distribution.
es: La distribución previa.
