Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.prior.Censored.sample_prior.po
Languages: es

source: Censored.sample\_prior
es: Censurado.muestra\_previa

source: Sample the prior distribution for the variable.
es: Muestree la distribución previa para la variable.

source: Parameters
es: Parámetros

source: **coords** : :class:`python:dict`\[:class:`python:str`, :class:`python:list`\[:class:`python:str`]], optional
es: **coords** : :class:`python:dict`\[:class:`python:str`, :class:`python:list`\[:class:`python:str`]], opcional

source: python:dict[python:str, python:list[python:str]], optional
es: python:dict[python:str, python:list[python:str]], opcional

source: The coordinates for the variable, by default None. Only required if the dims are specified.
es: Las coordenadas para la variable, por defecto None. Solo son necesarias si se especifican las dimensiones.

source: **name** : :class:`python:str`, optional
es: **nombre** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The name of the variable, by default "var".
es: El nombre de la variable, por defecto "var".

source: Additional arguments to pass to `pm.sample_prior_predictive`.
es: Argumentos adicionales para pasar a `pm.sample_prior_predictive`.

source: Returns
es: Devoluciones

source: The dataset of the prior samples.
es: El conjunto de datos de las muestras anteriores.
