Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.customer_choice.mv_its.MVITS.plot_causal_impact_market_share.po
Languages: es

source: MVITS.plot\_causal\_impact\_market\_share
es: MVITS.plot\_impacto\_causal\_cuota\_de\_mercado

source: Plot the inferred causal impact of the new product on the existing products.
es: Trace el impacto causal inferido del nuevo producto sobre los productos existentes.

source: Note: if we compare "mu" then we are comparing the expected sales, if we compare "y" then we are comparing the actual sales
es: Nota: si comparamos "mu" entonces estamos comparando las ventas esperadas, si comparamos "y" entonces estamos comparando las ventas reales.

source: Parameters
es: Par√°metros

source: **variable** : :class:`python:str`, optional
es: **variable** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The variable to compare. Either "mu" or "y".
es: La variable a comparar. Puede ser "mu" o "y".

source: **ax** : :obj:`plt.Axes`, optional
es: **ax** : :obj:`plt.Axes`, opcional

source: plt.Axes, optional
es: plt.Axes, opcional

source: The matplotlib axes.
es: Los ejes de matplotlib.

source: Returns
es: Devoluciones

source: The new or modified matplotlib axes.
es: Los nuevos ejes de matplotlib o los ejes modificados.
