Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.customer_choice.mv_its.MVITS.sample.po
Languages: es

source: MVITS.sample
es: MVITS.muestra

source: Sample all the things.
es: Muestrea todas las cosas.

source: Run all of the sample methods in the sequence:
es: Ejecute todos los métodos de muestra en la secuencia:

source: :meth:`calculate_counterfactual`
es: :meth:`calcular_contraparte`

source: Parameters
es: Parámetros

source: The data for the existing products.
es: Los datos de los productos existentes.

source: The data for the new product.
es: Los datos del nuevo producto.

source: **random_seed** : :obj:`np.random.Generator` | :class:`python:int`, optional
es: **random_seed** : :obj:`np.random.Generator` | :class:`python:int`, opcional

source: np.random.Generator | python:int, optional
es: np.random.Generator | python:int, opcional

source: The random seed for each stage of sampling.
es: La semilla aleatoria para cada etapa de muestreo.

source: **sample_prior_predictive_kwargs** : :class:`python:dict`, optional
es: **sample_prior_predictive_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: The keyword arguments for the sample_prior_predictive method.
es: Los argumentos de palabra clave para el método sample_prior_predictive.

source: **fit_kwargs** : :class:`python:dict`, optional
es: **fit_kwargs** : :class:`python:dict`, opcional

source: The keyword arguments for the fit method.
es: Los argumentos de palabra clave para el método fit.

source: **sample_posterior_predictive_kwargs** : :class:`python:dict`, optional
es: **sample_posterior_predictive_kwargs** : :class:`python:dict`, opcional

source: The keyword arguments for the sample_posterior_predictive method.
es: Los argumentos de palabra clave para el método sample_posterior_predictive.

source: Returns
es: Devoluciones

source: The model instance.
es: La instancia del modelo.
