Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.prior.Prior.constrain.po
Languages: es

source: Create a new prior with a given mass constrained within the given bounds.
es: Cree un nuevo prior con una masa dada restringida dentro de los límites establecidos.

source: Wrapper around `preliz.maxent`.
es: Envoltura alrededor de `preliz.maxent`.

source: Parameters
es: Parámetros

source: **lower** : :class:`python:float`
es: **inferior** : :class:`python:float`

source: The lower bound.
es: El límite inferior.

source: **upper** : :class:`python:float`
es: **superior** : :class:`python:float`

source: The upper bound.
es: El límite superior.

source: **mass: float = 0.95**
es: **masa: float = 0.95**

source: The mass of the distribution to keep within the bounds.
es: La masa de la distribución que se debe mantener dentro de los límites.

source: Additional arguments to pass to `pz.maxent`.
es: Argumentos adicionales para pasar a `pz.maxent`.

source: Returns
es: Devoluciones

source: The maximum entropy prior with a mass constrained to the given bounds.
es: El prior de máxima entropía con una masa restringida a los límites dados.

source: Examples
es: Ejemplos

source: Create a Beta distribution that is constrained to have 95% of the mass between 0.5 and 0.8.
es: Cree una distribución Beta que esté restringida a tener el 95% de la masa entre 0.5 y 0.8.

source: Create a Beta distribution with mean 0.6, that is constrained to have 95% of the mass between 0.5 and 0.8.
es: Cree una distribución Beta con una media de 0.6, que esté restringida a tener el 95% de la masa entre 0.5 y 0.8.
