Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MMM.build_from_idata.po
Languages: es

source: MMM.build\_from\_idata
es: MMM.construir\_desde\_idata

source: Rebuild the model from an ``InferenceData`` object.
es: Reconstruya el modelo a partir de un objeto ``InferenceData``.

source: Uses the stored fit dataset in ``idata`` to reconstruct the model graph by calling :meth:`build_model`. This is commonly used as part of a ``load`` workflow to restore a model prior to sampling predictive quantities.
es: Utiliza el conjunto de datos de ajuste almacenado en ``idata`` para reconstruir el gráfico del modelo al llamar a :meth:`build_model`. Esto se utiliza comúnmente como parte de un flujo de trabajo de ``carga`` para restaurar un modelo antes de muestrear cantidades predictivas.

source: Parameters
es: Parámetros

source: Inference data containing the fit dataset under the ``fit_data`` group.
es: Datos de inferencia que contienen el conjunto de datos de ajuste bajo el grupo ``fit_data``.

source: Returns
es: Devoluciones

source: Notes
es: Notas

source: Expects ``idata.fit_data`` to exist and contain both features and the
es: Espera que ``idata.fit_data`` exista y contenga tanto características como el

source: target column named ``self.output_var``.
es: columna objetivo llamada ``self.output_var``.

source: This rebuilds the model structure; it does not attach posterior samples.
es: Esto reconstruye la estructura del modelo; no adjunta muestras posteriores.

source: Assign ``self.idata = idata`` separately if you need to reuse samples.
es: Asigne ``self.idata = idata`` por separado si necesita reutilizar muestras.

source: Examples
es: Ejemplos
