Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.linear_trend.LinearTrend.sample_prior.po
Languages: es

source: LinearTrend.sample\_prior
es: LinearTrend.muestra\_previa

source: Sample the prior for the parameters used in the trend.
es: Muestre el anterior para los parámetros utilizados en la tendencia.

source: Parameters
es: Parámetros

source: **coords** : :class:`python:dict`, optional
es: **coords** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Coordinates in the priors, by default includes the changepoints.
es: Las coordenadas en los priors, por defecto incluyen los changepoints.

source: **sample_prior_predictive_kwargs** : :class:`python:dict`, optional
es: **sample_prior_predictive_kwargs** : :class:`python:dict`, opcional

source: Keyword arguments for the `pm.sample_prior_predictive` function.
es: Argumentos de palabras clave para la función `pm.sample_prior_predictive`.

source: Returns
es: Devoluciones

source: Dataset with the prior samples.
es: Conjunto de datos con las muestras anteriores.
