Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.plot_posterior_predictive.po
Languages: es

source: Plot the posterior predictive distribution from the model fit.
es: Trace la distribución predictiva posterior a partir del ajuste del modelo.

source: This function creates a visualization of the model's posterior predictive distribution, allowing for comparison with observed data. It can include highest density intervals (HDI), mean predictions, and a gradient representation of the full distribution.
es: Esta función crea una visualización de la distribución predictiva posterior del modelo, permitiendo la comparación con los datos observados. Puede incluir intervalos de densidad más alta (HDI), predicciones medias y una representación en gradiente de la distribución completa.

source: Parameters
es: Parámetros

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If True, plot in the original scale of the target variable. If False, plot in the transformed scale used for modeling. Default is False.
es: Si es verdadero, grafique en la escala original de la variable objetivo. Si es falso, grafique en la escala transformada utilizada para el modelado. El valor predeterminado es falso.

source: **hdi_list** : :class:`python:list` of :class:`python:float`, optional
es: **hdi_list** : :class:`python:list` de :class:`python:float`, opcional

source: python:list of python:float, optional
es: python:lista de python:float, opcional

source: List of HDI levels to plot. Default is [0.94] Provide an empty list to omit plotting the HDI.
es: Lista de niveles de IDH para graficar. El valor predeterminado es [0.94]. Proporcione una lista vacía para omitir la representación gráfica del IDH.

source: **add_mean** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **add_mean** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: If True, add the mean prediction to the plot. Default is True.
es: Si es verdadero, añade la predicción media al gráfico. El valor predeterminado es verdadero.

source: **add_gradient** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **add_gradient** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: If True, add a gradient representation of the full posterior distribution. Default is False.
es: Si es verdadero, añade una representación en gradiente de la distribución posterior completa. El valor predeterminado es falso.

source: **ax** : :obj:`plt.Axes`, optional
es: **ax** : :obj:`plt.Axes`, opcional

source: plt.Axes, optional
es: plt.Axes, opcional

source: A matplotlib Axes object to plot on. If None, a new figure and axes will be created.
es: Un objeto Axes de matplotlib en el que trazar. Si es None, se creará una nueva figura y ejes.

source: Additional keyword arguments to pass to plt.subplots() when creating a new figure.
es: Argumentos adicionales de palabras clave para pasar a plt.subplots() al crear una nueva figura.

source: Returns
es: Devoluciones

source: The matplotlib Figure object containing the plot.
es: El objeto Figure de matplotlib que contiene la gráfica.

source: Raises
es: Aumentos

source: If the length of the target variable doesn't match the length of the date column in the posterior predictive data.
es: Si la longitud de la variable objetivo no coincide con la longitud de la columna de fecha en los datos predictivos posteriores.

source: Notes
es: Notas

source: This function visualizes the model's predictions against the observed data. The observed data is always plotted as a black line. Depending on the parameters, it can also show: - HDI (Highest Density Intervals) at 94% and 50% levels - Mean prediction line - Gradient representation of the full posterior distribution
es: Esta función visualiza las predicciones del modelo en comparación con los datos observados. Los datos observados siempre se representan como una línea negra. Dependiendo de los parámetros, también puede mostrar: - HDI (Intervalos de Mayor Densidad) en niveles del 94% y 50% - Línea de predicción media - Representación del gradiente de la distribución posterior completa

source: If predicting out-of-sample, ensure that `self.y` is overwritten with the corresponding non-transformed target variable.
es: Si se predice fuera de la muestra, asegúrese de que `self.y` se sobrescriba con la variable objetivo no transformada correspondiente.
