Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.additive_effect.EventAdditiveEffect.model_copy.po
Languages: es

source: EventAdditiveEffect.model\_copy
es: EfectoAditivoEvento.modelo_copia

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: Returns a copy of the model.
es: Devuelve una copia del modelo.

source: !!! note
es: !!! nota

source: The underlying instance's [`__dict__`][object.__dict__] attribute is copied. This might have unexpected side effects if you store anything in it, on top of the model fields (e.g. the value of [cached properties][functools.cached_property]).
es: El atributo [`__dict__`][object.__dict__] de la instancia subyacente se copia. Esto podría tener efectos secundarios inesperados si almacena algo en él, además de los campos del modelo (por ejemplo, el valor de [propiedades en caché][functools.cached_property]).

source: update: Values to change/add in the new model. Note: the data is not validated
es: actualizar: Valores a cambiar/agregar en el nuevo modelo. Nota: los datos no están validados.

source: before creating the new model. You should trust this data.
es: antes de crear el nuevo modelo. Debería confiar en estos datos.

source: deep: Set to `True` to make a deep copy of the model.
es: deep: Establezca en `True` para hacer una copia profunda del modelo.

source: Returns:
es: Devoluciones:

source: New model instance.
es: Nueva instancia de modelo.
