Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.special_priors.MaskedPrior.create_likelihood_variable.po
Languages: es

source: MaskedPrior.create\_likelihood\_variable
es: MaskedPrior.crear\_variable\_de\_verosimilitud

source: Create an observed variable over the active subset and expand to full dims.
es: Cree una variable observada sobre el subconjunto activo y expanda a dimensiones completas.

source: Parameters
es: Parámetros

source: **name** : :class:`python:str`
es: **nombre** : :class:`python:str`

source: Base name for the created variables.
es: Nombre base para las variables creadas.

source: Mean/location parameter broadcastable to the masked shape.
es: Parámetro de media/ubicación transmisible a la forma enmascarada.

source: **observed** : :obj:`pt.TensorLike`
es: **observado** : :obj:`pt.TensorLike`

source: Observations broadcastable to the masked shape.
es: Observaciones transmitibles a la forma enmascarada.

source: Returns
es: Devoluciones

source: Deterministic variable over the full dims with observed RV on active entries.
es: Variable determinista sobre todas las dimensiones con RV observada en las entradas activas.
