Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_validate_json.po
Languages: es

source: CustomModelWrapper.model\_validate\_json
es: { "singular": "CustomModelWrapper.model_validar_json", "plural": "CustomModelWrapper.model_validar_json" }

source: !!! abstract "Usage Documentation"
es: { "singular": "!!! abstract \"Documentación de Uso\"", "plural": "!!! abstract \"Documentación de Uso\"" }

source: [JSON Parsing](../concepts/json.md#json-parsing)
es: { "singular": "[Análisis de JSON](../concepts/json.md#json-parsing)", "plural": "[Análisis de JSON](../concepts/json.md#json-parsing)" }

source: Validate the given JSON data against the Pydantic model.
es: { "singular": "Valide los datos JSON proporcionados contra el modelo Pydantic.", "plural": "Valide los datos JSON proporcionados contra el modelo Pydantic." }

source: Args:
es: { "singular": { "msgid": "Args:", "msgstr": "Args:" }, "plural": { "msgid": "Args:", "msgstr": "Args:" } }

source: json_data: The JSON data to validate. strict: Whether to enforce types strictly. extra: Whether to ignore, allow, or forbid extra data during model validation.
es: { "singular": { "msgid": "The JSON data to validate.", "msgstr": "Los datos JSON a validar." }, "plural": { "msgid": "Whether to enforce types strictly.", "msgstr": "Si se debe imponer estrictamente los tipos." }, "extra": { "msgid": "Whether to ignore, allow, or forbid extra data during model validation.", "msgstr": "Si se debe ignorar, permitir o prohibir datos adicionales durante la validación del modelo." } }

source: See the [`extra` configuration value][pydantic.ConfigDict.extra] for details.
es: { "singular": "Consulte el valor de configuración [`extra`][pydantic.ConfigDict.extra] para más detalles.", "plural": "Consulte el valor de configuración [`extra`][pydantic.ConfigDict.extra] para más detalles." }

source: context: Extra variables to pass to the validator. by_alias: Whether to use the field's alias when validating against the provided input data. by_name: Whether to use the field's name when validating against the provided input data.
es: { "singular": { "msgid": "context: Extra variables to pass to the validator. by_alias: Whether to use the field's alias when validating against the provided input data. by_name: Whether to use the field's name when validating against the provided input data.", "msgstr": "contexto: Variables adicionales para pasar al validador. by_alias: Si se debe usar el alias del campo al validar contra los datos de entrada proporcionados. by_name: Si se debe usar el nombre del campo al validar contra los datos de entrada proporcionados." }, "plural": { "msgid": "context: Extra variables to pass to the validator. by_alias: Whether to use the field's alias when validating against the provided input data. by_name: Whether to use the field's name when validating against the provided input data.", "msgstr": "contexto: Variables adicionales para pasar al validador. by_alias: Si se debe usar el alias del campo al validar contra los datos de entrada proporcionados. by_name: Si se debe usar el nombre del campo al validar contra los datos de entrada proporcionados." } }

source: Returns:
es: { "singular": "Devoluciones:", "plural": "Devoluciones:" }

source: The validated Pydantic model.
es: { "singular": "El modelo Pydantic validado.", "plural": "Los modelos Pydantic validados." }

source: Raises:
es: { "singular": "Aumentos:", "plural": "Aumentos:" }

source: ValidationError: If `json_data` is not a JSON string or the object could not be validated.
es: { "singular": "ValidationError: Si `json_data` no es una cadena JSON o el objeto no pudo ser validado.", "plural": "ValidationError: Si `json_data` no es una cadena JSON o los objetos no pudieron ser validados." }
