Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.*.MMMModelBuilder.preprocess.po
Languages: es

source: Preprocess the provided data according to the specified target.
es: Preprocese los datos proporcionados de acuerdo con el objetivo especificado.

source: This method applies preprocessing methods to the data ("X" or "y"), which are specified in the preprocessing_methods property of this object. It iteratively applies each method in the appropriate list (either for "X" or "y") to the data.
es: Este método aplica métodos de preprocesamiento a los datos ("X" o "y"), que se especifican en la propiedad preprocessing_methods de este objeto. Aplica de manera iterativa cada método en la lista apropiada (ya sea para "X" o "y") a los datos.

source: Parameters
es: Parámetros

source: **target** : :class:`python:str`
es: **objetivo** : :class:`python:str`

source: Indicates whether the data represents features ("X") or the target variable ("y").
es: Indica si los datos representan características ("X") o la variable objetivo ("y").

source: **data** : :obj:`Union`\[:obj:`pd.DataFrame`, :obj:`pd.Series`, :obj:`np.ndarray <numpy.ndarray>`]
es: **datos** : :obj:`Union`\[:obj:`pd.DataFrame`, :obj:`pd.Series`, :obj:`np.ndarray <numpy.ndarray>`]

source: Union[pd.DataFrame, pd.Series, np.ndarray]
es: Unión[pd.DataFrame, pd.Series, np.ndarray]

source: The data to be preprocessed.
es: Los datos que se van a preprocesar.

source: Returns
es: Devoluciones

source: :obj:`Union`\[:obj:`pd.DataFrame`, :obj:`pd.Series`, :obj:`np.ndarray <numpy.ndarray>`]
es: :obj:`Unión`\[:obj:`pd.DataFrame`, :obj:`pd.Series`, :obj:`np.ndarray <numpy.ndarray>`]

source: The preprocessed data.
es: Los datos preprocesados.

source: Raises
es: Aumentos

source: If the target is neither "X" nor "y".
es: Si el objetivo no es ni "X" ni "y".
