Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MMM.create_fit_data.po
Languages: es

source: Create a fit dataset aligned on date and present dimensions.
es: Cree un conjunto de datos adecuado alineado en dimensiones de fecha y presentación.

source: Builds and returns an xarray ``Dataset`` that contains:
es: Construye y devuelve un ``Dataset`` de xarray que contiene:

source: data variables from ``X`` (all non-coordinate columns),
es: variables de datos de ``X`` (todas las columnas no de coordenadas),

source: the target variable from ``y`` under ``self.output_var``, and
es: la variable objetivo de ``y`` bajo ``self.output_var``, y

source: coordinates on ``(self.date_column, *dims present in X)``.
es: coordenadas en ``(self.date_column, *dims presentes en X)``.

source: Parameters
es: Parámetros

source: Feature data. If an xarray object is provided, it is converted to a DataFrame via ``to_dataframe().reset_index()`` before processing.
es: Datos de la función. Si se proporciona un objeto xarray, se convierte en un DataFrame a través de ``to_dataframe().reset_index()`` antes del procesamiento.

source: Target values. Must align with ``X`` either by position (same length) or via a MultiIndex that includes ``(self.date_column, *dims present in X)``.
es: Valores objetivo. Deben alinearse con ``X`` ya sea por posición (mismo tamaño) o a través de un MultiIndex que incluya ``(self.date_column, *dims presentes en X)``.

source: Returns
es: Devoluciones

source: Dataset indexed by ``(self.date_column, *dims present in X)`` with the feature variables and a target variable named ``self.output_var``.
es: Conjunto de datos indexado por ``(self.date_column, *dims presentes en X)`` con las variables de características y una variable objetivo llamada ``self.output_var``.

source: Raises
es: Aumentos

source: If ``self.date_column`` is missing in ``X``.
es: Si ``self.date_column`` falta en ``X``.

source: If ``y`` is a ``np.ndarray`` and its length does not match ``X``.
es: Si ``y`` es un ``np.ndarray`` y su longitud no coincide con ``X``.

source: If ``y`` cannot be aligned to ``X`` by index or position.
es: Si ``y`` no puede alinearse con ``X`` por índice o posición.

source: If the target column is missing after alignment.
es: Si la columna objetivo falta después de la alineación.

source: Notes
es: Notas

source: The original date column name is preserved (``self.date_column``).
es: El nombre original de la columna de fecha se conserva (``self.date_column``).

source: Coordinates are assigned only for dimensions present in ``X``.
es: Las coordenadas se asignan solo para las dimensiones presentes en ``X``.

source: Data is sorted by ``(self.date_column, *dims present in X)`` prior to conversion to xarray.
es: Los datos se ordenan por ``(self.date_column, *dims presentes en X)`` antes de la conversión a xarray.

source: Examples
es: Ejemplos
