Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.customer_choice.nested_logit.NestedLogit.prepare_X_matrix.po
Languages: es

source: NestedLogit.prepare\_X\_matrix
es: NestedLogit.preparar\_matriz\_X

source: Prepare the X matrix for the utility equations.
es: Prepare la matriz X para las ecuaciones de utilidad.

source: The X matrix is a tensor with dimensions: (N observations) x (Alternatives) x (Covariates). Assumes that the utility formulas specify an equal number of covariates per alternative; these can be zero-valued if an alternative lacks a specific attribute.
es: La matriz X es un tensor con dimensiones: (N observaciones) x (Alternativas) x (Covariables). Se asume que las fórmulas de utilidad especifican un número igual de covariables por alternativa; estas pueden tener un valor de cero si una alternativa carece de un atributo específico.

source: Utility formulas should express the relationship between the choice outcome (dependent variable) and the attributes of each alternative that incentivize that choice. The left-hand side (LHS) of each formula must correspond to a value of the dependent variable, while the right-hand side (RHS) should define an additive combination of the available covariates.
es: Las fórmulas de utilidad deben expresar la relación entre el resultado de la elección (variable dependiente) y los atributos de cada alternativa que incentivan esa elección. El lado izquierdo (LHS) de cada fórmula debe corresponder a un valor de la variable dependiente, mientras que el lado derecho (RHS) debe definir una combinación aditiva de las covariables disponibles.

source: We also allow the incorporation of fixed covariates that do not vary across alternatives. For these, an alternative-specific parameter is used to allow the contribution to utility to vary by alternative.
es: También permitimos la incorporación de covariables fijas que no varían entre alternativas. Para estas, se utiliza un parámetro específico de la alternativa para permitir que la contribución a la utilidad varíe según la alternativa.

source: Returns
es: Devoluciones

source: :obj:`Tuple` containing:
es: :obj:`Tuple` que contiene:

source: **- X** : :class:`~numpy.ndarray` of :obj:`shape` (:obj:`n_obs`, :obj:`n_alts`, :obj:`n_covariates`)
es: **- X** : :class:`~numpy.ndarray` de :obj:`shape` (:obj:`n_obs`, :obj:`n_alts`, :obj:`n_covariates`)

source: ndarray of shape (n_obs, n_alts, n_covariates)
es: ndarray de forma (n_obs, n_alts, n_covariates)

source: The design matrix for the utility model.
es: La matriz de diseño para el modelo de utilidad.

source: **- F** : :obj:`Optional` :class:`~numpy.ndarray` of :obj:`shape` (:obj:`n_obs`, :obj:`n_fixed_covariates`)
es: **- F** : :obj:`Opcional` :class:`~numpy.ndarray` de :obj:`forma` (:obj:`n_obs`, :obj:`n_fixed_covariates`)

source: Optional ndarray of shape (n_obs, n_fixed_covariates)
es: ndarray opcional de forma (n_obs, n_fixed_covariates)

source: The matrix for fixed covariates (None if no fixed covariates used).
es: La matriz para covariables fijas (Ninguna si no se utilizan covariables fijas).

source: **- alts** : :class:`python:list` of :class:`python:str`
es: **- alts** : :class:`python:list` de :class:`python:str`

source: python:list of python:str
es: python:lista de python:str

source: Names of the alternatives (LHS of the utility equations).
es: Nombres de las alternativas (lado izquierdo de las ecuaciones de utilidad).

source: Array of unique fixed covariate names.
es: Array de nombres de covariables fijas únicas.
