Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.data.fivetran.FivetranAccessor.process_shopify_unique_orders.po
Languages: es

source: FivetranAccessor.process\_shopify\_unique\_orders
es: FivetranAccessor.procesar\_pedidos\_únicos\_shopify

source: Compute daily unique order counts from a (pre-filtered) Shopify dataset.
es: Calcule el conteo diario de pedidos únicos a partir de un conjunto de datos de Shopify (pre-filtrado).

source: This function targets data following the Fivetran Shopify orders schema (e.g., ``shopify__orders``). It assumes the input ``df`` is already filtered to the desired subset (e.g., non-canceled, US-delivery, new-only orders).
es: Esta función está dirigida a datos que siguen el esquema de pedidos de Fivetran Shopify (por ejemplo, ``shopify__orders``). Supone que la entrada ``df`` ya está filtrada al subconjunto deseado (por ejemplo, pedidos no cancelados, de entrega en EE. UU., solo nuevos).

source: Parameters
es: Parámetros

source: Input dataframe following the Shopify orders schema.
es: Entrada de dataframe siguiendo el esquema de pedidos de Shopify.

source: **date_col** : :class:`python:str`, default "processed_timestamp"
es: **date_col** : :class:`python:str`, predeterminado "processed_timestamp"

source: python:str, default "processed_timestamp"
es: python:str, predeterminado "processed_timestamp"

source: Timestamp column from which the daily bucket is derived.
es: Columna de marca de tiempo de la cual se deriva el bucket diario.

source: **order_key_col** : :class:`python:str`, default "orders_unique_key"
es: **order_key_col** : :class:`python:str`, predeterminado "orders_unique_key"

source: python:str, default "orders_unique_key"
es: python:str, valor predeterminado "orders_unique_key"

source: Unique order identifier column.
es: Columna de identificador de pedido único.

source: **rename_date_to** : :class:`python:str`, default "date"
es: msgid: **rename_date_to** : :class:`python:str`, default "date" msgstr: **rename_date_to** : :class:`python:str`, predeterminado "date"

source: python:str, default "date"
es: python:str, predeterminado "fecha"

source: Name of the date column in the result.
es: Nombre de la columna de fecha en el resultado.

source: Returns
es: Devoluciones

source: A dataframe with two columns: ``rename_date_to`` and ``orders``, where ``orders`` is the unique order count per day.
es: Un dataframe con dos columnas: ``rename_date_to`` y ``orders``, donde ``orders`` es el conteo único de pedidos por día.
