Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModelIndividual.load.po
Languages: es

source: ShiftedBetaGeoModelIndividual.load
es: ShiftedBetaGeoModelIndividual.cargar

source: Create a ModelBuilder instance from a file.
es: Cree una instancia de ModelBuilder a partir de un archivo.

source: Loads inference data for the model.
es: Carga los datos de inferencia para el modelo.

source: This class method has a few steps:
es: Este método de clase tiene algunos pasos:

source: Load the InferenceData from the file.
es: Cargue el InferenceData desde el archivo.

source: Construct a new instance of the model using the InferenceData attrs
es: Construya una nueva instancia del modelo utilizando los atributos de InferenceData.

source: Build the model from the InferenceData
es: Construya el modelo a partir de los InferenceData.

source: Check if the model id matches the id in the InferenceData loaded.
es: Verifique si el id del modelo coincide con el id en los InferenceData cargados.

source: Parameters
es: Parámetros

source: This denotes the name with path from where idata should be loaded from.
es: Esto denota el nombre con la ruta desde donde se debe cargar idata.

source: **check** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **verificar** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to check if the model id matches the id in the InferenceData loaded. Defaults to True.
es: Si se debe verificar si el id del modelo coincide con el id en los InferenceData cargados. Por defecto es True.

source: Returns
es: Devoluciones

source: :obj:`Returns` :obj:`an` instance of ModelBuilder.
es: Devuelve una instancia de ModelBuilder.

source: Raises
es: Aumentos

source: If the inference data that is loaded doesn't match with the model.
es: Si los datos de inferencia que se cargan no coinciden con el modelo.

source: Examples
es: Ejemplos

source: Load a model from a file
es: Cargar un modelo desde un archivo
