Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.fourier.WeeklyFourier.get_default_start_date.po
Languages: es

source: WeeklyFourier.get\_default\_start\_date
es: WeeklyFourier.obtener\_fecha\_de\_inicio\_predeterminada

source: Get the start date for the Fourier curve.
es: Obtenga la fecha de inicio para la curva de Fourier.

source: If `start_date` is provided, validate its type. Otherwise, provide the default start date based on the subclass implementation.
es: Si se proporciona `start_date`, valide su tipo. De lo contrario, proporcione la fecha de inicio predeterminada según la implementación de la subclase.

source: Parameters
es: Parámetros

source: **start_date** : :class:`python:str` or :obj:`datetime.datetime`, optional
es: **start_date** : :class:`python:str` o :obj:`datetime.datetime`, opcional

source: python:str or datetime.datetime, optional
es: python:str o datetime.datetime, opcional

source: Provided start date. Can be a string or a datetime object.
es: Fecha de inicio proporcionada. Puede ser una cadena o un objeto datetime.

source: Returns
es: Devoluciones

source: :class:`python:str` or :obj:`datetime.datetime`
es: :class:`python:str` o :obj:`datetime.datetime`

source: The validated start date.
es: La fecha de inicio validada.

source: Raises
es: Aumentos

source: If `start_date` is neither a string nor a datetime object.
es: Si `start_date` no es ni una cadena ni un objeto datetime.
