Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.fourier.FourierBase.model_json_schema.po
Languages: es

source: FourierBase.model\_json\_schema
es: FourierBase.modelo\_json\_esquema

source: Generates a JSON schema for a model class.
es: Genera un esquema JSON para una clase de modelo.

source: by_alias: Whether to use attribute aliases or not. ref_template: The reference template. union_format: The format to use when combining schemas from unions together. Can be one of:
es: by_alias: Si se deben utilizar alias de atributos o no. ref_template: La plantilla de referencia. union_format: El formato a utilizar al combinar esquemas de uniones. Puede ser uno de:

source: `'any_of'`: Use the [`anyOf`](https://json-schema.org/understanding-json-schema/reference/combining#anyOf)
es: 'any_of': Utilice el [`anyOf`](https://json-schema.org/understanding-json-schema/reference/combining#anyOf)

source: keyword to combine schemas (the default). - `'primitive_type_array'`: Use the [`type`](https://json-schema.org/understanding-json-schema/reference/type) keyword as an array of strings, containing each type of the combination. If any of the schemas is not a primitive type (`string`, `boolean`, `null`, `integer` or `number`) or contains constraints/metadata, falls back to `any_of`.
es: palabra clave para combinar esquemas (el predeterminado). - `'primitive_type_array'`: Utilice la palabra clave [`type`](https://json-schema.org/understanding-json-schema/reference/type) como un array de cadenas, que contenga cada tipo de la combinaci칩n. Si alguno de los esquemas no es un tipo primitivo (`string`, `boolean`, `null`, `integer` o `number`) o contiene restricciones/metadatos, se retrocede a `any_of`.

source: schema_generator: To override the logic used to generate the JSON schema, as a subclass of
es: schema_generator: Para anular la l칩gica utilizada para generar el esquema JSON, como una subclase de

source: `GenerateJsonSchema` with your desired modifications
es: GenerarJsonSchema con las modificaciones deseadas

source: mode: The mode in which to generate the schema.
es: modo: El modo en el que se generar치 el esquema.

source: Returns:
es: Devoluciones:

source: The JSON schema for the given model class.
es: El esquema JSON para la clase de modelo dada.
