Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.plot_channel_contribution_grid.po
Languages: es

source: Plot a grid of scaled channel contributions for a given grid of share values.
es: Trazar una cuadrícula de contribuciones de canal escaladas para una cuadrícula dada de valores de acciones.

source: Parameters
es: Parámetros

source: **start** : :class:`python:float`
es: **inicio** : :class:`python:float`

source: Start of the grid. It must be equal or greater than 0.
es: Inicio de la cuadrícula. Debe ser igual o mayor que 0.

source: **stop** : :class:`python:float`
es: **detener** : :class:`python:float`

source: End of the grid. It must be greater than start.
es: Fin de la cuadrícula. Debe ser mayor que el inicio.

source: Number of points in the grid.
es: Número de puntos en la cuadrícula.

source: **absolute_xrange** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **absolute_xrange** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If True, the x-axis is in absolute values (input units), otherwise it is in relative percentage values, by default False.
es: Si es verdadero, el eje x está en valores absolutos (unidades de entrada), de lo contrario está en valores porcentuales relativos, por defecto falso.

source: Keyword arguments to pass to `plt.subplots()`
es: Argumentos de palabras clave para pasar a `plt.subplots()`

source: Returns
es: Devoluciones

source: Plot of grid of channel contributions.
es: Gráfico de la cuadrícula de contribuciones del canal.
