Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.sensitivity_analysis.SensitivityAnalysis.run_sweep.po
Languages: es

source: SensitivityAnalysis.run\_sweep
es: SensitivityAnalysis.ejecutar\_barrido

source: Run the model's predict function over the sweep grid and store results.
es: Ejecute la función de predicción del modelo sobre la cuadrícula de barrido y almacene los resultados.

source: Parameters
es: Parámetros

source: List of variable names to intervene on.
es: Lista de nombres de variables para intervenir.

source: Array of sweep values.
es: Array de valores de barrido.

source: **sweep_type** : :obj:`Literal`\["multiplicative", "additive", "absolute"], optional
es: **sweep_type** : :obj:`Literal`\["multiplicativo", "aditivo", "absoluto"], opcional

source: Literal["multiplicative", "additive", "absolute"], optional
es: Literal["multiplicativo", "aditivo", "absoluto"], opcional

source: Type of intervention to apply, by default "multiplicative". - 'multiplicative': Multiply the original predictor values by each sweep value. - 'additive': Add each sweep value to the original predictor values. - 'absolute': Set the predictor values directly to each sweep value (ignoring original values).
es: Tipo de intervención a aplicar, por defecto "multiplicativa". - 'multiplicativa': Multiplicar los valores originales de los predictores por cada valor de barrido. - 'aditiva': Sumar cada valor de barrido a los valores originales de los predictores. - 'absoluta': Establecer los valores de los predictores directamente a cada valor de barrido (ignorando los valores originales).

source: Returns
es: Devoluciones

source: Dataset containing the sensitivity analysis results.
es: Conjunto de datos que contiene los resultados del análisis de sensibilidad.
