Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.plot_channel_parameter.po
Languages: es

source: Plot the posterior distribution of a specific parameter for each channel.
es: Trace la distribución posterior de un parámetro específico para cada canal.

source: Parameters
es: Parámetros

source: The name of the parameter to plot.
es: El nombre del parámetro a graficar.

source: **\*\*plt_kwargs** : :obj:`Any`
es: **\*\*plt_kwargs** : :obj:`Cualquiera`

source: Any
es: Cualquiera

source: Additional keyword arguments to pass to the `plt.subplots` function.
es: Argumentos adicionales de palabras clave para pasar a la función `plt.subplots`.

source: Returns
es: Devoluciones

source: The matplotlib Figure object containing the plot.
es: El objeto Figure de matplotlib que contiene la gráfica.

source: Raises
es: Aumentos

source: If the specified parameter name is invalid or not found in the model saturation or adstock function.
es: Si el nombre del parámetro especificado es inválido o no se encuentra en la función de saturación o adstock del modelo.
