Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.*.BaseValidateMMM.sample_posterior_predictive.po
Languages: es

source: BaseValidateMMM.sample\_posterior\_predictive
es: BaseValidateMMM.muestra\_predictiva\_posterior

source: Sample from the model's posterior predictive distribution.
es: Muestra de la distribución predictiva posterior del modelo.

source: Parameters
es: Parámetros

source: array, shape (n_pred, n_features)
es: array, forma (n_pred, n_features)

source: The input data used for prediction using prior distribution..
es: Los datos de entrada utilizados para la predicción mediante la distribución previa.

source: **extend_idata** : :obj:`Boolean`
es: **extend_idata** : :obj:`Booleano`

source: Determine whether the predictions should be added to inference data object. Defaults to True.
es: Determine si las predicciones deben ser añadidas al objeto de datos de inferencia. Por defecto es True.

source: **combined: Boolean**
es: **combinado: Booleano**

source: Combine chain and draw dims into sample. Won't work if a dim named sample already exists. Defaults to True.
es: Combina la cadena y las dimensiones de dibujo en la muestra. No funcionará si ya existe una dimensión llamada muestra. Por defecto es True.

source: **\*\*sample_posterior_predictive_kwargs: Additional arguments to pass to pymc.sample_posterior_predictive**
es: **\*\*sample_posterior_predictive_kwargs: Argumentos adicionales para pasar a pymc.sample_posterior_predictive**

source: Returns
es: Devoluciones

source: **posterior_predictive_samples** : :obj:`DataArray`, :obj:`shape` (:obj:`n_pred`, :obj:`samples`)
es: **muestras_predictivas_posteriores** : :obj:`DataArray`, :obj:`forma` (:obj:`n_pred`, :obj:`muestras`)

source: DataArray, shape (n_pred, samples)
es: DataArray, forma (n_pred, muestras)

source: Posterior predictive samples for each input X
es: Muestras predictivas posteriores para cada entrada X
