Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.*.MMMModelBuilder.validate.po
Languages: es

source: MMMModelBuilder.validate
es: MMMModelBuilder.validar

source: Validate the input data based on the specified target type.
es: Valide los datos de entrada según el tipo de destino especificado.

source: This function loops over the validation methods specified for the target type and applies them to the input data.
es: Esta función itera sobre los métodos de validación especificados para el tipo objetivo y los aplica a los datos de entrada.

source: Parameters
es: Parámetros

source: **target** : :class:`python:str`
es: **objetivo** : :class:`python:str`

source: The type of target to be validated. Expected values are "X" for features and "y" for the target variable.
es: El tipo de objetivo que debe ser validado. Los valores esperados son "X" para características y "y" para la variable objetivo.

source: **data** : :obj:`Union`\[:obj:`pd.DataFrame`, :obj:`pd.Series`, :obj:`np.ndarray <numpy.ndarray>`]
es: **datos** : :obj:`Union`\[:obj:`pd.DataFrame`, :obj:`pd.Series`, :obj:`np.ndarray <numpy.ndarray>`]

source: Union[pd.DataFrame, pd.Series, np.ndarray]
es: Unión[pd.DataFrame, pd.Series, np.ndarray]

source: The input data to be validated.
es: Los datos de entrada que deben ser validados.

source: Raises
es: Aumentos

source: If the target type is not "X" or "y", a ValueError will be raised.
es: Si el tipo de destino no es "X" o "y", se generará un ValueError.
