Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.plot_new_spend_contributions.po
Languages: es

source: Plot the upcoming sales for a given spend amount.
es: Grafique las ventas futuras para una cantidad de gasto dada.

source: Calls the new_spend_contributions method and plots the results. For more control over the plot, use new_spend_contributions directly.
es: Llama al método new_spend_contributions y traza los resultados. Para tener más control sobre la gráfica, utiliza new_spend_contributions directamente.

source: Parameters
es: Parámetros

source: **spend_amount** : :class:`python:float`
es: **gastar_monto** : :class:`python:float`

source: The amount of spend for each channel
es: La cantidad de gasto para cada canal

source: **one_time** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **una_vez** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether the spend are one time (at start of period) or constant (over period), by default True (one time)
es: Ya sea que el gasto sea único (al inicio del período) o constante (durante el período), por defecto es Verdadero (único)

source: **lower** : :class:`python:float`, optional
es: **inferior** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: The lower quantile for the confidence interval, by default 0.025
es: El cuartil inferior para el intervalo de confianza, por defecto 0.025

source: **upper** : :class:`python:float`, optional
es: **superior** : :class:`python:float`, opcional

source: The upper quantile for the confidence interval, by default 0.975
es: El cuartil superior para el intervalo de confianza, por defecto 0.975

source: **ylabel** : :class:`python:str`, optional
es: **ylabel** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The label for the y-axis, by default "Sales"
es: La etiqueta para el eje y, por defecto "Ventas"

source: **idx** : :obj:`slice`, optional
es: **idx** : :obj:`slice`, opcional

source: slice, optional
es: rebanada, opcional

source: The index slice of days to plot, by default None or only the positive days. More specifically, slice(0, None, None)
es: El índice de días a graficar, por defecto None o solo los días positivos. Más específicamente, slice(0, None, None)

source: **channels** : :obj:`List`\[:class:`python:str`], optional
es: **canales** : :obj:`Lista`\[:class:`python:str`], opcional

source: List[python:str], optional
es: Lista[python:str], opcional

source: The channels to plot, by default None or all channels
es: Los canales a graficar, por defecto None o todos los canales

source: **prior** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **anterior** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to use the prior or posterior, by default False (posterior)
es: Si utilizar el anterior o el posterior, por defecto Falso (posterior)

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to plot in the original scale of the target variable, by default True
es: Si se debe graficar en la escala original de la variable objetivo, por defecto Verdadero

source: **ax** : :obj:`plt.Axes`, optional
es: **ax** : :obj:`plt.Axes`, opcional

source: plt.Axes, optional
es: plt.Axes, opcional

source: The axes to plot on, by default None or current axes
es: Los ejes en los que trazar, por defecto None o los ejes actuales.

source: Additional keyword arguments passed to pm.sample_posterior_predictive
es: Argumentos adicionales de palabras clave pasados a pm.sample_posterior_predictive

source: Returns
es: Devoluciones

source: The plot of upcoming sales for the given spend amount
es: La representación de las ventas futuras para el monto de gasto dado
