Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.set_idata_attrs.po
Languages: es

source: ShiftedBetaGeoModel.set\_idata\_attrs
es: { "singular": "ShiftedBetaGeoModel.set_idata_attrs", "plural": "ShiftedBetaGeoModel.set_idata_attrs" }

source: Set attributes on an InferenceData object.
es: { "singular": "Establecer atributos en un objeto InferenceData.", "plural": "Establecer atributos en objetos InferenceData." }

source: Parameters
es: { "singular": { "msgid": "Parameters", "msgstr": "Par치metro" }, "plural": { "msgid": "Parameters", "msgstr": "Par치metros" } }

source: **idata** : :obj:`arviz.InferenceData`, optional
es: { "singular": "**idata** : :obj:`arviz.InferenceData`, opcional", "plural": "**idata** : :obj:`arviz.InferenceData`, opcional" }

source: arviz.InferenceData, optional
es: { "singular": "arviz.InferenceData, opcional", "plural": "arviz.InferenceData, opcional" }

source: The InferenceData object to set attributes on.
es: { "singular": "El objeto InferenceData para establecer atributos.", "plural": "Los objetos InferenceData para establecer atributos." }

source: Returns
es: { "singular": { "msgid": "Returns", "msgstr": "Devoluciones" }, "plural": { "msgid": "Returns", "msgstr": "Devoluciones" } }

source: :class:`~arviz.InferenceData`
es: { "singular": ":class:`~arviz.InferenceData`", "plural": ":class:`~arviz.InferenceData`" }

source: The InferenceData instance with the attrs set
es: { "singular": "La instancia de InferenceData con los atributos establecidos", "plural": "Las instancias de InferenceData con los atributos establecidos" }

source: Raises
es: { "singular": "Aumento", "plural": "Aumentos" }

source: :obj:`ValueError`
es: { "singular": ":obj:`ValueError`", "plural": ":obj:`ValueError`" }

source: If the attrs are missing for a property initialization of the class
es: { "singular": "Si faltan los attrs para la inicializaci칩n de una propiedad de la clase", "plural": "Si faltan los attrs para la inicializaci칩n de propiedades de la clase" }

source: :obj:`RuntimeError`
es: { "singular": ":obj:`RuntimeError`", "plural": ":obj:`RuntimeError`" }

source: If no InferenceData object is provided.
es: { "singular": "Si no se proporciona un objeto InferenceData.", "plural": "Si no se proporcionan objetos InferenceData." }

source: Examples
es: { "singular": "Ejemplo", "plural": "Ejemplos" }

source: Set the attrs for an InferenceData object manually.
es: { "singular": "Establezca los attrs para un objeto InferenceData manualmente.", "plural": "Establezca los attrs para objetos InferenceData manualmente." }
