Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MMM.add_cost_per_target_calibration.po
Languages: es

source: MMM.add\_cost\_per\_target\_calibration
es: MMM.agregar\_costo\_por\_calibración\_de\_objetivo

source: Calibrate cost-per-target using constraints via ``pm.Potential``.
es: Calibre el costo por objetivo utilizando restricciones a través de ``pm.Potential``.

source: This adds a deterministic ``cpt_variable_name`` computed as ``channel_data_spend / channel_contribution_original_scale`` and creates per-row penalty terms based on ``calibration_data`` using a quadratic penalty:
es: Esto añade un ``cpt_variable_name`` determinista calculado como ``channel_data_spend / channel_contribution_original_scale`` y crea términos de penalización por fila basados en ``calibration_data`` utilizando una penalización cuadrática:

source: Parameters
es: Parámetros

source: **data** : :obj:`pd.DataFrame`
es: **datos** : :obj:`pd.DataFrame`

source: Feature-like DataFrame with columns matching training ``X`` but with channel values representing spend (original units). Must include the same ``date`` and any model ``dims`` columns.
es: DataFrame similar a una característica con columnas que coinciden con el entrenamiento ``X``, pero con valores de canal que representan el gasto (unidades originales). Debe incluir la misma ``fecha`` y cualquier columna de ``dims`` del modelo.

source: DataFrame with rows specifying calibration targets. Must include:
es: DataFrame con filas que especifican los objetivos de calibración. Debe incluir:

source: ``channel``: channel name in ``self.channel_columns``
es: ``channel``: nombre del canal en ``self.channel_columns``

source: ``cost_per_target``: desired CPT value
es: ``cost_per_target``: valor CPT deseado

source: ``sigma``: accepted deviation; larger => weaker penalty
es: ``sigma``: desviación aceptada; mayor => penalización más débil

source: and one column per dimension in ``self.dims``.
es: y una columna por dimensión en ``self.dims``.

source: Name for the cost-per-target Deterministic in the model.
es: Nombre para el costo por objetivo Determinista en el modelo.

source: Prefix to use for generated potential names.
es: Prefijo a utilizar para los nombres potenciales generados.

source: Examples
es: Ejemplos

source: Build a model and calibrate CPT for selected (dims, channel):
es: Construya un modelo y calibra CPT para los seleccionados (dims, canal):
