Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.customer_choice.nested_logit.NestedLogit.make_exp_nest.po
Languages: es

source: NestedLogit.make\_exp\_nest
es: NestedLogit.hacer\_exp\_nido

source: Calculate within-nest probabilities for nested logit models.
es: Calcular las probabilidades dentro del nido para modelos logit anidados.

source: This function recursively computes the utility aggregates used to build a nested logit model within a PyMC probabilistic framework. Specifically, it calculates:
es: Esta función calcula recursivamente los agregados de utilidad utilizados para construir un modelo logit anidado dentro de un marco probabilístico de PyMC. Específicamente, calcula:

source: **Conditional choice probabilities within a nest**:
es: **Probabilidades de elección condicional dentro de un nido**:

source: This is a softmax probability scaled by the nest-specific temperature (scale) parameter \\( \lambda \\).
es: Esta es una probabilidad softmax escalada por el parámetro de temperatura específico del nido (escala) \\( \lambda \\).

source: **Inclusive value (or log-sum utility)**:
es: **Valor inclusivo (o utilidad de suma logarítmica)**:

source: This quantity represents the “meta-utility” of a nest, passed up the hierarchy in nested logit models.
es: Esta cantidad representa la “meta-utilidad” de un nido, transmitida a través de la jerarquía en modelos de logit anidados.

source: **Exponentiated meta-utility**:
es: **Meta-utilidad exponenciada**:

source: An exponentiated term combining inclusive value and fixed covariate contributions, used when computing choice probabilities in the parent nest.
es: Un término exponenciado que combina el valor inclusivo y las contribuciones de covariables fijas, utilizado al calcular las probabilidades de elección en el nido principal.

source: Parameters
es: Parámetros

source: Tensor of shape (N, J), where N is the number of observations and J is the number of alternatives. Represents latent utilities.
es: Tensor de forma (N, J), donde N es el número de observaciones y J es el número de alternativas. Representa utilidades latentes.

source: **W** : :class:`~pytensor.tensor.TensorVariable` or :data:`python:None`
es: **W** : :class:`~pytensor.tensor.TensorVariable` o :data:`python:None`

source: TensorVariable or python:None
es: TensorVariable o python:None

source: Optional tensor of shape (N, K), where K is the number of fixed covariates. Represents covariate contributions that do not vary across alternatives.
es: Tensor opcional de forma (N, K), donde K es el número de covariables fijas. Representa las contribuciones de covariables que no varían entre alternativas.

source: Tensor of shape (J, K), with one coefficient vector per alternative for fixed (non-alternative-varying) covariates.
es: Tensor de forma (J, K), con un vector de coeficientes por alternativa para covariables fijas (no variables según la alternativa).

source: A tensor containing the nest-specific scale parameters \\( \lambda \\), typically modeled with a Beta distribution.
es: Un tensor que contiene los parámetros de escala específicos del nido \\( \lambda \\), modelados típicamente con una distribución Beta.

source: **nest** : :class:`python:str`
es: **nido** : :class:`python:str`

source: Name of the current nest to process (e.g., `"Land"` or `"Land_Car"`). Determines which subset of alternatives belongs to the nest.
es: Nombre del nido actual a procesar (por ejemplo, {Land} o {Land_Car}). Determina qué subconjunto de alternativas pertenece al nido.

source: **level** : :class:`python:str`, default="top"
es: **nivel** : :class:`python:str`, predeterminado="top"

source: python:str, default="top"
es: python:str, predeterminado="top"

source: Either `"top"` or `"mid"`, indicating the level of the nest in the hierarchical structure. Used to select the correct index mapping.
es: Ya sea `"top"` o `"mid"`, indicando el nivel del nido en la estructura jerárquica. Se utiliza para seleccionar el mapeo de índice correcto.

source: Returns
es: Devoluciones

source: Exponentiated meta-utility for the current nest, used in the parent nest’s softmax normalization.
es: Meta-utilidad exponenciada para el nido actual, utilizada en la normalización softmax del nido padre.

source: **P_y_given_nest** : :class:`~pytensor.tensor.TensorVariable`
es: **P_y_dado_nido** : :class:`~pytensor.tensor.TensorVariable`

source: Conditional probability of choosing each alternative within the current nest.
es: Probabilidad condicional de elegir cada alternativa dentro del nido actual.

source: Notes
es: Notas

source: This function supports two-level nested logit models, where alternatives are grouped into mutually exclusive nests. The scale parameter \\( \lambda \\) controls the degree of substitutability within each nest.
es: Esta función admite modelos logit anidados de dos niveles, donde las alternativas se agrupan en nidos mutuamente excluyentes. El parámetro de escala \\( \lambda \\) controla el grado de sustituibilidad dentro de cada nido.

source: Currently, deeper nesting levels (more than two) are not supported, to simplify both modeling and computation.
es: Actualmente, no se admiten niveles de anidamiento más profundos (más de dos) para simplificar tanto la modelización como el cálculo.
