Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_dump_json.po
Languages: es

source: Generates a JSON representation of the model using Pydantic's `to_json` method.
es: Genera una representación JSON del modelo utilizando el método `to_json` de Pydantic.

source: indent: Indentation to use in the JSON output. If None is passed, the output will be compact. ensure_ascii: If `True`, the output is guaranteed to have all incoming non-ASCII characters escaped.
es: msgid: indent: Indentation to use in the JSON output. If None is passed, the output will be compact. ensure_ascii: If `True`, the output is guaranteed to have all incoming non-ASCII characters escaped. msgstr: indent: Sangría a utilizar en la salida JSON. Si se pasa None, la salida será compacta. ensure_ascii: Si es `True`, se garantiza que la salida tendrá todos los caracteres no ASCII entrantes escapados.

source: If `False` (the default), these characters will be output as-is.
es: msgid: If `False` (the default), these characters will be output as-is. msgstr: Si `False` (el valor predeterminado), estos caracteres se mostrarán tal como están.

source: include: Field(s) to include in the JSON output. exclude: Field(s) to exclude from the JSON output. context: Additional context to pass to the serializer. by_alias: Whether to serialize using field aliases. exclude_unset: Whether to exclude fields that have not been explicitly set. exclude_defaults: Whether to exclude fields that are set to their default value. exclude_none: Whether to exclude fields that have a value of `None`. exclude_computed_fields: Whether to exclude computed fields.
es: msgid: include: Field(s) to include in the JSON output. exclude: Field(s) to exclude from the JSON output. context: Additional context to pass to the serializer. by_alias: Whether to serialize using field aliases. exclude_unset: Whether to exclude fields that have not been explicitly set. exclude_defaults: Whether to exclude fields that are set to their default value. exclude_none: Whether to exclude fields that have a value of `None`. exclude_computed_fields: Whether to exclude computed fields. msgstr: incluir: Campo(s) a incluir en la salida JSON. excluir: Campo(s) a excluir de la salida JSON. contexto: Contexto adicional para pasar al serializador. por_alias: Si se debe serializar utilizando alias de campo. excluir_no_establecidos: Si se deben excluir los campos que no han sido establecidos explícitamente. excluir_valores_por_defecto: Si se deben excluir los campos que están establecidos en su valor por defecto. excluir_nulo: Si se deben excluir los campos que tienen un valor de `None`. excluir_campos_computados: Si se deben excluir los campos computados.

source: While this can be useful for round-tripping, it is usually recommended to use the dedicated `round_trip` parameter instead.
es: msgid: While this can be useful for round-tripping, it is usually recommended to use the dedicated `round_trip` parameter instead. msgstr: Si bien esto puede ser útil para el intercambio de datos, generalmente se recomienda utilizar el parámetro `round_trip` dedicado en su lugar.

source: round_trip: If True, dumped values should be valid as input for non-idempotent types such as Json[T]. warnings: How to handle serialization errors. False/"none" ignores them, True/"warn" logs errors,
es: msgid: round_trip: If True, dumped values should be valid as input for non-idempotent types such as Json[T]. warnings: How to handle serialization errors. False/"none" ignores them, True/"warn" logs errors, msgstr: round_trip: Si es True, los valores volcado deben ser válidos como entrada para tipos no idempotentes como Json[T]. advertencias: Cómo manejar los errores de serialización. False/"none" los ignora, True/"warn" registra errores,

source: "error" raises a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].
es: msgid: "error" raises a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError]. msgstr: "error" genera un [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].

source: fallback: A function to call when an unknown value is encountered. If not provided,
es: msgid: fallback: A function to call when an unknown value is encountered. If not provided, msgstr: fallback: Una función a llamar cuando se encuentra un valor desconocido. Si no se proporciona,

source: a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError] error is raised.
es: msgid: a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError] error is raised. msgstr: se genera un error [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].

source: serialize_as_any: Whether to serialize fields with duck-typing serialization behavior.
es: msgid: serialize_as_any: Whether to serialize fields with duck-typing serialization behavior. msgstr: serialize_as_any: Si se deben serializar los campos con un comportamiento de serialización de tipo pato.

source: A JSON string representation of the model.
es: msgid: A JSON string representation of the model. msgstr: Una representación en cadena JSON del modelo.
