Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.causal.TBF_FCI.to_digraph.po
Languages: es

source: TBF\_FCI.to\_digraph
es: { "singular": "TBF_FCI.to_digraph", "plural": "TBF_FCI.to_digraph" }

source: Export the learned graph as DOT text.
es: { "singular": { "msgid": "Export the learned graph as DOT text.", "msgstr": "Exporte el grafo aprendido como texto DOT." }, "plural": { "msgid": "Export the learned graph as DOT text.", "msgstr": "Exporte los grafos aprendidos como texto DOT." } }

source: Parameters
es: { "singular": "Par치metro", "plural": "Par치metros" }

source: **collapsed** : :ref:`bool <python:bltin-boolean-values>`, default :data:`python:True`
es: { "singular": "**colapsado** : :ref:`bool <python:bltin-boolean-values>`, predeterminado :data:`python:True`", "plural": "**colapsados** : :ref:`bool <python:bltin-boolean-values>`, predeterminado :data:`python:True`" }

source: bool, default python:True
es: { "singular": "bool, predeterminado python:True", "plural": "bool, predeterminado python:True" }

source: ``True`` collapses the time-unrolled graph into driver-level nodes with lag annotations; ``False`` returns the full lag-expanded structure.
es: { "singular": "``True`` colapsa el gr치fico desenrollado en el nivel de controladores con anotaciones de latencia; ``False`` devuelve la estructura completa expandida por latencia.", "plural": "``True`` colapsa los gr치ficos desenrollados en los niveles de controladores con anotaciones de latencia; ``False`` devuelve las estructuras completas expandidas por latencia." }

source: Returns
es: { "singular": "Devoluciones", "plural": "Devoluciones" }

source: :class:`python:str`
es: { "singular": ":class:`python:str`", "plural": ":class:`python:str`" }

source: DOT format string suitable for Graphviz rendering.
es: { "singular": "Cadena de formato DOT adecuada para el renderizado de Graphviz.", "plural": "Cadenas de formato DOT adecuadas para el renderizado de Graphviz." }

source: Examples
es: { "singular": "Ejemplo", "plural": "Ejemplos" }
