Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.plot.MMMPlotSuite.saturation_curves.po
Languages: es

source: MMMPlotSuite.saturation\_curves
es: MMMPlotSuite.curvas\_de\_saturación

source: Overlay saturation‑curve scatter‑plots with posterior‑predictive sample curves and HDI bands.
es: Superponer gráficos de dispersión de la curva de saturación con curvas de muestra predictiva posterior y bandas de HDI.

source: **allowing** you to customize figsize and font sizes.
es: **permitiéndole** personalizar el tamaño de la figura y los tamaños de fuente.

source: Parameters
es: Parámetros

source: **curve** : :obj:`xr.DataArray`
es: **curva** : :obj:`xr.DataArray`

source: Posterior‑predictive curves (e.g. dims `("chain","draw","x","channel","geo")`).
es: Curvas posteriores predictivas (por ejemplo, dims `("chain","draw","x","channel","geo")`).

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, default=False
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, predeterminado=False

source: bool, default=False
es: bool, predeterminado=False

source: Plot `channel_contribution_original_scale` if True, else `channel_contribution`.
es: Dibuje `channel_contribution_original_scale` si es verdadero, de lo contrario `channel_contribution`.

source: **n_samples** : :class:`python:int`, default=10
es: **n_samples** : :class:`python:int`, predeterminado=10

source: python:int, default=10
es: python:int, por defecto=10

source: Number of sample‑curves per subplot.
es: Número de curvas de muestra por subgráfico.

source: **hdi_probs** : :class:`python:float` or :class:`python:list` of :class:`python:float`, optional
es: **hdi_probs** : :class:`python:float` o :class:`python:list` de :class:`python:float`, opcional

source: python:float or python:list of python:float, optional
es: python:float o python:list de python:float, opcional

source: Credible interval probabilities (e.g. 0.94 or [0.5, 0.94]). If None, uses ArviZ's default (0.94).
es: Probabilidades de intervalos creíbles (por ejemplo, 0.94 o [0.5, 0.94]). Si es None, utiliza el valor predeterminado de ArviZ (0.94).

source: **random_seed** : :obj:`np.random.Generator`, optional
es: **random_seed** : :obj:`np.random.Generator`, opcional

source: np.random.Generator, optional
es: np.random.Generator, opcional

source: RNG for reproducible sampling. If None, uses `np.random.default_rng()`.
es: RNG para muestreo reproducible. Si es None, utiliza `np.random.default_rng()`.

source: **colors** : :term:`python:iterable` of :class:`python:str`, optional
es: **colores** : :term:`python:iterable` de :class:`python:str`, opcional

source: python:iterable of python:str, optional
es: python: iterable de python:str, opcional

source: Colors for the sample & HDI plots.
es: Colores para las muestras y gráficos de HDI.

source: **subplot_kwargs** : :class:`python:dict`, optional
es: **subplot_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Passed to `plt.subplots` (e.g. `{"figsize": (10,8)}`). Merged with the function's own default sizing.
es: Pasado a `plt.subplots` (por ejemplo, `{"figsize": (10,8)}`). Fusionado con el tamaño predeterminado de la función.

source: **rc_params** : :class:`python:dict`, optional
es: **rc_params** : :class:`python:dict`, opcional

source: Temporary `matplotlib.rcParams` for this plot. Example keys: `"xtick.labelsize"`, `"ytick.labelsize"`, `"axes.labelsize"`, `"axes.titlesize"`.
es: `matplotlib.rcParams` temporales para este gráfico. Claves de ejemplo: `"xtick.labelsize"`, `"ytick.labelsize"`, `"axes.labelsize"`, `"axes.titlesize"`.

source: **dims** : :class:`python:dict`\[:class:`python:str`, :class:`python:str` | :class:`python:int` | :class:`python:list`], optional
es: **dims** : :class:`python:dict`\[:class:`python:str`, :class:`python:str` | :class:`python:int` | :class:`python:list`], opcional

source: python:dict[python:str, python:str | python:int | python:list], optional
es: python:dict[python:str, python:str | python:int | python:list], opcional

source: Dimension filters to apply. Example: {"country": ["US", "UK"], "region": "X"}. If provided, only the selected slice(s) will be plotted.
es: Filtros de dimensión a aplicar. Ejemplo: {"country": ["US", "UK"], "region": "X"}. Si se proporciona, solo se trazará la(s) porción(es) seleccionada(s).

source: Any other kwargs forwarded to `plot_curve` (for instance `same_axes=True`, `legend=True`, etc.).
es: Cualquier otro kwargs enviado a `plot_curve` (por ejemplo `same_axes=True`, `legend=True`, etc.).

source: Returns
es: Devoluciones

source: Matplotlib figure with your grid.
es: Figura de Matplotlib con su cuadrícula.

source: **axes** : :obj:`np.ndarray <numpy.ndarray>` of :obj:`plt.Axes`
es: **ejes** : :obj:`np.ndarray <numpy.ndarray>` de :obj:`plt.Axes`

source: np.ndarray of plt.Axes
es: np.ndarray de plt.Axes

source: Array of shape `(n_channels, n_geo)`.
es: Array de forma `(n_channels, n_geo)`.
