Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.causal.TBF_FCI.fit.po
Languages: es

source: TBF\_FCI.fit
es: { "singular": "TBF_FCI.fit", "plural": "TBF_FCI.fit" }

source: Fit the temporal causal discovery algorithm to ``df``.
es: { "singular": "Ajuste el algoritmo de descubrimiento causal temporal a ``df``.", "plural": "Ajusten el algoritmo de descubrimiento causal temporal a ``df``." }

source: Parameters
es: { "singular": "Parámetro", "plural": "Parámetros" }

source: **df** : :obj:`pandas.DataFrame`
es: { "singular": "**df** : :obj:`pandas.DataFrame`", "plural": "**df** : :obj:`pandas.DataFrame`" }

source: pandas.DataFrame
es: { "singular": "pandas.DataFrame", "plural": "pandas.DataFrame" }

source: Input dataframe containing the target column and every driver column.
es: { "singular": "Marco de datos de entrada que contiene la columna objetivo y cada columna de controlador.", "plural": "Marcos de datos de entrada que contienen la columna objetivo y cada columna de controlador." }

source: **drivers** : :obj:`Sequence`\[:class:`python:str`]
es: { "singular": "**controlador** : :obj:`Secuencia`\[:class:`python:str`]", "plural": "**controladores** : :obj:`Secuencia`\[:class:`python:str`]" }

source: Sequence[python:str]
es: { "singular": "Secuencia[python:str]", "plural": "Secuencias[python:str]" }

source: Iterable of column names to be treated as drivers of the target.
es: { "singular": "Iterable de nombres de columna a ser tratados como impulsores del objetivo.", "plural": "Iterables de nombres de columna a ser tratados como impulsores del objetivo." }

source: Returns
es: { "singular": "Devoluciones", "plural": "Devoluciones" }

source: :obj:`TBF_FCI`
es: { "singular": ":obj:`TBF_FCI`", "plural": ":obj:`TBF_FCI`" }

source: The fitted instance with internal adjacency structures populated.
es: { "singular": "La instancia ajustada con estructuras de adyacencia internas pobladas.", "plural": "Las instancias ajustadas con estructuras de adyacencia internas pobladas." }

source: Examples
es: { "singular": "Ejemplo", "plural": "Ejemplos" }
