Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.causal.TBF_FCI.__init__.po
Languages: es

source: TBF\_FCI.\_\_init\_\_
es: { "singular": "TBF_FCI.__init__", "plural": "TBF_FCI.__init__" }

source: Create a new temporal TBF-PC causal discovery model.
es: { "singular": "Cree un nuevo modelo de descubrimiento causal TBF-PC temporal.", "plural": "Cree nuevos modelos de descubrimiento causal TBF-PC temporales." }

source: Parameters
es: { "singular": "Parámetro", "plural": "Parámetros" }

source: **target**
es: { "singular": { "msgid": "**target**", "msgstr": "**objetivo**" }, "plural": { "msgid": "**target**", "msgstr": "**objetivos**" } }

source: Target variable name at time ``t`` that the algorithm orients toward.
es: { "singular": "Nombre de la variable objetivo en el tiempo ``t`` al que el algoritmo se orienta.", "plural": "Nombres de las variables objetivo en el tiempo ``t`` a los que el algoritmo se orienta." }

source: **target_edge_rule**
es: { "singular": "**regla_de_borde_objetivo**", "plural": "**reglas_de_borde_objetivo**" }

source: Rule used to retain lagged → target edges. Choose from ``"any"``, ``"conservative"``, or ``"fullS"``.
es: { "singular": "Regla utilizada para retener los bordes de destino retrasados. Elija entre ``\"cualquiera\"``, ``\"conservadora\"`` o ``\"completaS\"``.", "plural": "Reglas utilizadas para retener los bordes de destino retrasados. Elija entre ``\"cualquiera\"``, ``\"conservadora\"`` o ``\"completaS\"``." }

source: **bf_thresh**
es: { "singular": "**bf_thresh**", "plural": "**bf_thresh**" }

source: Positive Bayes factor threshold applied during conditional independence testing.
es: { "singular": "Umbral del factor de Bayes positivo aplicado durante la prueba de independencia condicional.", "plural": "Umbrales del factor de Bayes positivo aplicados durante las pruebas de independencia condicional." }

source: **forbidden_edges**
es: { "singular": "**bordes_prohibidos**", "plural": "**bordes_prohibidos**" }

source: Optional sequence of node pairs that must be excluded from the final graph.
es: { "singular": "Secuencia opcional de pares de nodos que deben ser excluidos del gráfico final.", "plural": "Secuencias opcionales de pares de nodos que deben ser excluidos del gráfico final." }

source: **max_lag**
es: { "singular": "**max_lag**", "plural": "**max_lag**" }

source: Maximum lag (inclusive) to consider when constructing temporal drivers.
es: { "singular": "Retraso máximo (inclusive) a considerar al construir controladores temporales.", "plural": "Retrasos máximos (inclusive) a considerar al construir controladores temporales." }

source: **allow_contemporaneous**
es: { "singular": "**permitir_contemporáneo**", "plural": "**permitir_contemporáneos**" }

source: Whether contemporaneous edges at time ``t`` are permitted.
es: { "singular": "Si se permiten los bordes contemporáneos en el tiempo ``t``.", "plural": "Si se permiten los bordes contemporáneos en los tiempos ``t``." }
