Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.fourier.MonthlyFourier.sample_curve.po
Languages: es

source: MonthlyFourier.sample\_curve
es: MonthlyFourier.muestra\_curva

source: Create full period of the Fourier seasonality.
es: Crear el período completo de la estacionalidad de Fourier.

source: Parameters
es: Parámetros

source: **parameters** : :obj:`az.InferenceData` | :obj:`xr.Dataset`
es: **parámetros** : :obj:`az.InferenceData` | :obj:`xr.Dataset`

source: Inference data or dataset containing the Fourier parameters. Can be posterior or prior.
es: Datos de inferencia o conjunto de datos que contiene los parámetros de Fourier. Puede ser posterior o anterior.

source: **use_dates** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **use_dates** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If True, use datetime coordinates for the x-axis. Defaults to False.
es: Si es verdadero, utiliza coordenadas de fecha y hora para el eje x. Por defecto es falso.

source: **start_date** : :obj:`datetime.datetime`, optional
es: **fecha_de_inicio** : :obj:`datetime.datetime`, opcional

source: datetime.datetime, optional
es: datetime.datetime, opcional

source: Starting date for the Fourier curve. If not provided and use_dates is True, it will be derived from the current year or month. Defaults to None.
es: Fecha de inicio para la curva de Fourier. Si no se proporciona y use_dates es True, se derivará del año o mes actual. Por defecto es None.

source: Returns
es: Devoluciones

source: Full period of the Fourier seasonality.
es: Período completo de la estacionalidad de Fourier.
