Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_parametrized_name.po
Languages: es

source: CustomModelWrapper.model\_parametrized\_name
es: { "singular": "CustomModelWrapper.model_parametrized_name", "plural": "CustomModelWrapper.model_parametrized_name" }

source: Compute the class name for parametrizations of generic classes.
es: { "singular": "Calcule el nombre de la clase para parametrizaciones de clases genéricas.", "plural": "Calcule los nombres de las clases para parametrizaciones de clases genéricas." }

source: This method can be overridden to achieve a custom naming scheme for generic BaseModels.
es: { "singular": "Este método puede ser anulado para lograr un esquema de nombres personalizado para BaseModels genéricos.", "plural": "Este método puede ser anulado para lograr esquemas de nombres personalizados para BaseModels genéricos." }

source: Args:
es: { "singular": { "msgid": "Args:", "msgstr": "Args:" }, "plural": { "msgid": "Args:", "msgstr": "Args:" } }

source: params: Tuple of types of the class. Given a generic class
es: { "singular": { "msgid": "params: Tuple of types of the class. Given a generic class", "msgstr": "params: Tupla de tipos de la clase. Dada una clase genérica" }, "plural": { "msgid": "params: Tuple of types of the class. Given a generic class", "msgstr": "params: Tupla de tipos de la clase. Dada una clase genérica" } }

source: `Model` with 2 type variables and a concrete model `Model[str, int]`, the value `(str, int)` would be passed to `params`.
es: { "singular": "`Modelo` con 2 variables de tipo y un modelo concreto `Modelo[str, int]`, el valor `(str, int)` se pasaría a `params`.", "plural": "`Modelos` con 2 variables de tipo y modelos concretos `Modelos[str, int]`, los valores `(str, int)` se pasarían a `params`." }

source: Returns:
es: { "singular": { "msgid": "Returns:", "msgstr": "Devoluciones:" }, "plural": { "msgid": "Returns:", "msgstr": "Devoluciones:" } }

source: String representing the new class where `params` are passed to `cls` as type variables.
es: { "singular": "Cadena que representa la nueva clase donde `params` se pasan a `cls` como variables de tipo.", "plural": "Cadenas que representan las nuevas clases donde `params` se pasan a `cls` como variables de tipo." }

source: Raises:
es: { "singular": { "msgid": "Raises", "msgstr": "Aumentos" }, "plural": { "msgid": "Raises", "msgstr": "Aumentos" } }

source: TypeError: Raised when trying to generate concrete names for non-generic models.
es: { "singular": "TypeError: Se genera al intentar crear nombres concretos para modelos no genéricos.", "plural": "TypeError: Se genera al intentar crear nombres concretos para modelos no genéricos." }
