Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.gamma_gamma.BaseGammaGammaModel.expected_customer_lifetime_value.po
Languages: es

source: BaseGammaGammaModel.expected\_customer\_lifetime\_value
es: BaseGammaGammaModel.valor\_de\_vida\_útil\_del\_cliente\_esperado

source: Compute the average lifetime value for a group of one or more customers.
es: Calcule el valor promedio de vida para un grupo de uno o más clientes.

source: In addition, it applies a discount rate for net present value estimations.
es: Además, aplica una tasa de descuento para las estimaciones del valor presente neto.

source: Note `future_t` is measured in months regardless of `time_unit` specified.
es: Nota que `future_t` se mide en meses independientemente de la `time_unit` especificada.

source: Adapted from lifetimes package https://github.com/CamDavidsonPilon/lifetimes/blob/41e394923ad72b17b5da93e88cfabab43f51abe2/lifetimes/fitters/gamma_gamma_fitter.py#L246
es: Adaptado del paquete lifetimes https://github.com/CamDavidsonPilon/lifetimes/blob/41e394923ad72b17b5da93e88cfabab43f51abe2/lifetimes/fitters/gamma_gamma_fitter.py#L246

source: Parameters
es: Parámetros

source: Predictive model for future transactions. `BetaGeoModel` and `ParetoNBDModel` are currently supported.
es: Modelo predictivo para transacciones futuras. `BetaGeoModel` y `ParetoNBDModel` son actualmente compatibles.

source: **data** : :obj:`~pandas.DataFrame`
es: **datos** : :obj:`~pandas.DataFrame`

source: DataFrame containing the following columns:
es: DataFrame que contiene las siguientes columnas:

source: `customer_id`: Unique customer identifier
es: `customer_id`: Identificador único del cliente

source: `frequency`: Number of repeat purchases observed for each customer
es: `frequency`: Número de compras repetidas observadas para cada cliente

source: `recency`: Time between the first and the last purchase
es: `recency`: Tiempo entre la primera y la última compra

source: `T`: Time between the first purchase and the end of the observation period
es: T: Tiempo entre la primera compra y el final del período de observación

source: `monetary_value`: Mean spend values of repeat purchases for each customer
es: `monetary_value`: Valores de gasto medio de compras repetidas para cada cliente

source: **future_t** : :class:`python:int`, optional
es: **future_t** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: The lifetime expected for the user in months. Default: 12
es: La duración esperada de la vida útil para el usuario en meses. Predeterminado: 12

source: **discount_rate** : :class:`python:float`, optional
es: **tasa_de_descuento** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: The monthly adjusted discount rate. Default: 0.00
es: La tasa de descuento ajustada mensual. Predeterminado: 0.00

source: **time_unit** : :class:`python:str`, optional
es: **unidad_de_tiempo** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: Unit of time of the purchase history. Defaults to "D" for daily. Other options are "W" (weekly), "M" (monthly), and "H" (hourly). Example: If your dataset contains information about weekly purchases, you should use "W".
es: Unidad de tiempo del historial de compras. Por defecto es "D" para diario. Otras opciones son "W" (semanal), "M" (mensual) y "H" (horario). Ejemplo: Si su conjunto de datos contiene información sobre compras semanales, debe usar "W".

source: Returns
es: Devoluciones

source: DataArray containing estimated customer lifetime values
es: DataArray que contiene los valores de vida estimados de los clientes
