Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.components.saturation.InverseScaledLogisticSaturation.sample_curve.po
Languages: es

source: InverseScaledLogisticSaturation.sample\_curve
es: InverseScaledLogisticSaturation.muestra\_curva

source: Sample the curve of the saturation transformation given parameters.
es: Muestre la curva de la transformación de saturación dadas las parámetros.

source: Parameters
es: Parámetros

source: **parameters** : :obj:`xr.Dataset`
es: **parámetros** : :obj:`xr.Dataset`

source: xr.Dataset
es: xr.ConjuntoDeDatos

source: Dataset with the parameters of the saturation transformation.
es: Conjunto de datos con los parámetros de la transformación de saturación.

source: **max_value** : :class:`python:float`, optional
es: **max_value** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: Maximum value of the curve, by default 1.0.
es: Valor máximo de la curva, por defecto 1.0.

source: Returns
es: Devoluciones

source: Curve of the saturation transformation.
es: Curva de la transformación de saturación.
