Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.plot.MMMPlotSuite.saturation_curves_scatter.po
Languages: es

source: MMMPlotSuite.saturation\_curves\_scatter
es: MMMPlotSuite.curvas\_de\_saturación\_dispersión

source: Plot scatter plots of channel contributions vs. channel data.
es: Trace gráficos de dispersión de las contribuciones del canal frente a los datos del canal.

source: Will be removed in version 0.2.0. Use :meth:`saturation_scatterplot` instead.
es: Se eliminará en la versión 0.2.0. Utilice :meth:`saturation_scatterplot` en su lugar.

source: Parameters
es: Parámetros

source: **channel_contribution** : :class:`python:str`, optional
es: **channel_contribution** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: Name of the channel contribution variable in the InferenceData.
es: Nombre de la variable de contribución del canal en el InferenceData.

source: **additional_dims** : :class:`python:list`\[:class:`python:str`], optional
es: **additional_dims** : :class:`python:list`\[:class:`python:str`], opcional

source: python:list[python:str], optional
es: python:list[python:str], opcional

source: Additional dimensions to consider beyond 'channel'.
es: Dimensiones adicionales a considerar más allá de 'canal'.

source: **additional_combinations** : :class:`python:list`\[:class:`python:tuple`], optional
es: **combinaciones_adicionales** : :class:`python:list`\[:class:`python:tuple`], opcional

source: python:list[python:tuple], optional
es: python:list[python:tuple], opcional

source: Specific combinations of additional dimensions to plot.
es: Combinaciones específicas de dimensiones adicionales para graficar.

source: Additional keyword arguments passed to _init_subplots.
es: Argumentos de palabra clave adicionales pasados a _init_subplots.

source: Returns
es: Devoluciones

source: The matplotlib figure.
es: La figura de matplotlib.

source: **axes** : :obj:`np.ndarray <numpy.ndarray>`
es: **ejes** : :obj:`np.ndarray <numpy.ndarray>`

source: Array of matplotlib axes.
es: Array de ejes de matplotlib.
