Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.expected_residual_lifetime.po
Languages: es

source: ShiftedBetaGeoModel.expected\_residual\_lifetime
es: { "singular": "ShiftedBetaGeoModel.vida\_residual\_esperada", "plural": "ShiftedBetaGeoModel.vidas\_residuales\_esperadas" }

source: Compute expected residual lifetime of customers by cohort.
es: { "singular": "Calcule la vida residual esperada de los clientes por cohorte.", "plural": "Calcule la vida residual esperada de los clientes por cohortes." }

source: This is the expected number of periods a customer will remain active after the current time period, given a discount rate. If no discount rate is provided, infinite lifetime estimates may be returned.
es: { "singular": "Este es el número esperado de períodos en los que un cliente permanecerá activo después del período de tiempo actual, dado un tipo de descuento. Si no se proporciona un tipo de descuento, se pueden devolver estimaciones de vida infinita.", "plural": "Este es el número esperado de períodos en los que los clientes permanecerán activos después del período de tiempo actual, dado un tipo de descuento. Si no se proporciona un tipo de descuento, se pueden devolver estimaciones de vida infinita." }

source: Adapted from equation (6) in [R2e9259e9c988-1]_.
es: { "singular": "Adaptado de la ecuación (6) en [R2e9259e9c988-1]_.", "plural": "Adaptado de la ecuación (6) en [R2e9259e9c988-1]_." }

source: Parameters
es: { "singular": "Parámetro", "plural": "Parámetros" }

source: **discount_rate** : :class:`python:float`
es: { "singular": "**tasa_de_descuento** : :class:`python:float`", "plural": "**tasa_de_descuento** : :class:`python:float`" }

source: python:float
es: { "singular": "python:flotante", "plural": "python:flotantes" }

source: Discount rate to apply for net present value estimations.
es: { "singular": "Tasa de descuento a aplicar para estimaciones del valor presente neto.", "plural": "Tasa de descuento a aplicar para estimaciones del valor presente neto." }

source: **data** : :obj:`~pandas.DataFrame`
es: { "singular": "**datos** : :obj:`~pandas.DataFrame`", "plural": "**datos** : :obj:`~pandas.DataFrame`" }

source: DataFrame
es: { "singular": "DataFrame", "plural": "DataFrames" }

source: Optional dataframe containing the following columns: * `customer_id`: Unique customer identifier * `T`: Number of time periods customer has been active * `cohort`: Customer cohort label
es: { "singular": "Dataframe opcional que contiene las siguientes columnas: * `customer_id`: Identificador único del cliente * `T`: Número de períodos de tiempo en los que el cliente ha estado activo * `cohort`: Etiqueta de cohorte del cliente", "plural": "Dataframes opcionales que contienen las siguientes columnas: * `customer_id`: Identificador único del cliente * `T`: Número de períodos de tiempo en los que el cliente ha estado activo * `cohort`: Etiqueta de cohorte del cliente" }

source: References
es: { "singular": "Referencia", "plural": "Referencias" }

source: Fader, P. S., & Hardie, B. G. (2010). Customer-Base Valuation in a Contractual Setting: The Perils of Ignoring Heterogeneity. Marketing Science, 29(1), 85-93. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf
es: { "singular": "Fader, P. S., & Hardie, B. G. (2010). Valoración de la Base de Clientes en un Entorno Contractual: Los Peligros de Ignorar la Heterogeneidad. Ciencia del Marketing, 29(1), 85-93. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf", "plural": "Fader, P. S., & Hardie, B. G. (2010). Valoraciones de las Bases de Clientes en Entornos Contractuales: Los Peligros de Ignorar las Heterogeneidades. Ciencias del Marketing, 29(1), 85-93. https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf" }

source: [R2e9259e9c988-1]_
es: { "singular": "[R2e9259e9c988-1]", "plural": "[R2e9259e9c988-1]" }
