Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.plot_direct_contribution_curves.po
Languages: es

source: Plot the direct contribution curves for each marketing channel.
es: Trace las curvas de contribución directa para cada canal de marketing.

source: The term "direct" refers to the fact that we plot costs vs immediate returns and we do not take into account the lagged effects of the channels e.g. adstock transformations.
es: El término "directo" se refiere al hecho de que trazamos costos frente a retornos inmediatos y no tomamos en cuenta los efectos rezagados de los canales, por ejemplo, las transformaciones de adstock.

source: Parameters
es: Parámetros

source: **show_fit** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **show_fit** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If True, the function will also plot the curve fit. Defaults to False.
es: Si es verdadero, la función también trazará el ajuste de la curva. Por defecto es falso.

source: **xlim_max** : :class:`python:int`, optional
es: **xlim_max** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: The maximum value to be plot on the X-axis. If not provided, the maximum value in the data will be used.
es: El valor máximo a representar en el eje X. Si no se proporciona, se utilizará el valor máximo en los datos.

source: **channels** : :obj:`List`\[:class:`python:str`], optional
es: **canales** : :obj:`Lista`\[:class:`python:str`], opcional

source: List[python:str], optional
es: Lista[python:str], opcional

source: A list of channels to plot. If not provided, all channels will be plotted.
es: Una lista de canales para graficar. Si no se proporciona, se graficarán todos los canales.

source: **same_axes** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **same_axes** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: If True, all channels will be plotted on the same axes. Defaults to False.
es: Si es verdadero, todos los canales se graficarán en los mismos ejes. Por defecto es falso.

source: Returns
es: Devoluciones

source: A matplotlib Figure object with the direct contribution curves.
es: Un objeto Figure de matplotlib con las curvas de contribución directa.
