Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.gamma_gamma.BaseGammaGammaModel.distribution_customer_spend.po
Languages: es

source: BaseGammaGammaModel.distribution\_customer\_spend
es: BaseGammaGammaModel.distribution\_gasto\_del\_cliente

source: Posterior distribution of mean spend values for each customer.
es: Distribución posterior de los valores medios de gasto para cada cliente.

source: Parameters
es: Parámetros

source: **data** : :obj:`~pandas.DataFrame`
es: **datos** : :obj:`~pandas.DataFrame`

source: DataFrame containing the following columns:
es: DataFrame que contiene las siguientes columnas:

source: `customer_id`: Unique customer identifier
es: `customer_id`: Identificador único del cliente

source: `frequency`: Number of purchases
es: `frequency`: Número de compras

source: `monetary_value`: Mean spend values for each customer
es: `monetary_value`: Valores de gasto medio para cada cliente

source: **random_seed** : :obj:`~RandomState`, optional
es: **random_seed** : :obj:`~RandomState`, opcional

source: RandomState, optional
es: RandomState, opcional

source: Optional random seed to fix sampling results.
es: Semilla aleatoria opcional para fijar los resultados de muestreo.
