Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.channel_contribution_forward_pass.po
Languages: es

source: MMM.channel\_contribution\_forward\_pass
es: MMM.contribución\_canal\_pase\_adelante

source: Evaluate the channel contribution for a given channel data and a fitted model, ie. the forward pass.
es: Evalúe la contribución del canal para unos datos de canal dados y un modelo ajustado, es decir, la pasada hacia adelante.

source: We return the contribution in the original scale of the target variable.
es: Devolvemos la contribución en la escala original de la variable objetivo.

source: Parameters
es: Parámetros

source: numpy:array_like
es: numpy:similar_a_array

source: Input channel data. Result of all the preprocessing steps.
es: Datos del canal de entrada. Resultado de todos los pasos de preprocesamiento.

source: **disable_logger_stdout** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **disable_logger_stdout** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If True, suppress logger output to stdout
es: Si es verdadero, suprimir la salida del registrador a stdout.

source: Returns
es: Devoluciones

source: Transformed channel data.
es: Datos del canal transformados.
