Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.sample_posterior_predictive.po
Languages: es

source: MMM.sample\_posterior\_predictive
es: MMM.muestra\_predictiva\_posterior

source: Sample from the model's posterior predictive distribution.
es: Muestra de la distribución predictiva posterior del modelo.

source: Parameters
es: Parámetros

source: array, shape (n_pred, n_features)
es: array, forma (n_pred, n_features)

source: The input data used for prediction.
es: Los datos de entrada utilizados para la predicción.

source: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **extend_idata** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Boolean determining whether the predictions should be added to inference data object. Defaults to True.
es: Booleano que determina si las predicciones deben ser añadidas al objeto de datos de inferencia. Por defecto es True.

source: **combined: bool, optional**
es: **combinado: bool, opcional**

source: Combine chain and draw dims into sample. Won't work if a dim named sample already exists. Defaults to True.
es: Combina la cadena y las dimensiones de dibujo en la muestra. No funcionará si ya existe una dimensión llamada muestra. Por defecto es Verdadero.

source: **include_last_observations: bool, optional**
es: **incluir_últimas_observaciones: bool, opcional**

source: Boolean determining whether to include the last observations of the training data in order to carry over costs with the adstock transformation. Assumes that X are the next predictions following the training data.Defaults to False.
es: Boolean que determina si se deben incluir las últimas observaciones de los datos de entrenamiento para llevar los costos con la transformación adstock. Asume que X son las siguientes predicciones que siguen a los datos de entrenamiento. Por defecto es False.

source: **original_scale: bool, optional**
es: **original_scale: bool, opcional**

source: Boolean determining whether to return the predictions in the original scale of the target variable. Defaults to True.
es: Boolean que determina si se deben devolver las predicciones en la escala original de la variable objetivo. Por defecto es True.

source: Additional arguments to pass to pymc.sample_posterior_predictive
es: Argumentos adicionales para pasar a pymc.sample_posterior_predictive

source: Returns
es: Devoluciones

source: DataArray, shape (n_pred, samples)
es: DataArray, forma (n_pred, muestras)

source: Posterior predictive samples for each input X
es: Muestras predictivas posteriores para cada entrada X
