Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.components.saturation.LogisticSaturation.plot_curve.po
Languages: es

source: Plot curve HDI and samples.
es: Trazar la curva del IDH y las muestras.

source: Parameters
es: Parámetros

source: **curve** : :obj:`xr.DataArray`
es: **curva** : :obj:`xr.DataArray`

source: The curve to plot.
es: La curva a graficar.

source: **n_samples** : :class:`python:int`, optional
es: **n_samples** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: Number of samples
es: Número de muestras

source: **hdi_probs** : :class:`python:float` | :class:`python:list`\[:class:`python:float`], optional
es: **hdi_probs** : :class:`python:float` | :class:`python:list`\[:class:`python:float`], opcional

source: python:float | python:list[python:float], optional
es: python:float | python:list[python:float], opcional

source: HDI probabilities. Defaults to None which uses arviz default for stats.ci_prob which is 94%
es: Probabilidades de HDI. Por defecto es None, lo que utiliza el valor predeterminado de arviz para stats.ci_prob, que es del 94%.

source: **random_seed** : :class:`python:int` | :obj:`random` :obj:`number` :term:`python:generator`, optional
es: **random_seed** : :class:`python:int` | :obj:`random` :obj:`número` :term:`python:generador`, opcional

source: python:int | random number python:generator, optional
es: python:int | número aleatorio python:generador, opcional

source: Random number generator. Defaults to None
es: Generador de números aleatorios. Por defecto es None.

source: **subplot_kwargs** : :class:`python:dict`, optional
es: **subplot_kwargs** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: Keyword arguments for plt.subplots
es: Argumentos de palabras clave para plt.subplots

source: **sample_kwargs** : :class:`python:dict`, optional
es: **sample_kwargs** : :class:`python:dict`, opcional

source: Keyword arguments for the plot_curve_sample function. Defaults to None.
es: Argumentos de palabras clave para la función plot_curve_sample. Por defecto es None.

source: **hdi_kwargs** : :class:`python:dict`, optional
es: **hdi_kwargs** : :class:`python:dict`, opcional

source: Keyword arguments for the plot_curve_hdi function. Defaults to None.
es: Argumentos de palabras clave para la función plot_curve_hdi. Por defecto es None.

source: **axes** : :obj:`npt.NDArray`\[:obj:`plt.Axes`], optional
es: **ejes** : :obj:`npt.NDArray`\[:obj:`plt.Axes`], opcional

source: npt.NDArray[plt.Axes], optional
es: npt.NDArray[plt.Axes], opcional

source: The exact axes to plot on. Overrides any subplot_kwargs
es: Los ejes exactos para trazar. Anula cualquier subplot_kwargs.

source: **same_axes** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **same_axes** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If the axes should be the same for all plots. Defaults to False.
es: Si los ejes deben ser los mismos para todos los gráficos. Por defecto es False.

source: **colors** : :obj:`Iterable`\[:class:`python:str`], optional
es: **colores** : :obj:`Iterable`\[:class:`python:str`], opcional

source: Iterable[python:str], optional
es: Iterable[python:str], opcional

source: The colors to use for the plot. Defaults to None.
es: Los colores a utilizar para el gráfico. Por defecto es None.

source: **legend** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **leyenda** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: If the legend should be shown. Defaults to None.
es: Si se debe mostrar la leyenda. Por defecto es None.

source: **sel_to_string** : :obj:`SelToString`, optional
es: **sel_to_string** : :obj:`SelToString`, opcional

source: SelToString, optional
es: SelToString, opcional

source: The function to convert the selection to a string. Defaults to None.
es: La función para convertir la selección en una cadena. Por defecto es None.

source: Returns
es: Devoluciones
