Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.model_construct.po
Languages: es

source: CustomModelWrapper.model\_construct
es: { "singular": "CustomModelWrapper.model_construct", "plural": "CustomModelWrapper.model_construct" }

source: Creates a new instance of the `Model` class with validated data.
es: { "singular": { "msgid": "Creates a new instance of the `Model` class with validated data.", "msgstr": "Crea una nueva instancia de la clase `Model` con datos validados." }, "plural": { "msgid": "Creates a new instance of the `Model` class with validated data.", "msgstr": "Crea nuevas instancias de la clase `Model` con datos validados." } }

source: Creates a new model setting `__dict__` and `__pydantic_fields_set__` from trusted or pre-validated data. Default values are respected, but no other validation is performed.
es: { "singular": "Crea un nuevo modelo configurando `__dict__` y `__pydantic_fields_set__` a partir de datos confiables o prevalidados. Se respetan los valores predeterminados, pero no se realiza ninguna otra validación.", "plural": "Crean nuevos modelos configurando `__dict__` y `__pydantic_fields_set__` a partir de datos confiables o prevalidados. Se respetan los valores predeterminados, pero no se realiza ninguna otra validación." }

source: !!! note
es: { "singular": "!!! nota", "plural": "!!! nota" }

source: `model_construct()` generally respects the `model_config.extra` setting on the provided model. That is, if `model_config.extra == 'allow'`, then all extra passed values are added to the model instance's `__dict__` and `__pydantic_extra__` fields. If `model_config.extra == 'ignore'` (the default), then all extra passed values are ignored. Because no validation is performed with a call to `model_construct()`, having `model_config.extra == 'forbid'` does not result in an error if extra values are passed, but they will be ignored.
es: { "singular": "`model_construct()` generalmente respeta la configuración `model_config.extra` en el modelo proporcionado. Es decir, si `model_config.extra == 'allow'`, entonces todos los valores extra pasados se añaden a los campos `__dict__` y `__pydantic_extra__` de la instancia del modelo. Si `model_config.extra == 'ignore'` (el valor por defecto), entonces todos los valores extra pasados son ignorados. Dado que no se realiza ninguna validación con una llamada a `model_construct()`, tener `model_config.extra == 'forbid'` no resulta en un error si se pasan valores extra, pero serán ignorados.", "plural": "`model_construct()` generalmente respeta la configuración `model_config.extra` en los modelos proporcionados. Es decir, si `model_config.extra == 'allow'`, entonces todos los valores extra pasados se añaden a los campos `__dict__` y `__pydantic_extra__` de las instancias del modelo. Si `model_config.extra == 'ignore'` (el valor por defecto), entonces todos los valores extra pasados son ignorados. Dado que no se realiza ninguna validación con una llamada a `model_construct()`, tener `model_config.extra == 'forbid'` no resulta en un error si se pasan valores extra, pero serán ignorados." }

source: Args:
es: { "singular": { "msgid": "Args:", "msgstr": "Args:" }, "plural": { "msgid": "Args:", "msgstr": "Args:" } }

source: _fields_set: A set of field names that were originally explicitly set during instantiation. If provided,
es: { "singular": { "msgid": "_fields_set: A set of field names that were originally explicitly set during instantiation. If provided,", "msgstr": "_fields_set: Un conjunto de nombres de campo que fueron establecidos explícitamente durante la instanciación. Si se proporciona," }, "plural": { "msgid": "_fields_set: A set of field names that were originally explicitly set during instantiation. If provided,", "msgstr": "_fields_set: Un conjunto de nombres de campo que fueron establecidos explícitamente durante la instanciación. Si se proporciona," } }

source: this is directly used for the [`model_fields_set`][pydantic.BaseModel.model_fields_set] attribute. Otherwise, the field names from the `values` argument will be used.
es: { "singular": "esto se utiliza directamente para el atributo [`model_fields_set`][pydantic.BaseModel.model_fields_set]. De lo contrario, se utilizarán los nombres de campo del argumento `values`.", "plural": "esto se utiliza directamente para el atributo [`model_fields_set`][pydantic.BaseModel.model_fields_set]. De lo contrario, se utilizarán los nombres de campo del argumento `values`." }

source: values: Trusted or pre-validated data dictionary.
es: { "singular": "valores: Diccionario de datos confiables o prevalidado.", "plural": "valores: Diccionarios de datos confiables o prevalidados." }

source: Returns:
es: { "singular": { "msgid": "Returns:", "msgstr": "Devoluciones:" }, "plural": { "msgid": "Returns:", "msgstr": "Devoluciones:" } }

source: A new instance of the `Model` class with validated data.
es: { "singular": "Una nueva instancia de la clase `Model` con datos validados.", "plural": "Nuevas instancias de la clase `Model` con datos validados." }
