Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.BudgetOptimizer.model_construct.po
Languages: es

source: BudgetOptimizer.model\_construct
es: BudgetOptimizer.modelo\_construir

source: Creates a new instance of the `Model` class with validated data.
es: Crea una nueva instancia de la clase `Model` con datos validados.

source: Creates a new model setting `__dict__` and `__pydantic_fields_set__` from trusted or pre-validated data. Default values are respected, but no other validation is performed.
es: Crea un nuevo modelo estableciendo `__dict__` y `__pydantic_fields_set__` a partir de datos confiables o prevalidados. Se respetan los valores predeterminados, pero no se realiza ninguna otra validación.

source: !!! note
es: !!! nota

source: `model_construct()` generally respects the `model_config.extra` setting on the provided model. That is, if `model_config.extra == 'allow'`, then all extra passed values are added to the model instance's `__dict__` and `__pydantic_extra__` fields. If `model_config.extra == 'ignore'` (the default), then all extra passed values are ignored. Because no validation is performed with a call to `model_construct()`, having `model_config.extra == 'forbid'` does not result in an error if extra values are passed, but they will be ignored.
es: `model_construct()` generalmente respeta la configuración `model_config.extra` del modelo proporcionado. Es decir, si `model_config.extra == 'allow'`, entonces todos los valores adicionales pasados se añaden a los campos `__dict__` y `__pydantic_extra__` de la instancia del modelo. Si `model_config.extra == 'ignore'` (el valor predeterminado), entonces todos los valores adicionales pasados son ignorados. Dado que no se realiza ninguna validación con una llamada a `model_construct()`, tener `model_config.extra == 'forbid'` no resulta en un error si se pasan valores adicionales, pero serán ignorados.

source: _fields_set: A set of field names that were originally explicitly set during instantiation. If provided,
es: _fields_set: Un conjunto de nombres de campo que se establecieron explícitamente durante la instanciación. Si se proporciona,

source: this is directly used for the [`model_fields_set`][pydantic.BaseModel.model_fields_set] attribute. Otherwise, the field names from the `values` argument will be used.
es: esto se utiliza directamente para el atributo [`model_fields_set`][pydantic.BaseModel.model_fields_set]. De lo contrario, se utilizarán los nombres de campo del argumento `values`.

source: values: Trusted or pre-validated data dictionary.
es: valores: Diccionario de datos confiable o prevalidado.

source: Returns:
es: Devoluciones:

source: A new instance of the `Model` class with validated data.
es: Una nueva instancia de la clase `Model` con datos validados.
