Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.plot.MMMPlotSuite.allocated_contribution_by_channel_over_time.po
Languages: es

source: MMMPlotSuite.allocated\_contribution\_by\_channel\_over\_time
es: MMMPlotSuite.contribución\_asignada\_por\_canal\_a\_lo\_largo\_del\_tiempo

source: Plot the allocated contribution by channel with uncertainty intervals.
es: Trace la contribución asignada por canal con intervalos de incertidumbre.

source: This function visualizes the mean allocated contributions by channel along with the uncertainty intervals defined by the lower and upper quantiles. If additional dimensions besides 'channel', 'date', and 'sample' are present, creates a subplot for each combination of these dimensions.
es: Esta función visualiza las contribuciones medias asignadas por canal junto con los intervalos de incertidumbre definidos por los cuartiles inferior y superior. Si hay dimensiones adicionales además de 'canal', 'fecha' y 'muestra', crea un subplot para cada combinación de estas dimensiones.

source: Parameters
es: Parámetros

source: **samples** : :obj:`xr.Dataset`
es: **muestras** : :obj:`xr.Dataset`

source: xr.Dataset
es: xr.ConjuntoDeDatos

source: The dataset containing the samples of channel contributions. Expected to have 'channel_contribution' variable with dimensions 'channel', 'date', and 'sample'.
es: El conjunto de datos que contiene las muestras de contribuciones de canal. Se espera que tenga la variable 'channel_contribution' con dimensiones 'channel', 'date' y 'sample'.

source: **scale_factor** : :class:`python:float`, optional
es: **factor_de_escala** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: Scale factor to convert to original scale, if original_scale=True. If None and original_scale=True, assumes scale_factor=1.
es: Factor de escala para convertir a la escala original, si original_scale=True. Si es None y original_scale=True, se asume scale_factor=1.

source: **lower_quantile** : :class:`python:float`, optional
es: **lower_quantile** : :class:`python:float`, opcional

source: The lower quantile for the uncertainty interval. Default is 0.025.
es: El cuartil inferior para el intervalo de incertidumbre. El valor predeterminado es 0.025.

source: **upper_quantile** : :class:`python:float`, optional
es: **cuartil_superior** : :class:`python:float`, opcional

source: The upper quantile for the uncertainty interval. Default is 0.975.
es: El cuartil superior para el intervalo de incertidumbre. El valor predeterminado es 0.975.

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: If True, the contributions are plotted on the original scale. Default is True.
es: Si es verdadero, las contribuciones se representan en la escala original. El valor predeterminado es verdadero.

source: **figsize** : :class:`python:tuple`\[:class:`python:float`, :class:`python:float`], optional
es: **figsize** : :class:`python:tuple`\[:class:`python:float`, :class:`python:float`], opcional

source: python:tuple[python:float, python:float], optional
es: python:tuple[python:float, python:float], opcional

source: The size of the figure to be created. Default is (10, 6).
es: El tamaño de la figura a crear. El valor predeterminado es (10, 6).

source: **ax** : :obj:`plt.Axes`, optional
es: **ax** : :obj:`plt.Axes`, opcional

source: plt.Axes, optional
es: plt.Axes, opcional

source: The axis to plot on. If None, a new figure and axis will be created. Only used when no extra dimensions are present.
es: El eje en el que trazar. Si es None, se creará una nueva figura y eje. Solo se utiliza cuando no hay dimensiones adicionales presentes.

source: Returns
es: Devoluciones

source: The Figure object containing the plot.
es: El objeto Figure que contiene el gráfico.

source: **axes** : :obj:`matplotlib.axes.Axes` or :obj:`numpy.ndarray` of :obj:`matplotlib.axes.Axes`
es: **ejes** : :obj:`matplotlib.axes.Axes` o :obj:`numpy.ndarray` de :obj:`matplotlib.axes.Axes`

source: matplotlib.axes.Axes or numpy.ndarray of matplotlib.axes.Axes
es: matplotlib.axes.Axes o numpy.ndarray de matplotlib.axes.Axes

source: The Axes object with the plot, or array of Axes for multiple subplots.
es: El objeto Axes con el gráfico, o matriz de Axes para múltiples subgráficas.
