Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MMM.build_model.po
Languages: es

source: MMM.build\_model
es: MMM.construir\_modelo

source: Build a probabilistic model using PyMC for marketing mix modeling.
es: Construya un modelo probabilístico utilizando PyMC para el modelado de mezcla de marketing.

source: The model incorporates channels, control variables, and Fourier components, applying adstock and saturation transformations to the channel data. The final model is constructed with multiple factors contributing to the response variable.
es: El modelo incorpora canales, variables de control y componentes de Fourier, aplicando transformaciones de adstock y saturación a los datos del canal. El modelo final se construye con múltiples factores que contribuyen a la variable de respuesta.

source: Parameters
es: Parámetros

source: The input data for the model, which should include columns for channels, control variables (if applicable), and Fourier components (if applicable).
es: Los datos de entrada para el modelo, que deben incluir columnas para canales, variables de control (si corresponde) y componentes de Fourier (si corresponde).

source: Union[pd.Series, np.ndarray]
es: Unión[pd.Series, np.ndarray]

source: The target/response variable for the modeling.
es: La variable objetivo/respuesta para el modelado.

source: Additional keyword arguments that might be required by underlying methods or utilities.
es: Argumentos adicionales de palabras clave que podrían ser requeridos por los métodos o utilidades subyacentes.

source: Examples
es: Ejemplos

source: Initialize model with custom configuration
es: Inicializar el modelo con configuración personalizada
