Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.customer_choice.mv_its.MVITS.inform_default_prior.po
Languages: es

source: Inform the default prior based on the data.
es: Informar la prioridad predeterminada basada en los datos.

source: This only works with the default prior.
es: Esto solo funciona con el prior predeterminado.

source: Parameters
es: Parámetros

source: **data** : :obj:`pd.DataFrame`
es: **datos** : :obj:`pd.DataFrame`

source: The DataFrame to inform the default prior. This should be the data before the treatment.
es: El DataFrame para informar la prior predeterminada. Estos deberían ser los datos antes del tratamiento.

source: Returns
es: Devoluciones

source: The model instance.
es: La instancia del modelo.

source: Examples
es: Ejemplos

source: Use the data before the treatment to inform the prior.
es: Utilice los datos antes del tratamiento para informar el previo.

source: Check the model configuration
es: Verifique la configuración del modelo
