Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mlflow.MMMWrapper.predict.po
Languages: es

source: MMMWrapper.predict
es: MMMWrapper.predecir

source: Perform predictions or sampling using the specified prediction method.
es: Realice predicciones o muestreo utilizando el método de predicción especificado.

source: Parameters
es: Parámetros

source: **context** : :obj:`Any`
es: **context** : :obj:`Cualquiera`

source: Any
es: Cualquiera

source: The context in which the model is running. Isn't specified by users but is passed by MLflow.
es: El contexto en el que se está ejecutando el modelo. No es especificado por los usuarios, sino que es proporcionado por MLflow.

source: array, shape (n_pred, n_features)
es: array, forma (n_pred, n_features)

source: The input data used for prediction.
es: Los datos de entrada utilizados para la predicción.

source: **params** : :class:`python:dict`, optional
es: **params** : :class:`python:dict`, opcional

source: python:dict, optional
es: python:dict, opcional

source: A dictionary of parameters to specify the prediction method.
es: Un diccionario de parámetros para especificar el método de predicción.

source: Returns
es: Devoluciones

source: :class:`~numpy.ndarray` or :class:`~arviz.InferenceData`
es: :class:`~numpy.ndarray` o :class:`~arviz.InferenceData`

source: The predictions or samples generated by the model.
es: Las predicciones o muestras generadas por el modelo.

source: Raises
es: Aumentos

source: If an unsupported prediction method is specified.
es: Si se especifica un método de predicción no soportado.
