Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.distributions.ShiftedBetaGeometric.dist.po
Languages: es

source: ShiftedBetaGeometric.dist
es: { "singular": "ShiftedBetaGeometric.dist", "plural": "ShiftedBetaGeometric.dist" }

source: Create a tensor variable corresponding to the `cls` distribution.
es: { "singular": "Cree una variable tensor correspondiente a la distribución `cls`.", "plural": "Cree variables tensor correspondientes a las distribuciones `cls`." }

source: Parameters
es: { "singular": "Parámetro", "plural": "Parámetros" }

source: **dist_params** : :term:`numpy:array_like`
es: { "singular": "**dist_params** : :term:`numpy:array_like`", "plural": "**dist_params** : :term:`numpy:array_like`" }

source: numpy:array_like
es: { "singular": "numpy:array_like", "plural": "numpy:array_like" }

source: The inputs to the `RandomVariable` `Op`.
es: { "singular": "Las entradas a la operación `RandomVariable`.", "plural": "Las entradas a las operaciones `RandomVariable`." }

source: **shape** : :class:`python:int`, :class:`python:tuple`, :obj:`Variable`, optional
es: { "singular": "**forma** : :class:`python:int`, :class:`python:tuple`, :obj:`Variable`, opcional", "plural": "**formas** : :class:`python:int`, :class:`python:tuple`, :obj:`Variable`, opcional" }

source: python:int, python:tuple, Variable, optional
es: { "singular": { "msgid": "python:int", "msgstr": "python:int" }, "plural": { "msgid": "python:tuple", "msgstr": "python:tuple" }, "variable": { "msgid": "Variable", "msgstr": "Variable" }, "optional": { "msgid": "optional", "msgstr": "opcional" } }

source: A tuple of sizes for each dimension of the new RV.
es: { "singular": "Una tupla de tamaños para cada dimensión del nuevo RV.", "plural": "Una tupla de tamaños para cada dimensión de los nuevos RV." }

source: **\*\*kwargs**
es: { "singular": "**\*\*kwargs**", "plural": "**\*\*kwargs**" }

source: Keyword arguments that will be forwarded to the PyTensor RV Op. Most prominently: ``size`` or ``dtype``.
es: { "singular": "Argumentos de palabra clave que se enviarán a la operación RV de PyTensor. Más notablemente: ``size`` o ``dtype``.", "plural": "Argumentos de palabra clave que se enviarán a la operación RV de PyTensor. Más notablemente: ``size`` o ``dtype``." }

source: Returns
es: { "singular": "Devoluciones", "plural": "Devoluciones" }

source: **rv** : :class:`~pytensor.tensor.TensorVariable`
es: { "singular": "**rv** : :class:`~pytensor.tensor.TensorVariable`", "plural": "**rv** : :class:`~pytensor.tensor.TensorVariable`" }

source: TensorVariable
es: { "singular": "TensorVariable", "plural": "TensorVariables" }

source: The created random variable tensor.
es: { "singular": "El tensor de variable aleatoria creado.", "plural": "Los tensores de variable aleatoria creados." }
