Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.fourier.FourierBase.model_validate_json.po
Languages: es

source: FourierBase.model\_validate\_json
es: FourierBase.validar\_json\_modelo

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: [JSON Parsing](../concepts/json.md#json-parsing)
es: [Análisis de JSON](../concepts/json.md#json-parsing)

source: Validate the given JSON data against the Pydantic model.
es: Valide los datos JSON proporcionados contra el modelo de Pydantic.

source: json_data: The JSON data to validate. strict: Whether to enforce types strictly. extra: Whether to ignore, allow, or forbid extra data during model validation.
es: json_data: Los datos JSON a validar. strict: Si se deben imponer los tipos de manera estricta. extra: Si se debe ignorar, permitir o prohibir datos adicionales durante la validación del modelo.

source: See the [`extra` configuration value][pydantic.ConfigDict.extra] for details.
es: Consulte el valor de configuración [`extra`][pydantic.ConfigDict.extra] para más detalles.

source: context: Extra variables to pass to the validator. by_alias: Whether to use the field's alias when validating against the provided input data. by_name: Whether to use the field's name when validating against the provided input data.
es: context: Variables adicionales para pasar al validador. by_alias: Si se debe utilizar el alias del campo al validar contra los datos de entrada proporcionados. by_name: Si se debe utilizar el nombre del campo al validar contra los datos de entrada proporcionados.

source: Returns:
es: Devoluciones:

source: The validated Pydantic model.
es: El modelo Pydantic validado.

source: Raises:
es: Aumentos:

source: ValidationError: If `json_data` is not a JSON string or the object could not be validated.
es: ValidationError: Si `json_data` no es una cadena JSON o el objeto no pudo ser validado.
