Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.sample_response_distribution.po
Languages: es

source: MMM.sample\_response\_distribution
es: MMM.muestra\_distribución\_respuesta

source: Generate synthetic dataset and sample posterior predictive based on allocation.
es: Generar un conjunto de datos sintético y muestrear la predicción posterior basada en la asignación.

source: Parameters
es: Parámetros

source: **allocation_strategy** : :obj:`DataArray` or :class:`python:dict`\[:class:`python:str`, :class:`python:float`]
es: **estrategia_de_asignación** : :obj:`DataArray` o :class:`python:dict`\[:class:`python:str`, :class:`python:float`]

source: DataArray or python:dict[python:str, python:float]
es: DataArray o python:dict[python:str, python:float]

source: The allocation strategy for the channels.
es: La estrategia de asignación para los canales.

source: **time_granularity** : :obj:`Literal`\["daily", "weekly", "monthly", "quarterly", "yearly"]
es: **time_granularity** : :obj:`Literal`\["diario", "semanal", "mensual", "trimestral", "anual"]

source: Literal["daily", "weekly", "monthly", "quarterly", "yearly"]
es: Literal["diario", "semanal", "mensual", "trimestral", "anual"]

source: The granularity of the time units (e.g., 'daily', 'weekly', 'monthly').
es: La granularidad de las unidades de tiempo (por ejemplo, 'diario', 'semanal', 'mensual').

source: The number of time periods for prediction.
es: El número de períodos de tiempo para la predicción.

source: **noise_level** : :class:`python:float`
es: **nivel_de_ruido** : :class:`python:float`

source: The level of noise to add to the synthetic data.
es: El nivel de ruido a añadir a los datos sintéticos.

source: Returns
es: Devoluciones

source: The posterior predictive samples based on the synthetic dataset.
es: Las muestras predictivas posteriores basadas en el conjunto de datos sintético.
