Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.additive_effect.EventAdditiveEffect.model_dump.po
Languages: es

source: EventAdditiveEffect.model\_dump
es: EfectoAditivoEvento.model\_dump

source: !!! abstract "Usage Documentation"
es: !!! abstract "Documentación de Uso"

source: Generate a dictionary representation of the model, optionally specifying which fields to include or exclude.
es: Generar una representación en diccionario del modelo, especificando opcionalmente qué campos incluir o excluir.

source: mode: The mode in which `to_python` should run.
es: modo: El modo en el que `to_python` debe ejecutarse.

source: If mode is 'json', the output will only contain JSON serializable types. If mode is 'python', the output may contain non-JSON-serializable Python objects.
es: Si el modo es 'json', la salida solo contendrá tipos serializables en JSON. Si el modo es 'python', la salida puede contener objetos de Python no serializables en JSON.

source: include: A set of fields to include in the output. exclude: A set of fields to exclude from the output. context: Additional context to pass to the serializer. by_alias: Whether to use the field's alias in the dictionary key if defined. exclude_unset: Whether to exclude fields that have not been explicitly set. exclude_defaults: Whether to exclude fields that are set to their default value. exclude_none: Whether to exclude fields that have a value of `None`. exclude_computed_fields: Whether to exclude computed fields.
es: include: Un conjunto de campos a incluir en la salida. exclude: Un conjunto de campos a excluir de la salida. context: Contexto adicional para pasar al serializador. by_alias: Si se debe utilizar el alias del campo en la clave del diccionario si está definido. exclude_unset: Si se deben excluir los campos que no han sido establecidos explícitamente. exclude_defaults: Si se deben excluir los campos que están establecidos en su valor predeterminado. exclude_none: Si se deben excluir los campos que tienen un valor de `None`. exclude_computed_fields: Si se deben excluir los campos computados.

source: While this can be useful for round-tripping, it is usually recommended tu use the dedicated `round_trip` parameter instead.
es: Si bien esto puede ser útil para el intercambio de datos, generalmente se recomienda utilizar el parámetro `round_trip` dedicado en su lugar.

source: round_trip: If True, dumped values should be valid as input for non-idempotent types such as Json[T]. warnings: How to handle serialization errors. False/"none" ignores them, True/"warn" logs errors,
es: round_trip: Si es verdadero, los valores volcado deben ser válidos como entrada para tipos no idempotentes como Json[T]. advertencias: Cómo manejar los errores de serialización. Falso/"ninguno" los ignora, Verdadero/"advertir" registra errores,

source: "error" raises a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].
es: "error" genera un [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].

source: fallback: A function to call when an unknown value is encountered. If not provided,
es: fallback: Una función que se llama cuando se encuentra un valor desconocido. Si no se proporciona,

source: a [`PydanticSerializationError`][pydantic_core.PydanticSerializationError] error is raised.
es: se genera un error de [`PydanticSerializationError`][pydantic_core.PydanticSerializationError].

source: serialize_as_any: Whether to serialize fields with duck-typing serialization behavior.
es: serialize_as_any: Si se deben serializar los campos con un comportamiento de serialización de tipo pato.

source: Returns:
es: Devoluciones:

source: A dictionary representation of the model.
es: Una representación en forma de diccionario del modelo.
