Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MMM.add_lift_test_measurements.po
Languages: es

source: MMM.add\_lift\_test\_measurements
es: MMM.agregar\_mediciones\_de\_prueba\_de\_elevación

source: Add lift tests to the model.
es: Añadir pruebas de elevación al modelo.

source: The model for the difference of a channel's saturation curve is created from `x` and `x + delta_x` for each channel. This random variable is then conditioned using the empirical lift, `delta_y`, and `sigma` of the lift test with the specified distribution `dist`.
es: El modelo para la diferencia de la curva de saturación de un canal se crea a partir de `x` y `x + delta_x` para cada canal. Esta variable aleatoria se condiciona luego utilizando el aumento empírico, `delta_y`, y `sigma` de la prueba de aumento con la distribución especificada `dist`.

source: The pseudo-code for the lift test is as follows:
es: El pseudo-código para la prueba del ascensor es el siguiente:

source: The model has to be built before adding the lift tests.
es: El modelo debe ser construido antes de agregar las pruebas de elevación.

source: Parameters
es: Parámetros

source: DataFrame with lift test results with at least the following columns:
es: DataFrame con los resultados de la prueba de elevación con al menos las siguientes columnas:

source: `DIM_NAME`: dimension name. One column per dimension in `mmm.dims`.
es: `DIM_NAME`: nombre de la dimensión. Una columna por dimensión en `mmm.dims`.

source: `channel`: channel name. Must be present in `channel_columns`.
es: `channel`: nombre del canal. Debe estar presente en `channel_columns`.

source: `x`: x axis value of the lift test.
es: `x`: valor del eje x de la prueba de elevación.

source: `delta_x`: change in x axis value of the lift test.
es: `delta_x`: cambio en el valor del eje x de la prueba de elevación.

source: `delta_y`: change in y axis value of the lift test.
es: `delta_y`: cambio en el valor del eje y de la prueba de elevación.

source: `sigma`: standard deviation of the lift test.
es: `sigma`: desviación estándar de la prueba de elevación.

source: **dist** : :obj:`pm.Distribution`, optional
es: **dist** : :obj:`pm.Distribution`, opcional

source: pm.Distribution, optional
es: pm.Distribution, opcional

source: The distribution to use for the likelihood, by default pm.Gamma
es: La distribución a utilizar para la verosimilitud, por defecto pm.Gamma

source: **name** : :class:`python:str`, optional
es: **nombre** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The name of the likelihood of the lift test contribution(s), by default "lift_measurements". Name change required if calling this method multiple times.
es: El nombre de la probabilidad de la(s) contribución(es) de la prueba de elevación, por defecto "lift_measurements". Se requiere un cambio de nombre si se llama a este método múltiples veces.

source: Raises
es: Aumentos

source: If the model has not been built yet.
es: Si el modelo aún no ha sido construido.

source: If the 'channel' column or any of the model dimensions is not present in df_lift_test.
es: Si la columna 'channel' o cualquiera de las dimensiones del modelo no está presente en df_lift_test.

source: Examples
es: Ejemplos

source: Build the model first then add lift test measurements.
es: Primero construya el modelo y luego agregue las mediciones de la prueba de elevación.
