Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.*.BaseValidateMMM.plot_channel_contribution_share_hdi.po
Languages: es

source: Plot the share of channel contributions in a forest plot.
es: Trace la participación de las contribuciones del canal en un gráfico de bosque.

source: Parameters
es: Parámetros

source: **hdi_prob** : :class:`python:float`, optional
es: **hdi_prob** : :class:`python:float`, opcional

source: python:float, optional
es: python:float, opcional

source: HDI value to be displayed, by default 0.94
es: Valor del HDI a mostrar, por defecto 0.94

source: **prior** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **anterior** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to use the prior or posterior, by default False (posterior)
es: Si utilizar el anterior o el posterior, por defecto Falso (posterior)

source: Additional keyword arguments to pass to `az.plot_forest`.
es: Argumentos adicionales de palabras clave para pasar a `az.plot_forest`.

source: Returns
es: Devoluciones
