Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.optimize_budget.po
Languages: es

source: MMM.optimize\_budget
es: MMM.optimizar\_presupuesto

source: Optimize the given budget based on the specified utility function over a specified time period.
es: Optimice el presupuesto dado en función de la función de utilidad especificada durante un período de tiempo determinado.

source: This function optimizes the allocation of a given budget across different channels to maximize the response, considering adstock and saturation effects. It scales the budget and budget bounds, performs the optimization, and generates a synthetic dataset for posterior predictive sampling.
es: Esta función optimiza la asignación de un presupuesto dado entre diferentes canales para maximizar la respuesta, considerando los efectos de adstock y saturación. Escala el presupuesto y los límites del presupuesto, realiza la optimización y genera un conjunto de datos sintético para el muestreo predictivo posterior.

source: The function first scales the budget and budget bounds using the maximum scale of the channel transformer. It then uses the `BudgetOptimizer` to allocate the budget, and creates a synthetic dataset based on the optimal allocation. Finally, it performs posterior predictive sampling on the synthetic dataset.
es: La función primero escala el presupuesto y los límites del presupuesto utilizando la escala máxima del transformador de canal. Luego utiliza el `BudgetOptimizer` para asignar el presupuesto y crea un conjunto de datos sintético basado en la asignación óptima. Finalmente, realiza un muestreo predictivo posterior sobre el conjunto de datos sintético.

source: **Important**: When generating the posterior predicive distribution for the target with the optimized budget, we are setting the control variables to zero! This is done because in many situations we do not have all the control variables in the future (e.g. outlier control, special events).
es: **Importante**: Al generar la distribución predictiva posterior para el objetivo con el presupuesto optimizado, ¡estamos estableciendo las variables de control en cero! Esto se hace porque en muchas situaciones no tenemos todas las variables de control en el futuro (por ejemplo, control de valores atípicos, eventos especiales).

source: Parameters
es: Parámetros

source: **budget** : :class:`python:float` or :class:`python:int`
es: **presupuesto** : :class:`python:float` o :class:`python:int`

source: python:float or python:int
es: python:float o python:int

source: The total budget to be allocated.
es: El presupuesto total a ser asignado.

source: The number of time units over which the budget is to be allocated.
es: El número de unidades de tiempo sobre las cuales se debe asignar el presupuesto.

source: **budget_bounds** : :obj:`DataArrayr` or :class:`python:dict`\[:class:`python:str`, :class:`python:tuple`\[:class:`python:float`, :class:`python:float`]], optional
es: **budget_bounds** : :obj:`DataArrayr` o :class:`python:dict`\[:class:`python:str`, :class:`python:tuple`\[:class:`python:float`, :class:`python:float`]], opcional

source: DataArrayr or python:dict[python:str, python:tuple[python:float, python:float]], optional
es: DataArrayr o python:dict[python:str, python:tuple[python:float, python:float]], opcional

source: An xarray DataArary or dictionary specifying the lower and upper bounds for the budget allocation for each channel. If None, no bounds are applied.
es: Un xarray DataArray o diccionario que especifica los límites inferiores y superiores para la asignación del presupuesto para cada canal. Si es None, no se aplican límites.

source: **response_variable** : :class:`python:str`, optional
es: **response_variable** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: The response variable to optimize. Default is "total_contribution".
es: La variable de respuesta a optimizar. El valor predeterminado es "total_contribution".

source: **utility_function** : :obj:`UtilityFunctionType`, optional
es: **utility_function** : :obj:`UtilityFunctionType`, opcional

source: UtilityFunctionType, optional
es: TipoDeFunciónUtilidad, opcional

source: The utility function to maximize. Default is the mean of the response distribution.
es: La función de utilidad a maximizar. El valor predeterminado es la media de la distribución de respuestas.

source: **custom_constraints** : :class:`python:list`\[:class:`python:dict`\[:class:`python:str`, :obj:`Any`]], optional
es: **custom_constraints** : :class:`python:list`\[:class:`python:dict`\[:class:`python:str`, :obj:`Any`]], opcional

source: python:list[python:dict[python:str, Any]], optional
es: python:list[python:dict[python:str, Any]], opcional

source: Custom constraints for the optimization. If None, no custom constraints are applied. Format: [{"key":...,"constraint_fun":...,"constraint_type":...}]
es: Restricciones personalizadas para la optimización. Si es None, no se aplican restricciones personalizadas. Formato: [{"key":...,"constraint_fun":...,"constraint_type":...}]

source: **default_constraints** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **default_constraints** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether to add the default sum constraint to the optimizer. Default is True.
es: Si se debe agregar la restricción de suma predeterminada al optimizador. El valor predeterminado es True.

source: **callback** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **callback** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to return callback information tracking optimization progress. When True, returns a third element containing a list of dictionaries with optimization information at each iteration. Default is False for backward compatibility.
es: Si se debe devolver información de seguimiento de la optimización del progreso de la devolución de llamada. Cuando es Verdadero, devuelve un tercer elemento que contiene una lista de diccionarios con información de optimización en cada iteración. El valor predeterminado es Falso para mantener la compatibilidad hacia atrás.

source: Additional arguments to pass to the `BudgetOptimizer`.
es: Argumentos adicionales para pasar al `BudgetOptimizer`.

source: Returns
es: Devoluciones

source: The posterior predictive samples generated from the synthetic dataset.
es: Las muestras predictivas posteriores generadas a partir del conjunto de datos sintético.

source: Raises
es: Aumentos

source: If the time granularity is not supported.
es: Si la granularidad del tiempo no es compatible.

source: If the noise level is not a float.
es: Si el nivel de ruido no es un número decimal.
