Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.beta_geo.BetaGeoModel.distribution_new_customer_recency_frequency.po
Languages: es

source: BetaGeoModel.distribution\_new\_customer\_recency\_frequency
es: BetaGeoModel.distribución\_nueva\_frecuencia\_recencia\_cliente

source: BG/NBD process representing purchases across the customer population.
es: Proceso BG/NBD que representa las compras a través de la población de clientes.

source: This is the distribution of purchase frequencies given 'T' observation periods for each customer.
es: Esta es la distribución de las frecuencias de compra dadas 'T' períodos de observación para cada cliente.

source: Parameters
es: Parámetros

source: **data** : :obj:`~pandas.DataFrame`, optional
es: **datos** : :obj:`~pandas.DataFrame`, opcional

source: DataFrame, optional
es: DataFrame, opcional

source: DataFrame containing the following columns:
es: DataFrame que contiene las siguientes columnas:

source: `customer_id`: Unique customer identifier
es: `customer_id`: Identificador único del cliente

source: `T`: Time between the first purchase and the end of the observation period.
es: `T`: Tiempo entre la primera compra y el final del período de observación.

source: All covariate columns specified when model was initialized.
es: Todas las columnas de covariables especificadas cuando se inicializó el modelo.

source: If not provided, the method will use the fit dataset.
es: Si no se proporciona, el método utilizará el conjunto de datos de ajuste.

source: **T** : :term:`numpy:array_like`, optional
es: **T** : :term:`numpy:array_like`, opcional

source: numpy:array_like, optional
es: numpy:similar a un arreglo, opcional

source: Number of observation periods for each customer. If not provided, T values from fit dataset will be used. Not required if `data` Dataframe contains a `T` column.
es: Número de períodos de observación para cada cliente. Si no se proporciona, se utilizarán los valores de T del conjunto de datos ajustado. No es necesario si el DataFrame `data` contiene una columna `T`.

source: **random_seed** : :obj:`~numpy.random.RandomState`, optional
es: **random_seed** : :obj:`~numpy.random.RandomState`, opcional

source: RandomState, optional
es: RandomState, opcional

source: Random state to use for sampling.
es: Estado aleatorio a utilizar para el muestreo.

source: **n_samples** : :class:`python:int`, optional
es: **n_samples** : :class:`python:int`, opcional

source: python:int, optional
es: python:int, opcional

source: Number of samples to generate. Defaults to 1000.
es: Número de muestras a generar. Por defecto es 1000.

source: Returns
es: Devoluciones

source: Dataset containing the posterior samples for the customer population.
es: Conjunto de datos que contiene las muestras posteriores para la población de clientes.
