Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.customer_choice.nested_logit.NestedLogit.apply_intervention.po
Languages: es

source: NestedLogit.apply\_intervention
es: NestedLogit.aplicar\_intervención

source: Apply one of two types of intervention.
es: Aplique uno de los dos tipos de intervención.

source: This method supports two intervention strategies:
es: Este método admite dos estrategias de intervención:

source: 1. **Observable attribute changes**: Uses the existing fitted model and modifies observable inputs (e.g., prices, features) to simulate how market shares change. This method uses posterior predictive sampling.
es: 1. **Cambios en atributos observables**: Utiliza el modelo ajustado existente y modifica las entradas observables (por ejemplo, precios, características) para simular cómo cambian las cuotas de mercado. Este método utiliza muestreo predictivo posterior.

source: 2. **Product removal**: Allows a product to be entirely removed from the choice set and simulates how demand redistributes among the remaining alternatives. This re-specifies and re-estimates the model before posterior prediction.
es: 2. **Eliminación de producto**: Permite que un producto sea completamente eliminado del conjunto de opciones y simula cómo se redistribuye la demanda entre las alternativas restantes. Esto reespecifica y reestima el modelo antes de la predicción posterior.

source: Parameters
es: Parámetros

source: The new dataset reflecting changes to observable attributes or product availability.
es: El nuevo conjunto de datos que refleja cambios en los atributos observables o la disponibilidad del producto.

source: **new_utility_equations** : :class:`python:list`\[:class:`python:str`] | :data:`python:None`, optional
es: **nuevas_ecuaciones_utilitarias** : :class:`python:list`\[:class:`python:str`] | :data:`python:None`, opcional

source: python:list[python:str] | python:None, optional
es: python:list[python:str] | python:Ninguno, opcional

source: An updated list of utility specifications for each alternative, if different from the original model. If `None`, the original equations are reused and only the data is changed.
es: Una lista actualizada de especificaciones de utilidad para cada alternativa, si es diferente del modelo original. Si es `None`, se reutilizan las ecuaciones originales y solo se cambian los datos.

source: Returns
es: Devoluciones

source: The posterior or full predictive distribution under the intervention, including predicted probabilities (`"p"`) and likelihood draws (`"likelihood"`).
es: La distribución predictiva posterior o completa bajo la intervención, incluyendo las probabilidades predichas (`"p"`) y las muestras de verosimilitud (`"likelihood"`).
