Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.prior.Censored.create_likelihood_variable.po
Languages: es

source: Censored.create\_likelihood\_variable
es: Censored.crear\_variable\_de\_probabilidad

source: Create observed censored variable.
es: Crear variable censurada observada.

source: Will require that the distribution has a `mu` parameter and that it has not been set in the parameters.
es: Requerirá que la distribución tenga un parámetro `mu` y que no se haya establecido en los parámetros.

source: Parameters
es: Parámetros

source: **name** : :class:`python:str`
es: **nombre** : :class:`python:str`

source: The name of the variable.
es: El nombre de la variable.

source: pt.TensorLike
es: pt.TensorComo

source: The mu parameter for the likelihood.
es: El parámetro mu para la verosimilitud.

source: **observed** : :obj:`pt.TensorLike`
es: **observado** : :obj:`pt.TensorLike`

source: The observed data.
es: Los datos observados.

source: Returns
es: Devoluciones

source: The PyMC variable.
es: La variable PyMC.

source: Examples
es: Ejemplos

source: Create a censored likelihood variable in a larger PyMC model.
es: Cree una variable de probabilidad censurada en un modelo más grande de PyMC.
