Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.multidimensional.MMM.add_events.po
Languages: es

source: MMM.add\_events
es: MMM.agregar\_eventos

source: Add event effects to the model.
es: Agregue efectos de evento al modelo.

source: This must be called before building the model.
es: Esto debe ser llamado antes de construir el modelo.

source: Parameters
es: Parámetros

source: The DataFrame containing the event data.
es: El DataFrame que contiene los datos del evento.

source: `name`: name of the event. Used as the model coordinates.
es: `name`: nombre del evento. Se utiliza como las coordenadas del modelo.

source: `start_date`: start date of the event
es: `start_date`: fecha de inicio del evento

source: `end_date`: end date of the event
es: `end_date`: fecha de finalización del evento

source: **prefix** : :class:`python:str`
es: **prefijo** : :class:`python:str`

source: The prefix to use for the event effect and associated variables.
es: El prefijo a utilizar para el efecto del evento y las variables asociadas.

source: **effect** : :obj:`EventEffect`
es: **efecto** : :obj:`EventEffect`

source: EventEffect
es: EfectoEvento

source: The event effect to apply.
es: El efecto del evento a aplicar.

source: Raises
es: Aumentos

source: If the event effect dimensions do not contain the prefix and model dimensions.
es: Si las dimensiones del efecto del evento no contienen el prefijo y las dimensiones del modelo.
