Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.customer_choice.nested_logit.NestedLogit.plot_change.po
Languages: es

source: Plot change induced by a market intervention.
es: Cambio de trama inducido por una intervención en el mercado.

source: Parameters
es: Parámetros

source: A DataFrame indexed by product (or mode) with the following columns: - 'policy_share': share before the intervention - 'new_policy_share': share after the intervention
es: Un DataFrame indexado por producto (o modo) con las siguientes columnas: - 'policy_share': participación antes de la intervención - 'new_policy_share': participación después de la intervención

source: **title** : :class:`python:str`, optional
es: **título** : :class:`python:str`, opcional

source: python:str, optional
es: python:str, opcional

source: Title of the plot. Default is "Change in Proportion due to Intervention".
es: Título de la gráfica. El valor predeterminado es "Cambio en la Proporción debido a la Intervención".

source: **figsize** : :class:`python:tuple`, optional
es: **figsize** : :class:`python:tuple`, opcional

source: python:tuple, optional
es: python:tupla, opcional

source: Size of the plot in inches, as (width, height). Default is (8, 4).
es: Tamaño del gráfico en pulgadas, como (ancho, alto). El valor predeterminado es (8, 4).

source: Returns
es: Devoluciones

source: A matplotlib Figure object showing before/after market share comparisons, with colored lines indicating gain (green) or loss (red) for each product.
es: Un objeto Figure de matplotlib que muestra comparaciones de cuota de mercado antes/después, con líneas de colores que indican ganancia (verde) o pérdida (rojo) para cada producto.
