Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.gamma_gamma.GammaGammaModelIndividual.set_idata_attrs.po
Languages: es

source: Set attributes on an InferenceData object.
es: Establecer atributos en un objeto InferenceData.

source: Parameters
es: Parámetros

source: **idata** : :obj:`arviz.InferenceData`, optional
es: **idata** : :obj:`arviz.InferenceData`, opcional

source: arviz.InferenceData, optional
es: arviz.InferenceData, opcional

source: The InferenceData object to set attributes on.
es: El objeto InferenceData en el que establecer atributos.

source: Returns
es: Devoluciones

source: The InferenceData instance with the attrs set
es: La instancia de InferenceData con los atributos establecidos

source: Raises
es: Aumentos

source: If the attrs are missing for a property initialization of the class
es: Si faltan los attrs para la inicialización de una propiedad de la clase

source: If no InferenceData object is provided.
es: Si no se proporciona un objeto InferenceData.

source: Examples
es: Ejemplos

source: Set the attrs for an InferenceData object manually.
es: Establezca los attrs para un objeto InferenceData manualmente.
