Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.plot_grouped_contribution_breakdown_over_time.po
Languages: es

source: MMM.plot\_grouped\_contribution\_breakdown\_over\_time
es: MMM.trazar\_contribución\_agrupada\_desglose\_a\_lo\_largo\_del\_tiempo

source: Plot a time series area chart for all channel contributions.
es: Trace un gráfico de área de series temporales para todas las contribuciones del canal.

source: Since a chart like this can become quite crowded if you have many channels or control variables, you can group certain variables together using the `stack_groups` keyword.
es: Dado que un gráfico como este puede volverse bastante abarrotado si tiene muchos canales o variables de control, puede agrupar ciertas variables utilizando la palabra clave `stack_groups`.

source: Parameters
es: Parámetros

source: **stack_groups** : :class:`python:dict` of {str: :class:`python:list` of :class:`python:str`}, optional
es: **stack_groups** : :class:`python:dict` de {str: :class:`python:list` of :class:`python:str`}, opcional

source: python:dict of {str: python:list of python:str}, optional
es: python:diccionario de {str: python:list of python:str}, opcional

source: Specifies which variables to group together. Example: passing
es: Especifica qué variables agrupar. Ejemplo: pasando

source: "Baseline": ["intercept"], "Offline": ["TV", "Radio"], "Online": ["Banners"]
es: "Base": ["intercepción"], "Fuera de línea": ["TV", "Radio"], "En línea": ["Banners"]

source: results in a chart with three colors, one for Baseline, one for Online, and one for Offline. If `stack_groups` is None, the chart would have four colors since TV and Radio would be separated.
es: resulta en un gráfico con tres colores, uno para la Línea Base, uno para en Línea y uno para Fuera de Línea. Si `stack_groups` es None, el gráfico tendría cuatro colores ya que la TV y la Radio estarían separadas.

source: Note: If you only pass {"Baseline": "intercept", "Online": ["Banners"]}, you will not see the TV and Radio channels in the chart.
es: Nota: Si solo pasa {"Baseline": "intercept", "Online": ["Banners"]}, no verá los canales de TV y Radio en el gráfico.

source: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, :obj:`by` default :data:`python:False`
es: **original_scale** : :ref:`bool <python:bltin-boolean-values>`, :obj:`por` defecto :data:`python:False`

source: bool, by default python:False
es: bool, por defecto python:False

source: If True, the contributions are plotted in the original scale of the target.
es: Si es verdadero, las contribuciones se trazan en la escala original del objetivo.

source: Returns
es: Devoluciones

source: Matplotlib figure with the plot.
es: Figura de Matplotlib con el gráfico.
