Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.*.BaseValidateMMM.predict_posterior.po
Languages: es

source: BaseValidateMMM.predict\_posterior
es: BaseValidateMMM.predecir\_posterior

source: Generate posterior predictive samples on unseen data.
es: Generar muestras predictivas posteriores en datos no vistos.

source: Parameters
es: Parámetros

source: numpy:array_like | array, shape (n_pred, n_features)
es: numpy:array_like | arreglo, forma (n_pred, n_features)

source: The input data used for prediction. If scikit-learn is available, array-like, otherwise array.
es: Los datos de entrada utilizados para la predicción. Si scikit-learn está disponible, tipo array, de lo contrario, array.

source: **extend_idata** : :obj:`Boolean`
es: **extend_idata** : :obj:`Booleano`

source: Determine whether the predictions should be added to inference data object. Defaults to True.
es: Determine si las predicciones deben ser añadidas al objeto de datos de inferencia. Por defecto es True.

source: **combined: Boolean**
es: **combinado: Booleano**

source: Combine chain and draw dims into sample. Won't work if a dim named sample already exists. Defaults to True.
es: Combina la cadena y las dimensiones de dibujo en la muestra. No funcionará si ya existe una dimensión llamada muestra. Por defecto es True.

source: **\*\*kwargs: Additional arguments to pass to sample_posterior_predictive method**
es: **\*\*kwargs: Argumentos adicionales para pasar al método sample_posterior_predictive**

source: Returns
es: Devoluciones

source: Posterior predictive samples for each input X. Shape is (n_pred, chains * draws) if combined is True, otherwise (chains, draws, n_pred).
es: Muestras predictivas posteriores para cada entrada X. La forma es (n_pred, chains * draws) si combinado es Verdadero, de lo contrario (chains, draws, n_pred).
