Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.budget_optimizer.CustomModelWrapper.copy.po
Languages: es

source: CustomModelWrapper.copy
es: { "singular": "CustomModelWrapper.copiar", "plural": "CustomModelWrapper.copiar" }

source: Returns a copy of the model.
es: { "singular": { "msgid": "Returns a copy of the model.", "msgstr": "Devuelve una copia del modelo." }, "plural": { "msgid": "Returns a copy of the model.", "msgstr": "Devuelve una copia del modelo." } }

source: !!! warning "Deprecated"
es: { "singular": "!!! advertencia \"Obsoleto\"", "plural": "!!! advertencia \"Obsoleto\"" }

source: This method is now deprecated; use `model_copy` instead.
es: { "singular": "Este método está ahora obsoleto; use `model_copy` en su lugar.", "plural": "Este método está ahora obsoleto; use `model_copy` en su lugar." }

source: If you need `include` or `exclude`, use:
es: { "singular": "Si necesita `include` o `exclude`, utilice:", "plural": "Si necesita `include` o `exclude`, utilice:" }

source: ```python {test="skip" lint="skip"} data = self.model_dump(include=include, exclude=exclude, round_trip=True) data = {**data, **(update or {})} copied = self.model_validate(data) ```
es: { "singular": "data = self.model_dump(include=include, exclude=exclude, round_trip=True) data = {**data, **(update or {})} copied = self.model_validate(data)", "plural": "data = self.model_dump(include=include, exclude=exclude, round_trip=True) data = {**data, **(update or {})} copied = self.model_validate(data)" }

source: Args:
es: { "singular": { "msgid": "Args:", "msgstr": "Args:" }, "plural": { "msgid": "Args:", "msgstr": "Args:" } }

source: include: Optional set or mapping specifying which fields to include in the copied model. exclude: Optional set or mapping specifying which fields to exclude in the copied model. update: Optional dictionary of field-value pairs to override field values in the copied model. deep: If True, the values of fields that are Pydantic models will be deep-copied.
es: { "singular": { "msgid": "include: Optional set or mapping specifying which fields to include in the copied model.", "msgstr": "include: Conjunto o mapeo opcional que especifica qué campos incluir en el modelo copiado." }, "plural": { "msgid": "exclude: Optional set or mapping specifying which fields to exclude in the copied model.", "msgstr": "exclude: Conjunto o mapeo opcional que especifica qué campos excluir en el modelo copiado." }, "singular": { "msgid": "update: Optional dictionary of field-value pairs to override field values in the copied model.", "msgstr": "update: Diccionario opcional de pares campo-valor para sobrescribir los valores de campo en el modelo copiado." }, "plural": { "msgid": "deep: If True, the values of fields that are Pydantic models will be deep-copied.", "msgstr": "deep: Si es True, los valores de los campos que son modelos Pydantic serán copiados en profundidad." } }

source: Returns:
es: { "singular": { "msgid": "Returns:", "msgstr": "Devoluciones:" }, "plural": { "msgid": "Returns:", "msgstr": "Devoluciones:" } }

source: A copy of the model with included, excluded and updated fields as specified.
es: { "singular": "Una copia del modelo con campos incluidos, excluidos y actualizados según lo especificado.", "plural": "Copias del modelo con campos incluidos, excluidos y actualizados según lo especificado." }
