Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.mmm.mmm.MMM.new_spend_contributions.po
Languages: es

source: MMM.new\_spend\_contributions
es: MMM.nuevas\_contribuciones\_de\_gasto

source: Return the upcoming contributions for a given spend.
es: Devuelva las contribuciones próximas para un gasto dado.

source: The spend can be one time or constant over the period. The spend leading up to the period can also be specified in order account for the lagged effect of the spend.
es: El gasto puede ser único o constante durante el período. El gasto previo al período también se puede especificar para tener en cuenta el efecto rezagado del gasto.

source: Parameters
es: Parámetros

source: **spend** : :obj:`np.ndarray <numpy.ndarray>`, optional
es: **gastar** : :obj:`np.ndarray <numpy.ndarray>`, opcional

source: np.ndarray, optional
es: np.ndarray, opcional

source: Array of spend for each channel. If None, the average spend for each channel is used, by default None.
es: Array de gasto para cada canal. Si es None, se utiliza el gasto promedio para cada canal, por defecto None.

source: **one_time** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **una_vez** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: bool, optional
es: bool, opcional

source: Whether the spends for each channel are only at the start of the period. If True, all spends after the initial spend are zero. If False, all spends after the initial spend are the same as the initial spend. By default True.
es: Si los gastos para cada canal son solo al inicio del período. Si es Verdadero, todos los gastos después del gasto inicial son cero. Si es Falso, todos los gastos después del gasto inicial son iguales al gasto inicial. Por defecto, es Verdadero.

source: **spend_leading_up** : :obj:`np.array`, optional
es: **gastar_previo** : :obj:`np.array`, opcional

source: np.array, optional
es: np.array, opcional

source: Array of spend for each channel leading up to the spend, by default None or 0 for each channel. Use this parameter to account for the lagged effect of the spend.
es: Array de gasto para cada canal que conduce al gasto, por defecto None o 0 para cada canal. Utilice este parámetro para tener en cuenta el efecto rezagado del gasto.

source: **prior** : :ref:`bool <python:bltin-boolean-values>`, optional
es: **anterior** : :ref:`bool <python:bltin-boolean-values>`, opcional

source: Whether to use the prior or posterior, by default False (posterior)
es: Si utilizar el anterior o el posterior, por defecto Falso (posterior)

source: Additional keyword arguments passed to pm.sample_posterior_predictive
es: Argumentos adicionales de palabras clave pasados a pm.sample_posterior_predictive

source: Returns
es: Devoluciones

source: Upcoming contributions for each channel
es: Contribuciones próximas para cada canal

source: Examples
es: Ejemplos

source: Channel contributions from 1 unit on each channel only once.
es: Contribuciones de canal de 1 unidad en cada canal solo una vez.

source: Channel contributions from continuously spending 1 unit on each channel.
es: Contribuciones del canal al gastar continuamente 1 unidad en cada canal.

source: Channel contributions from 1 unit on each channel only once but with 1 unit leading up to the spend.
es: Contribuciones de canal de 1 unidad en cada canal solo una vez, pero con 1 unidad que precede al gasto.
