Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.model_builder.RegressionModelBuilder.sample_prior_predictive.po
Languages: es

source: RegressionModelBuilder.sample\_prior\_predictive
es: RegressionModelBuilder.muestra\_predictiva\_previa

source: Sample from the model's prior predictive distribution.
es: Muestra de la distribución predictiva previa del modelo.

source: Parameters
es: Parámetros

source: array, shape (n_pred, n_features)
es: array, forma (n_pred, n_features)

source: The input data used for prediction using prior distribution.
es: Los datos de entrada utilizados para la predicción utilizando la distribución previa.

source: **y** : :obj:`array <numpy.ndarray>`, :obj:`shape` (n_pred,), optional
es: **y** : :obj:`array <numpy.ndarray>`, :obj:`shape` (n_pred,), opcional

source: array, shape (n_pred,), optional
es: array, forma (n_pred,), opcional

source: The target values (real numbers) used for prediction using prior distribution. If not set, defaults to an array of zeros.
es: Los valores objetivo (números reales) utilizados para la predicción mediante la distribución previa. Si no se establecen, por defecto se utiliza un arreglo de ceros.

source: **samples** : :class:`python:int`
es: **muestras** : :class:`python:int`

source: Number of samples from the prior parameter distributions to generate. If not set, uses sampler_config['draws'] if that is available, otherwise defaults to 500.
es: Número de muestras de las distribuciones de parámetros anteriores a generar. Si no se establece, utiliza sampler_config['draws'] si está disponible, de lo contrario, por defecto es 500.

source: **extend_idata** : :obj:`Boolean`
es: **extend_idata** : :obj:`Booleano`

source: Determine whether the predictions should be added to inference data object. Defaults to True.
es: Determine si las predicciones deben ser añadidas al objeto de datos de inferencia. Por defecto es True.

source: **combined: Boolean**
es: **combinado: Booleano**

source: Combine chain and draw dims into sample. Won't work if a dim named sample already exists. Defaults to True.
es: Combina la cadena y las dimensiones de dibujo en la muestra. No funcionará si ya existe una dimensión llamada muestra. Por defecto es True.

source: **\*\*kwargs: Additional arguments to pass to pymc.sample_prior_predictive**
es: **\*\*kwargs: Argumentos adicionales para pasar a pymc.sample_prior_predictive**

source: Returns
es: Devoluciones

source: DataArray, shape (n_pred, samples)
es: DataArray, forma (n_pred, muestras)

source: Prior predictive samples for each input X
es: Muestras predictivas previas para cada entrada X
