Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/api/generated/classmethods/pymc_marketing.clv.models.shifted_beta_geo.ShiftedBetaGeoModel.load.po
Languages: es

source: ShiftedBetaGeoModel.load
es: { "singular": "ShiftedBetaGeoModel.cargar", "plural": "ShiftedBetaGeoModel.cargar" }

source: Create a ModelBuilder instance from a file.
es: { "singular": "Cree una instancia de ModelBuilder a partir de un archivo.", "plural": "Cree instancias de ModelBuilder a partir de archivos." }

source: Loads inference data for the model.
es: { "singular": { "msgid": "Loads inference data for the model.", "msgstr": "Carga datos de inferencia para el modelo." }, "plural": { "msgid": "Loads inference data for the model.", "msgstr": "Carga datos de inferencia para el modelo." } }

source: This class method has a few steps:
es: { "singular": "Este método de clase tiene unos pocos pasos:", "plural": "Este método de clase tiene unos pocos pasos:" }

source: Load the InferenceData from the file.
es: { "singular": "Cargue el InferenceData desde el archivo.", "plural": "Carguen el InferenceData desde el archivo." }

source: Construct a new instance of the model using the InferenceData attrs
es: { "singular": "Construya una nueva instancia del modelo utilizando los atributos de InferenceData", "plural": "Construyan nuevas instancias del modelo utilizando los atributos de InferenceData" }

source: Build the model from the InferenceData
es: { "singular": "Construya el modelo a partir de los InferenceData", "plural": "Construyan el modelo a partir de los InferenceData" }

source: Check if the model id matches the id in the InferenceData loaded.
es: { "singular": "Verifique si el id del modelo coincide con el id en los InferenceData cargados.", "plural": "Verifique si los id de los modelos coinciden con los id en los InferenceData cargados." }

source: Parameters
es: { "singular": { "msgid": "Parameter", "msgstr": "Parámetro" }, "plural": { "msgid": "Parameters", "msgstr": "Parámetros" } }

source: **fname** : :class:`python:str`
es: { "singular": "**fname** : :class:`python:str`", "plural": "**fname** : :class:`python:str`" }

source: python:str
es: { "singular": "python:str", "plural": "python:str" }

source: This denotes the name with path from where idata should be loaded from.
es: { "singular": "Esto denota el nombre con la ruta desde donde se debe cargar idata.", "plural": "Esto denota los nombres con las rutas desde donde se deben cargar idata." }

source: **check** : :ref:`bool <python:bltin-boolean-values>`, optional
es: { "singular": "**verificar** : :ref:`bool <python:bltin-boolean-values>`, opcional", "plural": "**verificar** : :ref:`bool <python:bltin-boolean-values>`, opcional" }

source: bool, optional
es: { "singular": "bool, opcional", "plural": "bool, opcionales" }

source: Whether to check if the model id matches the id in the InferenceData loaded. Defaults to True.
es: { "singular": "Si se debe verificar si el id del modelo coincide con el id en los InferenceData cargados. Por defecto es True.", "plural": "Si se deben verificar si los id de los modelos coinciden con los id en los InferenceData cargados. Por defecto es True." }

source: Returns
es: { "singular": "Devoluciones", "plural": "Devoluciones" }

source: :obj:`Returns` :obj:`an` instance of ModelBuilder.
es: { "singular": ":obj:`Devuelve` :obj:`una` instancia de ModelBuilder.", "plural": ":obj:`Devuelve` :obj:`unas` instancias de ModelBuilder." }

source: Raises
es: { "singular": "Aumento", "plural": "Aumentos" }

source: :obj:`DifferentModelError`
es: { "singular": ":obj:`DifferentModelError`", "plural": ":obj:`DifferentModelError`" }

source: If the inference data that is loaded doesn't match with the model.
es: { "singular": "Si los datos de inferencia que se cargan no coinciden con el modelo.", "plural": "Si los datos de inferencia que se cargan no coinciden con los modelos." }

source: Examples
es: { "singular": "Ejemplo", "plural": "Ejemplos" }

source: Load a model from a file
es: { "singular": "Cargar un modelo desde un archivo", "plural": "Cargar modelos desde un archivo" }
