Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/contributing/index.po
Languages: es

source: Contributing
es: Contribuyendo

source: PyMC-Marketing welcomes contributions from interested individuals or groups. These guidelines are provided to give potential contributors information to make their contribution compliant with the conventions of the PyMC-Marketing project, and maximize the probability of such contributions to be merged as quickly and efficiently as possible. Contributors need not be experts, but should be interested in the project, willing to learn, and share knowledge.
es: PyMC-Marketing da la bienvenida a las contribuciones de individuos o grupos interesados. Estas directrices se proporcionan para ofrecer a los posibles contribuyentes información que les permita hacer su contribución conforme a las convenciones del proyecto PyMC-Marketing y maximizar la probabilidad de que tales contribuciones sean fusionadas de la manera más rápida y eficiente posible. Los contribuyentes no necesitan ser expertos, pero deben estar interesados en el proyecto, dispuestos a aprender y a compartir conocimientos.

source: There are 4 main ways of contributing to the PyMC-Marketing project (in ascending order of difficulty or scope):
es: Existen 4 formas principales de contribuir al proyecto PyMC-Marketing (en orden ascendente de dificultad o alcance):

source: Submitting issues related to bugs or desired enhancements.
es: Enviando problemas relacionados con errores o mejoras deseadas.

source: Contributing or improving the documentation (docs) or examples.
es: Contribuyendo o mejorando la documentación (docs) o ejemplos.

source: Fixing outstanding issues (bugs) with the existing codebase. They range from low-level software bugs to higher-level design problems.
es: Solucionando problemas pendientes (errores) en la base de código existente. Estos varían desde errores de software de bajo nivel hasta problemas de diseño de nivel superior.

source: Adding new or improved functionality to the existing codebase.
es: Añadiendo nuevas o mejoradas funcionalidades a la base de código existente.

source: Items 2-4 require setting up a local development environment, see [Local development steps](#Contributing-code-via-pull-requests) for more information.
es: Los elementos 2-4 requieren la configuración de un entorno de desarrollo local, consulte [Pasos de desarrollo local](#Contributing-code-via-pull-requests) para más información.

source: Opening issues
es: Abriendo problemas

source: We appreciate being notified of problems with the existing PyMC-Marketing code. We prefer that issues be filed the on [Github Issue Tracker](https://github.com/pymc-labs/pymc-marketing/issues), rather than on social media or by direct email to the developers.
es: Agradecemos que nos notifiquen sobre problemas con el código existente de PyMC-Marketing. Preferimos que los problemas se informen en el [Github Issue Tracker](https://github.com/pymc-labs/pymc-marketing/issues), en lugar de en redes sociales o por correo electrónico directo a los desarrolladores.

source: Please verify that your issue is not being currently addressed by other issues or pull requests by using the GitHub search tool to look for key words in the project issue tracker.
es: Por favor, verifique que su problema no esté siendo abordado actualmente por otros problemas o solicitudes de extracción utilizando la herramienta de búsqueda de GitHub para buscar palabras clave en el rastreador de problemas del proyecto.

source: Contributing code via pull requests
es: Contribuyendo código a través de solicitudes de extracción

source: While issue reporting is valuable, we strongly encourage users who are inclined to do so to submit patches for new or existing issues via pull requests. This is particularly the case for simple fixes, such as typos or tweaks to documentation, which do not require a heavy investment of time and attention.
es: Si bien la presentación de informes de problemas es valiosa, alentamos encarecidamente a los usuarios que estén inclinados a hacerlo a que envíen parches para problemas nuevos o existentes a través de solicitudes de extracción. Este es particularmente el caso de correcciones simples, como errores tipográficos o ajustes en la documentación, que no requieren una gran inversión de tiempo y atención.

source: Contributors are also encouraged to contribute new code to enhance PyMC-Marketing's functionality, via pull requests.
es: Se anima a los colaboradores a contribuir con nuevo código para mejorar la funcionalidad de PyMC-Marketing, a través de solicitudes de extracción.

source: The preferred workflow for contributing to PyMC-Marketing is to fork the GitHub repository, clone it to your local machine, and develop on a feature branch.
es: El flujo de trabajo preferido para contribuir a PyMC-Marketing es bifurcar el repositorio de GitHub, clonarlo en su máquina local y desarrollar en una rama de características.

source: For more instructions see the [Pull request checklist](#pull-request-checklist)
es: Para más instrucciones, consulte la [lista de verificación de solicitudes de extracción](#pull-request-checklist)

source: Local development steps
es: Pasos para el desarrollo local

source: If you have not already done so, fork the [project repository](https://github.com/pymc-labs/pymc-marketing) by clicking on the 'Fork' button near the top right of the main repository page. This creates a copy of the code under your GitHub user account.
es: Si aún no lo ha hecho, bifurque el [repositorio del proyecto](https://github.com/pymc-labs/pymc-marketing) haciendo clic en el botón 'Fork' cerca de la parte superior derecha de la página principal del repositorio. Esto crea una copia del código bajo su cuenta de usuario de GitHub.

source: Clone your fork of the `pymc-marketing` repo from your GitHub account to your local disk, and add the base repository as a remote:
es: Clona tu bifurcación del repositorio `pymc-marketing` de tu cuenta de GitHub a tu disco local y añade el repositorio base como remoto:

source: Alternatively, if you use the [GitHub CLI](https://cli.github.com/), then the required command is just
es: Alternativamente, si utiliza el [GitHub CLI](https://cli.github.com/), entonces el comando requerido es solo

source: Create a feature branch (e.g. `my-feature`) to hold your development changes:
es: Cree una rama de características (por ejemplo, `my-feature`) para contener sus cambios de desarrollo:

source: Always use a feature branch. It's good practice to never routinely work on the `main` branch of any repository.
es: Siempre utiliza una rama de características. Es una buena práctica no trabajar rutinariamente en la rama `main` de ningún repositorio.

source: Create a dedicated development environment from the file present in the repo:
es: Cree un entorno de desarrollo dedicado a partir del archivo presente en el repositorio:

source: This will create an environment called `pymc-marketing-dev`. Activate the environment.
es: Esto creará un entorno llamado `pymc-marketing-dev`. Active el entorno.

source: Install the package (in editable mode) and its development dependencies:
es: Instale el paquete (en modo editable) y sus dependencias de desarrollo:

source: Set [pre-commit hooks](https://pre-commit.com/). First install pre-commit package (either `pip install pre-commit`, see the package's installation instructions). Alternatively you can run `make check_lint` which will install the `pre-commit` package. Then run this to set up the git hook scripts:
es: Configura los [ganchos pre-commit](https://pre-commit.com/). Primero, instala el paquete pre-commit (ya sea `pip install pre-commit`, consulta las instrucciones de instalación del paquete). Alternativamente, puedes ejecutar `make check_lint`, lo que instalará el paquete `pre-commit`. Luego, ejecuta esto para configurar los scripts de ganchos de git:

source: You can then work on your changes locally, in your feature branch. Add changed files using `git add` and then `git commit` files:
es: Puedes trabajar en tus cambios localmente, en tu rama de características. Agrega los archivos modificados usando `git add` y luego `git commit` archivos:

source: to record your changes locally. After committing, it is a good idea to sync with the base repository in case there have been any changes:
es: para registrar sus cambios localmente. Después de hacer el commit, es una buena idea sincronizar con el repositorio base en caso de que haya habido algún cambio:

source: Then push the changes to your GitHub account with:
es: Luego, envía los cambios a tu cuenta de GitHub con:

source: [Optionally] Build the docs locally. If you have changed any of the documentation, you can build it locally to check that it looks as expected.
es: [Opcionalmente] Construya la documentación localmente. Si ha cambiado alguna de la documentación, puede construirla localmente para verificar que se vea como se espera.

source: To delete all intermediate files and cached content and build the docs from scratch, run `make cleandocs` before `make html`
es: Para eliminar todos los archivos intermedios y el contenido en caché y construir la documentación desde cero, ejecute `make cleandocs` antes de `make html`.

source: Before you submit a Pull request, follow the [Pull request checklist](#pull-request-checklist).
es: Antes de enviar una solicitud de extracción, siga la [lista de verificación de solicitudes de extracción](#pull-request-checklist).

source: Finally, to submit a pull request, go to the GitHub web page of your fork of the PyMC-Marketing repo. Click the 'Pull request' button to send your changes to the project's maintainers for review. This will send an email to the committers.
es: Finalmente, para enviar una solicitud de extracción, dirígete a la página web de GitHub de tu bifurcación del repositorio PyMC-Marketing. Haz clic en el botón 'Pull request' para enviar tus cambios a los mantenedores del proyecto para su revisión. Esto enviará un correo electrónico a los responsables de los commits.

source: Pull request checklist
es: Lista de verificación de la solicitud de extracción

source: We recommend that your contribution complies with the following guidelines before you submit a pull request:
es: Recomendamos que su contribución cumpla con las siguientes directrices antes de enviar una solicitud de extracción:

source: If your pull request addresses an issue, please use the pull request title to describe the issue and mention the issue number in the pull request description. This will make sure a link back to the original issue is created.
es: Si su solicitud de extracción aborda un problema, utilice el título de la solicitud de extracción para describir el problema y mencione el número del problema en la descripción de la solicitud de extracción. Esto asegurará que se cree un enlace de regreso al problema original.

source: All public methods must have informative docstrings with sample usage when appropriate.
es: Todos los métodos públicos deben tener docstrings informativos con ejemplos de uso cuando sea apropiado.

source: To indicate a work in progress please mark the PR as `draft`. Drafts may be useful to (1) indicate you are working on something to avoid duplicated work, (2) request broad review of functionality or API, or (3) seek collaborators.
es: Para indicar un trabajo en progreso, por favor marque el PR como `borrador`. Los borradores pueden ser útiles para (1) indicar que está trabajando en algo para evitar trabajo duplicado, (2) solicitar una revisión amplia de la funcionalidad o API, o (3) buscar colaboradores.

source: All other tests pass when everything is rebuilt from scratch.
es: Todas las demás pruebas pasan cuando todo se reconstruye desde cero.

source: When adding additional functionality, either edit an existing example, or create a new example (typically in the form of a Jupyter Notebook) in the `pymc-marketing/docs/source/mmm` or `pymc-marketing/docs/source/clv` folders. Have a look at other examples for reference. Examples should demonstrate why the new functionality is useful in practice.
es: Al agregar funcionalidad adicional, edite un ejemplo existente o cree un nuevo ejemplo (típicamente en forma de un Jupyter Notebook) en las carpetas `pymc-marketing/docs/source/mmm` o `pymc-marketing/docs/source/clv`. Consulte otros ejemplos como referencia. Los ejemplos deben demostrar por qué la nueva funcionalidad es útil en la práctica.

source: Documentation and high-coverage tests are necessary for enhancements to be accepted.
es: La documentación y las pruebas de alta cobertura son necesarias para que las mejoras sean aceptadas.

source: Documentation follows [NumPy style guide](https://numpydoc.readthedocs.io/en/latest/format.html)
es: La documentación sigue la [guía de estilo de NumPy](https://numpydoc.readthedocs.io/en/latest/format.html)

source: Run any of the pre-existing examples in `pymc-marketing/docs/source/*` that contain analyses that would be affected by your changes to ensure that nothing breaks. This is a useful opportunity to not only check your work for bugs that might not be revealed by unit test, but also to show how your contribution improves PyMC-Marketing for end users.
es: Ejecute cualquiera de los ejemplos preexistentes en `pymc-marketing/docs/source/*` que contengan análisis que se verían afectados por sus cambios para asegurarse de que nada se rompa. Esta es una oportunidad útil no solo para verificar su trabajo en busca de errores que podrían no ser revelados por las pruebas unitarias, sino también para mostrar cómo su contribución mejora PyMC-Marketing para los usuarios finales.

source: Your code passes linting tests. Run the line below to check linting errors:
es: Tu código pasa las pruebas de linting. Ejecuta la línea a continuación para verificar errores de linting:

source: If you want to fix linting errors automatically, run
es: Si desea corregir los errores de linting automáticamente, ejecute

source: To run tests:
es: Para ejecutar pruebas:

source: To check code style:
es: Para verificar el estilo de código:

source: To fix code style automatically:
es: Para corregir el estilo de código automáticamente:
