Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/dev/*_nbg_covariates_test_issues.po
Languages: es

source: BG/NBD Model with covariates: Issues with parameter a, b recovery
es: Modelo BG/NBD con covariables: Problemas con la recuperación de los parámetros a, b

source: Imports
es: Importaciones

source: Replicate the test
es: Replicar la prueba

source: Read the data
es: Leer los datos

source: Set artificial covariates
es: Establecer covariables artificiales

source: Set the config
es: Establecer la configuración

source: Mock fit
es: Ajuste simulado

source: Set test data
es: Establecer datos de prueba

source: Sampling Distributions
es: Distribuciones de muestreo

source: Sample with zero covariates
es: Muestra sin covariables

source: Sample with covariates
es: Muestra con covariables

source: Combine both and inspect the distributions
es: Combina ambos y examina las distribuciones.

source: Dropout is the problematic assertion
es: La deserción es la afirmación problemática.

source: The introduction of covariates is not changing the value of the droput probability. We will investigate this below.
es: La introducción de covariables no está cambiando el valor de la probabilidad de abandono. Investigaremos esto a continuación.

source: The Beta distribution, and the dropout covariate
es: La distribución Beta y la covariable de abandono

source: alpha (a) = beta (b)
es: msgid: alpha (a) = beta (b) msgstr: alpha (a) = beta (b)

source: Whenever a = b, the Beta distribution is simetrical with E[X] = 0.5.
es: Siempre que a = b, la distribución Beta es simétrica con E[X] = 0.5.

source: This has implications, on the expected values of our *"dropout"* variable. Introducing covariates only narrows our distribution
es: Esto tiene implicaciones sobre los valores esperados de nuestra variable *"dropout"*. Introducir covariables solo estrecha nuestra distribución.

source: alpha (a) > beta (b)
es: msgid: alpha (a) > beta (b) msgstr: alpha (a) > beta (b)

source: We have E[X] > 0.5
es: Tenemos E[X] > 0.5

source: We have E[X] < 0.5
es: Tenemos E[X] < 0.5

source: Contrast with ParetoNBD
es: Contraste con ParetoNBD

source: The ParetoNBD used Gamma for the dropout process,
es: El ParetoNBD utilizó Gamma para el proceso de abandono,

source: Here we have E[X] monotonically increasing. The presence of covariates increases dropout probability
es: Aquí tenemos E[X] que aumenta monótonamente. La presencia de covariables incrementa la probabilidad de abandono.

source: We should change out assertion to:
es: Deberíamos cambiar nuestra afirmación a:
