Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/dev/gamma_gamma_dev.po
Languages: es

source: Developer Gamma-gamma model PyMC implementation
es: Implementación del modelo Gamma-gamma en PyMC por el desarrollador

source: **Reference**:Fader, P. S., & Hardie, B. G. (2013). The Gamma-Gamma model of monetary value. February, 2, 1-9.
es: **Referencia**: Fader, P. S., & Hardie, B. G. (2013). El modelo Gamma-Gamma del valor monetario. Febrero, 2, 1-9.

source: Simulate data
es: Simular datos

source: PyMC implementation
es: Implementación de PyMC

source: We can use the pre-built PyMMMC implementation of the Gamma-Gamma model, which also provides nice ploting and prediction methods
es: Podemos utilizar la implementación preconstruida de PyMMMC del modelo Gamma-Gamma, que también ofrece métodos de graficado y predicción atractivos.

source: Using individual transactions 𝑧
es: Usando transacciones individuales 𝑧

source: Using average transactions per user $\overline{z}$
es: Usando transacciones promedio por usuario $\overline{z}$

source: Manual PyMC implementations
es: Implementaciones manuales de PyMC

source: We show how the Gamma-Gamma model can be implemented by hand using PyMC. This clarifies how the model can be modified or extended to include more prior information or additional structure.
es: Mostramos cómo se puede implementar el modelo Gamma-Gamma manualmente utilizando PyMC. Esto aclara cómo se puede modificar o extender el modelo para incluir más información previa o estructura adicional.

source: Gamma-Gamma model conditioned on individual transactions $z$
es: Modelo Gamma-Gamma condicionado a transacciones individuales $z$

source: Gamma-gamma model conditioned on average transactions per user $\overline{z}$
es: Modelo gamma-gamma condicionado a las transacciones promedio por usuario $\overline{z}$

source: This fails to sample because the model contains "nearly" two independent parameters per observation. For more details check this [Discourse topic](https://discourse.pymc.io/t/gamma-model-sampling-much-worse-when-observation-summaries-are-used-instead-of-individual-observations/10444)
es: Esto no puede muestrear porque el modelo contiene "casi" dos parámetros independientes por observación. Para más detalles, consulta este [tema de Discourse](https://discourse.pymc.io/t/gamma-model-sampling-much-worse-when-observation-summaries-are-used-instead-of-individual-observations/10444)

source: Gamma-Gamma model conditioned on average transaction per user with $\nu$ marginalized
es: Modelo Gamma-Gamma condicionado en la transacción promedio por usuario con $\nu$ marginalizado
