Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/dev/pareto_nbd_advi.po
Languages: es

source: Load data
es: Cargar datos

source: RFM aggregations
es: Agregaciones RFM

source: ParetoNBDModel
es: ModeloParetoNBD

source: MAP fit
es: ajuste del MAP

source: DEMZ fit
es: DEMZ se ajusta

source: Full-rank fit
es: Ajuste de rango completo

source: Visual comparison
es: Comparación visual

source: Observations:
es: Observaciones:

source: Fullrank provides a rather poor fit
es: Fullrank ofrece un ajuste bastante deficiente.

source: advi's fit does match mcmc, although providing narrower estimates
es: el ajuste de advi coincide con mcmc, aunque proporciona estimaciones más estrechas

source: Relative Differences in param estimates
es: Diferencias relativas en las estimaciones de parámetros
