Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/dev/sBG_cohort.po
Languages: es

source: Shifted Beta-Geometric Modeling with Cohorts
es: { "singular": "Modelado Beta-Geométrico Desplazado con Cohortes", "plural": "Modelados Beta-Geométricos Desplazados con Cohortes" }

source: In this notebook we replicate the main results and figures from ["How to Project Customer Retention"](https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf) by Hardie & Fader (2007), which introduces the Shifted Beta-Geometric (sBG) model for customer behavior in a discrete contractual setting. It is ideal for business cases involving recurring subscriptions and has the following assumptions:
es: { "singular": "En este cuaderno replicamos los principales resultados y figuras de [\"Cómo proyectar la retención de clientes\"](https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf) de Hardie y Fader (2007), que introduce el modelo Beta-Geométrico Desplazado (sBG) para el comportamiento del cliente en un entorno contractual discreto. Es ideal para casos de negocio que involucran suscripciones recurrentes y tiene las siguientes suposiciones:", "plural": "En estos cuadernos replicamos los principales resultados y figuras de [\"Cómo proyectar la retención de clientes\"](https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_jim_07.pdf) de Hardie y Fader (2007), que introduce el modelo Beta-Geométrico Desplazado (sBG) para el comportamiento del cliente en un entorno contractual discreto. Es ideal para casos de negocio que involucran suscripciones recurrentes y tiene las siguientes suposiciones:" }

source: Customer cancellation probabilities are Beta-distributed with hyperparameters `alpha` and `beta`.
es: { "singular": "Las probabilidades de cancelación del cliente están distribuidas según una Beta con hiperparámetros `alpha` y `beta`.", "plural": "Las probabilidades de cancelación de los clientes están distribuidas según una Beta con hiperparámetros `alpha` y `beta`." }

source: Retention rates change over time due to customer heterogeneity.
es: { "singular": { "msgid": "Retention rates change over time due to customer heterogeneity.", "msgstr": "Las tasas de retención cambian con el tiempo debido a la heterogeneidad de los clientes." }, "plural": { "msgid": "Retention rates change over time due to customer heterogeneity.", "msgstr": "Las tasas de retención cambian con el tiempo debido a la heterogeneidad de los clientes." } }

source: All customers in a given cohort began their contract in the same time period.
es: { "singular": "Todos los clientes en una cohorte determinada comenzaron su contrato en el mismo período de tiempo.", "plural": "Todos los clientes en una cohorte determinada comenzaron sus contratos en el mismo período de tiempo." }

source: The last assumption in particular is an ideal application for hierarchical Bayesian modeling.
es: { "singular": "La última suposición en particular es una aplicación ideal para el modelado bayesiano jerárquico.", "plural": "" }

source: Tutorial Notebook Outstanding Tasks
es: { "singular": "Tareas Pendientes del Cuaderno de Tutoriales", "plural": "Tareas Pendientes del Cuaderno de Tutoriales" }

source: Merge PR for `expected_retention_elasticity`
es: { "singular": "Fusionar PR para `expected_retention_elasticity`", "plural": "Fusionar PR para `expected_retention_elasticity`" }

source: Merge Mean/Polarization index plotting PR
es: { "singular": "Fusión de la representación gráfica del índice de media/polarización PR", "plural": "Fusiones de la representación gráfica del índice de media/polarización PR" }

source: Merge Static Covariate PR
es: { "singular": "Fusionar Covariables Estáticas PR", "plural": "Fusionar Covariables Estáticas PR" }

source: Fit regular/highend data to both a cohort and covariate model to replicate research results
es: { "singular": "Ajustar datos regulares/de alta gama a un modelo de cohorte y covariables para replicar los resultados de la investigación", "plural": "Ajustar datos regulares/de alta gama a modelos de cohortes y covariables para replicar los resultados de la investigación" }

source: Synthesize time cohort model with covariates to showcase conventional cohort EDA, additional predictive methods, and mean/polar plotting
es: { "singular": "Sintetizar el modelo de cohorte temporal con covariables para mostrar el EDA de cohorte convencional, métodos predictivos adicionales y gráficos de media/polar.", "plural": "Sintetizar los modelos de cohorte temporal con covariables para mostrar los EDA de cohorte convencionales, métodos predictivos adicionales y gráficos de media/polar." }

source: Load Data and EDA
es: { "singular": "Cargar datos y EDA", "plural": "Cargar datos y EDA" }

source: Adapt plots from sBG-Individual notebook here.
es: { "singular": "Adapte los gráficos del cuaderno sBG-Individual aquí.", "plural": "Adapte los gráficos del cuaderno sBG-Individual aquí." }

source: Figures 4 and 5 show the predicted average churn and retention trends for the two groups. We can see that predictions nicely match the observed data (black line), even when extrapolating into the time periods that were held-out when fitting the model.
es: { "singular": "Las Figuras 4 y 5 muestran las tendencias promedio de abandono y retención predichas para los dos grupos. Podemos ver que las predicciones coinciden perfectamente con los datos observados (línea negra), incluso al extrapolar hacia los períodos de tiempo que se reservaron al ajustar el modelo.", "plural": "Las Figuras 4 y 5 muestran las tendencias promedio de abandono y retención predichas para los dos grupos. Podemos ver que las predicciones coinciden perfectamente con los datos observados (línea negra), incluso al extrapolar hacia los períodos de tiempo que se reservaron al ajustar el modelo." }

source: The plots also highlight an interesting implication from the model: the retention rates are expected to increase over time, as the more precarious customers gradually drop out. This is a direct consequence of modelling individual churn rates as being fixed over time.
es: { "singular": "Las gráficas también destacan una implicación interesante del modelo: se espera que las tasas de retención aumenten con el tiempo, a medida que los clientes más precarios se vayan retirando gradualmente. Esta es una consecuencia directa de modelar las tasas de abandono individuales como fijas a lo largo del tiempo.", "plural": "Las gráficas también destacan implicaciones interesantes del modelo: se espera que las tasas de retención aumenten con el tiempo, a medida que los clientes más precarios se vayan retirando gradualmente. Estas son consecuencias directas de modelar las tasas de abandono individuales como fijas a lo largo del tiempo." }

source: Model Fitting
es: { "singular": "Ajuste del Modelo", "plural": "Ajustes del Modelo" }

source: Differential Evolution Metropolis
es: { "singular": "Evolución Diferencial Metropolis", "plural": "Evoluciones Diferenciales Metropolis" }

source: NUTS defaults to a compound sampler since this is a discrete sampling distribution. It still works great for a dataset of this size, but with large numbers of customers and cohorts, [`DEMetropolisZ`](https://www.pymc.io/projects/docs/en/v5.6.1/api/generated/pymc.DEMetropolisZ.html) may be more performant.
es: { "singular": "NUTS utiliza un muestreador compuesto ya que esta es una distribución de muestreo discreta. Aún funciona muy bien para un conjunto de datos de este tamaño, pero con grandes cantidades de clientes y cohortes, [`DEMetropolisZ`](https://www.pymc.io/projects/docs/en/v5.6.1/api/generated/pymc.DEMetropolisZ.html) puede ser más eficiente.", "plural": "NUTS utiliza un muestreador compuesto ya que esta es una distribución de muestreo discreta. Aún funciona muy bien para conjuntos de datos de este tamaño, pero con grandes cantidades de clientes y cohortes, [`DEMetropolisZ`](https://www.pymc.io/projects/docs/en/v5.6.1/api/generated/pymc.DEMetropolisZ.html) puede ser más eficiente." }

source: Contrasting posterior inferences with the repo MLE estimates
es: { "singular": "Contrastando las inferencias posteriores con las estimaciones MLE del repositorio", "plural": "Contrastando las inferencias posteriores con las estimaciones MLE de los repositorios" }

source: The sBG model has 2 population parameters of interest: `alpha` and `beta`. These parameters define the population distribution of the latent churn rate distribution `theta`. The larger the values of `alpha` and `beta`, the more homogenous the churn rates across different customers.
es: { "singular": "El modelo sBG tiene 2 parámetros poblacionales de interés: `alpha` y `beta`. Estos parámetros definen la distribución poblacional de la distribución de la tasa de abandono latente `theta`. Cuanto mayores sean los valores de `alpha` y `beta`, más homogéneas serán las tasas de abandono entre diferentes clientes.", "plural": "Los modelos sBG tienen 2 parámetros poblacionales de interés: `alpha` y `beta`. Estos parámetros definen la distribución poblacional de la distribución de la tasa de abandono latente `theta`. Cuanto mayores sean los valores de `alpha` y `beta`, más homogéneas serán las tasas de abandono entre diferentes clientes." }

source: The ratio of `alpha` to `beta` tells us the expected churn rates. If `alpha/beta == 0.1`, we expect the average customer to have a `0.1` probability of churning between each time period.
es: { "singular": "La relación de `alpha` a `beta` nos indica las tasas de cancelación esperadas. Si `alpha/beta == 0.1`, esperamos que el cliente promedio tenga una probabilidad de `0.1` de cancelar entre cada período de tiempo.", "plural": "La relación de `alpha` a `beta` nos indica las tasas de cancelación esperadas. Si `alpha/beta == 0.1`, esperamos que los clientes promedio tengan una probabilidad de `0.1` de cancelar entre cada período de tiempo." }

source: The model fitting agrees with the Maximum Likelihood estimates described in the original paper. In addition, MCMC sampling, gives us useful information about the uncertainty of the fits.
es: { "singular": "El ajuste del modelo coincide con las estimaciones de Máxima Verosimilitud descritas en el artículo original. Además, el muestreo MCMC nos proporciona información útil sobre la incertidumbre de los ajustes.", "plural": "Los ajustes del modelo coinciden con las estimaciones de Máxima Verosimilitud descritas en el artículo original. Además, el muestreo MCMC nos proporciona información útil sobre la incertidumbre de los ajustes." }

source: Predictive Methods
es: { "singular": "Métodos predictivos", "plural": "Métodos predictivos" }

source: **Below plotting code cells were lifted directly from sBG-Individual notebook and require adaptation:**
es: { "singular": "**El siguiente código de celdas de gráficos fue extraído directamente del cuaderno sBG-Individual y requiere adaptación:**", "plural": "**El siguiente código de celdas de gráficos fue extraído directamente del cuaderno sBG-Individual y requiere adaptación:**" }

source: Additional Predictive Methods
es: { "singular": "Métodos Predictivos Adicionales", "plural": "Métodos Predictivos Adicionales" }

source: Below methods are described in https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf
es: { "singular": "A continuación se describen los métodos en https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf", "plural": "A continuación se describen los métodos en https://faculty.wharton.upenn.edu/wp-content/uploads/2012/04/Fader_hardie_contractual_mksc_10.pdf" }

source: Simulate Data from Follow-Up Paper
es: { "singular": "Simular datos del documento de seguimiento", "plural": "Simular datos de los documentos de seguimiento" }

source: Adapt below code to create time-period cohorts with highend & regular covariate customers mixed into each.
es: { "singular": "Adapte el código a continuación para crear cohortes de períodos de tiempo con clientes de covariables de alta gama y regulares mezclados en cada uno.", "plural": "Adapte el código a continuación para crear cohortes de períodos de tiempo con clientes de covariables de alta gama y regulares mezclados en cada uno." }

source: Expected Retention Elasticity
es: { "singular": "Elasticidad de Retención Esperada", "plural": "Elasticidades de Retención Esperadas" }

source: TO BE ADDED IN NEXT PR!
es: { "singular": "¡AÑADIR EN LA PRÓXIMA PR!", "plural": "¡AÑADIR EN LA PRÓXIMA PR!" }

source: Expected Lifetime Transactions
es: { "singular": "Transacciones de Vida Esperada", "plural": "Transacciones de Vida Esperada" }

source: Add unit testing fixtures here for visual inspection
es: { "singular": "Agregue aquí los elementos de prueba de unidad para la inspección visual", "plural": "Agregue aquí los elementos de prueba de unidad para la inspección visual" }

source: Latent Dropout Distribution for Customer Population
es: { "singular": "Distribución de Dropout Latente para la Población de Clientes", "plural": "Distribuciones de Dropout Latente para las Poblaciones de Clientes" }

source: Distribution mean and polarization index plotting will be added in future PR rather than visualizations of the latent cohort dropout distributions, but for illustratrive examples in tutorial notebook, latent distribution plotting code is provided below:
es: { "singular": "Se añadirá la representación del promedio de distribución y el índice de polarización en futuras PR en lugar de las visualizaciones de las distribuciones de abandono de la cohorte latente, pero para ejemplos ilustrativos en el cuaderno de tutorial, se proporciona el código de representación de la distribución latente a continuación:", "plural": "Se añadirán las representaciones del promedio de distribución y el índice de polarización en futuras PR en lugar de las visualizaciones de las distribuciones de abandono de la cohorte latente, pero para ejemplos ilustrativos en el cuaderno de tutorial, se proporciona el código de representación de la distribución latente a continuación:" }
