Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/clv/dev/utilities_plotting.po
Languages: es

source: Create a simple dataset for testing:
es: Cree un conjunto de datos simple para pruebas:

source: Note customer 4 made two purchases on 2015-02-05.
es: Nota: el cliente 4 realizó dos compras el 2015-02-05.

source: `_find_first_transactions` flags the first purchase each customer has made, which must be excluded for modeling. It is called internally by `rfm_summary`.
es: `_find_first_transactions` marca la primera compra que ha realizado cada cliente, la cual debe ser excluida para el modelado. Se llama internamente por `rfm_summary`.

source: Notice how **9** is missing from the dataframe index. Multiple transactions in the same time period are treated as a single purchase, so the indices for those additional transactions are skipped.
es: Observe cómo el **9** falta en el índice del dataframe. Múltiples transacciones en el mismo período de tiempo se tratan como una única compra, por lo que los índices de esas transacciones adicionales se omiten.

source: `rfm_summary` is the primary data preprocessing step for CLV modeling in the continuous, non-contractual domain:
es: `rfm_summary` es el paso principal de preprocesamiento de datos para el modelado de CLV en el dominio continuo y no contractual:

source: For MAP fits and covariate models, `rfm_train_test_split` can be used to evaluate models on unseen data. It is also useful for identifying the impact of a time-based event like a marketing campaign.
es: Para los ajustes de MAP y modelos de covariables, `rfm_train_test_split` se puede utilizar para evaluar modelos en datos no vistos. También es útil para identificar el impacto de un evento basado en el tiempo, como una campaña de marketing.

source: `rfm_segments` will assign customer to segments based on their recency, frequency, and monetary value. It uses a quartile-based RFM score approach that is very computationally efficient, but defining custom segments is a rather subjective exercise. The returned dataframe also cannot be used for modeling because it does not zero out the initial transactions.
es: `rfm_segments` asignará a los clientes a segmentos basados en su recencia, frecuencia y valor monetario. Utiliza un enfoque de puntuación RFM basado en cuartiles que es muy eficiente en términos computacionales, pero definir segmentos personalizados es un ejercicio bastante subjetivo. El dataframe devuelto tampoco puede ser utilizado para modelar porque no anula las transacciones iniciales.

source: Plotting
es: Trazado

source: `expected_cumulative_transactions` and all other plotting functions require a fitted model. Test with both MAP and full posteriors:
es: `expected_cumulative_transactions` y todas las demás funciones de trazado requieren un modelo ajustado. Pruebe con tanto MAP como con los posteriores completos:

source: Expected Cumulative Purchases
es: Compras Acumulativas Esperadas

source: If doing a train/test split, or studying time interventions like marketing campaigns, `plot_expected_purchases_over_time` can be used for easy visual interpretation.
es: Si se realiza una división entre entrenamiento/prueba, o se estudian intervenciones temporales como campañas de marketing, `plot_expected_purchases_over_time` se puede utilizar para una interpretación visual fácil.

source: Now fit a model by sampling from the posterior distributions:
es: Ahora ajuste un modelo muestreando de las distribuciones posteriores:

source: Adding HDIs to `plot_purchase_pmf` requires value counts to be grouped coordinate-wise across a dimension like `draws`, which may not be supported in `xarray`. `arviz.hdi` can then be applied across all value counts for interval estimation.
es: Agregar HDIs a `plot_purchase_pmf` requiere que los recuentos de valores se agrupen coordenada por coordenada a lo largo de una dimensión como `draws`, lo cual puede no ser compatible con `xarray`. Luego, se puede aplicar `arviz.hdi` a todos los recuentos de valores para la estimación de intervalos.
