Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_roas.po
Languages: es

source: Case Study: Unobserved Confounders, ROAS and Lift Tests
es: Estudio de Caso: Confusores No Observados, ROAS y Pruebas de Incremento

source: The Importance of Calibration in Media Mix Models
es: La importancia de la calibración en los modelos de mezcla de medios

source: When working with Media Mix Models (MMMs), calibration with lift tests is not just a technical step — it's essential for making these models reliable and actionable. Lift tests serve as a reality check, grounding the model's predictions in real-world outcomes. This process is particularly important because MMMs often rely on data that is both noisy and limited in scope, making accurate predictions difficult.
es: Al trabajar con Modelos de Mezcla de Medios (MMM), la calibración con pruebas de elevación no es solo un paso técnico, sino que es esencial para hacer que estos modelos sean fiables y accionables. Las pruebas de elevación sirven como un chequeo de la realidad, anclando las predicciones del modelo en resultados del mundo real. Este proceso es particularmente importante porque los MMM a menudo dependen de datos que son tanto ruidosos como limitados en alcance, lo que dificulta realizar predicciones precisas.

source: Why MMMs Need to Be Causal Models
es: Por qué los MMM deben ser modelos causales

source: The true power of MMMs lies in their ability to guide decisions based on potential changes in marketing strategy. For instance, a marketer might ask, "What impact would reducing the budget for channel X by 50% have on overall sales?" To answer such questions, MMMs must be developed as *causal models*—models that can predict the effects of specific interventions.
es: El verdadero poder de los MMM radica en su capacidad para guiar decisiones basadas en posibles cambios en la estrategia de marketing. Por ejemplo, un comercializador podría preguntar: "¿Qué impacto tendría la reducción del presupuesto para el canal X en un 50% en las ventas totales?" Para responder a tales preguntas, los MMM deben desarrollarse como *modelos causales*—modelos que pueden predecir los efectos de intervenciones específicas.

source: Creating a causal model involves constructing a well-defined *directed acyclic graph* (DAG). A DAG is a visual representation of the relationships between different variables in the model, helping to ensure that the right covariates (or control variables) are included. This isn't just about throwing in every available piece of data; it's about selecting variables that genuinely contribute to understanding the causal relationships in your marketing activities.
es: Crear un modelo causal implica construir un *grafo acíclico dirigido* (DAG) bien definido. Un DAG es una representación visual de las relaciones entre diferentes variables en el modelo, ayudando a garantizar que se incluyan las covariables correctas (o variables de control). No se trata solo de incluir cada dato disponible; se trata de seleccionar variables que realmente contribuyan a entender las relaciones causales en sus actividades de marketing.

source: The Challenge of Unobserved Confounders
es: El desafío de los confundidores no observados

source: Even with a well-constructed DAG, unobserved confounders can pose a significant problem. These are variables that influence both the treatment (e.g., spending on a particular marketing channel) and the outcome (e.g., sales) but are not included in the model. Their omission can lead to biased estimates, which in turn can result in poor decision-making. Unfortunately, unobserved confounders are almost inevitable in any real-world scenario.
es: Incluso con un DAG bien construido, los confundidores no observados pueden representar un problema significativo. Estas son variables que influyen tanto en el tratamiento (por ejemplo, el gasto en un canal de marketing particular) como en el resultado (por ejemplo, las ventas), pero que no están incluidas en el modelo. Su omisión puede llevar a estimaciones sesgadas, lo que a su vez puede resultar en una mala toma de decisiones. Desafortunadamente, los confundidores no observados son casi inevitables en cualquier escenario del mundo real.

source: A Recent Innovation: Calibrating MMMs with Bayesian Priors and Lift Tests
es: Una innovación reciente: calibración de MMMs con priors bayesianos y pruebas de lift

source: In theory, methods like instrumental variables can help address the issue of unobserved confounders. An instrumental variable is a variable that is correlated with the treatment but not with the outcome, except through the treatment. However, finding good instruments is notoriously difficult, making this solution less practical.
es: En teoría, métodos como las variables instrumentales pueden ayudar a abordar el problema de los confundidores no observados. Una variable instrumental es una variable que está correlacionada con el tratamiento pero no con el resultado, excepto a través del tratamiento. Sin embargo, encontrar buenos instrumentos es notoriamente difícil, lo que hace que esta solución sea menos práctica.

source: An alternative, more practical solution is to calibrate the MMM using lift tests. Lift tests are experiments that measure the incremental effect of a marketing intervention, such as a temporary increase in ad spend on a specific channel. By calibrating the model with the results of these tests, we can reduce the bias introduced by unobserved confounders. Bayesian methods are particularly well-suited for this approach because they allow us to incorporate prior knowledge—information we have before analyzing the data—into the model. This can significantly improve the model's accuracy, even before we start crunching the numbers.
es: Una solución alternativa y más práctica es calibrar el MMM utilizando pruebas de lift. Las pruebas de lift son experimentos que miden el efecto incremental de una intervención de marketing, como un aumento temporal en el gasto publicitario en un canal específico. Al calibrar el modelo con los resultados de estas pruebas, podemos reducir el sesgo introducido por confusores no observados. Los métodos bayesianos son particularmente adecuados para este enfoque porque nos permiten incorporar conocimiento previo—información que tenemos antes de analizar los datos—en el modelo. Esto puede mejorar significativamente la precisión del modelo, incluso antes de comenzar a procesar los números.

source: A recent paper, [Media Mix Model Calibration With Bayesian Priors](https://research.google/pubs/media-mix-model-calibration-with-bayesian-priors/) by Zhang et al. (2024), proposes a novel approach to calibrating MMMs. Instead of using the traditional beta (or regression) coefficients for each channel, the authors suggest parametrizing the model in terms of *return on ad spend* (ROAS).
es: Un artículo reciente, [Calibración del Modelo de Mezcla de Medios con Priors Bayesianos](https://research.google/pubs/media-mix-model-calibration-with-bayesian-priors/) de Zhang et al. (2024), propone un enfoque novedoso para calibrar los MMM. En lugar de utilizar los coeficientes beta (o de regresión) tradicionales para cada canal, los autores sugieren parametrizar el modelo en términos de *retorno sobre la inversión publicitaria* (ROAS).

source: The concept is straightforward: express the beta coefficients in terms of ROAS, and then substitute these into a standard MMM equation. This method simplifies the calibration process and can partially mitigate biases comming from unobserved confounders and noise in the data.
es: El concepto es sencillo: expresar los coeficientes beta en términos de ROAS y luego sustituirlos en una ecuación estándar de MMM. Este método simplifica el proceso de calibración y puede mitigar parcialmente los sesgos derivados de confusores no observados y del ruido en los datos.

source: Practical Application: Implementing the Method in PyMC
es: Aplicación Práctica: Implementación del Método en PyMC

source: In the blog post [Media Mix Model and Experimental Calibration: A Simulation Study](https://juanitorduz.github.io/mmm_roas/), [Juan Orduz](https://juanitorduz.github.io) provides a comprehensive implementation of this method using PyMC. This work demonstrates how this calibration approach can yield more accurate estimates, even when dealing with unobserved confounders. However, despite its strengths, this method has a limitation: it doesn't automatically improve when additional lift tests are added. The authors of the paper suggest aggregating the results of multiple lift tests by taking a weighted average of the ROAS estimates from each experiment.
es: En la entrada del blog [Modelo de Mezcla de Medios y Calibración Experimental: Un Estudio de Simulación](https://juanitorduz.github.io/mmm_roas/), [Juan Orduz](https://juanitorduz.github.io) proporciona una implementación completa de este método utilizando PyMC. Este trabajo demuestra cómo este enfoque de calibración puede generar estimaciones más precisas, incluso al tratar con confusores no observados. Sin embargo, a pesar de sus fortalezas, este método tiene una limitación: no mejora automáticamente cuando se añaden pruebas de lift adicionales. Los autores del artículo sugieren agregar los resultados de múltiples pruebas de lift tomando un promedio ponderado de las estimaciones de ROAS de cada experimento.

source: A New Approach: Refining MMMs with Custom Likelihood Functions
es: Un Nuevo Enfoque: Refinando los MMMs con Funciones de Verosimilitud Personalizadas

source: While the method proposed by Zhang et al. is effective, it could be more efficient in leveraging the results of lift tests. Running these experiments requires significant planning and resources, so it's important to maximize their value.
es: Aunque el método propuesto por Zhang et al. es efectivo, podría ser más eficiente al aprovechar los resultados de las pruebas de elevación. Realizar estos experimentos requiere una planificación y recursos significativos, por lo que es importante maximizar su valor.

source: To address this, we propose an alternative approach. Instead of directly reparametrizing the model in terms of ROAS, we suggest adding additional likelihood functions based on the saturation curves of the marketing channels. Saturation curves describe how the effectiveness of a marketing channel diminishes as spending increases. By calibrating the model through these curves using lift test results, we can continuously refine our estimates as more experiments are conducted. This approach allows us to make better use of the data from lift tests, leading to more accurate and reliable MMMs over time.
es: Para abordar esto, proponemos un enfoque alternativo. En lugar de reparametrizar directamente el modelo en términos de ROAS, sugerimos agregar funciones de verosimilitud adicionales basadas en las curvas de saturación de los canales de marketing. Las curvas de saturación describen cómo la efectividad de un canal de marketing disminuye a medida que aumenta el gasto. Al calibrar el modelo a través de estas curvas utilizando los resultados de las pruebas de lift, podemos refinar continuamente nuestras estimaciones a medida que se realizan más experimentos. Este enfoque nos permite hacer un mejor uso de los datos de las pruebas de lift, lo que conduce a MMMs más precisos y confiables con el tiempo.

source: Demonstrating the Approach: Results and Implementation
es: Demostrando el Enfoque: Resultados e Implementación

source: In our notebook, we replicate the results from the blog post [Media Mix Model and Experimental Calibration: A Simulation Study](https://juanitorduz.github.io/mmm_roas/) using the PyMC-Marketing framework. This framework allows us to incorporate lift tests through custom likelihood functions, providing a more nuanced calibration of the MMM. By continuously refining our estimates as new data becomes available, this approach offers a dynamic and robust solution to the challenges posed by unobserved confounders in marketing mix modeling.
es: En nuestro cuaderno, replicamos los resultados del artículo del blog [Modelo de Mezcla de Medios y Calibración Experimental: Un Estudio de Simulación](https://juanitorduz.github.io/mmm_roas/) utilizando el marco PyMC-Marketing. Este marco nos permite incorporar pruebas de aumento a través de funciones de verosimilitud personalizadas, proporcionando una calibración más matizada del MMM. Al refinar continuamente nuestras estimaciones a medida que nuevos datos se vuelven disponibles, este enfoque ofrece una solución dinámica y robusta a los desafíos planteados por los factores de confusión no observados en la modelización de la mezcla de marketing.

source: For those interested in diving deeper, we encourage you to explore a detailed description of the method in our notebook {ref}`mmm_lift_test`, where we walk through the process step by step.
es: Para aquellos interesados en profundizar, les animamos a explorar una descripción detallada del método en nuestro cuaderno {ref}`mmm_lift_test`, donde explicamos el proceso paso a paso.

source: Prepare Notebook
es: Preparar el cuaderno

source: Read Data
es: Leer Datos

source: We read the data, which is available in the `data` of our repository.
es: Leemos los datos, que están disponibles en el `data` de nuestro repositorio.

source: There are many columns in the dataset. We will explain the below. For now, that is important is for modeling purposes we will only use the `date`, `x1`, `x2` (channels)and `y` (target) columns.
es: Hay muchas columnas en el conjunto de datos. A continuación, explicaremos lo siguiente. Por ahora, lo importante es que, para fines de modelado, solo utilizaremos las columnas `date`, `x1`, `x2` (canales) y `y` (objetivo).

source: Data Generating Process
es: Proceso de Generación de Datos

source: In the original [blog post](https://juanitorduz.github.io/mmm_roas/), the authors generate the data using the following DAG.
es: En el [artículo del blog](https://juanitorduz.github.io/mmm_roas/) original, los autores generan los datos utilizando el siguiente DAG.

source: We are interested in the effect of the `x1` and `x2` channels on the `y` variable. We have additional covariates like yearly seasonality and a a non-linear trend component. In addition, there is an unobserved confounder `z` that affects both the channels and the target variable. This variable introduces a bias in the estimates if we do not account for it. However, for this problem we are going to assume that we do not have access to the `z` variable (hence, unobserved).
es: Estamos interesados en el efecto de los canales `x1` y `x2` en la variable `y`. Tenemos covariables adicionales como la estacionalidad anual y un componente de tendencia no lineal. Además, hay un confusor no observado `z` que afecta tanto a los canales como a la variable objetivo. Esta variable introduce un sesgo en las estimaciones si no la tenemos en cuenta. Sin embargo, para este problema vamos a suponer que no tenemos acceso a la variable `z` (por lo tanto, no observada).

source: In the `raw_df` we have all all the columns needed in the data generating process to obtain the target variable `y`. For example, the `x1_adstock_saturated` column is the result of applying the adstock function and then the saturation to the `x1` channel.
es: En el `raw_df` tenemos todas las columnas necesarias en el proceso de generación de datos para obtener la variable objetivo `y`. Por ejemplo, la columna `x1_adstock_saturated` es el resultado de aplicar la función de adstock y luego la saturación al canal `x1`.

source: The target variable `y` is generated as
es: La variable objetivo `y` se genera como

source: where `epsilon` is a Gaussian noise and `amplitude` is a set to $100$.
es: donde `epsilon` es un ruido gaussiano y `amplitude` se establece en $100$.

source: The variables `y01` and `y02` are the target variable `y` without the effect of the `x1` and `x2` channels, respectively. Hence
es: Las variables `y01` y `y02` son la variable objetivo `y` sin el efecto de los canales `x1` y `x2`, respectivamente. Por lo tanto

source: For details on the data generating process, please refer to the [blog post](https://juanitorduz.github.io/mmm_roas/).
es: Para obtener detalles sobre el proceso de generación de datos, consulte la [entrada del blog](https://juanitorduz.github.io/mmm_roas/).

source: From the variables `y01` and `y02` we can compute the true ROAS for the `x1` and `x2` channels for the whole period ( for simplicity we ignore the carryover effect).
es: A partir de las variables `y01` y `y02`, podemos calcular el ROAS verdadero para los canales `x1` y `x2` durante todo el período (por simplicidad, ignoramos el efecto de arrastre).

source: We would like to recover the true ROAS for the `x1` and `x2` channels using a media mix model.
es: Nos gustaría recuperar el verdadero ROAS para los canales `x1` y `x2` utilizando un modelo de mezcla de medios.

source: Before jumping into the model, let's plot channels the data to understand it better.
es: Antes de sumergirnos en el modelo, tracemos los canales de los datos para comprenderlo mejor.

source: Baseline Model
es: Modelo Base

source: To begin with, we fit a media mix model, without including the unobserved confounder `z`, using a saturated adstock and logistic saturation using PyMC-Marketing's API. For more details on the model, please refer to the {ref}`mmm_example` notebook. As we discuss in that notebook, without any lift test information, a good starting point is to pass the cost share into the prior of the beta channel coefficients.
es: Para comenzar, ajustamos un modelo de mezcla de medios, sin incluir el confusor no observado `z`, utilizando un adstock saturado y saturación logística mediante la API de PyMC-Marketing. Para más detalles sobre el modelo, consulte el cuaderno `{ref}`mmm_example`. Como discutimos en ese cuaderno, sin ninguna información de prueba de elevación, un buen punto de partida es pasar la participación de costos al prior de los coeficientes del canal beta.

source: We can specify the model configuration as follows (see the {ref}`model_configuration` notebook for more details):
es: Podemos especificar la configuración del modelo de la siguiente manera (consulte el cuaderno {ref}`model_configuration` para más detalles):

source: Observe that we are going to use a Gaussian process to model the non-linear trend component (see {ref}`mmm_tv_intercept`).
es: Observe que vamos a utilizar un proceso gaussiano para modelar el componente de tendencia no lineal (ver {ref}`mmm_tv_intercept`).

source: Let's fit the model!
es: ¡Ajustemos el modelo!

source: Let's verify that we do not have divergent transitions.
es: Verifiquemos que no tengamos transiciones divergentes.

source: Next, we look into the model components contributions:
es: A continuación, examinamos las contribuciones de los componentes del modelo:

source: The results look very similar to the results from the original blog post. In particular, note that we were able to capture the non-linear trend.
es: Los resultados son muy similares a los resultados de la publicación original del blog. En particular, observe que pudimos capturar la tendencia no lineal.

source: Next, we look into the channel contributions against the true effects (which we know from the data generating process).
es: A continuación, analizamos las contribuciones del canal en relación con los efectos reales (que conocemos a partir del proceso de generación de datos).

source: We see that the contribution for `x1` is very different from the true effect. This is because the absence of the unobserved confounder `z`. For `x2`, the contribution is very similar to the true effect.
es: Vemos que la contribución de `x1` es muy diferente del efecto verdadero. Esto se debe a la ausencia del confusor no observado `z`. Para `x2`, la contribución es muy similar al efecto verdadero.

source: Finally, we can compute the ROAS for the `x1` and `x2` channels (again, ignoring the small carryover effect).
es: Finalmente, podemos calcular el ROAS para los canales `x1` y `x2` (nuevamente, ignorando el pequeño efecto de arrastre).

source: We see that the ROAS for `x1` is very different from the true value. This is reflecting the bias induced by the unobserved confounder `z`. The models suggests that `x1` is more effective than `x2`, but we know from the data generating process that `x2` is more effective!
es: Vemos que el ROAS para `x1` es muy diferente del valor verdadero. Esto refleja el sesgo inducido por el confusor no observado `z`. Los modelos sugieren que `x1` es más efectivo que `x2`, ¡pero sabemos por el proceso de generación de datos que `x2` es más efectivo!

source: Lift Test Model
es: Modelo de Prueba de Elevación

source: Now we fit a model with some lift tests. We will use the same model configuration as before, but we free the priors of the beta channel coefficients as these are included in the saturation function parametrization. In general, we expect lift tests priors or associated custom likelihoods to be better than the cost share prior.
es: Ahora ajustamos un modelo con algunas pruebas de elevación. Usaremos la misma configuración del modelo que antes, pero liberamos los priors de los coeficientes del canal beta, ya que estos están incluidos en la parametrización de la función de saturación. En general, esperamos que los priors de las pruebas de elevación o las verosimilitudes personalizadas asociadas sean mejores que el prior de la participación en los costos.

source: Lift Tests
es: Pruebas de Elevación

source: In a lift study, one temporarily changes the budget of a channel for a fixed period of time, and then uses some method (for example [CausalPy](https://causalpy.readthedocs.io/en/stable/)) to make inference about the change in sales directly caused by the adjustment.
es: En un estudio de elevación, se cambia temporalmente el presupuesto de un canal durante un período fijo de tiempo, y luego se utiliza algún método (por ejemplo, [CausalPy](https://causalpy.readthedocs.io/en/stable/)) para inferir sobre el cambio en las ventas directamente causado por el ajuste.

source: A lift test is characterized by:
es: Una prueba de elevación se caracteriza por:

source: `channel`: the channel that was tested
es: `channel`: el canal que fue probado

source: `x`: pre-test channel spend
es: `x`: gasto del canal de pre-prueba

source: `delta_x`: change made to x
es: `delta_x`: cambio realizado en x

source: `delta_y`: inferred change in sales due to delta_x
es: `delta_y`: cambio inferido en las ventas debido a delta_x

source: `sigma`: standard deviation of delta_y
es: `sigma`: desviación estándar de delta_y

source: An experiment characterized in this way can be viewed as two points on the saturation curve for the channel.
es: Un experimento caracterizado de esta manera puede ser visto como dos puntos en la curva de saturación para el canal.

source: Next assume we have ran two lift tests for the `x1` and `x2` channels. The results table looks like this:
es: A continuación, supongamos que hemos realizado dos pruebas de elevación para los canales `x1` y `x2`. La tabla de resultados se ve así:

source: Comparison with the original blog post
es: Comparación con la publicación original del blog

source: Note that we have added the true ROAS for the `x1` and `x2` channels implicit to the `df_lift_test` table. We add them multiplying the `delta_y` as this is what we would have observed if we had run the lift test (or similar values).
es: Tenga en cuenta que hemos añadido el ROAS verdadero para los canales `x1` y `x2` implícitos en la tabla `df_lift_test`. Los añadimos multiplicando el `delta_y`, ya que esto es lo que habríamos observado si hubiéramos realizado la prueba de lift (o valores similares).
