Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_time_slice_cross_validation.po
Languages: es

source: Time-Slice-Cross-Validation and Parameter Stability
es: Validación cruzada por segmentos de tiempo y estabilidad de parámetros

source: In this notebook we will illustrate how to perform time-slice cross validation for a media mix model. This is an important step to evaluate the stability and quality of the model. We not only look into out of sample predictions but also the stability of the model parameters.
es: En este cuaderno, ilustramos cómo realizar la validación cruzada por segmentos de tiempo para un modelo de mezcla de medios. Este es un paso importante para evaluar la estabilidad y calidad del modelo. No solo analizamos las predicciones fuera de muestra, sino también la estabilidad de los parámetros del modelo.

source: Prepare Notebook
es: Preparar el cuaderno

source: Read Data
es: Leer Datos

source: We use the same data as in the example notebook {ref}`mmm_example`.
es: Utilizamos los mismos datos que en el cuaderno de ejemplo {ref}`mmm_example`.

source: Specify Time-Slice-Cross-Validation Strategy
es: Especificar la estrategia de validación cruzada por segmentos de tiempo

source: The main idea of the time-slice cross validation process is to fit the model on a time slice of the data and then evaluate it on the next time slice. We repeat this process for each time slice of the data. As we want to simulate a production-like environment where we enlarge our training data over time, we make the time-slice size grow over time.
es: La idea principal del proceso de validación cruzada por segmentos de tiempo es ajustar el modelo en un segmento de tiempo de los datos y luego evaluarlo en el siguiente segmento de tiempo. Repetimos este proceso para cada segmento de tiempo de los datos. Como queremos simular un entorno similar al de producción donde ampliamos nuestros datos de entrenamiento con el tiempo, hacemos que el tamaño del segmento de tiempo crezca con el tiempo.

source: Following the strategy of the example notebook, we use the costs share of each channel to set the prior standard deviation of the beta parameters. We need to compute this share for each training time slice independently.
es: Siguiendo la estrategia del cuaderno de ejemplo, utilizamos la participación de costos de cada canal para establecer la desviación estándar previa de los parámetros beta. Necesitamos calcular esta participación para cada intervalo de tiempo de entrenamiento de manera independiente.

source: Data Leakage
es: Filtración de datos

source: It is very important to avoid data leakage when performing time-slice cross validation. This means that the model should not see any training data from the future. This also includes any data pre-processing steps!
es: Es muy importante evitar la filtración de datos al realizar la validación cruzada por segmentos de tiempo. Esto significa que el modelo no debe ver ningún dato de entrenamiento del futuro. ¡Esto también incluye cualquier paso de preprocesamiento de datos!

source: For example, as mentioned above, we need to compute the costs share for each training time slice independently if we want to avoid data leakage. Other sources of data leakage include using a global feature for thr trend component. In our case, we simply use an increasing variable `t` so we are safe as we just increase it by one for each time slice.
es: Por ejemplo, como se mencionó anteriormente, necesitamos calcular la participación de costos para cada intervalo de tiempo de entrenamiento de manera independiente si queremos evitar la filtración de datos. Otras fuentes de filtración de datos incluyen el uso de una característica global para el componente de tendencia. En nuestro caso, simplemente utilizamos una variable creciente `t`, por lo que estamos a salvo, ya que solo la incrementamos en uno para cada intervalo de tiempo.

source: We wrap the main steps of the training procedure in a set of functions.
es: Envolvemos los pasos principales del procedimiento de entrenamiento en un conjunto de funciones.

source: For the sake of convenience, we define a data container to store the results of the time-slice cross validation step.
es: Para mayor comodidad, definimos un contenedor de datos para almacenar los resultados del paso de validación cruzada por intervalos de tiempo.

source: Finally, we define the main function that performs the time-slice cross validation step by calling the functions defined above.
es: Finalmente, definimos la función principal que realiza el paso de validación cruzada por segmentos de tiempo al llamar a las funciones definidas anteriormente.

source: We are now ready to run the time-slice cross validation loop 💪!
es: ¡Ahora estamos listos para ejecutar el bucle de validación cruzada por segmentos de tiempo 💪!

source: Run Time-Slice-Cross-Validation Loop
es: Ejecutar el bucle de validación cruzada de tiempo de segmento

source: Depending on the business requirements, we need to decide the initial number of observations to use for fitting the model (`n_init`) and the forecast horizon (`forecast_horizon`). For this example, we use the first 158 observations to fit the model and then predict the next 12 observations (3 months).
es: Dependiendo de los requisitos del negocio, necesitamos decidir el número inicial de observaciones a utilizar para ajustar el modelo (`n_init`) y el horizonte de pronóstico (`forecast_horizon`). Para este ejemplo, utilizamos las primeras 158 observaciones para ajustar el modelo y luego predecimos las siguientes 12 observaciones (3 meses).

source: Let's run it!
es: ¡Ejecutémoslo!

source: Model Diagnostics
es: Diagnósticos del Modelo

source: First, we evaluate whether we have any divergences in the model (we can extend the analysis more more model diagnostics).
es: Primero, evaluamos si tenemos alguna divergencia en el modelo (podemos extender el análisis con más diagnósticos del modelo).

source: We have no divergences in the model 😃!
es: No tenemos divergencias en el modelo 😃!

source: Evaluate Parameter Stability
es: Evaluar la Estabilidad del Parámetro

source: Next, we look at the stability of the model parameters. For a good model, these should not change abruptly over time.
es: A continuación, examinamos la estabilidad de los parámetros del modelo. Para un buen modelo, estos no deberían cambiar de manera abrupta a lo largo del tiempo.

source: Saturation Beta
es: Saturación Beta

source: Saturation Lambda
es: Saturación Lambda

source: The parameters seem to be stable over time. This implies that the estimates ROAS will not change abruptly over time.
es: Los parámetros parecen ser estables a lo largo del tiempo. Esto implica que las estimaciones de ROAS no cambiarán abruptamente con el tiempo.

source: Evaluate Out of Sample Predictions
es: Evaluar Predicciones Fuera de Muestra

source: Finally, we evaluate the out of sample predictions. To begin with, we can simply plot the posterior predictive distributions for each iteration for both the training and test data.
es: Finalmente, evaluamos las predicciones fuera de muestra. Para comenzar, podemos simplemente trazar las distribuciones predictivas posteriores para cada iteración tanto para los datos de entrenamiento como para los datos de prueba.

source: Overall, the out of sample predictions look very good 🚀!
es: En general, las predicciones fuera de muestra se ven muy bien 🚀!

source: We can quantify the model performance using the Continuous Ranked Probability Score (CRPS).
es: Podemos cuantificar el rendimiento del modelo utilizando la Puntuación de Probabilidad Continua Clasificada (CRPS).

source: *“The CRPS — Continuous Ranked Probability Score — is a score function that compares a single ground truth value to a Cumulative Distribution Function. It can be used as a metric to evaluate a model’s performance when the target variable is continuous and the model predicts the target’s distribution; Examples include Bayesian Regression or Bayesian Time Series models.”*
es: El CRPS — Puntaje de Probabilidad Clasificada Continua — es una función de puntuación que compara un único valor de verdad fundamental con una Función de Distribución Acumulativa. Puede utilizarse como una métrica para evaluar el rendimiento de un modelo cuando la variable objetivo es continua y el modelo predice la distribución del objetivo; ejemplos incluyen la Regresión Bayesiana o modelos de Series Temporales Bayesianos.

source: For a nice explanation of the CRPS, check out this [blog post](https://towardsdatascience.com/crps-a-scoring-function-for-bayesian-machine-learning-models-dd55a7a337a8).
es: Para una buena explicación del CRPS, consulte esta [entrada de blog](https://towardsdatascience.com/crps-a-scoring-function-for-bayesian-machine-learning-models-dd55a7a337a8).

source: In PyMC-Marketing, we provide the function {func}`crps <pymc_marketing.metrics.crps>` to compute this metric. We can use it to compute the CRPS score for each iteration.
es: En PyMC-Marketing, proporcionamos la función `{func}`crps <pymc_marketing.metrics.crps>` para calcular esta métrica. Podemos utilizarla para calcular la puntuación CRPS para cada iteración.

source: Event though the visual results look great, we see that the CRPS mildly decreases for the training data while it increases for the test data as we increase the size of the training data. This is a sign that we are overfitting the model to the training data. Some strategies to overcome this issue include using regularization techniques and re-evaluate the model specification. This should be an iterative process.
es: A pesar de que los resultados visuales son excelentes, observamos que el CRPS disminuye levemente para los datos de entrenamiento mientras que aumenta para los datos de prueba a medida que incrementamos el tamaño de los datos de entrenamiento. Esto es un indicio de que estamos sobreajustando el modelo a los datos de entrenamiento. Algunas estrategias para superar este problema incluyen el uso de técnicas de regularización y la reevaluación de la especificación del modelo. Este debería ser un proceso iterativo.
