Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_budget_allocation_example.po
Languages: es

source: This makes everything clear, even adding the double of budget we can't move our total response significantly. **Of course, we are maximizing the response, but at what cost?** Let's take a look to the number of units back per unit spend, similar to ROAS.
es: Esto deja todo claro, incluso añadiendo el doble del presupuesto no podemos mover nuestra respuesta total de manera significativa. **Por supuesto, estamos maximizando la respuesta, pero ¿a qué costo?** Echemos un vistazo al número de unidades devueltas por unidad gastada, similar al ROAS.

source: As expected, bigger the budget lower the returns. This happens because the response stays similar but the budget increases faster (Yes, the diminishing return effect). We can ask a different question, if we want to get 145,000, then what is the cheaper way to make it?
es: Como era de esperar, cuanto mayor es el presupuesto, menores son los retornos. Esto sucede porque la respuesta se mantiene similar, pero el presupuesto aumenta más rápido (Sí, el efecto de rendimientos decrecientes). Podemos plantear una pregunta diferente: si queremos obtener 145,000, ¿cuál es la forma más económica de lograrlo?

source: Optimizing towards a target
es: Optimizando hacia un objetivo

source: Another way to approach optimization is to adjust towards a target response. This can be useful if you want to ensure that the response is above a certain level. Instead of optimizing a given budget, we can optimize to find the right budget to reach a target response.
es: Otra forma de abordar la optimización es ajustar hacia una respuesta objetivo. Esto puede ser útil si desea asegurarse de que la respuesta esté por encima de un cierto nivel. En lugar de optimizar un presupuesto dado, podemos optimizar para encontrar el presupuesto adecuado para alcanzar una respuesta objetivo.

source: The following example shows how to create a custom constraint to minimize the budget to reach a target response. In short words, we are asking the optimizer, what is the minimum budget to reach a certain response?
es: El siguiente ejemplo muestra cómo crear una restricción personalizada para minimizar el presupuesto necesario para alcanzar una respuesta objetivo. En pocas palabras, le estamos preguntando al optimizador, ¿cuál es el presupuesto mínimo para alcanzar una cierta respuesta?

source: Great! Looks like using 5K euros, we could get a response even bigger than the initial optimization. Considering that the spend it's slightly more in order to get this amount of response, ROAS should be good. Let's take a look!
es: ¡Genial! Parece que utilizando 5K euros, podríamos obtener una respuesta incluso mayor que la optimización inicial. Considerando que el gasto es ligeramente mayor para obtener esta cantidad de respuesta, el ROAS debería ser bueno. ¡Echemos un vistazo!

source: The new result is much clearer. By using a bit more budget, we could achieve the more outcomes as our initial setup, in a more profitable way. On the other hand, the optimal allocation distributes the budget in levels similar by the model, not increasing the uncertainty around the estimated impact, at least not as much as going up a 2X more on budget.
es: El nuevo resultado es mucho más claro. Al utilizar un poco más de presupuesto, podríamos lograr más resultados que en nuestra configuración inicial, de una manera más rentable. Por otro lado, la asignación óptima distribuye el presupuesto en niveles similares al modelo, sin aumentar la incertidumbre en torno al impacto estimado, al menos no tanto como al aumentar el presupuesto en un 2X.

source: Please note that the estimate provided assumes consistent spending each week. However, in the field of marketing, even with a fixed spending level, the actual spending can fluctuate based on factors such as the number of people bidding on your ad or viewing ads on a given day.
es: Tenga en cuenta que la estimación proporcionada asume un gasto constante cada semana. Sin embargo, en el ámbito del marketing, incluso con un nivel de gasto fijo, el gasto real puede fluctuar en función de factores como el número de personas que pujan por su anuncio o que ven anuncios en un día determinado.

source: To account for this unpredictable variation, we have included a parameter called `noise_level` that allows you to introduce white noise into the projection. This can provide a sense of what the outcome might look like if the recommended budget could potentially fluctuate by a certain extent. The default value for `noise_level` is 1%, but you can adjust it as needed. In the example below, we have used a value of 10%.
es: Para tener en cuenta esta variación impredecible, hemos incluido un parámetro llamado `noise_level` que le permite introducir ruido blanco en la proyección. Esto puede proporcionar una idea de cómo podría ser el resultado si el presupuesto recomendado pudiera fluctuar en cierta medida. El valor predeterminado para `noise_level` es 1%, pero puede ajustarlo según sea necesario. En el ejemplo a continuación, hemos utilizado un valor del 10%.

source: Take a look to signature below!
es: ¡Eche un vistazo a la firma a continuación!

source: If you don't want to assume a evenly distributed allocation given, you can use a custom pattern. Providing the optimizer a way around how to spend the money over time. The parameter it's call `budget_distribution_over_period` and you can read about it in the following signature.
es: Si no desea asumir una asignación distribuida de manera uniforme, puede utilizar un patrón personalizado. Proporcionando al optimizador una forma de cómo gastar el dinero a lo largo del tiempo. El parámetro se llama `budget_distribution_over_period` y puede leer sobre él en la siguiente firma.

source: Note: When using a custom budget distribution over time, ensure that the values for each channel and geo sum to 1 across the time dimension. This is demonstrated in the example above where we create decreasing values that are normalized to sum to 1.
es: Nota: Al utilizar una distribución de presupuesto personalizada a lo largo del tiempo, asegúrese de que los valores para cada canal y geo sumen 1 en la dimensión temporal. Esto se demuestra en el ejemplo anterior donde creamos valores decrecientes que se normalizan para sumar 1.

source: We can pass this new parameter in the optimizable model.
es: Podemos pasar este nuevo parámetro en el modelo optimizable.

source: You can visualize the pattern for your variables access to the response sample!
es: ¡Puede visualizar el patrón para el acceso a sus variables en la muestra de respuesta!

source: And giving that pattern, you'll see some response!
es: Y al dar ese patrón, ¡verás alguna respuesta!

source: As expected, now the spend follows a specific pattern of spend, and the optimization process considers this as well. This change, can affect quite radically the total response, adding more or less complexity to your optimization challenges.
es: Como era de esperar, ahora el gasto sigue un patrón específico de gasto, y el proceso de optimización también lo considera. Este cambio puede afectar de manera bastante radical la respuesta total, añadiendo más o menos complejidad a sus desafíos de optimización.

source: Other methods to explore
es: Otros métodos para explorar

source: The current optimization use the full posterior, and it can be use for more than minimize or maximize, can consider all information to perfom risk assesments, you can take a read to [Risk Allocation for Media Mix Models](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_allocation_assessment.html). At the same time, it could be a powerful and interesting solution as it's described on the following blog ["Using bayesian decision making to optimize supply chains"](https://twiecki.io/blog/2019/01/14/supply_chain/)
es: La optimización actual utiliza el posterior completo, y se puede usar para más que solo minimizar o maximizar; puede considerar toda la información para realizar evaluaciones de riesgo. Puede consultar [Asignación de Riesgo para Modelos de Mezcla de Medios](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_allocation_assessment.html). Al mismo tiempo, podría ser una solución poderosa e interesante, como se describe en el siguiente blog ["Uso de la toma de decisiones bayesianas para optimizar cadenas de suministro"](https://twiecki.io/blog/2019/01/14/supply_chain/).

source: The current methodology is similar to the ones used on other libraries as [Robyn from Meta](https://facebookexperimental.github.io/Robyn/docs/features/#budget-allocation) and Google [Lightweight from Google](https://github.com/google/lightweight_mmm). You can explore the solutions and compare if needed.
es: La metodología actual es similar a las utilizadas en otras bibliotecas como [Robyn de Meta](https://facebookexperimental.github.io/Robyn/docs/features/#budget-allocation) y [Lightweight de Google](https://github.com/google/lightweight_mmm). Puede explorar las soluciones y comparar si es necesario.

source: Conclusion
es: Conclusión

source: MMM models and methodologies used here are designed to bridge the gap between theoretical rigor and actionable marketing insights. They represent a significant stride towards a more data-driven, analytical approach to marketing budget allocation, which could change how organizations invest in customer acquisition and retention.
es: Los modelos y metodologías MMM utilizados aquí están diseñados para cerrar la brecha entre el rigor teórico y los conocimientos de marketing aplicables. Representan un avance significativo hacia un enfoque más basado en datos y analítico para la asignación del presupuesto de marketing, lo que podría cambiar la forma en que las organizaciones invierten en la adquisición y retención de clientes.

source: Consequently, your engagements, feedback, and thoughts are not merely welcomed but actively solicited to make this tool as practical and universally applicable as possible.
es: En consecuencia, sus compromisos, comentarios y pensamientos no solo son bienvenidos, sino que se solicitan activamente para hacer que esta herramienta sea lo más práctica y universalmente aplicable posible.
