Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_reasoning_and_discovery.po
Languages: es

source: Now that we have our synthetic dataset and its underlying causal structure, let’s see how easily we can recover it using the `TBFPC` algorithm. The class is designed to be simple and intuitive — you just specify the **target variable** (in our case, `purchase`) and the **candidate drivers**. Behind the scenes, the algorithm tests conditional independences using Bayes factors and builds a graph that represents the most plausible causal skeleton consistent with the data.
es: { "singular": "Ahora que tenemos nuestro conjunto de datos sintético y su estructura causal subyacente, veamos qué tan fácilmente podemos recuperarlo utilizando el algoritmo `TBFPC`. La clase está diseñada para ser simple e intuitiva: solo debe especificar la **variable objetivo** (en nuestro caso, `purchase`) y los **factores candidatos**. Detrás de escena, el algoritmo prueba independencias condicionales utilizando factores de Bayes y construye un gráfico que representa el esqueleto causal más plausible consistente con los datos.", "plural": "Ahora que tenemos nuestros conjuntos de datos sintéticos y sus estructuras causales subyacentes, veamos qué tan fácilmente podemos recuperarlos utilizando el algoritmo `TBFPC`. Las clases están diseñadas para ser simples e intuitivas: solo deben especificar las **variables objetivo** (en nuestro caso, `purchase`) y los **factores candidatos**. Detrás de escena, el algoritmo prueba independencias condicionales utilizando factores de Bayes y construye gráficos que representan los esqueletos causales más plausibles consistentes con los datos." }

source: Under the hood, `TBFPC` begins with a **fully connected graph** between all candidate variables and the target. It then performs a systematic **search for conditional independences**, starting from unconditioned tests (no control variables) and gradually conditioning on larger subsets of other variables. Whenever it finds that two variables are independent given some conditioning set, it **removes the edge** connecting them — this step progressively prunes the skeleton. The process continues until no more edges can be removed under the chosen significance rule.
es: { "singular": "Bajo el capó, `TBFPC` comienza con un **grafo completamente conectado** entre todas las variables candidatas y el objetivo. Luego realiza una **búsqueda sistemática de independencias condicionales**, comenzando desde pruebas no condicionadas (sin variables de control) y condicionando gradualmente sobre subconjuntos más grandes de otras variables. Siempre que encuentra que dos variables son independientes dado un conjunto de condicionamiento, **elimina la arista** que las conecta; este paso poda progresivamente el esqueleto. El proceso continúa hasta que no se pueden eliminar más aristas bajo la regla de significancia elegida.", "plural": "Bajo el capó, `TBFPC` comienza con **grafos completamente conectados** entre todas las variables candidatas y los objetivos. Luego realizan una **búsqueda sistemática de independencias condicionales**, comenzando desde pruebas no condicionadas (sin variables de control) y condicionando gradualmente sobre subconjuntos más grandes de otras variables. Siempre que encuentran que dos variables son independientes dado un conjunto de condicionamiento, **eliminan la arista** que las conecta; este paso poda progresivamente los esqueletos. El proceso continúa hasta que no se pueden eliminar más aristas bajo la regla de significancia elegida." }

source: Each remaining connection represents a dependency that cannot be “explained away” by conditioning on other variables. Directed edges (especially toward the target) are oriented according to the **target-edge rule** you specify, ensuring that the search favors interpretable *driver → target* relationships while respecting any **forbidden** or **required** edges you might impose. The output of this procedure is a **causal graph** — specifically, a **Causal Directed Acyclic Graph (Causal DAG)** or, more precisely, a **Completed Partially Directed Acyclic Graph (CPDAG)**.
es: { "singular": "Cada conexión restante representa una dependencia que no puede ser \"explicada\" condicionando sobre otras variables. Los bordes dirigidos (especialmente hacia el objetivo) están orientados de acuerdo con la **regla de borde objetivo** que especifique, asegurando que la búsqueda favorezca relaciones interpretables de *driver → target* mientras respeta cualquier borde **prohibido** o **requerido** que pueda imponer. La salida de este procedimiento es un **grafo causal** — específicamente, un **Grafo Dirigido Acíclico Causal (Causal DAG)** o, más precisamente, un **Grafo Acíclico Dirigido Parcialmente Completado (CPDAG)**.", "plural": "Cada conexión restante representa una dependencia que no puede ser \"explicada\" condicionando sobre otras variables. Los bordes dirigidos (especialmente hacia los objetivos) están orientados de acuerdo con la **regla de borde objetivo** que especifique, asegurando que la búsqueda favorezca relaciones interpretables de *driver → target* mientras respeta cualquier borde **prohibido** o **requerido** que pueda imponer. La salida de este procedimiento es un **grafo causal** — específicamente, un **Grafo Dirigido Acíclico Causal (Causal DAG)** o, más precisamente, un **Grafo Acíclico Dirigido Parcialmente Completado (CPDAG)**." }

source: What's the difference between a CPDAG and CDAG?
es: { "singular": "¿Cuál es la diferencia entre un CPDAG y un CDAG?", "plural": "¿Cuáles son las diferencias entre un CPDAG y un CDAG?" }

source: A **Causal DAG** represents a single, fully oriented data-generating structure where every edge has a direction (e.g., `media_activities → brand_search → purchase`). It encodes a complete causal story.
es: { "singular": "Un **DAG Causal** representa una única estructura generadora de datos completamente orientada donde cada arista tiene una dirección (por ejemplo, `media_activities → brand_search → purchase`). Codifica una historia causal completa.", "plural": "Unos **DAG Causales** representan unas únicas estructuras generadoras de datos completamente orientadas donde cada arista tiene una dirección (por ejemplo, `media_activities → brand_search → purchase`). Codifican unas historias causales completas." }

source: A **CPDAG**, on the other hand, represents a **Markov equivalence class**: all the DAGs that are statistically indistinguishable from one another given the observed data. It contains both directed and undirected edges — the directed ones are those we can infer confidently from data and logic, while the undirected ones remain ambiguous (they could point either way without contradicting observed independences).
es: { "singular": "Un **CPDAG**, por otro lado, representa una **clase de equivalencia de Markov**: todos los DAG que son estadísticamente indistinguibles entre sí dado los datos observados. Contiene tanto aristas dirigidas como no dirigidas: las dirigidas son aquellas que podemos inferir con confianza a partir de los datos y la lógica, mientras que las no dirigidas permanecen ambiguas (podrían apuntar en cualquier dirección sin contradecir las independencias observadas).", "plural": "" }

source: With `TBFPC`, obtaining this structure takes only a few lines of code. The algorithm will return the learned graph in **DOT format** (compatible with Graphviz) and you can visualize it or inspect the directed and undirected edges directly. Below we fit the model and print its discovered structure.
es: { "singular": "Con `TBFPC`, obtener esta estructura requiere solo unas pocas líneas de código. El algoritmo devolverá el grafo aprendido en **formato DOT** (compatible con Graphviz) y puedes visualizarlo o inspeccionar los bordes dirigidos y no dirigidos directamente. A continuación, ajustamos el modelo e imprimimos su estructura descubierta.", "plural": "Con `TBFPC`, obtener estas estructuras requiere solo unas pocas líneas de código. El algoritmo devolverá los grafos aprendidos en **formato DOT** (compatible con Graphviz) y puedes visualizarlos o inspeccionar los bordes dirigidos y no dirigidos directamente. A continuación, ajustamos los modelos e imprimimos sus estructuras descubiertas." }

source: See how it works!
es: { "singular": "¡Vea cómo funciona!", "plural": "¡Vean cómo funciona!" }

source: The output above shows the **learned causal graph** in Graphviz DOT format. Each line represents a node or an edge, and the syntax captures both **directed** and **undirected** relationships.
es: { "singular": "La salida anterior muestra el **grafo causal aprendido** en formato DOT de Graphviz. Cada línea representa un nodo o un borde, y la sintaxis captura tanto relaciones **dirigidas** como **no dirigidas**.", "plural": "Las salidas anteriores muestran los **grafas causales aprendidos** en formato DOT de Graphviz. Cada línea representa nodos o bordes, y la sintaxis captura tanto relaciones **dirigidas** como **no dirigidas**." }

source: Directed arrows such as `"brand_search" -> "purchase";` or `"media_activities" -> "purchase";` represent **oriented edges** — causal directions that the algorithm can infer with sufficient confidence based on conditional independence tests. In this case, both `brand_search` and `media_activities` are estimated as **direct causes** of `purchase`, which aligns with the true underlying DAG we simulated earlier.
es: { "singular": "Las flechas dirigidas como \"brand_search\" -> \"purchase\"; o \"media_activities\" -> \"purchase\"; representan **bordes orientados** — direcciones causales que el algoritmo puede inferir con suficiente confianza basándose en pruebas de independencia condicional. En este caso, tanto `brand_search` como `media_activities` se estiman como **causas directas** de `purchase`, lo que se alinea con el verdadero DAG subyacente que simulamos anteriormente.", "plural": "Las flechas dirigidas como \"brand_search\" -> \"purchase\"; o \"media_activities\" -> \"purchase\"; representan **bordes orientados** — direcciones causales que el algoritmo puede inferir con suficiente confianza basándose en pruebas de independencia condicional. En este caso, tanto `brand_search` como `media_activities` se estiman como **causas directas** de `purchase`, lo que se alinea con el verdadero DAG subyacente que simulamos anteriormente." }

source: The dashed, undirected edges such as `"brand_search" -> "generic_search" [style=dashed, dir=none]` represent **ambiguous relationships** — connections that remain *undirected* in the **CPDAG**. The tag `[style=dashed, dir=none]` encodes this explicitly:
es: { "singular": "Los bordes discontinuos y no dirigidos, como \"brand_search\" -> \"generic_search\" [style=dashed, dir=none], representan **relaciones ambiguas** — conexiones que permanecen *no dirigidas* en el **CPDAG**. La etiqueta [style=dashed, dir=none] codifica esto explícitamente:", "plural": "Los bordes discontinuos y no dirigidos, como \"brand_search\" -> \"generic_search\" [style=dashed, dir=none], representan **relaciones ambiguas** — conexiones que permanecen *no dirigidas* en el **CPDAG**. La etiqueta [style=dashed, dir=none] codifica esto explícitamente:" }

source: `style=dashed` visually marks the edge as *non-oriented*.
es: { "singular": { "msgid": "`style=dashed` visually marks the edge as *non-oriented*.", "msgstr": "`style=dashed` marca visualmente el borde como *no orientado*." }, "plural": { "msgid": "`style=dashed` visually marks the edge as *non-oriented*.", "msgstr": "`style=dashed` marca visualmente los bordes como *no orientados*." } }

source: `dir=none` tells Graphviz to draw the edge **without an arrowhead**.
es: { "singular": "`dir=none` indica a Graphviz que dibuje el borde **sin una punta de flecha**.", "plural": "`dir=none` indica a Graphviz que dibuje los bordes **sin una punta de flecha**." }

source: Mathematically, this ambiguity means that both possible directions (e.g., `brand_search → generic_search` and `generic_search → brand_search`) are **Markov equivalent** — they induce the same set of conditional independences in the data. In the language of causal graphs, two DAGs are Markov equivalent if they encode the same **d-separation** relations; that is, for every triplet of variables $(X, Y, Z)$,
es: { "singular": "Matemáticamente, esta ambigüedad significa que ambas direcciones posibles (por ejemplo, `brand_search → generic_search` y `generic_search → brand_search`) son **equivalentes de Markov** — inducen el mismo conjunto de independencias condicionales en los datos. En el lenguaje de los gráficos causales, dos DAGs son equivalentes de Markov si codifican las mismas relaciones de **d-separación**; es decir, para cada tripleta de variables $(X, Y, Z)$,", "plural": "Matemáticamente, estas ambigüedades significan que ambas direcciones posibles (por ejemplo, `brand_search → generic_search` y `generic_search → brand_search`) son **equivalentes de Markov** — inducen el mismo conjunto de independencias condicionales en los datos. En el lenguaje de los gráficos causales, dos DAGs son equivalentes de Markov si codifican las mismas relaciones de **d-separación**; es decir, para cada tripleta de variables $(X, Y, Z)$," }

source: X \perp Y \mid Z \quad \text{in DAG}_1 \iff X \perp Y \mid Z \quad \text{in DAG}_2.
es: { "singular": "X \\perp Y \\mid Z \\quad \\text{in DAG}_1 \\iff X \\perp Y \\mid Z \\quad \\text{in DAG}_2.", "plural": "X \\perp Y \\mid Z \\quad \\text{in DAG}_1 \\iff X \\perp Y \\mid Z \\quad \\text{in DAG}_2." }

source: Thus, both orientations would fit the observed independence structure equally well. Without additional assumptions or experimental data, the algorithm cannot determine which direction is correct, so it preserves them as dashed undirected links.
es: { "singular": "Por lo tanto, ambas orientaciones se ajustarían igualmente bien a la estructura de independencia observada. Sin suposiciones adicionales o datos experimentales, el algoritmo no puede determinar cuál dirección es correcta, por lo que las preserva como enlaces no dirigidos discontinuos.", "plural": "Por lo tanto, ambas orientaciones se ajustarían igualmente bien a la estructura de independencia observada. Sin suposiciones adicionales o datos experimentales, el algoritmo no puede determinar cuál dirección es correcta, por lo que las preserva como enlaces no dirigidos discontinuos." }

source: These dashed connections therefore represent the **remaining uncertainty** after conditioning on all other variables up to a given subset size (controlled by `max_k` inside the algorithm). The Bayes factor test behind `TBFPC` compares two competing models for each independence query:
es: { "singular": "Estas conexiones discontinuas representan, por lo tanto, la **incertidumbre restante** después de condicionar sobre todas las demás variables hasta un tamaño de subconjunto dado (controlado por `max_k` dentro del algoritmo). La prueba del factor de Bayes detrás de `TBFPC` compara dos modelos en competencia para cada consulta de independencia:", "plural": "Estas conexiones discontinuas representan, por lo tanto, la **incertidumbre restante** después de condicionar sobre todas las demás variables hasta un tamaño de subconjunto dado (controlado por `max_k` dentro del algoritmo). La prueba del factor de Bayes detrás de `TBFPC` compara dos modelos en competencia para cada consulta de independencia:" }

source: M_0 : Y \sim S, \qquad M_1 : Y \sim S + X,
es: { "singular": "M_0 : Y \sim S, \qquad M_1 : Y \sim S + X,", "plural": "M_0 : Y \sim S, \qquad M_1 : Y \sim S + X," }

source: and declares independence if
es: { "singular": "y declara independencia si", "plural": "y declaran independencia si" }

source: \log \mathrm{BF}_{10} = -\tfrac{1}{2}\,[\mathrm{BIC}(M_1)-\mathrm{BIC}(M_0)] < \tau,
es: { "singular": "\log \mathrm{BF}_{10} = -\tfrac{1}{2}\,[\mathrm{BIC}(M_1)-\mathrm{BIC}(M_0)] < \tau,", "plural": "\log \mathrm{BF}_{10} = -\tfrac{1}{2}\,[\mathrm{BIC}(M_1)-\mathrm{BIC}(M_0)] < \tau," }

source: where $\tau$ is the chosen Bayes factor threshold. If this inequality holds symmetrically across conditioning sets (i.e., neither direction provides stronger evidence of dependence), the edge remains *ambiguous* — hence, dashed.
es: { "singular": "donde $\tau$ es el umbral del factor de Bayes elegido. Si esta desigualdad se mantiene simétricamente a través de los conjuntos de condicionamiento (es decir, ninguna dirección proporciona una evidencia más fuerte de dependencia), el borde permanece *ambiguo* — por lo tanto, discontinuo.", "plural": "donde $\tau$ son los umbrales de los factores de Bayes elegidos. Si estas desigualdades se mantienen simétricamente a través de los conjuntos de condicionamiento (es decir, ninguna dirección proporciona evidencias más fuertes de dependencia), los bordes permanecen *ambiguos* — por lo tanto, discontinuos." }

source: In other words, dashed edges mean the data support a dependency between variables, but **not enough directional evidence** exists to resolve the arrow. These are precisely the boundaries of the **Markov equivalence class**, and exploring or constraining them (through prior knowledge or further experiments) is the next step toward a uniquely oriented causal DAG.
es: { "singular": "En otras palabras, los bordes discontinuos significan que los datos apoyan una dependencia entre variables, pero **no existe suficiente evidencia direccional** para resolver la flecha. Estos son precisamente los límites de la **clase de equivalencia de Markov**, y explorar o restringirlos (a través del conocimiento previo o experimentos adicionales) es el siguiente paso hacia un DAG causal orientado de manera única.", "plural": "En otras palabras, los bordes discontinuos significan que los datos apoyan una dependencia entre variables, pero **no existe suficiente evidencia direccional** para resolver la flecha. Estos son precisamente los límites de la **clase de equivalencia de Markov**, y explorar o restringirlos (a través del conocimiento previo o experimentos adicionales) es el siguiente paso hacia un DAG causal orientado de manera única." }

source: Let's put this in `Graphviz` to visualize better!
es: { "singular": "¡Pongamos esto en `Graphviz` para visualizarlo mejor!", "plural": "¡Pongamos esto en `Graphviz` para visualizarlo mejor!" }

source: A hard truth in causal discovery is that **the data rarely identify a single “true” DAG**. Many different graphs can encode the **same** set of conditional independences and thus fit the observed evidence equally well. These graphs form a **Markov equivalence class (MEC)** and are summarized by the CPDAG you saw above: solid arrows for orientations we can justify, and dashed links for edges that could point either way without contradicting the tests. In practice, the size of the MEC grows **exponentially** with the number of undirected edges, which is why pinning down *the* DAG from observational data alone is notoriously difficult.
es: { "singular": { "msgid": "A hard truth in causal discovery is that **the data rarely identify a single “true” DAG**. Many different graphs can encode the **same** set of conditional independences and thus fit the observed evidence equally well. These graphs form a **Markov equivalence class (MEC)** and are summarized by the CPDAG you saw above: solid arrows for orientations we can justify, and dashed links for edges that could point either way without contradicting the tests. In practice, the size of the MEC grows **exponentially** with the number of undirected edges, which is why pinning down *the* DAG from observational data alone is notoriously difficult.", "msgstr": "Una dura verdad en el descubrimiento causal es que **los datos rara vez identifican un único “verdadero” DAG**. Muchos gráficos diferentes pueden codificar el **mismo** conjunto de independencias condicionales y, por lo tanto, ajustarse a la evidencia observada igualmente bien. Estos gráficos forman una **clase de equivalencia de Markov (MEC)** y se resumen por el CPDAG que viste arriba: flechas sólidas para orientaciones que podemos justificar, y enlaces discontinuos para bordes que podrían apuntar en cualquier dirección sin contradecir las pruebas. En la práctica, el tamaño de la MEC crece **exponencialmente** con el número de bordes no dirigidos, razón por la cual determinar *el* DAG a partir de datos observacionales por sí solo es notoriamente difícil." }, "plural": { "msgid": "A hard truth in causal discovery is that **the data rarely identify a single “true” DAG**. Many different graphs can encode the **same** set of conditional independences and thus fit the observed evidence equally well. These graphs form a **Markov equivalence class (MEC)** and are summarized by the CPDAG you saw above: solid arrows for orientations we can justify, and dashed links for edges that could point either way without contradicting the tests. In practice, the size of the MEC grows **exponentially** with the number of undirected edges, which is why pinning down *the* DAG from observational data alone is notoriously difficult.", "msgstr": "Una dura verdad en el descubrimiento causal es que **los datos rara vez identifican un único “verdadero” DAG**. Muchos gráficos diferentes pueden codificar el **mismo** conjunto de independencias condicionales y, por lo tanto, ajustarse a la evidencia observada igualmente bien. Estos gráficos forman una **clase de equivalencia de Markov (MEC)** y se resumen por el CPDAG que viste arriba: flechas sólidas para orientaciones que podemos justificar, y enlaces discontinuos para bordes que podrían apuntar en cualquier dirección sin contradecir las pruebas. En la práctica, el tamaño de la MEC crece **exponencialmente** con el número de bordes no dirigidos, razón por la cual determinar *el* DAG a partir de datos observacionales por sí solo es notoriamente difícil." } }

source: Still, understanding the MEC is often **enough** for principled decisions. Every DAG in the MEC shares the same d-separation relations (the same testable independences), so they agree on which controls block backdoors and which variables are downstream effects. That means you can design valid adjustment sets, stress-test causal stories, and decide where an experiment or instrument would be most informative — all **without** committing to a single orientation.
es: { "singular": "Aún así, entender el MEC es a menudo **suficiente** para decisiones fundamentadas. Cada DAG en el MEC comparte las mismas relaciones de d-separación (las mismas independencias comprobables), por lo que están de acuerdo en qué controles bloquean puertas traseras y qué variables son efectos descendentes. Eso significa que puedes diseñar conjuntos de ajuste válidos, poner a prueba historias causales y decidir dónde un experimento o instrumento sería más informativo — todo **sin** comprometerse a una sola orientación.", "plural": "Aún así, entender los MEC es a menudo **suficiente** para decisiones fundamentadas. Cada DAG en los MEC comparte las mismas relaciones de d-separación (las mismas independencias comprobables), por lo que están de acuerdo en qué controles bloquean puertas traseras y qué variables son efectos descendentes. Eso significa que puedes diseñar conjuntos de ajuste válidos, poner a prueba historias causales y decidir dónde un experimento o instrumento sería más informativo — todo **sin** comprometerse a una sola orientación." }
