Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_reasoning_and_discovery.po
Languages: es

source: **How consistent is this with the true DAG?** It’s closer on the *target side* (we retain the true causes `brand_search` and `media_activities` of `purchase`) but still *under-oriented upstream*. The true structure favors directions such as `exogenous → generic_search`, `generic_search → media_activities`, and paths into `brand_search` (`generic_search → brand_search`, `media_activities → brand_search`).
es: { "singular": "**¿Qué tan consistente es esto con el verdadero DAG?** Está más cerca del *lado objetivo* (retendremos las verdaderas causas `brand_search` y `media_activities` de `purchase`), pero aún está *suborientado hacia arriba*. La verdadera estructura favorece direcciones como `exogenous → generic_search`, `generic_search → media_activities`, y caminos hacia `brand_search` (`generic_search → brand_search`, `media_activities → brand_search`).", "plural": "**¿Qué tan consistentes son esto con los verdaderos DAG?** Están más cerca del *lado objetivo* (retendremos las verdaderas causas `brand_search` y `media_activities` de `purchase`), pero aún están *suborientados hacia arriba*. La verdadera estructura favorece direcciones como `exogenous → generic_search`, `generic_search → media_activities`, y caminos hacia `brand_search` (`generic_search → brand_search`, `media_activities → brand_search`)." }

source: It's time to bring general knowledge.
es: { "singular": { "msgid": "It's time to bring general knowledge.", "msgstr": "Es hora de aportar conocimientos generales." }, "plural": { "msgid": "It's time to bring general knowledge.", "msgstr": "Es hora de aportar conocimientos generales." } }

source: External knowledge from the ecosystem:
es: { "singular": "Conocimiento externo del ecosistema:", "plural": "Conocimientos externos del ecosistema:" }

source: It is rarely sensible that brand search causes exogenous conditions or generic intent; your experience strongly favors the opposite. Encoding those as required directions above reflects the mechanism you actually believe.
es: { "singular": "Rara vez es sensato que la búsqueda de marca cause condiciones exógenas o intención genérica; su experiencia favorece fuertemente lo contrario. Codificar eso como direcciones requeridas arriba refleja el mecanismo en el que realmente cree.", "plural": "Rara vez es sensato que las búsquedas de marca causen condiciones exógenas o intenciones genéricas; su experiencia favorece fuertemente lo contrario. Codificar eso como direcciones requeridas arriba refleja el mecanismo en el que realmente cree." }

source: You likely expect `generic_search → media_activities` and some path from media to brand (creative/awareness effects), so compel `media_activities → brand_search` rather than letting it vanish.
es: { "singular": "Es probable que esperes `generic_search → media_activities` y algún camino de medios a marca (efectos creativos/de concienciación), así que obliga a `media_activities → brand_search` en lugar de dejar que desaparezca.", "plural": "Es probable que esperen `generic_search → media_activities` y algún camino de medios a marca (efectos creativos/de concienciación), así que obliguen a `media_activities → brand_search` en lugar de dejar que desaparezca." }

source: Let's use this information now!
es: { "singular": "¡Utilicemos esta información ahora!", "plural": "¡Utilicemos esta información ahora!" }

source: Success — with a small dose of **domain knowledge** we’ve steered discovery to the **true structure**. By *forbidding* implausible links into `purchase` (`generic_search`, `exogenous`) and *requiring* core mechanisms (`media_activities → brand_search`, `exogenous → brand_search`), we constrained the search space so the Bayes-factor CI tests could focus on what’s causally plausible. This is the intended workflow: start from a CPDAG learned from data, then iteratively **inject priors** (forbidden/required edges, target-edge rule) to refine the graph into a story that is both **statistically supported** and **business-sensible**.
es: { "singular": { "msgid": "Success — with a small dose of **domain knowledge** we’ve steered discovery to the **true structure**. By *forbidding* implausible links into `purchase` (`generic_search`, `exogenous`) and *requiring* core mechanisms (`media_activities → brand_search`, `exogenous → brand_search`), we constrained the search space so the Bayes-factor CI tests could focus on what’s causally plausible. This is the intended workflow: start from a CPDAG learned from data, then iteratively **inject priors** (forbidden/required edges, target-edge rule) to refine the graph into a story that is both **statistically supported** and **business-sensible**.", "msgstr": "Éxito — con una pequeña dosis de **conocimiento del dominio** hemos dirigido el descubrimiento hacia la **verdadera estructura**. Al *prohibir* enlaces implausibles en `purchase` (`generic_search`, `exogenous`) y *requerir* mecanismos fundamentales (`media_activities → brand_search`, `exogenous → brand_search`), limitamos el espacio de búsqueda para que las pruebas CI del factor Bayesiano pudieran centrarse en lo que es causalmente plausible. Este es el flujo de trabajo previsto: comenzar desde un CPDAG aprendido a partir de datos, luego inyectar de manera iterativa **prioris** (bordes prohibidos/requeridos, regla de borde objetivo) para refinar el gráfico en una historia que sea tanto **estadísticamente respaldada** como **sensible al negocio**." }, "plural": { "msgid": "Success — with a small dose of **domain knowledge** we’ve steered discovery to the **true structure**. By *forbidding* implausible links into `purchase` (`generic_search`, `exogenous`) and *requiring* core mechanisms (`media_activities → brand_search`, `exogenous → brand_search`), we constrained the search space so the Bayes-factor CI tests could focus on what’s causally plausible. This is the intended workflow: start from a CPDAG learned from data, then iteratively **inject priors** (forbidden/required edges, target-edge rule) to refine the graph into a story that is both **statistically supported** and **business-sensible**.", "msgstr": "Éxito — con una pequeña dosis de **conocimiento del dominio** hemos dirigido el descubrimiento hacia la **verdadera estructura**. Al *prohibir* enlaces implausibles en `purchase` (`generic_search`, `exogenous`) y *requerir* mecanismos fundamentales (`media_activities → brand_search`, `exogenous → brand_search`), limitamos el espacio de búsqueda para que las pruebas CI del factor Bayesiano pudieran centrarse en lo que es causalmente plausible. Este es el flujo de trabajo previsto: comenzar desde un CPDAG aprendido a partir de datos, luego inyectar de manera iterativa **prioris** (bordes prohibidos/requeridos, regla de borde objetivo) para refinar el gráfico en una historia que sea tanto **estadísticamente respaldada** como **sensible al negocio**." } }

source: As always, remember that a CPDAG represents a **Markov equivalence class**. Even when we recover the true structure, there may be other DAGs that fit the same conditional independences. If you want to audit that space, enumerate all consistent DAGs (e.g., `get_all_cdags_from_cpdag`) and sanity-check them against mechanism knowledge and validation diagnostics. The goal isn’t dogma about a single graph, but a **reliable causal narrative** that survives both the data and your understanding of how marketing actually works.
es: { "singular": "Como siempre, recuerde que un CPDAG representa una **clase de equivalencia de Markov**. Incluso cuando recuperamos la verdadera estructura, puede haber otros DAG que se ajusten a las mismas independencias condicionales. Si desea auditar ese espacio, enumere todos los DAG consistentes (por ejemplo, `get_all_cdags_from_cpdag`) y verifíquelos con respecto al conocimiento del mecanismo y los diagnósticos de validación. El objetivo no es un dogma sobre un solo gráfico, sino una **narrativa causal confiable** que sobreviva tanto a los datos como a su comprensión de cómo funciona realmente el marketing.", "plural": "Como siempre, recuerden que un CPDAG representa una **clase de equivalencia de Markov**. Incluso cuando recuperamos la verdadera estructura, puede haber otros DAG que se ajusten a las mismas independencias condicionales. Si desean auditar ese espacio, enumeren todos los DAG consistentes (por ejemplo, `get_all_cdags_from_cpdag`) y verifíquenlos con respecto al conocimiento del mecanismo y los diagnósticos de validación. El objetivo no es un dogma sobre un solo gráfico, sino una **narrativa causal confiable** que sobreviva tanto a los datos como a su comprensión de cómo funciona realmente el marketing." }

source: We’ve stress-tested `TBFPC` on tidy, cross-sectional toy worlds. Now comes the real beast: **time series**. Marketing data arrive as sequences — budgets, impressions, search, conversions — with **autocorrelation**, **seasonality**, and **policy feedback** (yesterday’s performance shapes today’s spend). In such settings, plain “snapshot” conditional independences can mislead: serial correlation shrinks the *effective* sample size, nonstationarity makes relationships drift, and lags create **mediated paths over time** (e.g., `media_{t-2} → brand_{t-1} → sales_t`). Even worse, conditioning on certain lags can **open colliders**, while failing to include them can leave **backdoors** unblocked.
es: { "singular": { "msgid": "We’ve stress-tested `TBFPC` on tidy, cross-sectional toy worlds. Now comes the real beast: **time series**. Marketing data arrive as sequences — budgets, impressions, search, conversions — with **autocorrelation**, **seasonality**, and **policy feedback** (yesterday’s performance shapes today’s spend). In such settings, plain “snapshot” conditional independences can mislead: serial correlation shrinks the *effective* sample size, nonstationarity makes relationships drift, and lags create **mediated paths over time** (e.g., `media_{t-2} → brand_{t-1} → sales_t`). Even worse, conditioning on certain lags can **open colliders**, while failing to include them can leave **backdoors** unblocked.", "msgstr": "Hemos sometido a prueba `TBFPC` en mundos de juguete ordenados y transversales. Ahora viene la verdadera bestia: **series temporales**. Los datos de marketing llegan como secuencias — presupuestos, impresiones, búsquedas, conversiones — con **autocorrelación**, **estacionalidad** y **retroalimentación de políticas** (el rendimiento de ayer moldea el gasto de hoy). En tales entornos, las simples independencias condicionales de “instantánea” pueden engañar: la correlación serial reduce el tamaño de la *muestra efectiva*, la no estacionariedad hace que las relaciones se desplacen y los rezagos crean **caminos mediados a lo largo del tiempo** (por ejemplo, `media_{t-2} → brand_{t-1} → sales_t`). Aún peor, condicionar sobre ciertos rezagos puede **abrir colisionadores**, mientras que no incluirlos puede dejar **puertas traseras** sin bloquear." }, "plural": { "msgid": "We’ve stress-tested `TBFPC` on tidy, cross-sectional toy worlds. Now comes the real beast: **time series**. Marketing data arrive as sequences — budgets, impressions, search, conversions — with **autocorrelation**, **seasonality**, and **policy feedback** (yesterday’s performance shapes today’s spend). In such settings, plain “snapshot” conditional independences can mislead: serial correlation shrinks the *effective* sample size, nonstationarity makes relationships drift, and lags create **mediated paths over time** (e.g., `media_{t-2} → brand_{t-1} → sales_t`). Even worse, conditioning on certain lags can **open colliders**, while failing to include them can leave **backdoors** unblocked.", "msgstr": "Hemos sometido a prueba `TBFPC` en mundos de juguete ordenados y transversales. Ahora viene la verdadera bestia: **series temporales**. Los datos de marketing llegan como secuencias — presupuestos, impresiones, búsquedas, conversiones — con **autocorrelación**, **estacionalidad** y **retroalimentación de políticas** (el rendimiento de ayer moldea el gasto de hoy). En tales entornos, las simples independencias condicionales de “instantánea” pueden engañar: la correlación serial reduce el tamaño de la *muestra efectiva*, la no estacionariedad hace que las relaciones se desplacen y los rezagos crean **caminos mediados a lo largo del tiempo** (por ejemplo, `media_{t-2} → brand_{t-1} → sales_t`). Aún peor, condicionar sobre ciertos rezagos puede **abrir colisionadores**, mientras que no incluirlos puede dejar **puertas traseras** sin bloquear." } }

source: Why is causal discovery harder in time? First, many DAGs that differ in **instantaneous** directions are **Markov equivalent** once you add strong serial dependence; their d-separations look the same after you include common trend/seasonal drivers. Second, **feedback** (`sales_{t-1} → spend_t`) violates the DAG acyclicity if modeled at a single time index — the “arrow of time” must be enforced across lags. Third, aggregation and measurement delays blur timing, so $X_t$ may appear contemporaneously related to $Y_t$ even if the true effect is $X_{t-1} \to Y_t$. Granger predictability is *not* causality; it’s necessary but far from sufficient.
es: { "singular": "¿Por qué es más difícil el descubrimiento causal en el tiempo? Primero, muchos DAG que difieren en direcciones **instantáneas** son **equivalentes de Markov** una vez que se añade una fuerte dependencia serial; sus d-separaciones se ven iguales después de incluir tendencias comunes/controladores estacionales. Segundo, **retroalimentación** (`sales_{t-1} → spend_t`) viola la aciclicidad del DAG si se modela en un solo índice de tiempo; la “flecha del tiempo” debe ser impuesta a través de los rezagos. Tercero, la agregación y los retrasos de medición difuminan el tiempo, por lo que $X_t$ puede parecer contemporáneamente relacionado con $Y_t$ incluso si el verdadero efecto es $X_{t-1} \to Y_t$. La predictibilidad de Granger *no* es causalidad; es necesaria pero está lejos de ser suficiente.", "plural": "¿Por qué son más difíciles los descubrimientos causales en el tiempo? Primero, muchos DAG que difieren en direcciones **instantáneas** son **equivalentes de Markov** una vez que se añade una fuerte dependencia serial; sus d-separaciones se ven iguales después de incluir tendencias comunes/controladores estacionales. Segundo, **retroalimentación** (`sales_{t-1} → spend_t`) viola la aciclicidad del DAG si se modela en un solo índice de tiempo; la “flecha del tiempo” debe ser impuesta a través de los rezagos. Tercero, la agregación y los retrasos de medición difuminan el tiempo, por lo que $X_t$ puede parecer contemporáneamente relacionado con $Y_t$ incluso si el verdadero efecto es $X_{t-1} \to Y_t$. La predictibilidad de Granger *no* es causalidad; es necesaria pero está lejos de ser suficiente." }

source: Capturing Time series CPDAGs
es: { "singular": "Capturando series temporales CPDAG", "plural": "Capturando series temporales CPDAG" }

source: Before diving into time-dependent causal graphs, we need a way to **simulate realistic marketing time series** — data that move gradually, not randomly jump around. For that, we’ll use a simple yet powerful utility: a **bounded random walk**.
es: { "singular": "Antes de sumergirnos en gráficos causales dependientes del tiempo, necesitamos una forma de **simular series temporales de marketing realistas** — datos que se mueven gradualmente, no que saltan aleatoriamente. Para eso, utilizaremos una utilidad simple pero poderosa: un **paseo aleatorio acotado**.", "plural": "Antes de sumergirnos en gráficos causales dependientes del tiempo, necesitamos una forma de **simular series temporales de marketing realistas** — datos que se mueven gradualmente, no que saltan aleatoriamente. Para eso, utilizaremos una utilidad simple pero poderosa: un **paseo aleatorio acotado**." }

source: The function below, `random_walk`, generates a sequence of values that evolve step-by-step with small stochastic increments around a target mean (`mu`) and standard deviation (`sigma`). You can also specify lower and upper bounds, ensuring that values stay within a realistic range — for example, between 0 and 1 for normalized ad spend, or within a limited percentage range for brand search interest. The result is a smooth, autocorrelated trajectory that mimics how signals such as spend, impressions, search volume, conversions, etc. behave over time.
es: { "singular": "La función a continuación, `random_walk`, genera una secuencia de valores que evolucionan paso a paso con pequeños incrementos estocásticos alrededor de una media objetivo (`mu`) y una desviación estándar (`sigma`). También puede especificar límites inferiores y superiores, asegurando que los valores se mantengan dentro de un rango realista — por ejemplo, entre 0 y 1 para el gasto publicitario normalizado, o dentro de un rango porcentual limitado para el interés de búsqueda de marca. El resultado es una trayectoria suave y autocorrelacionada que imita cómo se comportan las señales como el gasto, las impresiones, el volumen de búsqueda, las conversiones, etc. a lo largo del tiempo.", "plural": "Las funciones a continuación, `random_walk`, generan secuencias de valores que evolucionan paso a paso con pequeños incrementos estocásticos alrededor de una media objetivo (`mu`) y una desviación estándar (`sigma`). También pueden especificar límites inferiores y superiores, asegurando que los valores se mantengan dentro de un rango realista — por ejemplo, entre 0 y 1 para el gasto publicitario normalizado, o dentro de un rango porcentual limitado para el interés de búsqueda de marca. El resultado es una trayectoria suave y autocorrelacionada que imita cómo se comportan las señales como el gasto, las impresiones, el volumen de búsqueda, las conversiones, etc. a lo largo del tiempo." }

source: This kind of controlled stochasticity is crucial for our next experiments: it gives us **time-correlated inputs** that create temporal dependencies between variables (e.g., `media_{t-1} → brand_{t} → sales_{t+1}`) without exploding variance or unrealistic oscillations. In other words, this random walk helps us *simulate the inertia and memory* inherent in marketing processes — the very features that make **time-series causal discovery** both fascinating and challenging.
es: { "singular": "Este tipo de estocasticidad controlada es crucial para nuestros próximos experimentos: nos proporciona **entradas correlacionadas en el tiempo** que crean dependencias temporales entre variables (por ejemplo, `media_{t-1} → brand_{t} → sales_{t+1}`) sin hacer explotar la varianza o generar oscilaciones irreales. En otras palabras, este paseo aleatorio nos ayuda a *simular la inercia y la memoria* inherentes a los procesos de marketing, las mismas características que hacen que el **descubrimiento causal de series temporales** sea tanto fascinante como desafiante.", "plural": "Este tipo de estocasticidad controlada es crucial para nuestros próximos experimentos: nos proporciona **entradas correlacionadas en el tiempo** que crean dependencias temporales entre variables (por ejemplo, `media_{t-1} → brand_{t} → sales_{t+1}`) sin hacer explotar la varianza o generar oscilaciones irreales. En otras palabras, este paseo aleatorio nos ayuda a *simular la inercia y la memoria* inherentes a los procesos de marketing, las mismas características que hacen que el **descubrimiento causal de series temporales** sea tanto fascinante como desafiante." }

source: Let's define a simple DAG structure!
es: { "singular": "¡Definamos una estructura DAG simple!", "plural": "¡Definamos estructuras DAG simples!" }

source: But now, lets populate with time series each of the factors for the target variable!
es: { "singular": "¡Pero ahora, populamos con series temporales cada uno de los factores para la variable objetivo!", "plural": "¡Pero ahora, populamos con series temporales cada uno de los factores para las variables objetivo!" }

source: What our model has to say? it could find the right structure?
es: { "singular": "¿Qué tiene que decir nuestro modelo? ¿Podría encontrar la estructura correcta?", "plural": "¿Qué tienen que decir nuestros modelos? ¿Podrían encontrar la estructura correcta?" }

source: Why did this simple time-series case “fail”? Even though the **true graph is contemporaneous** (`generic_search`, `media_activities`, `brand_search`, `exogenous` all point into `purchase` at the same time index), the data generated are **strongly autocorrelated**. Autocorrelation makes predictors move together over long stretches, creating **near-collinearity** and **spurious contemporaneous associations**. In that setting, conditional-independence tests on $Y_t \sim \{X_{1,t},X_{2,t},X_{3,t},X_{4,t}\}$ can’t tell whether a signal is a genuine *instant* driver or just a **proxy for past values** (e.g., $X_{1,t-1}$) or a shared trend. Worse, the ΔBIC Bayes-factor uses $n$ in its penalty; when series are autocorrelated the **effective sample size** is much smaller, so evidence is **overstated/understated** in ways that can flip marginal decisions near the threshold.
es: { "singular": "¿Por qué falló este simple caso de series temporales? A pesar de que el **gráfico verdadero es contemporáneo** (`generic_search`, `media_activities`, `brand_search`, `exogenous` apuntan a `purchase` en el mismo índice de tiempo), los datos generados son **fuertemente autocorrelacionados**. La autocorrelación hace que los predictores se muevan juntos durante largos períodos, creando **casi colinealidad** y **asociaciones contemporáneas espurias**. En ese contexto, las pruebas de independencia condicional sobre $Y_t \sim \{X_{1,t},X_{2,t},X_{3,t},X_{4,t}\}$ no pueden determinar si una señal es un verdadero *impulsor instantáneo* o solo un **proxy para valores pasados** (por ejemplo, $X_{1,t-1}$) o una tendencia compartida. Peor aún, el factor Bayes ΔBIC utiliza $n$ en su penalización; cuando las series están autocorrelacionadas, el **tamaño efectivo de la muestra** es mucho más pequeño, por lo que la evidencia está **sobrestimada/subestimada** de maneras que pueden cambiar decisiones marginales cerca del umbral.", "plural": "¿Por qué fallaron estos simples casos de series temporales? A pesar de que los **gráficos verdaderos son contemporáneos** (`generic_search`, `media_activities`, `brand_search`, `exogenous` apuntan a `purchase` en el mismo índice de tiempo), los datos generados son **fuertemente autocorrelacionados**. La autocorrelación hace que los predictores se muevan juntos durante largos períodos, creando **casi colinealidad** y **asociaciones contemporáneas espurias**. En ese contexto, las pruebas de independencia condicional sobre $Y_t \sim \{X_{1,t},X_{2,t},X_{3,t},X_{4,t}\}$ no pueden determinar si una señal es un verdadero *impulsor instantáneo* o solo un **proxy para valores pasados** (por ejemplo, $X_{1,t-1}$) o una tendencia compartida. Peor aún, el factor Bayes ΔBIC utiliza $n$ en su penalización; cuando las series están autocorrelacionadas, el **tamaño efectivo de la muestra** es mucho más pequeño, por lo que la evidencia está **sobrestimada/subestimada** de maneras que pueden cambiar decisiones marginales cerca del umbral." }
