Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_multi_objective_optimization.po
Languages: es

source: Nevertheless, the biggest benefit of combining the models is being able to connect or relate the variables. Not only for optimization, but during sampling, you could add penalty terms on a variable of a model A, which, if related to model B, could condition the values for the parameters of model B.
es: { "singular": "Sin embargo, el mayor beneficio de combinar los modelos es poder conectar o relacionar las variables. No solo para la optimización, sino que durante el muestreo, podrías agregar términos de penalización en una variable de un modelo A, que, si se relaciona con el modelo B, podría condicionar los valores de los parámetros del modelo B.", "plural": "Sin embargo, los mayores beneficios de combinar los modelos son poder conectar o relacionar las variables. No solo para la optimización, sino que durante el muestreo, podrías agregar términos de penalización en una variable de un modelo A, que, si se relaciona con el modelo B, podrían condicionar los valores de los parámetros del modelo B." }

source: Depending on the model, a possible benefit or problem could be the sampling time. This can vary quite a bit once you start making these large graphical models.
es: { "singular": "Dependiendo del modelo, un posible beneficio o problema podría ser el tiempo de muestreo. Esto puede variar bastante una vez que comience a hacer estos grandes modelos gráficos.", "plural": "Dependiendo de los modelos, un posible beneficio o problema podría ser el tiempo de muestreo. Esto puede variar bastante una vez que comience a hacer estos grandes modelos gráficos." }

source: To estimate sampling times for any PyMC model, you can use the `ModelSamplerEstimator` utility class from `pytensor_utils`.
es: { "singular": "Para estimar los tiempos de muestreo para cualquier modelo de PyMC, puede utilizar la clase utilitaria `ModelSamplerEstimator` de `pytensor_utils`.", "plural": "Para estimar los tiempos de muestreo para cualquier modelo de PyMC, puede utilizar la clase utilitaria `ModelSamplerEstimator` de `pytensor_utils`." }

source: Once we initialize the class, we can pass a model to it and get back the sampling estimation in different time units. See the example below!
es: { "singular": "Una vez que inicializamos la clase, podemos pasarle un modelo y obtener la estimación de muestreo en diferentes unidades de tiempo. ¡Vea el ejemplo a continuación!", "plural": "Una vez que inicializamos las clases, podemos pasarles modelos y obtener las estimaciones de muestreo en diferentes unidades de tiempo. ¡Vea los ejemplos a continuación!" }

source: Doing the same, we can now estimate the time for our individual models.
es: { "singular": "Haciendo lo mismo, ahora podemos estimar el tiempo para nuestro modelo individual.", "plural": "Haciendo lo mismo, ahora podemos estimar el tiempo para nuestros modelos individuales." }

source: Conclusion
es: { "singular": "Conclusión", "plural": "Conclusiones" }

source: The main focus of this notebook is a powerful technique: combining different probabilistic models to create a unified framework for decision-making. We showed how the `BuildMergedModel` class can smoothly integrate various models, whether they are custom PyMC models or complex MultiDimensional MMMs from the `pymc-marketing` library. This method allows us to tackle tricky trade-offs—like maximizing new users while also re-engaging existing ones—by reformulating the problem as a constrained optimization. We can maximize one objective while ensuring another meets a minimum performance level, which helps us find a balanced budget allocation without compromising important business objectives.
es: { "singular": "El enfoque principal de este cuaderno es una técnica poderosa: combinar diferentes modelos probabilísticos para crear un marco unificado para la toma de decisiones. Mostramos cómo la clase `BuildMergedModel` puede integrar sin problemas varios modelos, ya sean modelos personalizados de PyMC o complejos MMMs Multidimensionales de la biblioteca `pymc-marketing`. Este método nos permite abordar compromisos difíciles—como maximizar nuevos usuarios mientras también reactivamos a los existentes—al reformular el problema como una optimización restringida. Podemos maximizar un objetivo mientras aseguramos que otro cumpla con un nivel mínimo de rendimiento, lo que nos ayuda a encontrar una asignación de presupuesto equilibrada sin comprometer objetivos comerciales importantes.", "plural": "Los enfoques principales de estos cuadernos son técnicas poderosas: combinar diferentes modelos probabilísticos para crear un marco unificado para la toma de decisiones. Mostramos cómo las clases `BuildMergedModel` pueden integrar sin problemas varios modelos, ya sean modelos personalizados de PyMC o complejos MMMs Multidimensionales de la biblioteca `pymc-marketing`. Estos métodos nos permiten abordar compromisos difíciles—como maximizar nuevos usuarios mientras también reactivamos a los existentes—al reformular los problemas como optimizaciones restringidas. Podemos maximizar un objetivo mientras aseguramos que otros cumplan con un nivel mínimo de rendimiento, lo que nos ayuda a encontrar asignaciones de presupuesto equilibradas sin comprometer objetivos comerciales importantes." }

source: However, this is not just about marketing. The techniques presented here demonstrate a flexible and scalable approach to computational modeling. By building models in a modular, 'Lego-like' fashion using the `merge_models` function, we can create complex graphical models that truly capture the connections within business systems. This opens up possibilities for detailed scenario planning and optimization in various areas, such as finance, operations, or product development. Plus, with tools like `ModelSamplerEstimator` to estimate computational costs, practitioners can handle the complexities of larger models. This provides a practical and powerful framework for data-driven strategic planning in any organization.
es: { "singular": "Sin embargo, esto no se trata solo de marketing. Las técnicas presentadas aquí demuestran un enfoque flexible y escalable para el modelado computacional. Al construir modelos de manera modular, 'similar a Lego', utilizando la función `merge_models`, podemos crear modelos gráficos complejos que realmente capturan las conexiones dentro de los sistemas empresariales. Esto abre posibilidades para una planificación de escenarios detallada y optimización en diversas áreas, como finanzas, operaciones o desarrollo de productos. Además, con herramientas como `ModelSamplerEstimator` para estimar los costos computacionales, los profesionales pueden manejar las complejidades de modelos más grandes. Esto proporciona un marco práctico y poderoso para la planificación estratégica basada en datos en cualquier organización.", "plural": "Sin embargo, esto no se trata solo de marketing. Las técnicas presentadas aquí demuestran un enfoque flexible y escalable para el modelado computacional. Al construir modelos de manera modular, 'similar a Lego', utilizando la función `merge_models`, podemos crear modelos gráficos complejos que realmente capturan las conexiones dentro de los sistemas empresariales. Esto abre posibilidades para una planificación de escenarios detallada y optimización en diversas áreas, como finanzas, operaciones o desarrollo de productos. Además, con herramientas como `ModelSamplerEstimator` para estimar los costos computacionales, los profesionales pueden manejar las complejidades de modelos más grandes. Esto proporciona un marco práctico y poderoso para la planificación estratégica basada en datos en cualquier organización." }
