Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_time_varying_media_example.po
Languages: es

source: MMM with time-varying media baseline
es: MMM con una línea base de medios variable en el tiempo

source: Introduction
es: Introducción

source: In the domain of Marketing Mix Modeling (MMM), understanding the impact of various marketing activities on a target variable and other key performance indicators is crucial. Traditional regression models often neglect the temporal dynamics of marketing activities, potentially leading to biased or incomplete insights. This notebook aims to showcase the difference between a conventional regression model that does not account for time variation and a more sophisticated model that incorporates time as a key component through a Gaussian process.
es: En el ámbito del Modelado de Mezcla de Marketing (MMM), comprender el impacto de diversas actividades de marketing en una variable objetivo y otros indicadores clave de rendimiento es crucial. Los modelos de regresión tradicionales a menudo pasan por alto las dinámicas temporales de las actividades de marketing, lo que puede llevar a percepciones sesgadas o incompletas. Este cuaderno tiene como objetivo mostrar la diferencia entre un modelo de regresión convencional que no tiene en cuenta la variación temporal y un modelo más sofisticado que incorpora el tiempo como un componente clave a través de un proceso gaussiano.

source: The objective is to determine the contribution of each marketing activity to the overall target variable or desired outcome. This process typically involves two critical transformations:
es: El objetivo es determinar la contribución de cada actividad de marketing a la variable objetivo general o resultado deseado. Este proceso generalmente implica dos transformaciones críticas:

source: **Saturation Function**: This function models the diminishing returns of marketing inputs. As more resources are allocated to a specific channel, the incremental benefit tends to decrease.
es: **Función de Saturación**: Esta función modela los rendimientos decrecientes de las entradas de marketing. A medida que se asignan más recursos a un canal específico, el beneficio incremental tiende a disminuir.

source: **Adstock Function**: This function captures the carryover effect of marketing activities over time, recognizing that the impact of a marketing effort extends beyond the immediate period in which it occurs.
es: **Función Adstock**: Esta función captura el efecto de arrastre de las actividades de marketing a lo largo del tiempo, reconociendo que el impacto de un esfuerzo de marketing se extiende más allá del período inmediato en el que ocurre.

source: The standard approach in MMM applies these transformations to the marketing inputs, resulting in a contribution to the outcome.
es: El enfoque estándar en MMM aplica estas transformaciones a las entradas de marketing, resultando en una contribución al resultado.

source: Time-Dependent MMM Model
es: Modelo MMM Dependiente del Tiempo

source: In real-world scenarios, the effectiveness of marketing activities is not static but varies over time due to factors like competitive actions, and market dynamics. To account for this, we introduce a time-dependent component into the MMM framework using a Gaussian Process, specifically a [Hilbert Space GP](https://www.pymc.io/projects/docs/en/stable/api/gp/generated/pymc.gp.HSGP.html). This allows us to capture the hidden latent temporal variation of the marketing contributions.
es: En escenarios del mundo real, la efectividad de las actividades de marketing no es estática, sino que varía con el tiempo debido a factores como las acciones competitivas y la dinámica del mercado. Para tener en cuenta esto, introducimos un componente dependiente del tiempo en el marco de MMM utilizando un Proceso Gaussiano, específicamente un [GP de Espacio de Hilbert](https://www.pymc.io/projects/docs/en/stable/api/gp/generated/pymc.gp.HSGP.html). Esto nos permite capturar la variación temporal latente oculta de las contribuciones de marketing.

source: Model Specification
es: Especificación del modelo

source: In `pymc-marketing` we provide an API for a Bayesian media mix model (MMM) specification following [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017)](https://research.google/pubs/pub46001/) as a base model. Concretely, given a time series target variable $y_{t}$ (e.g. sales or conversions), media variables $x_{m, t}$ (e.g. impressions, clicks or costs) and a set of control covariates $z_{c, t}$ (e.g. holidays, special events) we consider a linear model of the form
es: En `pymc-marketing` proporcionamos una API para la especificación de un modelo de mezcla de medios bayesiano (MMM) siguiendo [Jin, Yuxue, et al. “Métodos bayesianos para la modelización de mezcla de medios con efectos de arrastre y forma.” (2017)](https://research.google/pubs/pub46001/) como modelo base. Concretamente, dado una variable objetivo de serie temporal $y_{t}$ (por ejemplo, ventas o conversiones), variables de medios $x_{m, t}$ (por ejemplo, impresiones, clics o costos) y un conjunto de covariables de control $z_{c, t}$ (por ejemplo, días festivos, eventos especiales), consideramos un modelo lineal de la forma

source: where $\alpha$ is the intercept, $f$ is a media transformation function and $\varepsilon_{t}$ is the error term which we assume is normally distributed. The function $f$ encodes the contribution of media on the target variable. Typically we consider two types of transformation: adstock (carry-over) and saturation effects.
es: donde $\alpha$ es la intersección, $f$ es una función de transformación de medios y $\varepsilon_{t}$ es el término de error que asumimos que está distribuido normalmente. La función $f$ codifica la contribución de los medios en la variable objetivo. Típicamente consideramos dos tipos de transformación: adstock (carry-over) y efectos de saturación.

source: When `time_media_varying` is set to `True`, we capture a single latent process that multiplies all channels. We assume all channels share the same time-dependent fluctuations, contrasting with implementations where each channel has an independent latent process. The modified model can be represented as:
es: Cuando `time_media_varying` se establece en `True`, capturamos un único proceso latente que multiplica todos los canales. Suponemos que todos los canales comparten las mismas fluctuaciones dependientes del tiempo, en contraste con las implementaciones donde cada canal tiene un proceso latente independiente. El modelo modificado se puede representar como:

source: y_{t} = \alpha + \lambda_{t} \cdot \sum_{m=1}^{M}\beta_{m}f(x_{m, t}) \ + \sum_{c=1}^{C}\gamma_{c}z_{c, t} + \varepsilon_{t},
es: y_{t} = \alpha + \lambda_{t} \cdot \sum_{m=1}^{M}\beta_{m}f(x_{m, t}) \ + \sum_{c=1}^{C}\gamma_{c}z_{c, t} + \varepsilon_{t}0,

source: where $\lambda_{t}$ is the time-varying component modeled as a latent process. This shared time-dependent variation $\lambda_{t}$ allows us to capture the overall temporal effects that influence all media channels simultaneously.
es: donde $\lambda_{t}$ es el componente variable en el tiempo modelado como un proceso latente. Esta variación compartida dependiente del tiempo $\lambda_{t}$ nos permite capturar los efectos temporales generales que influyen en todos los canales de medios simultáneamente.

source: Objective
es: Objetivo

source: This notebook will:
es: Este cuaderno hará:

source: Illustrate the formulation of a standard MMM model without time variation.
es: Ilustre la formulación de un modelo MMM estándar sin variación temporal.

source: Extend the model to include a time component using HSGP.
es: Extienda el modelo para incluir un componente temporal utilizando HSGP.

source: Compare the results and insights derived from both models, highlighting the importance of incorporating time variation in capturing the true impact of marketing activities.
es: Compare los resultados y las percepciones derivadas de ambos modelos, destacando la importancia de incorporar la variación temporal para capturar el verdadero impacto de las actividades de marketing.

source: By the end of this notebook, you will have a comprehensive understanding of the advantages of using time-dependent MMM models in capturing the dynamic nature of marketing effectiveness, leading to more accurate and actionable insights.
es: Al final de este cuaderno, tendrá una comprensión completa de las ventajas de utilizar modelos MMM dependientes del tiempo para capturar la naturaleza dinámica de la efectividad del marketing, lo que conducirá a conocimientos más precisos y accionables.

source: Prerequisite Knowledge
es: Conocimientos Previos

source: The notebook assumes the reader has knowledge of the essential functionalities of PyMC-Marketing. If one is unfamiliar, the ["MMM Example Notebook"](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html) serves as an excellent starting point, offering a comprehensive introduction to media mix models in this context.
es: El cuaderno asume que el lector tiene conocimiento de las funcionalidades esenciales de PyMC-Marketing. Si no está familiarizado, el ["Cuaderno de Ejemplo de MMM"](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html) sirve como un excelente punto de partida, ofreciendo una introducción completa a los modelos de mezcla de medios en este contexto.

source: Part I: Data Generation Process
es: Parte I: Proceso de Generación de Datos

source: In Part I of this notebook we focus on the data generating process. That is, we want to construct the target variable $y_{t}$ (sales) by adding each of the components described in the *Business Problem* section.
es: En la Parte I de este cuaderno nos enfocamos en el proceso de generación de datos. Es decir, queremos construir la variable objetivo $y_{t}$ (ventas) añadiendo cada uno de los componentes descritos en la sección *Problema de Negocio*.

source: Prepare Notebook
es: Preparar el cuaderno

source: 1. Date Range
es: 1. Rango de fechas

source: First we set a time range for our data. We consider a bit more than 2 years of data at weekly granularity.
es: Primero establecemos un rango de tiempo para nuestros datos. Consideramos un poco más de 2 años de datos con granularidad semanal.

source: 2. Media Costs Data
es: 2. Datos de Costos de Medios

source: Now we generate synthetic data from two channels $x_1$ and $x_2$. We refer to it as the raw signal as it is going to be the input at the modeling phase. We expect the contribution of each channel to be different, based on the carryover and saturation parameters.
es: Ahora generamos datos sintéticos a partir de dos canales $x_1$ y $x_2$. Nos referimos a ello como la señal en bruto, ya que será la entrada en la fase de modelado. Esperamos que la contribución de cada canal sea diferente, basada en los parámetros de arrastre y saturación.

source: **Remark:** By design, $x_{1}$ should resemble a typical paid social channel and $x_{2}$ a offline (e.g. TV) spend time series.
es: **Observación:** Por diseño, $x_{1}$ debería parecerse a un canal social pagado típico y $x_{2}$ a una serie temporal de gastos offline (por ejemplo, televisión).

source: 4. Control Variables
es: 4. Controlar Variables

source: We add two *events* where there was a remarkable peak in our target variable. We assume they are independent an not seasonal (e.g. launch of a particular product).
es: Agregamos dos *eventos* donde hubo un pico notable en nuestra variable objetivo. Asumimos que son independientes y no estacionales (por ejemplo, el lanzamiento de un producto en particular).

source: 5. Temporal Hidden Latent Process
es: 5. Proceso Latente Oculto Temporal

source: To illustrate the impact of time-varying media performance in our model, we generate a synthetic signal that modifies the base contribution. This signal, `hidden_latent_media_fluctuation`, is designed to simulate the natural fluctuations in media performance over time.
es: Para ilustrar el impacto del rendimiento variable de los medios a lo largo del tiempo en nuestro modelo, generamos una señal sintética que modifica la contribución base. Esta señal, `hidden_latent_media_fluctuation`, está diseñada para simular las fluctuaciones naturales en el rendimiento de los medios a lo largo del tiempo.

source: By centering the signal around 1, we'll maintain the base contribution as the average effect while allowing for periodic increases and decreases. This approach mirrors real-world scenarios where marketing effectiveness can vary, but the overall trend remains consistent.
es: Al centrar la señal alrededor de 1, mantendremos la contribución base como el efecto promedio mientras permitimos aumentos y disminuciones periódicas. Este enfoque refleja escenarios del mundo real donde la efectividad del marketing puede variar, pero la tendencia general se mantiene constante.

source: This synthetic signal is essential for demonstrating the efficacy of our time-dependent MMM model, which should recover this signal as much as possible.
es: Esta señal sintética es esencial para demostrar la eficacia de nuestro modelo MMM dependiente del tiempo, que debería recuperar esta señal tanto como sea posible.

source: 6. Target Variable
es: 6. Variable objetivo

source: Finally, we need to create our target variable. In order to do create, we'll use the PyMC `do` [operator](https://www.pymc-labs.com/blog-posts/causal-analysis-with-pymc-answering-what-if-with-the-new-do-operator/) to specify some true parameter values that govern the causal relationships in the model.
es: Finalmente, necesitamos crear nuestra variable objetivo. Para hacerlo, utilizaremos el operador `do` de PyMC [operator](https://www.pymc-labs.com/blog-posts/causal-analysis-with-pymc-answering-what-if-with-the-new-do-operator/) para especificar algunos valores de parámetros verdaderos que rigen las relaciones causales en el modelo.

source: Doing this, we'll draw a simulated target variable (sales) $y$, which assume it is a linear combination of all components in the model. We also add some Gaussian noise.
es: Haciendo esto, generaremos una variable objetivo simulada (ventas) $y$, que asumimos es una combinación lineal de todos los componentes en el modelo. También añadimos algo de ruido gaussiano.

source: After build your dummy model you can name all variables and parameters in it, using `named_vars` Alternatively you can make a plot of the model graph.
es: Después de construir su modelo ficticio, puede nombrar todas las variables y parámetros en él, utilizando `named_vars`. Alternativamente, puede hacer un gráfico del modelo.

source: Here are the true parameter values used in our model:
es: Aquí están los verdaderos valores de los parámetros utilizados en nuestro modelo:

source: **Intercept**: 6.0
es: **Interceptar**: 6.0

source: **Adstock Alpha**: [0.5, 0.4] (for two different media channels)
es: **Adstock Alpha**: [0.5, 0.4] (para dos canales de medios diferentes)

source: **Saturation Alpha**: [3, 5] (for two different media channels)
es: **Saturación Alfa**: [3, 5] (para dos canales de medios diferentes)

source: **Saturation Lambda**: [0.3, 0.5] (for two different media channels)
es: **Saturación Lambda**: [0.3, 0.5] (para dos canales de medios diferentes)

source: **Media Temporal Latent Multiplier**: The time-varying signal `hidden_latent_media_fluctuation` from our dataset
es: **Multiplicador de Media Temporal Latente**: La señal variable en el tiempo `hidden_latent_media_fluctuation` de nuestro conjunto de datos

source: **Gamma Fourier**: [2.5, -0.5, 1.5, 2.5] (coefficients for Fourier terms)
es: **Gamma Fourier**: [2.5, -0.5, 1.5, 2.5] (coeficientes para términos de Fourier)

source: **Y Sigma**: 0.25 (Noise)
es: **Y Sigma**: 0.25 (Ruido)

source: **Gamma Control**: [-3.5, 6.25] (coefficients for control events, e.g., event1 and event2)
es: **Control de Gamma**: [-3.5, 6.25] (coeficientes para eventos de control, p. ej., event1 y event2)

source: By specifying these true parameter values, we create a realistic simulated target variable that encapsulates the complexity of our media mix model. This approach allows us to effectively test and validate the performance of our time-dependent MMM model.
es: Al especificar estos valores de parámetro verdaderos, creamos una variable objetivo simulada realista que encapsula la complejidad de nuestro modelo de mezcla de medios. Este enfoque nos permite probar y validar de manera efectiva el rendimiento de nuestro modelo MMM dependiente del tiempo.

source: Let's unpack this a little bit. The do-function takes a pymc.Model object and a dict of parameter values. It then returns a new model where the original random variables (RVs) have been converted to constant nodes taking on the specified values.
es: Desglosemos esto un poco. La función do toma un objeto pymc.Model y un diccionario de valores de parámetros. Luego, devuelve un nuevo modelo donde las variables aleatorias (RVs) originales han sido convertidas en nodos constantes que toman los valores especificados.

source: Let's start by drawing our intercept using our "draw" function from PyMC.
es: Comencemos dibujando nuestra intersección utilizando nuestra función "draw" de PyMC.

source: As you can see, the intercept is aligned with the previously added data, having a constant value of `6`. But how looks our total contribution after transformed?
es: Como puede ver, la intersección está alineada con los datos añadidos previamente, teniendo un valor constante de `6`. Pero, ¿cómo se ve nuestra contribución total después de la transformación?

source: **Baseline Channel Contributions**
es: **Contribuciones del Canal Base**

source: The left plot, titled "Baseline Channel Contributions," shows the contributions of the media channels before considering the time-varying effects. The values are generated by summing the baseline channel contributions drawn from the true model.
es: El gráfico de la izquierda, titulado "Contribuciones de Canales Base", muestra las contribuciones de los canales de medios antes de considerar los efectos variables en el tiempo. Los valores se generan al sumar las contribuciones de canales base extraídas del modelo verdadero.

source: **Channel Contributions with Time Variation**
es: **Contribuciones del Canal con Variación Temporal**

source: The right plot, titled "Channel Contributions," displays the media channel contributions after incorporating the time-varying media performance signal. These contributions reflect the impact of the latent temporal process, represented by `hidden_latent_media_fluctuation`, which modifies the baseline contributions. This modification captures the natural fluctuations in media performance over time, as influenced by various marketing dynamics.
es: El gráfico de la derecha, titulado "Contribuciones del Canal", muestra las contribuciones de los canales de medios después de incorporar la señal de rendimiento de medios variable en el tiempo. Estas contribuciones reflejan el impacto del proceso temporal latente, representado por `hidden_latent_media_fluctuation`, que modifica las contribuciones base. Esta modificación captura las fluctuaciones naturales en el rendimiento de los medios a lo largo del tiempo, influenciadas por diversas dinámicas de marketing.

source: 7. Trend \& Seasonal Components
es: 7. Componentes de Tendencia y Estacionales

source: We can also observe the contribution of our control events, as well as the seasonality added when making the true model.
es: También podemos observar la contribución de nuestros eventos de control, así como la estacionalidad añadida al crear el modelo verdadero.

source: Finally, we can visualize the true target given all the previous componets!
es: Finalmente, ¡podemos visualizar el verdadero objetivo dado todos los componentes anteriores!

source: Now with everything in place, we are going to separate our dataset to leave the real data estimated by the true model inside `df` and we will create a new dataset called `data` which will have all the necessary columns but will not have any information about true relationships. Similar to how it would happen in real life.
es: Ahora que todo está en su lugar, vamos a separar nuestro conjunto de datos para dejar los datos reales estimados por el modelo verdadero dentro de `df` y crearemos un nuevo conjunto de datos llamado `data` que tendrá todas las columnas necesarias pero no tendrá ninguna información sobre las relaciones verdaderas. Similar a como sucedería en la vida real.

source: As we discussed previously, we want to compare a model without variant coefficients to see how much it deviates from reality. For this we will create the MMM object that will receive all the necessary parameters to build our model, which should estimate the relationships of the true model.
es: Como discutimos anteriormente, queremos comparar un modelo sin coeficientes de variante para ver cuánto se desvía de la realidad. Para esto, crearemos el objeto MMM que recibirá todos los parámetros necesarios para construir nuestro modelo, el cual debería estimar las relaciones del modelo verdadero.

source: As we can see the model found divergencies!🤯
es: Como podemos ver, ¡el modelo encontró divergencias!🤯

source: The occurrence of divergences in our Bayesian MMM highlights the strengths and robustness of the Bayesian framework in hypothesis testing and model validation. Bayesian models are structural and adhere to certain assumptions about the data-generating process. When these assumptions are violated or the model structure does not fit the data well, divergences and sampling problems can arise.
es: La ocurrencia de divergencias en nuestro MMM bayesiano destaca las fortalezas y la robustez del marco bayesiano en la prueba de hipótesis y la validación de modelos. Los modelos bayesianos son estructurales y se adhieren a ciertas suposiciones sobre el proceso generador de datos. Cuando estas suposiciones se violan o la estructura del modelo no se ajusta bien a los datos, pueden surgir divergencias y problemas de muestreo.

source: This characteristic makes the Bayesian approach a powerful tool for:
es: Esta característica convierte el enfoque bayesiano en una herramienta poderosa para:

source: **Hypothesis Testing**: By defining clear structural relationships and assumptions, Bayesian models can help test and validate hypotheses about the underlying processes in the data.
es: **Pruebas de Hipótesis**: Al definir relaciones estructurales y supuestos claros, los modelos bayesianos pueden ayudar a probar y validar hipótesis sobre los procesos subyacentes en los datos.

source: **Model Validation**: Divergences and sampling issues serve as indicators that the model may not be correctly specified, prompting further investigation and refinement.
es: **Validación del Modelo**: Las divergencias y los problemas de muestreo sirven como indicadores de que el modelo puede no estar correctamente especificado, lo que provoca una investigación y refinamiento adicionales.

source: **Understanding Complex Systems**: Bayesian methods allow for the incorporation of prior knowledge and the testing of various structural assumptions, making them well-suited for understanding complex, real-world systems.
es: **Comprensión de Sistemas Complejos**: Los métodos bayesianos permiten la incorporación de conocimientos previos y la prueba de diversas suposiciones estructurales, lo que los hace especialmente adecuados para comprender sistemas complejos del mundo real.
