Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_multi_objective_optimization.po
Languages: es

source: We can see that both responses are similar in terms of the budget, but the budget allocations for those responses change radically. To visualize this phenomenon better, we can compute the response distributions.
es: { "singular": "Podemos ver que ambas respuestas son similares en términos del presupuesto, pero las asignaciones presupuestarias para esas respuestas cambian radicalmente. Para visualizar mejor este fenómeno, podemos calcular las distribuciones de las respuestas.", "plural": "Podemos ver que ambas respuestas son similares en términos de los presupuestos, pero las asignaciones presupuestarias para esas respuestas cambian radicalmente. Para visualizar mejor este fenómeno, podemos calcular las distribuciones de las respuestas." }

source: This makes everything clear: if we use the budget recommendation from the new users model, we will get a good number of new users, but we'll penalize re-engaged users, getting 40% fewer than we could with the same budget distributed differently. A similar story unfolds if we use the recommendation for re-engaged users; we then penalize new users.
es: { "singular": "Esto deja todo claro: si utilizamos la recomendación de presupuesto del modelo de nuevos usuarios, obtendremos un buen número de nuevos usuarios, pero penalizaremos a los usuarios reactivados, obteniendo un 40% menos de lo que podríamos con el mismo presupuesto distribuido de manera diferente. Una historia similar se desarrolla si utilizamos la recomendación para usuarios reactivados; entonces penalizamos a los nuevos usuarios.", "plural": "Esto deja todo claro: si utilizamos las recomendaciones de presupuesto de los modelos de nuevos usuarios, obtendremos buenos números de nuevos usuarios, pero penalizaremos a los usuarios reactivados, obteniendo un 40% menos de lo que podríamos con el mismo presupuesto distribuido de manera diferente. Historias similares se desarrollan si utilizamos las recomendaciones para usuarios reactivados; entonces penalizamos a los nuevos usuarios." }

source: How can we create an optimization problem that considers both responses and finds a solution that doesn't penalize any target metric? The answer is the `BuildMergedModel` class.
es: { "singular": "¿Cómo podemos crear un problema de optimización que considere ambas respuestas y encuentre una solución que no penalice ninguna métrica objetivo? La respuesta es la clase `BuildMergedModel`.", "plural": "¿Cómo podemos crear problemas de optimización que consideren ambas respuestas y encuentren soluciones que no penalicen ninguna métrica objetivo? Las respuestas son las clases `BuildMergedModel`." }

source: The `BuildMergedModel` class is designed to merge multiple optimizer-compatible models into a single unified graphical representation. This is achieved by combining the posterior `InferenceData` from each model with unique prefixes, allowing for the integration of multiple models' outputs into a cohesive framework. The class operates in a symbolic graphical space, where models are treated as generative processes that can be combined similarly to SQL queries. This approach enables the seamless merging of models by aligning and merging dimensions based on a shared variable, typically referred to as `merge_on`. The merged model is then exposed as a persistent PyMC model, which can be used for further optimization and analysis.
es: { "singular": { "msgid": "The `BuildMergedModel` class is designed to merge multiple optimizer-compatible models into a single unified graphical representation. This is achieved by combining the posterior `InferenceData` from each model with unique prefixes, allowing for the integration of multiple models' outputs into a cohesive framework. The class operates in a symbolic graphical space, where models are treated as generative processes that can be combined similarly to SQL queries. This approach enables the seamless merging of models by aligning and merging dimensions based on a shared variable, typically referred to as `merge_on`. The merged model is then exposed as a persistent PyMC model, which can be used for further optimization and analysis.", "msgstr": "La clase `BuildMergedModel` está diseñada para fusionar múltiples modelos compatibles con optimizadores en una única representación gráfica unificada. Esto se logra combinando los `InferenceData` posteriores de cada modelo con prefijos únicos, lo que permite la integración de las salidas de múltiples modelos en un marco cohesivo. La clase opera en un espacio gráfico simbólico, donde los modelos se tratan como procesos generativos que pueden combinarse de manera similar a las consultas SQL. Este enfoque permite la fusión sin problemas de modelos al alinear y fusionar dimensiones basadas en una variable compartida, típicamente denominada `merge_on`. El modelo fusionado se expone entonces como un modelo PyMC persistente, que puede ser utilizado para una mayor optimización y análisis." }, "plural": { "msgid": "The `BuildMergedModel` class is designed to merge multiple optimizer-compatible models into a single unified graphical representation. This is achieved by combining the posterior `InferenceData` from each model with unique prefixes, allowing for the integration of multiple models' outputs into a cohesive framework. The class operates in a symbolic graphical space, where models are treated as generative processes that can be combined similarly to SQL queries. This approach enables the seamless merging of models by aligning and merging dimensions based on a shared variable, typically referred to as `merge_on`. The merged model is then exposed as a persistent PyMC model, which can be used for further optimization and analysis.", "msgstr": "La clase `BuildMergedModel` está diseñada para fusionar múltiples modelos compatibles con optimizadores en una única representación gráfica unificada. Esto se logra combinando los `InferenceData` posteriores de cada modelo con prefijos únicos, lo que permite la integración de las salidas de múltiples modelos en un marco cohesivo. La clase opera en un espacio gráfico simbólico, donde los modelos se tratan como procesos generativos que pueden combinarse de manera similar a las consultas SQL. Este enfoque permite la fusión sin problemas de modelos al alinear y fusionar dimensiones basadas en una variable compartida, típicamente denominada `merge_on`. El modelo fusionado se expone entonces como un modelo PyMC persistente, que puede ser utilizado para una mayor optimización y análisis." } }

source: Let's take a look at how it works!
es: { "singular": "¡Echemos un vistazo a cómo funciona!", "plural": "¡Echemos un vistazo a cómo funcionan!" }

source: Now that the model is merged, we can reformulate the optimization process. Maximizing two variables, such as new user acquisition and re-engagement, is inherently challenging because they represent different units and objectives. Attempting to maximize both simultaneously leads to an infinite solution space, as improving one objective often comes at the expense of the other.
es: { "singular": "Ahora que el modelo está fusionado, podemos reformular el proceso de optimización. Maximizar dos variables, como la adquisición de nuevos usuarios y la reactivación, es inherentemente desafiante porque representan diferentes unidades y objetivos. Intentar maximizar ambos simultáneamente conduce a un espacio de soluciones infinito, ya que mejorar un objetivo a menudo se hace a expensas del otro.", "plural": "Ahora que los modelos están fusionados, podemos reformular los procesos de optimización. Maximizar dos variables, como la adquisición de nuevos usuarios y la reactivación, es inherentemente desafiante porque representan diferentes unidades y objetivos. Intentar maximizar ambos simultáneamente conduce a un espacio de soluciones infinito, ya que mejorar un objetivo a menudo se hace a expensas del otro." }

source: However, we can reformulate the problem by maximizing one variable while holding the other as a constraint. This approach allows the optimizer to focus on maximizing a single objective while ensuring that the other variable remains above a specified threshold $Z$, which represents our minimum goal for that "*secondary objective*".
es: { "singular": "Sin embargo, podemos reformular el problema maximizando una variable mientras mantenemos la otra como una restricción. Este enfoque permite al optimizador centrarse en maximizar un único objetivo mientras asegura que la otra variable permanezca por encima de un umbral especificado $Z$, que representa nuestra meta mínima para ese \"*objetivo secundario*\".", "plural": "Sin embargo, podemos reformular los problemas maximizando una variable mientras mantenemos las otras como restricciones. Este enfoque permite a los optimizadores centrarse en maximizar un único objetivo mientras aseguran que las otras variables permanezcan por encima de un umbral especificado $Z$, que representa nuestras metas mínimas para esos \"*objetivos secundarios*\"." }

source: Here, we are saying we want a budget that brings in at least 10 (thousand or million) re-engaged users, and that new users should be maximized as long as that constraint is met.
es: { "singular": "Aquí, estamos diciendo que queremos un presupuesto que atraiga al menos 10 (mil o millón) usuarios reactivados, y que los nuevos usuarios deben ser maximizados siempre que se cumpla esa restricción.", "plural": "Aquí, estamos diciendo que queremos un presupuesto que atraiga al menos 10 (mil o millón) usuarios reactivados, y que los nuevos usuarios deben ser maximizados siempre que se cumpla esa restricción." }

source: The optimization is now performed using a merged model that combines multiple deterministic variables (objective variables). As a consequence, we can use any of them in any part of the optimization.
es: { "singular": "La optimización se realiza ahora utilizando un modelo combinado que integra múltiples variables determinísticas (variables objetivo). Como consecuencia, podemos usar cualquiera de ellas en cualquier parte de la optimización.", "plural": "Las optimizaciones se realizan ahora utilizando modelos combinados que integran múltiples variables determinísticas (variables objetivo). Como consecuencia, podemos usar cualquiera de ellas en cualquier parte de las optimizaciones." }

source: You can create any type of objective function. This is just an example, so be as creative as you want. As long as your objective is feasible, the optimizer can handle the rest.
es: { "singular": { "msgid": "You can create any type of objective function. This is just an example, so be as creative as you want. As long as your objective is feasible, the optimizer can handle the rest.", "msgstr": "Puede crear cualquier tipo de función objetivo. Este es solo un ejemplo, así que sea tan creativo como desee. Siempre que su objetivo sea factible, el optimizador puede manejar el resto." }, "plural": { "msgid": "You can create any type of objective function. This is just an example, so be as creative as you want. As long as your objective is feasible, the optimizer can handle the rest.", "msgstr": "Puede crear cualquier tipo de función objetivo. Este es solo un ejemplo, así que sea tan creativo como desee. Siempre que su objetivo sea factible, el optimizador puede manejar el resto." } }

source: Amazing! The new allocation is more balanced between channels, showing that we are not optimizing for a single objective. 👏🏻
es: { "singular": "¡Increíble! La nueva asignación está más equilibrada entre los canales, mostrando que no estamos optimizando para un solo objetivo. 👏🏻", "plural": "¡Increíble! Las nuevas asignaciones están más equilibradas entre los canales, mostrando que no estamos optimizando para un solo objetivo. 👏🏻" }

source: What else can we do? Let's now look at an example using a native `MMM` model from PyMC-Marketing.
es: { "singular": "¿Qué más podemos hacer? Ahora veamos un ejemplo utilizando un modelo nativo `MMM` de PyMC-Marketing.", "plural": "¿Qué más podemos hacer? Ahora veamos ejemplos utilizando modelos nativos `MMM` de PyMC-Marketing." }

source: Optimizing MultiDimensional MMM Models
es: { "singular": "Optimizando Modelos MMM Multidimensionales", "plural": "Optimizando Modelos MMM Multidimensionales" }

source: With the PyMC-Marketing class, the process barely changes:
es: { "singular": "Con la clase PyMC-Marketing, el proceso apenas cambia:", "plural": "Con la clase PyMC-Marketing, los procesos apenas cambian:" }

source: We load or build our MMM model (Multidimensional or not).
es: { "singular": "Cargamos o construimos nuestro modelo MMM (multidimensional o no).", "plural": "Cargamos o construimos nuestros modelos MMM (multidimensionales o no)." }

source: We wrap the model in the optimizer class (avoid this if you are using the old API).
es: { "singular": "Envolvemos el modelo en la clase optimizadora (evite esto si está utilizando la API antigua).", "plural": "Envolvemos los modelos en la clase optimizadora (evite esto si está utilizando la API antigua)." }

source: We pass the new merged model to the budget optimizer.
es: { "singular": "Pasamos el nuevo modelo fusionado al optimizador de presupuesto.", "plural": "Pasamos los nuevos modelos fusionados a los optimizadores de presupuesto." }

source: Once the models are built, we use the wrappers!
es: { "singular": { "msgid": "Once the models are built, we use the wrappers!", "msgstr": "Una vez que se han construido los modelos, ¡utilizamos los envoltorios!" }, "plural": { "msgid": "Once the models are built, we use the wrappers!", "msgstr": "Una vez que se han construido los modelos, ¡utilizamos los envoltorios!" } }

source: Done! Our merged model is ready to use. Let's visualize it.
es: { "singular": { "msgid": "Done! Our merged model is ready to use. Let's visualize it.", "msgstr": "¡Hecho! Nuestro modelo combinado está listo para usar. Vamos a visualizarlo." }, "plural": { "msgid": "Done! Our merged model is ready to use. Let's visualize it.", "msgstr": "¡Hecho! Nuestro modelo combinado está listo para usar. Vamos a visualizarlo." } }

source: We'll play here with another option (something different than before). Once our model is ready, we can merge and add a new variable that is dependent on pre-existing deterministic variables from our different models. This can help create a deterministic variable that represents the total units across our models.
es: { "singular": "Jugaremos aquí con otra opción (algo diferente a antes). Una vez que nuestro modelo esté listo, podemos fusionar y añadir una nueva variable que dependa de variables deterministas preexistentes de nuestros diferentes modelos. Esto puede ayudar a crear una variable determinista que represente el total de unidades a través de nuestros modelos.", "plural": "Jugaremos aquí con otras opciones (algo diferente a antes). Una vez que nuestros modelos estén listos, podemos fusionar y añadir nuevas variables que dependan de variables deterministas preexistentes de nuestros diferentes modelos. Esto puede ayudar a crear variables deterministas que representen el total de unidades a través de nuestros modelos." }

source: We just need to access the model and create the deterministic variable.
es: { "singular": "Solo necesitamos acceder al modelo y crear la variable determinista.", "plural": "Solo necesitamos acceder a los modelos y crear las variables deterministas." }

source: Now, we can ask the optimizer to do something similar to what it did before: bring me the maximum number of units across all markets (models), but keep a specific market at a level greater than or equal to $Z$.
es: { "singular": "Ahora, podemos pedirle al optimizador que haga algo similar a lo que hizo antes: tráigame el número máximo de unidades en todos los mercados (modelos), pero mantenga un mercado específico en un nivel mayor o igual a $Z$.", "plural": "Ahora, podemos pedirle a los optimizadores que hagan algo similar a lo que hicieron antes: tráiganme el número máximo de unidades en todos los mercados (modelos), pero mantengan un mercado específico en un nivel mayor o igual a $Z$." }

source: Check how this works 👇🏻
es: { "singular": "Ver cómo funciona esto 👇🏻", "plural": "Ver cómo funcionan esto 👇🏻" }

source: Great! Again, we can see that the optimizer found a solution and finished the task while respecting the constraints.
es: { "singular": "¡Genial! Nuevamente, podemos ver que el optimizador encontró una solución y terminó la tarea respetando las restricciones.", "plural": "¡Genial! Nuevamente, podemos ver que los optimizadores encontraron soluciones y terminaron las tareas respetando las restricciones." }

source: The `BuildMergedModel` class allows for a huge range of new capabilities in optimization. You can merge your pre-existing trained models into a single place and optimize whatever you like, thinking about and adjusting the objective based on your business needs. But at the same time, that's just the tip of the iceberg.
es: { "singular": { "msgid": "The `BuildMergedModel` class allows for a huge range of new capabilities in optimization. You can merge your pre-existing trained models into a single place and optimize whatever you like, thinking about and adjusting the objective based on your business needs. But at the same time, that's just the tip of the iceberg.", "msgstr": "La clase `BuildMergedModel` permite una amplia gama de nuevas capacidades en optimización. Puede fusionar sus modelos entrenados preexistentes en un solo lugar y optimizar lo que desee, pensando y ajustando el objetivo según las necesidades de su negocio. Pero al mismo tiempo, eso es solo la punta del iceberg." }, "plural": { "msgid": "The `BuildMergedModel` class allows for a huge range of new capabilities in optimization. You can merge your pre-existing trained models into a single place and optimize whatever you like, thinking about and adjusting the objective based on your business needs. But at the same time, that's just the tip of the iceberg.", "msgstr": "La clase `BuildMergedModel` permite una amplia gama de nuevas capacidades en optimización. Puede fusionar sus modelos entrenados preexistentes en un solo lugar y optimizar lo que desee, pensando y ajustando el objetivo según las necesidades de su negocio. Pero al mismo tiempo, eso es solo la punta del iceberg." } }

source: Learning about the merge models function
es: { "singular": "Aprendiendo sobre la función de modelos de fusión", "plural": "Aprendiendo sobre las funciones de modelos de fusión" }

source: Under the hood, the `BuildMergedModel` class is based on the `merge_models` function in `pytensor_utils`, which allows you to apply the same merge operation without `idata`. This allows you to create models from other models and then sample them together if needed.
es: { "singular": "Bajo el capó, la clase `BuildMergedModel` se basa en la función `merge_models` en `pytensor_utils`, que permite aplicar la misma operación de fusión sin `idata`. Esto permite crear modelos a partir de otros modelos y luego muestrearlos juntos si es necesario.", "plural": "Bajo el capó, las clases `BuildMergedModel` se basan en la función `merge_models` en `pytensor_utils`, que permiten aplicar la misma operación de fusión sin `idata`. Esto permite crear modelos a partir de otros modelos y luego muestrearlos juntos si es necesario." }

source: In this symbolic graphical space, each model acts as a node in a computational directed acyclic graph (C-DAG), and the merging process is akin to performing a join operation in SQL, where different datasets are combined based on common keys. By leveraging the power of PyMC and the symbolic representation of models, `merge_models` facilitates the construction of these large graphical models without the need to build them all together from scratch. You can always build and combine different pieces, like with **Lego**.
es: { "singular": "En este espacio gráfico simbólico, cada modelo actúa como un nodo en un grafo acíclico dirigido computacional (C-DAG), y el proceso de fusión es similar a realizar una operación de unión en SQL, donde diferentes conjuntos de datos se combinan en función de claves comunes. Al aprovechar el poder de PyMC y la representación simbólica de modelos, `merge_models` facilita la construcción de estos grandes modelos gráficos sin necesidad de construirlos todos juntos desde cero. Siempre puedes construir y combinar diferentes piezas, como con **Lego**.", "plural": "En este espacio gráfico simbólico, cada modelo actúa como nodos en un grafo acíclico dirigido computacional (C-DAG), y los procesos de fusión son similares a realizar operaciones de unión en SQL, donde diferentes conjuntos de datos se combinan en función de claves comunes. Al aprovechar el poder de PyMC y la representación simbólica de modelos, `merge_models` facilita la construcción de estos grandes modelos gráficos sin necesidad de construirlos todos juntos desde cero. Siempre puedes construir y combinar diferentes piezas, como con **Lego**." }

source: Check out how, using this lower-level function, we can use the pure PyMC models and get a new model from them.
es: { "singular": "Vea cómo, utilizando esta función de nivel inferior, podemos usar los modelos puros de PyMC y obtener un nuevo modelo a partir de ellos.", "plural": "Vea cómo, utilizando estas funciones de nivel inferior, podemos usar los modelos puros de PyMC y obtener nuevos modelos a partir de ellos." }

source: Now that the model is built, we can sample from it like any other PyMC model.
es: { "singular": { "msgid": "Now that the model is built, we can sample from it like any other PyMC model.", "msgstr": "Ahora que el modelo está construido, podemos muestrear de él como cualquier otro modelo de PyMC." }, "plural": { "msgid": "Now that the model is built, we can sample from it like any other PyMC model.", "msgstr": "Ahora que el modelo está construido, podemos muestrear de él como cualquier otro modelo de PyMC." } }

source: Is this model different from sampling two models separately? It shouldn't be. This is merging all your variables and keeping every deterministic or random variable with a prefix. This means the nodes don't interact or pull information from each other; the models are fully independent even when they share the same variable. This is equivalent to running separate models in parallel.
es: { "singular": "¿Es este modelo diferente de muestrear dos modelos por separado? No debería serlo. Esto está fusionando todas sus variables y manteniendo cada variable determinista o aleatoria con un prefijo. Esto significa que los nodos no interactúan ni extraen información unos de otros; los modelos son completamente independientes incluso cuando comparten la misma variable. Esto es equivalente a ejecutar modelos separados en paralelo.", "plural": "¿Son estos modelos diferentes de muestrear dos modelos por separado? No deberían serlo. Esto está fusionando todas sus variables y manteniendo cada variable determinista o aleatoria con un prefijo. Esto significa que los nodos no interactúan ni extraen información unos de otros; los modelos son completamente independientes incluso cuando comparten la misma variable. Esto es equivalente a ejecutar modelos separados en paralelo." }

source: Let's see how the posterior for a given parameter looks against the individual model.
es: { "singular": "Veamos cómo se ve la posterior para un parámetro dado en comparación con el modelo individual.", "plural": "Veamos cómo se ven las posteriors para parámetros dados en comparación con los modelos individuales." }

source: The recovered parameter is the same!
es: { "singular": "¡El parámetro recuperado es el mismo!", "plural": "¡Los parámetros recuperados son los mismos!" }
