Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_gam_options.po
Languages: es

source: This means PyMC-Marketing will not sample adstock or saturation parameters for those excluded combinations — instead, it fills those entries with deterministic zeros while maintaining full coordinate alignment.
es: Esto significa que PyMC-Marketing no muestreará parámetros de adstock o saturación para esas combinaciones excluidas; en su lugar, llena esas entradas con ceros deterministas mientras mantiene una alineación completa de coordenadas.

source: By leveraging `MaskedPrior`, you can prune large models intelligently, maintaining structural consistency while dramatically reducing parameter space. This approach keeps your model both scalable and interpretable, especially when working with high-dimensional marketing datasets.
es: Al aprovechar `MaskedPrior`, puede podar modelos grandes de manera inteligente, manteniendo la consistencia estructural mientras reduce drásticamente el espacio de parámetros. Este enfoque mantiene su modelo tanto escalable como interpretable, especialmente al trabajar con conjuntos de datos de marketing de alta dimensión.

source: The `MaskedPrior` functionality was merged recently and is still experimental. Use with caution in production environments.
es: La funcionalidad `MaskedPrior` se fusionó recientemente y aún es experimental. Úsela con precaución en entornos de producción.

source: Variational inference for High Dimensional grids
es: Inferencia variacional para rejillas de alta dimensión

source: We’ve already seen how dimensional design and `MaskedPrior` can **shrink parameter space** by excluding irrelevant combinations. However, there are regimes where this isn’t enough: as you add nonlinear transformations, trend/seasonality, multi-index structures, and custom effects, you can end up in **very high-dimensional** posterior geometries. In these cases, exact MCMC (e.g., NUTS) can become prohibitively expensive. This is where **approximate inference** shines. As Michael Betancourt aptly notes, *“In high dimensions, expectations are the only thing that makes sense.”* Approximations let you target informative summaries (e.g., posterior means, credible intervals) without paying the full cost of exact sampling.
es: Ya hemos visto cómo el diseño dimensional y `MaskedPrior` pueden **reducir el espacio de parámetros** al excluir combinaciones irrelevantes. Sin embargo, hay regímenes donde esto no es suficiente: a medida que añades transformaciones no lineales, tendencias/estacionalidad, estructuras de múltiples índices y efectos personalizados, puedes terminar en geometrías posteriores **muy de alta dimensión**. En estos casos, el MCMC exacto (por ejemplo, NUTS) puede volverse prohibitivamente costoso. Aquí es donde **la inferencia aproximada** brilla. Como señala acertadamente Michael Betancourt, *“En altas dimensiones, las expectativas son lo único que tiene sentido.”* Las aproximaciones te permiten apuntar a resúmenes informativos (por ejemplo, medias posteriores, intervalos creíbles) sin pagar el costo total del muestreo exacto.

source: PyMC-Marketing exposes PyMC’s **variational** and **approximate** methods directly, so you can switch from exact sampling to approximation with minimal code. For example, using **ADVI** via `pm.fit(...)` and then drawing samples from the approximation. This tool allows you to prototype and triage large models quickly. You can later escalate to full MCMC if the approximation looks adequate and the compute budget allows. For details on available approximation methods (e.g., ADVI, Full-Rank ADVI, SVGD), see the PyMC inference docs (search for “PyMC variational inference” and pm.fit).
es: PyMC-Marketing expone los métodos **variacionales** y **aproximados** de PyMC directamente, para que pueda cambiar de muestreo exacto a aproximación con un código mínimo. Por ejemplo, utilizando **ADVI** a través de `pm.fit(...)` y luego extrayendo muestras de la aproximación. Esta herramienta le permite prototipar y clasificar modelos grandes rápidamente. Posteriormente, puede escalar a MCMC completo si la aproximación parece adecuada y el presupuesto de cómputo lo permite. Para obtener detalles sobre los métodos de aproximación disponibles (por ejemplo, ADVI, ADVI de rango completo, SVGD), consulte la documentación de inferencia de PyMC (busque "inferencia variacional de PyMC" y pm.fit).

source: Bias–variance trade-off: Variational families can underestimate posterior variance and miss correlations.
es: Compensación entre sesgo y varianza: Las familias variacionales pueden subestimar la varianza posterior y perder correlaciones.

source: Pathologies in geometry: Multimodality, heavy tails, and strong curvature can break simple variational assumptions or lead to poor local optima.
es: Patologías en geometría: La multimodalidad, las colas pesadas y la fuerte curvatura pueden romper supuestos variacionales simples o llevar a óptimos locales deficientes.

source: Diagnostics matter: Monitor ELBO trajectories, check stability of solutions, and compare against short pilot NUTS runs on reduced models when possible.
es: Los diagnósticos son importantes: Monitoree las trayectorias de ELBO, verifique la estabilidad de las soluciones y compárelas con ejecuciones cortas de NUTS en modelos reducidos cuando sea posible.

source: Calibration risk: Downstream decisions (e.g., budget allocation) may be overconfident if variance is underestimated. Consider conservative policies or robust utilities.
es: Riesgo de calibración: Las decisiones posteriores (por ejemplo, la asignación de presupuesto) pueden ser excesivamente confiadas si se subestima la varianza. Considere políticas conservadoras o utilidades robustas.

source: Final Thoughts
es: Reflexiones Finales

source: What we’ve explored here is just a glimpse of what **PyMC-Marketing** can do. Beyond being a Marketing Mix Modeling toolkit, it’s a **probabilistic modeling framework** driven by **PyMC** that gives you the building blocks to design, extend, and experiment with Bayesian models of any complexity — from linear regressions to rich, hierarchical, time-aware systems.
es: Lo que hemos explorado aquí es solo un vistazo de lo que **PyMC-Marketing** puede hacer. Más allá de ser un conjunto de herramientas para el Modelado de Mezcla de Marketing, es un **marco de modelado probabilístico** impulsado por **PyMC** que te proporciona los bloques de construcción para diseñar, extender y experimentar con modelos bayesianos de cualquier complejidad, desde regresiones lineales hasta sistemas ricos, jerárquicos y conscientes del tiempo.

source: PyMC-Marketing is not limited **for marketing** and more important **you are not limited by templates**. You can build, modify, and extend your models freely while standing on the solid foundation of PyMC’s probabilistic engine. Every additional layer — trend, seasonality, saturation, or custom effect — adds expressiveness without losing clarity or structure.
es: PyMC-Marketing no se limita **para marketing** y, lo más importante, **no estás limitado por plantillas**. Puedes construir, modificar y extender tus modelos libremente mientras te apoyas en la sólida base del motor probabilístico de PyMC. Cada capa adicional — tendencia, estacionalidad, saturación o efecto personalizado — añade expresividad sin perder claridad ni estructura.

source: So, keep exploring! Try new transformations, mix causal and functional effects, benchmark inference strategies, and share your ideas with the community. If there’s a feature you wish existed — ask for it, or even better, help us build it.
es: Así que, ¡sigue explorando! Prueba nuevas transformaciones, mezcla efectos causales y funcionales, evalúa estrategias de inferencia y comparte tus ideas con la comunidad. Si hay una función que desearías que existiera, pídela o, aún mejor, ayúdanos a construirla.

source: PyMC-Marketing is evolving fast, and your curiosity is what drives its next step! 🔥
es: PyMC-Marketing está evolucionando rápidamente, y su curiosidad es lo que impulsa su próximo paso! 🔥
