Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_components.po
Languages: es

source: Custom Models with MMM components
es: Modelos personalizados con componentes MMM

source: The underlying components used in the `MMM` class provide flexibility to build other, custom models. With a little knowledge of `PyMC` and how to customize these `PyMC-Marketing` components, a lot of different use-cases can be covered.
es: Los componentes subyacentes utilizados en la clase `MMM` ofrecen flexibilidad para construir otros modelos personalizados. Con un poco de conocimiento de `PyMC` y de cómo personalizar estos componentes de `PyMC-Marketing`, se pueden cubrir muchos casos de uso diferentes.

source: This notebook is not an introduction but rather an advance example for those trying to understand the `PyMC-Marketing` internals for flexibility for custom use-cases.
es: Este cuaderno no es una introducción, sino un ejemplo avanzado para aquellos que intentan comprender los internals de `PyMC-Marketing` para la flexibilidad en casos de uso personalizados.

source: Overview
es: Descripción general

source: This notebook will cover the currently exposed model components from the PyMC-Marketing API. At the moment, this includes:
es: Este cuaderno cubrirá los componentes del modelo actualmente expuestos de la API de PyMC-Marketing. En este momento, esto incluye:

source: media transformations
es: transformaciones de medios

source: adstock: how today's media has an effect in the future
es: adstock: cómo los medios de hoy tienen un efecto en el futuro

source: saturation: the diminishing returns for media
es: saturación: los rendimientos decrecientes para los medios

source: recurring seasonality
es: estacionalidad recurrente

source: For each of these, the flexibility and customization will be showcased and combined together in a toy model with with `PyMC` directly.
es: Para cada uno de estos, se mostrará la flexibilidad y personalización, combinándolas en un modelo de juguete directamente con `PyMC`.

source: Setup
es: Configuración

source: Media Transformations
es: Transformaciones de Medios

source: There are classes for each of the adstock and saturation transformations. They can be imported from the `pymc_marketing.mmm` module.
es: Hay clases para cada una de las transformaciones de adstock y saturación. Pueden ser importadas del módulo `pymc_marketing.mmm`.

source: Saturation curves can take many different forms. In this example, we will use the Michaelis Menten curve which we provide in the `MichaelisMentenSaturation` class.
es: Las curvas de saturación pueden adoptar muchas formas diferentes. En este ejemplo, utilizaremos la curva de Michaelis-Menten que proporcionamos en la clase `MichaelisMentenSaturation`.

source: This curve has two parameters, `alpha` and `lam`.
es: Esta curva tiene dos parámetros, `alpha` y `lam`.

source: A characteristic of these curves are diminishing returns in order to indicate saturation of a media variable. This can be seen in the plateauing as x increases.
es: Una característica de estas curvas son los rendimientos decrecientes para indicar la saturación de una variable media. Esto se puede observar en el estancamiento a medida que x aumenta.

source: Sampling Transformation Function
es: Función de Transformación de Muestreo

source: Each of the transformation will have a set of default priors. These can be altered at initialization with the `priors` parameter but will ultimately be stored in the `function_priors` attribute of the instance. There will be a prior for each of the estimated parameters used in the function.
es: Cada una de las transformaciones tendrá un conjunto de priors predeterminados. Estos pueden ser modificados en la inicialización con el parámetro `priors`, pero finalmente se almacenarán en el atributo `function_priors` de la instancia. Habrá un prior para cada uno de los parámetros estimados utilizados en la función.

source: The `sample_prior` method can be used to sample the parameters of the functions.
es: El método `sample_prior` se puede utilizar para muestrear los parámetros de las funciones.

source: There is the prefix `saturation_` on each of the parameters in order to not clash with the larger model. This is the default but can be changed as well.
es: Hay el prefijo `saturation_` en cada uno de los parámetros para no chocar con el modelo más grande. Este es el valor predeterminado, pero también se puede cambiar.

source: With parameters for the function, the curve can be sampled as well. Combining `sample_curve` and `plot_curve` together can provide good insight into the shape the curve makes!
es: Con parámetros para la función, la curva también se puede muestrear. Combinar `sample_curve` y `plot_curve` juntos puede proporcionar una buena visión de la forma que toma la curva.

source: This shows the most likely curves under the prior distributions.
es: Esto muestra las curvas más probables bajo las distribuciones a priori.

source: The posterior can be used instead of the prior in both the `sample_curve` and `plot_curve` methods. Any additional coordinates from the parameters will be handled automatically!
es: El posterior puede ser utilizado en lugar del anterior en ambos métodos `sample_curve` y `plot_curve`. ¡Cualquier coordenada adicional de los parámetros será manejada automáticamente!

source: Adding Parameter Dimensions
es: Añadiendo Dimensiones de Parámetro

source: In most cases, a separate saturation function will be estimated for each media channel. A dimension needs to be added to the prior of the function parameters to account for this.
es: En la mayoría de los casos, se estimará una función de saturación separada para cada canal de medios. Se necesita agregar una dimensión al prior de los parámetros de la función para tener en cuenta esto.

source: Let's create some example data to work toward this transformation.
es: Creemos algunos datos de ejemplo para trabajar en esta transformación.

source: For this example, we will have 2 years of media spend for 4 channels
es: Para este ejemplo, tendremos 2 años de gasto en medios para 4 canales.

source: As mentioned, the default priors **do not** have a channel dimension. In order to use with the in our model with "channel" dim, we have to add the dims to each of the function priors.
es: Como se mencionó, los priors predeterminados **no** tienen una dimensión de canal. Para utilizarlos en nuestro modelo con dimensión de "canal", debemos agregar las dimensiones a cada uno de los priors de función.

source: The previous workflow can be used to understand our priors still. Just pass the `coords` to the `sample_prior` method in order to add dims to the appropriate variables.
es: El flujo de trabajo anterior se puede utilizar para comprender nuestros priors aún. Simplemente pase las `coords` al método `sample_prior` para agregar dimensiones a las variables apropiadas.

source: Since each channel prior is the same, there will just be some noise between the HDI and curve samples.
es: Dado que cada canal previo es el mismo, solo habrá algo de ruido entre las muestras de HDI y de la curva.

source: Using in PyMC Model
es: Usando en el modelo de PyMC

source: When using the transformation in a larger `PyMC` model, the `apply` method will be used.
es: Al utilizar la transformación en un modelo más grande de `PyMC`, se utilizará el método `apply`.

source: This method will:
es: Este método hará:

source: create distributions based on prior specification of the instance
es: crear distribuciones basadas en la especificación previa de la instancia

source: apply the transformation to the data
es: aplicar la transformación a los datos

source: The `dims` parameter is the shape of parameters and not the data. The data has a different shape but will need to be broadcastable with the parameters!
es: El parámetro `dims` es la forma de los parámetros y no de los datos. Los datos tienen una forma diferente, pero deberán ser compatibles para la transmisión con los parámetros.

source: Since independent alpha and lam were specified, we see that in the model graph below:
es: Dado que se especificaron alpha y lam independientes, vemos que en el gráfico del modelo a continuación:

source: Neither the `df_spends` nor `saturated_spends` show in the model. If needed, use `pm.Data` and `pm.Deterministic` to save off.
es: Ni `df_spends` ni `saturated_spends` se muestran en el modelo. Si es necesario, utiliza `pm.Data` y `pm.Deterministic` para guardar.

source: Our variable will be (date, channel) dims.
es: Nuestra variable será (fecha, canal) dimensiones.

source: We can manipulate this in anyway we'd like to connect it in with the larger model.
es: Podemos manipular esto de cualquier manera que deseemos para conectarlo con el modelo más grande.

source: Changing Assumptions
es: Cambiando Suposiciones

source: As hinted above, the priors for the function parameters are customizable which can lead to many different models. Change the priors, change the model.
es: Como se insinuó anteriormente, los priors para los parámetros de la función son personalizables, lo que puede dar lugar a muchos modelos diferentes. Cambie los priors, cambie el modelo.

source: The prior distributions just need to follow the distribution API [here](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.model_config.html).
es: Las distribuciones previas solo necesitan seguir la API de distribución [aquí](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.model_config.html).

source: Instead of the defaults, we can use:
es: En lugar de los valores predeterminados, podemos usar:

source: hierarchical parameter for `lam` parameter
es: parámetro jerárquico para el parámetro `lam`

source: common `alpha` parameter
es: parámetro `alpha` común

source: Then this can be used in a new `PyMC` model which leads to a much different model graph than before!
es: Entonces, esto se puede utilizar en un nuevo modelo `PyMC`, lo que conduce a un gráfico de modelo muy diferente al anterior.

source: The shape of the output will still be (date, channel) even though some of the parameter's dims has changed.
es: La forma de la salida seguirá siendo (fecha, canal) aunque algunas de las dimensiones del parámetro hayan cambiado.

source: The previous workflow still helps us understand the produced curves:
es: El flujo de trabajo anterior aún nos ayuda a comprender las curvas producidas:

source: `sample_prior`
es: muestra_anterior

source: `plot_curve`
es: `trazar_curva`

source: Though they all look the same in the prior, the data generation process is indeed different as seen in the model graph.
es: Aunque todos parecen iguales en el anterior, el proceso de generación de datos es, de hecho, diferente como se observa en el gráfico del modelo.

source: Geo Hierarchical Model
es: Modelo Geo Jerárquico

source: The dimensions of the parameters are not limited to 1D so additional hierarchies can be defined.
es: Las dimensiones de los parámetros no están limitadas a 1D, por lo que se pueden definir jerarquías adicionales.

source: Below defines:
es: A continuación se define:

source: alpha which is hierarchical across channels
es: alpha que es jerárquico a través de los canales

source: lam which is common across all geos but different channels
es: lam que es común en todas las geos pero en diferentes canales

source: Our new data set needs to have information for geo now. This is channel spends by date **and geo**. This is stored in an `xarray.DataArray` which can be converted to a 3D `numpy.ndarray`.
es: Nuestro nuevo conjunto de datos necesita tener información para geo ahora. Esto son los gastos del canal por fecha **y geo**. Esto se almacena en un `xarray.DataArray` que puede ser convertido a un `numpy.ndarray` 3D.

source: Displaying the data is easy with pandas.
es: Mostrar los datos es fácil con pandas.

source: As long as the `dims` argument of `apply` can broadcast with the data going in, then the media transformations can be used!
es: Mientras el argumento `dims` de `apply` pueda transmitirse con los datos que se ingresan, ¡entonces se pueden utilizar las transformaciones de medios!

source: Here, the data is in the shape (date, channel, geo) so it can broadcast with the parameters in shape (channel, geo) to create the saturated spends.
es: Aquí, los datos están en la forma (fecha, canal, geo) para que se puedan transmitir con los parámetros en la forma (canal, geo) para crear los gastos saturados.

source: The saturation assumptions can be seen in the model graph:
es: Las suposiciones de saturación se pueden ver en el gráfico del modelo:

source: The `PyMC` model context will stay the same but changing model assumptions will happen with input data and prior configuration!
es: El contexto del modelo `PyMC` permanecerá igual, pero los cambios en las suposiciones del modelo ocurrirán con los datos de entrada y la configuración previa.

source: Seasonality
es: Estacionalidad

source: Recurring seasonality can be modeled with either a `MonthlyFourier` or `YearlyFourier` instance.
es: La estacionalidad recurrente se puede modelar con una instancia de `MonthlyFourier` o `YearlyFourier`.

source: There is a similar workflow to understand these priors as before:
es: Hay un flujo de trabajo similar para entender estos antecedentes como antes:

source: `sample_prior`: Sample all the priors
es: `sample_prior`: Muestre todos los priors

source: `sample_curve`: Sample the curve across the whole period
es: `sample_curve`: Muestre la curva a lo largo de todo el período

source: `plot_curve`: Plot the HDI and few samples
es: `plot_curve`: Graficar el IDH y algunas muestras

source: This also supports arbitrary hierarchies that can be defined with the `Prior` class. Pass these in with the `prior` parameters.
es: Esto también admite jerarquías arbitrarias que se pueden definir con la clase `Prior`. Pásalas con los parámetros `prior`.

source: A dimension associated with the prefix will be required! By default it is `fourier`
es: ¡Se requerirá una dimensión asociada con el prefijo! Por defecto es `fourier`

source: The above workflow works here as well! The coords just need to be passed like in `pm.Model`.
es: ¡El flujo de trabajo anterior también funciona aquí! Las coordenadas solo necesitan ser pasadas como en `pm.Model`.

source: Based on the hierarchical priors, we can see similar seasonality betweens geos. However, they are not exactly the same!
es: Basado en los priors jerárquicos, podemos observar una estacionalidad similar entre las geos. Sin embargo, ¡no son exactamente iguales!

source: Events
es: Eventos

source: You can add latent events using Gaussian Basis, this will [model events as Gaussian bumps](https://juanitorduz.github.io/bump_func/) as described by Juan Orduz.
es: Puedes añadir eventos latentes utilizando la Base Gaussiana, esto [modelará eventos como bultos gaussianos](https://juanitorduz.github.io/bump_func/) como lo describe Juan Orduz.

source: Example Custom MMM
es: Ejemplo de MMM personalizado

source: Lots of flexibility by combining them together. This will build off the example above and now include an adstock transformation of the data as well.
es: Mucha flexibilidad al combinarlos. Esto se basará en el ejemplo anterior e incluirá también una transformación de adstock de los datos.

source: Our adstock function will have a hierarchical parameter for each geo. Our configuration is flexible enough to change this as long as the final dims will broadcast with the data!
es: Nuestra función de adstock tendrá un parámetro jerárquico para cada geo. Nuestra configuración es lo suficientemente flexible como para cambiar esto siempre que las dimensiones finales se transmitan con los datos.

source: These are also hierarchical parameters but across a different dimensions than the saturation transformation.
es: Estos también son parámetros jerárquicos, pero en dimensiones diferentes a la transformación de saturación.

source: Then for some additional differences between geo and observations, we will assume an intercept and noise around observations. The intercept will be independent across geos and the noise will be assumed to be hierarchical across geos.
es: Luego, para algunas diferencias adicionales entre geo y observaciones, asumiremos una intersección y ruido alrededor de las observaciones. La intersección será independiente entre geos y se asumirá que el ruido es jerárquico entre geos.

source: The `Prior` class will be used to reflect these assumptions outside of the model context
es: La clase `Prior` se utilizará para reflejar estas suposiciones fuera del contexto del modelo.

source: The combined data generation process can be seen below:
es: El proceso de generación de datos combinados se puede ver a continuación:

source: We can then sample from this model to investigate the target variable of the MMM.
es: Podemos entonces muestrear de este modelo para investigar la variable objetivo del MMM.

source: We will use the `plot_curve` helper function to plot the `target` variable across time for each region. This shows the HDI and 2 prior samples for each of the 3 time series.
es: Usaremos la función auxiliar `plot_curve` para graficar la variable `target` a lo largo del tiempo para cada región. Esto muestra el IDH y 2 muestras anteriores para cada una de las 3 series temporales.

source: Summary
es: Resumen

source: Custom models are possible using the components that build up the `MMM` class and `PyMC` distributions themselves. With some prior distribution configuration and the components that PyMC-Marketing provides, novel models can be built up to fit various use-cases and various model assumptions.
es: Los modelos personalizados son posibles utilizando los componentes que conforman la clase `MMM` y las distribuciones de `PyMC` en sí. Con una configuración previa de la distribución y los componentes que proporciona PyMC-Marketing, se pueden construir modelos novedosos para ajustarse a diversos casos de uso y diversas suposiciones del modelo.

source: Much of the flexibility will come from the prior distribution configuration rather then the transformation themselves. This is meant to keep a standard interface while working with them regardless what their role is.
es: Gran parte de la flexibilidad provendrá de la configuración de distribución previa en lugar de las transformaciones en sí. Esto está destinado a mantener una interfaz estándar al trabajar con ellos, independientemente de cuál sea su función.

source: If there is any suggestions or feedback on how to make better custom models with the package, [create a GitHub Issue](https://github.com/pymc-labs/pymc-marketing/issues/new) or chime into the various discussions.
es: Si tiene alguna sugerencia o comentario sobre cómo mejorar los modelos personalizados con el paquete, [cree un problema en GitHub](https://github.com/pymc-labs/pymc-marketing/issues/new) o participe en las diversas discusiones.

source: Though models can be built up like this, the prebuilt structures provide many benefits as well. For instance, the `MMM` class provides:
es: Aunque los modelos se pueden construir de esta manera, las estructuras preconstruidas también ofrecen muchos beneficios. Por ejemplo, la clase `MMM` proporciona:

source: scaling of input and output data
es: escalado de datos de entrada y salida

source: plotting methods for parameters, predictive data, contributions, etc
es: métodos de representación para parámetros, datos predictivos, contribuciones, etc.

source: customized adstock and saturation transformations
es: transformaciones de adstock y saturación personalizadas

source: out of sample predictions
es: predicciones fuera de muestra

source: lift test integration
es: integración de prueba de elevación

source: budget optimization
es: optimización del presupuesto

source: Our recommendation is to start with the prebuilt models and work up from there.
es: Nuestra recomendación es comenzar con los modelos preconstruidos y avanzar a partir de ahí.
