Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_identification.po
Languages: es

source: **Market Growth**: Represents the underlying trend in sales due to long-term growth, with an implicit coefficient of 1, adding a steady upward influence.
es: **Crecimiento del Mercado**: Representa la tendencia subyacente en las ventas debido al crecimiento a largo plazo, con un coeficiente implícito de 1, añadiendo una influencia ascendente constante.

source: **Competitor Offers**: Directly reduces sales, with an implicit coefficient of -1, simulating the negative impact of competitor actions on the target variable.
es: **Ofertas de Competidores**: Reduce directamente las ventas, con un coeficiente implícito de -1, simulando el impacto negativo de las acciones de los competidores en la variable objetivo.

source: **Holiday Contributions**: Adds sales spikes around holiday periods, capturing the seasonal increase in consumer demand.
es: **Contribuciones Festivas**: Añade picos de ventas durante los períodos festivos, capturando el aumento estacional en la demanda del consumidor.

source: **$m(Impressions_{x1_t})$ and $m(Impressions_{x2_t})$**: Represent the **saturated adstock** values for the marketing channels $x1$ and $x2$.
es: **$m(Impressions_{x1_t})$ y $m(Impressions_{x2_t})$**: Representan los valores de **adstock saturado** para los canales de marketing $x1$ y $x2$.

source: **Noise $\epsilon$**: A small random error term, drawn from a normal distribution with mean 0 and standard deviation 0.08, to account for unexplained variability in sales.
es: **Ruido $\epsilon$**: Un pequeño término de error aleatorio, extraído de una distribución normal con media 0 y desviación estándar 0.08, para tener en cuenta la variabilidad no explicada en las ventas.

source: Let’s recap what we’ve done so far:
es: Hagamos un resumen de lo que hemos hecho hasta ahora:

source: We created a hypothesis about how things in the world interact and how those interactions are connected.
es: Creamos una hipótesis sobre cómo interactúan las cosas en el mundo y cómo están conectadas esas interacciones.

source: We turned our hypothesis into a mathematical model that reflects these connections.
es: Convertimos nuestra hipótesis en un modelo matemático que refleja estas conexiones.

source: We generated data that fits with our hypothesis.
es: Generamos datos que se ajustan a nuestra hipótesis.

source: Now we are ready to find the model that best explains our data.
es: Ahora estamos listos para encontrar el modelo que mejor explique nuestros datos.

source: In Bayesian terms, we call this the data generating process, which corresponds to the structural causal model in causal terms.
es: En términos bayesianos, llamamos a esto el proceso generador de datos, que corresponde al modelo causal estructural en términos causales.

source: All models we write in PyMC are structural causal models. Even if we don’t aim for a causal interpretation, our model still seeks to explain a specific data generating process.
es: Todos los modelos que escribimos en PyMC son modelos causales estructurales. Incluso si no buscamos una interpretación causal, nuestro modelo aún busca explicar un proceso específico de generación de datos.

source: Recognizing this is crucial because it shapes our decisions when building the model and choosing which variables to include. After our previous work, we should have a good idea of which variables are most important in explaining sales. However, if we forget what we discussed earlier, we won't know how to start building the model.
es: Reconocer esto es crucial porque influye en nuestras decisiones al construir el modelo y elegir qué variables incluir. Después de nuestro trabajo anterior, deberíamos tener una buena idea de cuáles son las variables más importantes para explicar las ventas. Sin embargo, si olvidamos lo que discutimos anteriormente, no sabremos cómo empezar a construir el modelo.

source: The Real Challenge
es: El verdadero desafío

source: In real life, we don't know the actual data generating process; we only have observed data. Often, we receive a dataset like the one shown below.
es: En la vida real, no conocemos el proceso real que genera los datos; solo tenemos datos observados. A menudo, recibimos un conjunto de datos como el que se muestra a continuación.

source: If we have PyMC installed, the simplest approach would be to include all our variables in a model and run it. This is like using any model available on the market, checking correlations, and selecting the most relevant variables. This method essentially means, “Let’s control for everything that might relate to sales.”
es: Si tenemos PyMC instalado, el enfoque más simple sería incluir todas nuestras variables en un modelo y ejecutarlo. Esto es similar a utilizar cualquier modelo disponible en el mercado, verificando correlaciones y seleccionando las variables más relevantes. Este método significa esencialmente: "Controlaremos todo lo que pueda relacionarse con las ventas."

source: Note: This approach is not bad, but it misses using valuable information and prior knowledge about the business and its inner relationships.
es: Nota: Este enfoque no es malo, pero no utiliza información valiosa y conocimientos previos sobre el negocio y sus relaciones internas.

source: We can separate the target variable from the potential factors that influence it. Then, we can begin training our initial correlation-based model.
es: Podemos separar la variable objetivo de los factores potenciales que la influyen. Luego, podemos comenzar a entrenar nuestro modelo inicial basado en correlaciones.

source: With the small lines of code above, our media mix model is set up, and we can now start training it.
es: Con las pequeñas líneas de código anteriores, nuestro modelo de mezcla de medios está configurado y ahora podemos comenzar a entrenarlo.

source: Since PyMC is structural, we can show our model as a directed acyclic graph (DAG). This graph helps us see how the parameters and variables relate to each other and understand our decisions in the modeling process.
es: Dado que PyMC es estructural, podemos representar nuestro modelo como un grafo acíclico dirigido (DAG). Este grafo nos ayuda a ver cómo se relacionan los parámetros y las variables entre sí y a comprender nuestras decisiones en el proceso de modelado.

source: We can use the `model_to_graphviz` function to create this visual representation.
es: Podemos utilizar la función `model_to_graphviz` para crear esta representación visual.

source: Our DAG is quite simple. It includes our channels, which have two dimensions: date and channel. It also has an intercept variable that captures baseline sales or revenue, which are factors outside of our control, and a term to reflect random variance.
es: Nuestro DAG es bastante simple. Incluye nuestros canales, que tienen dos dimensiones: fecha y canal. También tiene una variable de intercepción que captura las ventas o ingresos base, que son factores fuera de nuestro control, y un término para reflejar la variación aleatoria.

source: In simpler terms, we can express the underlying function of this media mix model as:
es: En términos más simples, podemos expresar la función subyacente de este modelo de mezcla de medios como:

source: Here:
es: Aquí:

source: $\mu$ represents the predicted outcome variable (like sales or revenue) based on the combined effects of our input variables.
es: $\mu$ representa la variable de resultado predicha (como ventas o ingresos) basada en los efectos combinados de nuestras variables de entrada.

source: $\beta_0$ is the coefficient for the baseline variable.
es: $\beta_0$ es el coeficiente para la variable base.

source: $m(\text{x1}, \theta_{\text{x1}})$ and $m(\text{x2}, \theta_{\text{x2}})$ are non-linear transformations of $x1$ and $x2$ that capture their varying impacts.
es: $m(\text{x1}, \theta_{\text{x1}})$ y $m(\text{x2}, \theta_{\text{x2}})$ son transformaciones no lineales de $x1$ y $x2$ que capturan sus impactos variables.

source: Based on this, we think this function will help us understand the impact of $x1$ and $x2$. Thus, we can outline the causal DAG we believe is correct.
es: Basado en esto, creemos que esta función nos ayudará a entender el impacto de $x1$ y $x2$. Así, podemos esbozar el DAG causal que creemos que es correcto.

source: How can we infer this DAG from our current model?
es: ¿Cómo podemos inferir este DAG de nuestro modelo actual?

source: During the development of our model, we established a specific structure and flow for our data. We concluded that the impacts of our channels operate independently of each other. Moreover, we determined that if any component of our ecosystem is missing, its influence will be accounted for by the baseline term due to this equation. As you can see, even by adopting this basic model, we are making significant assumptions.
es: Durante el desarrollo de nuestro modelo, establecimos una estructura y un flujo específicos para nuestros datos. Concluimos que los impactos de nuestros canales operan de manera independiente entre sí. Además, determinamos que si falta algún componente de nuestro ecosistema, su influencia será contabilizada por el término base debido a esta ecuación. Como puede ver, incluso al adoptar este modelo básico, estamos haciendo suposiciones significativas.

source: On one hand, you are assuming that the impact is not linear by applying these transformations, and you are suggesting that the impact is positive and that there may be a maximum delay of a certain number of days.
es: Por un lado, usted está asumiendo que el impacto no es lineal al aplicar estas transformaciones, y está sugiriendo que el impacto es positivo y que puede haber un retraso máximo de un cierto número de días.

source: You've even defined the direction of your relationships. By defining these relationships and assuming no direct causal connections between our variables, we can conclude that, if the nature of their relationship is accurately represented by the provided equation, then by controlling the relevant channels, we could uncover their true effects.
es: Incluso has definido la dirección de tus relaciones. Al definir estas relaciones y asumir que no hay conexiones causales directas entre nuestras variables, podemos concluir que, si la naturaleza de su relación está representada con precisión por la ecuación proporcionada, entonces al controlar los canales relevantes, podríamos descubrir sus verdaderos efectos.

source: This leads us to which causal DAG we assume is correct, based on our previous assumptions. If you recognize this process, congratulations! You've created a generative model or Structural Causal Model, with a Structural Causal Equation, using PyMC-marketing.
es: Esto nos lleva a cuál DAG causal asumimos que es correcto, basado en nuestras suposiciones anteriores. Si reconoces este proceso, ¡felicitaciones! Has creado un modelo generativo o Modelo Causal Estructural, con una Ecuación Causal Estructural, utilizando PyMC-marketing.

source: Note: As you can see, based on our assumptions and the variables we included, we can backtrack and infer the causal DAG we are inherently assuming. This backtracking process can be using and formalize on causal discovery algorithms to automatically infer the several causal DAGs based on how our regression model and their estimates respond to the data.
es: Nota: Como puede ver, basándonos en nuestras suposiciones y las variables que incluimos, podemos retroceder e inferir el DAG causal que estamos asumiendo inherentemente. Este proceso de retroceso puede ser utilizado y formalizado en algoritmos de descubrimiento causal para inferir automáticamente los varios DAG causales en función de cómo nuestro modelo de regresión y sus estimaciones responden a los datos.

source: However, this Causal DAG does not depict the true Causal DAG. Since our PyMC model is structural and causal, we must ask: *What happens if I create a model with a different causal structure than the real one?*
es: Sin embargo, este DAG causal no representa el verdadero DAG causal. Dado que nuestro modelo PyMC es estructural y causal, debemos preguntar: *¿Qué sucede si creo un modelo con una estructura causal diferente a la real?*

source: Because all PyMC models are generative models, they are able to "talk" about the causal relationships that are present in the data generating process. If we have a model that is not consistent with the true causal relationships, the model will fail during the exploration of the parameter space.
es: Porque todos los modelos de PyMC son modelos generativos, son capaces de "hablar" sobre las relaciones causales que están presentes en el proceso de generación de datos. Si tenemos un modelo que no es consistente con las verdaderas relaciones causales, el modelo fallará durante la exploración del espacio de parámetros.

source: For example, if you assume that variable A causes variable B (i.e., A -> B ), but in reality, B causes A or they are confounded by an unobserved variable, your model’s structure misrepresents the actual relationships. This misalignment creates inconsistencies between the model and the data, resulting in a posterior distribution that is challenging for the sampler to explore. The posterior may exhibit pathological features such as multimodality, strong correlations between parameters, or regions of high curvature.
es: Por ejemplo, si asume que la variable A causa la variable B (es decir, A -> B), pero en realidad, B causa A o están confundidas por una variable no observada, la estructura de su modelo representa incorrectamente las relaciones reales. Este desajuste crea inconsistencias entre el modelo y los datos, lo que resulta en una distribución posterior que es difícil de explorar para el muestreador. La posterior puede exhibir características patológicas como multimodalidad, fuertes correlaciones entre parámetros o regiones de alta curvatura.

source: A model like this will get divergencies, because these occur when the numerical integrator used in Hamiltonian Monte Carlo (HMC) cannot accurately simulate the trajectory through the parameter space, often due to steep gradients or discontinuities in the posterior. If you think about it, incorrect causal assumptions may force the sampler into incompatible regions of the parameter space, causing the numerical integration to fail.
es: Un modelo como este presentará divergencias, porque estas ocurren cuando el integrador numérico utilizado en el muestreo de Monte Carlo Hamiltoniano (HMC) no puede simular con precisión la trayectoria a través del espacio de parámetros, a menudo debido a gradientes pronunciados o discontinuidades en el posterior. Si lo piensas, suposiciones causales incorrectas pueden forzar al muestreador a entrar en regiones incompatibles del espacio de parámetros, lo que provoca que la integración numérica falle.

source: When we evaluate time series generative models, particulary bayesian models, we should always evaluate models with additional metrics on top of the pure fit metrics, such as divergences, rhat, ess, etc.
es: Cuando evaluamos modelos generativos de series temporales, particularmente modelos bayesianos, siempre debemos evaluar los modelos con métricas adicionales además de las métricas de ajuste puro, como divergencias, rhat, ess, etc.

source: Lets observe the fit of our current model 👀
es: Observemos el ajuste de nuestro modelo actual 👀

source: Great, our model looks amazing! At first glance, our model evaluation appears quite satisfactory. The $R^2$ value is decent, and the uncertainty in the credible intervals is manageable.
es: Genial, ¡nuestro modelo se ve increíble! A primera vista, la evaluación de nuestro modelo parece bastante satisfactoria. El valor de $R^2$ es decente y la incertidumbre en los intervalos creíbles es manejable.

source: However, the pressing question remains: are we truly capturing the underlying causal signals?
es: Sin embargo, la pregunta apremiante sigue siendo: ¿estamos realmente capturando las señales causales subyacentes?

source: Our model struggles to accurately capture the true causal effect of media variables, suggesting it may be misspecified.
es: Nuestro modelo tiene dificultades para capturar con precisión el verdadero efecto causal de las variables mediáticas, lo que sugiere que puede estar mal especificado.

source: In this context, although we can use the true model to compare the actual effects with the model's recovered effects, real-life situations often lack this clarity. Therefore, we need methods to identify and compare the recovered effects with the true ones.
es: En este contexto, aunque podemos utilizar el modelo verdadero para comparar los efectos reales con los efectos recuperados del modelo, las situaciones de la vida real a menudo carecen de esta claridad. Por lo tanto, necesitamos métodos para identificar y comparar los efectos recuperados con los verdaderos.

source: This is where **CausalPy** is useful. It enables the creation of quasi-experiments to determine the causal impact of media variables, allowing for comparison between our model's results and those from these experiments. You can learn more about [CausalPy here](https://causalpy.readthedocs.io/en/stable/).
es: Este es el lugar donde **CausalPy** resulta útil. Permite la creación de cuasi-experimentos para determinar el impacto causal de las variables mediáticas, lo que permite la comparación entre los resultados de nuestro modelo y los de estos experimentos. Puede aprender más sobre [CausalPy aquí](https://causalpy.readthedocs.io/en/stable/).

source: Utilizing Causal Identification
es: Utilizando la Identificación Causal

source: Instead of randomly adding variables to our regression, we should use a causal framework to build our model. A language which help us to translate our ideas and hypothesis into a graphical representation which we can interrogate. Doing so, we can understant if we are overlooking an important variable.
es: En lugar de agregar variables al azar a nuestra regresión, deberíamos utilizar un marco causal para construir nuestro modelo. Un lenguaje que nos ayude a traducir nuestras ideas e hipótesis en una representación gráfica que podamos interrogar. Al hacerlo, podemos entender si estamos pasando por alto una variable importante.

source: We’ve added a new column called `outcome_node` for our target variable and defined the `dag` parameter as a representation of the causal Directed Acyclic Graph (DAG). We included `holiday_signal` as a control variable in our model because it significantly influences the target variable and may have been missed before. After ran that, we received a warning that channel columns are being treated as default treatment variables, indicating they are our focus for estimating the true causal impact (default behavior).
es: Hemos añadido una nueva columna llamada `outcome_node` para nuestra variable objetivo y definido el parámetro `dag` como una representación del Grafo Acíclico Dirigido (DAG) causal. Incluimos `holiday_signal` como una variable de control en nuestro modelo porque influye significativamente en la variable objetivo y puede haber sido pasada por alto anteriormente. Después de ejecutar eso, recibimos una advertencia de que las columnas de canal se están tratando como variables de tratamiento por defecto, lo que indica que son nuestro enfoque para estimar el verdadero impacto causal (comportamiento por defecto).

source: Now, we can examine the adjustment set of variables needed to reveal the true causal effect of our treatment variables.
es: Ahora, podemos examinar el conjunto de variables de ajuste necesarias para revelar el verdadero efecto causal de nuestras variables de tratamiento.

source: Great, we got a new piece of important information. We are missing the `holiday_signal` variable in the adjustment set, meaning, to find the true causal effect of `x1` and `x2`, we don’t need to control for `holiday_signal`. So, why we could not recover the true causal effect of `x1` and `x2` before? Perhaps the specified DAG was not true, meaning its possible that the relationship between `x1` and `x2` is confounded by the `holiday_signal` variable?
es: Excelente, hemos obtenido una nueva pieza de información importante. Nos falta la variable `holiday_signal` en el conjunto de ajustes, lo que significa que, para encontrar el verdadero efecto causal de `x1` y `x2`, no necesitamos controlar por `holiday_signal`. Entonces, ¿por qué no pudimos recuperar el verdadero efecto causal de `x1` y `x2` antes? Quizás el DAG especificado no era verdadero, lo que significa que es posible que la relación entre `x1` y `x2` esté confundida por la variable `holiday_signal`?

source: Lets see if this is the case.
es: Veamos si este es el caso.

source: Now, with a new adjustment set, we see that if we do not control for `holiday_signal`, we cannot identify the true causal effect of `x1` and `x2` since they are influenced by this variable. This looks more close to what happened before, after compare the true contribution of `x1` and `x2` with the recovered contribution.
es: Ahora, con un nuevo conjunto de ajustes, vemos que si no controlamos por `holiday_signal`, no podemos identificar el verdadero efecto causal de `x1` y `x2`, ya que están influenciados por esta variable. Esto se asemeja más a lo que ocurrió antes, después de comparar la verdadera contribución de `x1` y `x2` con la contribución recuperada.

source: Note: We define this adjustment set using the `CausalGraphModel` class. We rely on `dowhy` to help us identify the adjustment set. You can learn more about `dowhy` [here](https://www.pywhy.org/dowhy/v0.9.1/).
es: Nota: Definimos este conjunto de ajuste utilizando la clase `CausalGraphModel`. Dependemos de `dowhy` para ayudarnos a identificar el conjunto de ajuste. Puede aprender más sobre `dowhy` [aquí](https://www.pywhy.org/dowhy/v0.9.1/).

source: We use the `backdoor` criterion to choose the adjustment set. This means we look for variables that, when we control for them, block all the backdoor paths between `x1` and `x2`. These paths can create false links between the treatment and outcome variables. If we don’t address these paths, our causal estimates may be off. To understand the causal effect accurately, we need to block these paths by adjusting for the confounding variables. You can read more about the backdoor criterion in Aleksander Molak's book [here](https://www.amazon.com/Causal-Inference-Discovery-Python-learning/dp/1804612987).
es: Utilizamos el criterio `backdoor` para elegir el conjunto de ajuste. Esto significa que buscamos variables que, al controlarlas, bloquean todos los caminos de retroceso entre `x1` y `x2`. Estos caminos pueden crear vínculos falsos entre las variables de tratamiento y resultado. Si no abordamos estos caminos, nuestras estimaciones causales pueden estar equivocadas. Para entender el efecto causal con precisión, necesitamos bloquear estos caminos ajustando las variables de confusión. Puede leer más sobre el criterio backdoor en el libro de Aleksander Molak [aquí](https://www.amazon.com/Causal-Inference-Discovery-Python-learning/dp/1804612987).

source: Now, let’s say we create a new variable called `holiday_signal` to control for the holiday effect. Adding this variable to our dataset should help us find the true causal effect of `x1` and `x2`, right?
es: Ahora, digamos que creamos una nueva variable llamada `holiday_signal` para controlar el efecto de las festividades. Agregar esta variable a nuestro conjunto de datos debería ayudarnos a encontrar el verdadero efecto causal de `x1` y `x2`, ¿verdad?
