Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_roas.po
Languages: es

source: In the simulation [Media Mix Model and Experimental Calibration: A Simulation Study](https://juanitorduz.github.io/mmm_roas/), the author included these "true" values into the prior for the ROAS.
es: En la simulación [Media Mix Model and Experimental Calibration: A Simulation Study](https://juanitorduz.github.io/mmm_roas/), el autor incluyó estos valores "verdaderos" en la prior para el ROAS.

source: Now, we fit the model with the lift test measurements.
es: Ahora, ajustamos el modelo con las mediciones de la prueba de elevación.

source: Again, we verify that we do not have divergent transitions.
es: Nuevamente, verificamos que no tenemos transiciones divergentes.

source: Let's plot the components contributions as we did before.
es: Vamos a trazar las contribuciones de los componentes como lo hicimos antes.

source: As before, we have recovered the non-linear trend component and the yearly seasonality.
es: Como antes, hemos recuperado el componente de tendencia no lineal y la estacionalidad anual.

source: Now, let's compute the channel contributions to the true ones.
es: Ahora, calculemos las contribuciones del canal a las verdaderas.

source: The contributions look much better and they are very close to the ones of the original blog post! Hence, **these two approaches are very similar**. However note that the PyMC-Marketing approach is more flexible as it allows to enrich the estimates with more test and different media spends to have a better understanding of the saturation effect.
es: Las contribuciones se ven mucho mejor y están muy cerca de las del artículo original del blog. Por lo tanto, **estos dos enfoques son muy similares**. Sin embargo, tenga en cuenta que el enfoque de PyMC-Marketing es más flexible, ya que permite enriquecer las estimaciones con más pruebas y diferentes gastos en medios para tener una mejor comprensión del efecto de saturación.

source: Finally, let's compute the ROAS for the `x1` and `x2` channels.
es: Finalmente, calculemos el ROAS para los canales `x1` y `x2`.

source: The estimates are very very close to the true ROAS! We do get from the model that `x2` is more effective than `x1`, which is aligned with the lift test results!
es: Las estimaciones están muy, muy cerca del verdadero ROAS. Obtenemos del modelo que `x2` es más efectivo que `x1`, lo cual está alineado con los resultados de la prueba de aumento.

source: Conclusion
es: Conclusión

source: In this notebook, we have seen a concrete example of how media mix models can provide bias estimates when we have unobserved confounders in the model specification. Ideally, we'd add the confounder, but in the absence of that, we need to provide a reality anchor to the model to have meaningful estimates. We have shown that the PyMC-Marketing approach of adding lift test measurements to the model is very similar to the one proposed in the paper [Media Mix Model Calibration With Bayesian Priors](https://research.google/pubs/media-mix-model-calibration-with-bayesian-priors/) and the blog post [Media Mix Model and Experimental Calibration: A Simulation Study](https://juanitorduz.github.io/mmm_roas/). However, the PyMC-Marketing approach is more flexible as it allows enriching the estimates with more lift tests and different media spending to better understand the saturation effect. We have also seen why it is essential to include the lift test measurements in the model to account for the unobserved confounders and better understand the saturation effect.
es: En este cuaderno, hemos visto un ejemplo concreto de cómo los modelos de mezcla de medios pueden proporcionar estimaciones de sesgo cuando tenemos confusores no observados en la especificación del modelo. Idealmente, agregaríamos el confusor, pero en ausencia de eso, necesitamos proporcionar un ancla de realidad al modelo para obtener estimaciones significativas. Hemos demostrado que el enfoque de PyMC-Marketing de agregar mediciones de pruebas de elevación al modelo es muy similar al propuesto en el artículo [Calibración del Modelo de Mezcla de Medios con Priors Bayesianos](https://research.google/pubs/media-mix-model-calibration-with-bayesian-priors/) y en la publicación del blog [Modelo de Mezcla de Medios y Calibración Experimental: Un Estudio de Simulación](https://juanitorduz.github.io/mmm_roas/). Sin embargo, el enfoque de PyMC-Marketing es más flexible, ya que permite enriquecer las estimaciones con más pruebas de elevación y diferentes gastos en medios para comprender mejor el efecto de saturación. También hemos visto por qué es esencial incluir las mediciones de pruebas de elevación en el modelo para tener en cuenta los confusores no observados y comprender mejor el efecto de saturación.
