Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_case_study.po
Languages: es

source: There is less variability or complexity in the test set data.
es: Hay menos variabilidad o complejidad en los datos del conjunto de prueba.

source: The test set has fewer points, which could affect the CRPS calculation comparison.
es: El conjunto de prueba tiene menos puntos, lo que podría afectar la comparación del cálculo de CRPS.

source: In order to have a better comparison we should look into the time slice cross validation results as in the {ref}`mmm_time_slice_cross_validation` notebook.
es: Para tener una mejor comparación, deberíamos consultar los resultados de validación cruzada por intervalo de tiempo como en el cuaderno {ref}`mmm_time_slice_cross_validation`.

source: Next, we look into the out-of-sample channel contributions.
es: A continuación, examinamos las contribuciones de canales fuera de muestra.

source: We do not have the *true* values contributions to compare against because this is what we are trying to estimate on the first place. Nevertheless, we can still do the time slice cross validation at the channel level to analyze the stability of the out-of-sample predictions and media parameters (adstock and saturation).
es: No tenemos para comparar las contribuciones de los valores *verdaderos* porque esto es lo que estamos tratando de estimar en primer lugar. Sin embargo, todavía podemos hacer la validación cruzada por intervalo de tiempo a nivel de canal para analizar la estabilidad de las predicciones fuera de muestra y los parámetros de medios (adstock y saturación).

source: In this las section we explain how to use PyMC-Marketing to perform optimization of the media budget allocation. The main idea is to use the response curves to optimize the spend. For more details see {ref}`mmm_budget_allocation_example` notebook.
es: En esta última sección explicamos cómo usar PyMC-Marketing para realizar la optimización de la asignación del presupuesto de medios. La idea principal es usar las curvas de respuesta para optimizar el gasto. Para más detalles, consulte el cuaderno {ref}`mmm_budget_allocation_example`.

source: For this example, let us assume we want to re-allocate the budget of the tests set. The PyMC-Marketing MMM optimizer would assume we will equally allocate the budget to all channels over the next `num_periods` periods. Hence, when we specify the `budget` variable we are actually specifying the weekly budget (in this case). Therefore, it is important to understand the past average weekly spend per channel:
es: Para este ejemplo, supongamos que queremos reasignar el presupuesto del conjunto de pruebas. El optimizador MMM de PyMC-Marketing asumiría que asignaremos equitativamente el presupuesto a todos los canales durante los próximos `num_periods` períodos. Por lo tanto, cuando especificamos la variable `budget`, en realidad estamos especificando el presupuesto semanal (en este caso). Por lo tanto, es importante entender el gasto semanal promedio pasado por canal:

source: Let's plot the average weekly spend per channel for the *actual* test set.
es: Vamos a graficar el gasto promedio semanal por canal para el conjunto de prueba *real*.

source: Observe that the spend distribution on the test set is considerably different from the train set. When planning future spends, this is usually the case as the team might be exploring new investment opportunities. For example that in the test set we have on average more spend on `Online Display` while less spend on `Insert`, both with high ROAS from the training data.
es: Observe que la distribución del gasto en el conjunto de prueba es considerablemente diferente del conjunto de entrenamiento. Al planificar gastos futuros, este suele ser el caso, ya que el equipo podría estar explorando nuevas oportunidades de inversión. Por ejemplo, en el conjunto de prueba tenemos en promedio más gasto en `Online Display` y menos gasto en `Insert`, ambos con alto ROAS de los datos de entrenamiento.

source: Next, let's talk about the variability of the allocation. Even if the model finds `Insert` as the most efficient channel, strategically is very hard to simply put $100\%$ of the budget into this channel. A better strategy, which generally plays well with the stakeholders, is to allow a custom degree of flexibility and some upper and lower bounds for each channel budget.
es: A continuación, hablemos sobre la variabilidad de la asignación. Incluso si el modelo encuentra que `Insert` es el canal más eficiente, estratégicamente es muy difícil simplemente poner $100\%$ del presupuesto en este canal. Una mejor estrategia, que generalmente juega bien con las partes interesadas, es permitir un grado de flexibilidad personalizado y algunos límites superiores e inferiores para cada presupuesto de canal.

source: For example, we will allow a $50\%$ difference on the past average weekly spend for each channel.
es: Por ejemplo, permitiremos una diferencia del $50\%$ sobre el gasto semanal promedio pasado para cada canal.

source: Now we are ready to pass all this business requirements to the optimizer.
es: Ahora estamos listos para pasar todos estos requisitos de negocio al optimizador.

source: Let's visualize the results.
es: Vamos a visualizar los resultados.

source: We verify that the sum of the budget allocation is the same as the initial budget.
es: Verificamos que la suma de la asignación del presupuesto sea la misma que el presupuesto inicial.

source: The first thing we notice is how the spend on `Direct Mail` has been reduced. This is consistent with the previous findings that this channel is not very efficient. The spends has been distributed more evenly across the other channels. Interestingly, we see how the spend on `Online Display` is slightly reduced. This might be explained by the fact that this channel already had an average spend increase from the training to the test set.
es: Lo primero que notamos es cómo se ha reducido el gasto en `Direct Mail`. Esto es consistente con los hallazgos previos de que este canal no es muy eficiente. El gasto se ha distribuido más uniformemente entre los otros canales. Curiosamente, vemos cómo se reduce ligeramente el gasto en `Online Display`. Esto podría explicarse por el hecho de que este canal ya había tenido un aumento promedio de gasto desde el entrenamiento hasta el conjunto de prueba.

source: Next, we can look into the expected channel contributions with this new budget allocation over time.
es: A continuación, podemos analizar las contribuciones esperadas del canal con esta nueva asignación de presupuesto a lo largo del tiempo.

source: Observe that uncertainty increases given the new level of spending. For example, historically spending for `Online Display` was in between $200$K to $250$K and we are now recommending around $350$K. The fact that this spend level has not been reached before is refelected in the increased uncertainty (yellow band).
es: Observe que la incertidumbre aumenta dado el nuevo nivel de gasto. Por ejemplo, el gasto histórico en `Online Display` fue entre $200$K y $250$K y ahora estamos recomendando alrededor de $350$K. El hecho de que este nivel de gasto no se haya alcanzado antes se refleja en la mayor incertidumbre (banda amarilla).

source: We can also obtain the average expected contributions per channel with the new budget allocation.
es: También podemos obtener las contribuciones esperadas promedio por canal con la nueva asignación de presupuesto.

source: Lastly, we want to compare the optimized budget allocation with the initial (naive) allocation. We compare this at two levels:
es: Por último, queremos comparar la asignación del presupuesto optimizada con la asignación inicial (ingenua). Comparamos esto en dos niveles:

source: Channel contributions: We compute the difference between the optimized and naive channel contributions from the posterior predictive samples.
es: Contribuciones del canal: Calculamos la diferencia entre las contribuciones del canal optimizadas e ingenuas a partir de las muestras predictivas posteriores.

source: Total Sales: We compute the difference between the optimized and naive total sales from the posterior predictive samples. In this case we include the intercept and seasonality, but we se the control variables to zero as in many cases we do not have them for the future.
es: Ventas Totales: Calculamos la diferencia entre las ventas totales optimizadas e ingenuas a partir de las muestras predictivas posteriores. En este caso, incluimos el intercepto y la estacionalidad, pero dejamos las variables de control en cero, ya que en muchos casos no las tenemos para el futuro.

source: Channel Contribution Comparison
es: Comparación de Contribuciones de Canal

source: The first thing we need to do is to compute the naive channel contributions for the test period. We do this by simply setting these values as uniform across the test period and then using the model (trained on the training period) to compute the expected channel contributions.
es: Lo primero que necesitamos hacer es calcular las contribuciones de canal ingenuas para el periodo de prueba. Hacemos esto simplemente estableciendo estos valores como uniformes a lo largo del periodo de prueba y luego usando el modelo (entrenado en el periodo de entrenamiento) para calcular las contribuciones de canal esperadas.

source: Let's visualize the optimized and naive channel contributions.
es: Vamos a visualizar las contribuciones de canal optimizadas y no optimizadas.

source: We see indeed that the optimized allocation strategy is more efficient regarding the aggregated channel contributions. This is exactly what we were looking for!
es: Vemos que, de hecho, la estrategia de asignación optimizada es más eficiente en cuanto a las contribuciones agregadas de los canales. ¡Esto es exactamente lo que estábamos buscando!

source: We can quantify the percentage improvement of the optimized allocation by comparing the two posterior distributions aggregated over time.
es: Podemos cuantificar el porcentaje de mejora de la asignación optimizada comparando las dos distribuciones posteriores agregadas a lo largo del tiempo.

source: Concretely, we see an approximately $10\%$ increase in the aggregated channel contributions. This could result in a significant increase in monetary value!
es: Concretamente, vemos un aumento de aproximadamente $10\%$ en las contribuciones agregadas de los canales. ¡Esto podría resultar en un aumento significativo en valor monetario!

source: The orange line and corresponding range compares these posterior samples to the reference value of zero. Hence, we have a probability of more than $80\%$ that the optimized allocation will perform better than the initial allocation.
es: La línea naranja y el rango correspondiente comparan estas muestras posteriores con el valor de referencia de cero. Por lo tanto, tenemos una probabilidad de más del $80\%$ de que la asignación optimizada funcione mejor que la asignación inicial.

source: Sales Comparison
es: Comparación de Ventas

source: Next, we want to compare the optimized and naive total sales. The strategy is the same as in the case above. The only difference is that we add additional variables like seasonality and baseline (intercept). As mentioned above, we set the control variables to zero for the sake of comparison. This is what is done in the {meth}`~pymc_marketing.mmm.mmm.MMM.allocate_budget_to_maximize_response` method.
es: A continuación, queremos comparar las ventas totales optimizadas e ingenuas. La estrategia es la misma que en el caso anterior. La única diferencia es que añadimos variables adicionales como estacionalidad y línea base (intercepto). Como se mencionó anteriormente, establecemos las variables de control en cero para efectos de comparación. Esto es lo que se hace en el método {meth}`~pymc_marketing.mmm.mmm.MMM.allocate_budget_to_maximize_response`.

source: At the level of total sales, in this case the difference is negligible as the baseline and seasonality (which are the same in both cases) explain most of the variance as the average weekly media spend in this last period is much smaller as in the training set.
es: A nivel de ventas totales, en este caso la diferencia es insignificante ya que la línea base y la estacionalidad (que son iguales en ambos casos) explican la mayor parte de la varianza, ya que el gasto medio semanal en medios en este último período es mucho menor que en el conjunto de entrenamiento.

source: In this case we see that when we compare the posterior samples of the uplift to the reference value of zero we do not find any difference. This should not be discouraging as we did see a $10\%$ increase in the aggregated (over time) channel contributions. This can translate to a lot of money! There is no discrepancy on the results. What we are seeing is that the constrained optimization problem where we are just allowed, because of business requirements (which is very common for many marketing teams), to change the budget up to $60\%$ we improved the channel contributions significantly but not at the same order of magnitude of the other model components.
es: En este caso vemos que cuando comparamos las muestras posteriores del crecimiento con el valor de referencia de cero no encontramos ninguna diferencia. Esto no debería ser desalentador ya que vimos un aumento del $10\%$ en las contribuciones de canal agregadas (a lo largo del tiempo). ¡Esto puede traducirse en mucho dinero! No hay discrepancia en los resultados. Lo que estamos viendo es que el problema de optimización restringida en el que solo se nos permite, debido a requisitos comerciales (que es muy común para muchos equipos de marketing), cambiar el presupuesto hasta un $60\%$ mejoramos las contribuciones del canal significativamente, pero no en el mismo orden de magnitud que los otros componentes del modelo.

source: Conclusion
es: Conclusión

source: This case study demonstrated how to leverage PyMC-Marketing's Media Mix Modeling capabilities to gain actionable insights into marketing effectiveness and optimize budget allocation. We walked through the entire process from data preparation and exploratory analysis to model fitting, diagnostics, and budget optimization. The model provided valuable insights into the effectiveness of different marketing channels, their saturation effects, and return on ad spend. We were able to use these insights to propose an optimized budget allocation that aims to maximize sales while respecting business constraints.
es: Este caso de estudio demostró cómo aprovechar las capacidades de Modelado de Mezcla de Medios de PyMC-Marketing para obtener ideas accionables sobre la efectividad del marketing y optimizar la asignación de presupuesto. Recorrimos todo el proceso desde la preparación de datos y el análisis exploratorio hasta el ajuste del modelo, diagnósticos y optimización del presupuesto. El modelo proporcionó valiosas ideas sobre la efectividad de diferentes canales de marketing, sus efectos de saturación y el retorno sobre el gasto publicitario. Pudimos usar estas ideas para proponer una asignación de presupuesto optimizada que busca maximizar las ventas respetando las restricciones comerciales.

source: Next Steps
es: Próximos Pasos

source: Stakeholder engagement: Present findings to key stakeholders, focusing on actionable insights and potential business impact. Understand their feedback and iterate.
es: Compromiso con las partes interesadas: presenta hallazgos a las partes interesadas clave, enfocándote en ideas accionables y el impacto potencial en el negocio. Entiende sus comentarios y repite.

source: Scenario planning: Use the model to simulate various budget scenarios and market conditions to support strategic decision-making.
es: Planificación de escenarios: usa el modelo para simular varios escenarios presupuestarios y condiciones de mercado para apoyar la toma de decisiones estratégicas.

source: Integration with other tools: Explore ways to integrate the MMM insights with other marketing analytics tools and processes for a more holistic view of marketing performance.
es: Integración con otras herramientas: explora formas de integrar las ideas de MMM con otras herramientas y procesos analíticos de marketing para una vista más holística del rendimiento del marketing.

source: Time-slice cross-validation: Implement a more robust validation strategy to ensure model stability and performance over time (see {ref}`mmm_time_slice_cross_validation`).
es: Validación cruzada por intervalos de tiempo: implementa una estrategia de validación más robusta para asegurar la estabilidad y el rendimiento del modelo con el tiempo (ver {ref}`mmm_time_slice_cross_validation`).

source: Iterate and refine: This analysis represents a first iteration. Future iterations could incorporate:
es: Iterar y refinar: Este análisis representa una primera iteración. Las iteraciones futuras podrían incorporar:

source: Lift test data to better calibrate the model (see {ref}`mmm_lift_test`)
es: Datos de prueba de elevación para calibrar mejor el modelo (ver {ref}`mmm_lift_test`).

source: More granular data (e.g., daily instead of weekly)
es: Datos más granulares (por ejemplo, diarios en lugar de semanales).

source: Additional variables like competitor actions or macroeconomic factors
es: Variables adicionales como acciones de la competencia o factores macroeconómicos.

source: A/B (or Geo) testing: Design experiments to test the model's recommendations and validate its predictions in the real world.
es: Pruebas A/B (o Geo): diseña experimentos para probar las recomendaciones del modelo y validar sus predicciones en el mundo real.

source: Regular updates: Establish a process for regularly updating the model with new data to keep insights current.
es: Actualizaciones regulares: establece un proceso para actualizar regularmente el modelo con nuevos datos para mantener las ideas actualizadas.

source: Explore advanced features: Investigate other PyMC-Marketing capabilities, such as incorporating time varying parameters (see and {ref}`mmm_tv_intercept` {ref}`(mmm_time_varying_media_example`) and custom models like hierarchical levels or more complex seasonality patterns, to further refine the model (see {ref}`mmm_components`).
es: Explora características avanzadas: investiga otras capacidades de PyMC-Marketing, como la incorporación de parámetros variables en el tiempo (ver y {ref}`mmm_tv_intercept` {ref}`(mmm_time_varying_media_example`) y modelos personalizados como niveles jerárquicos o patrones de estacionalidad más complejos, para refinar aún más el modelo (ver {ref}`mmm_components`).
