Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_multi_objective_optimization.po
Languages: es

source: Multi-Objective optimization with PyMC-Marketing
es: { "singular": "Optimización multiobjetivo con PyMC-Marketing", "plural": "Optimización multiobjetivo con PyMC-Marketing" }

source: Have you ever faced the challenge of deciding whether to focus on bringing in new users or keeping the ones you already have? It’s a common dilemma in any growing company. On one hand, acquisition drives visibility, expansion, and excitement. On the other, retention builds loyalty, stability, and long-term value. When resources are limited, choosing where to invest—more ads to attract newcomers or more experiences to keep your current audience engaged—feels like walking a tightrope between short-term gains and lasting growth.
es: { "singular": "¿Alguna vez has enfrentado el desafío de decidir si enfocarte en atraer nuevos usuarios o en mantener a los que ya tienes? Es un dilema común en cualquier empresa en crecimiento. Por un lado, la adquisición impulsa la visibilidad, la expansión y la emoción. Por otro, la retención construye lealtad, estabilidad y valor a largo plazo. Cuando los recursos son limitados, elegir dónde invertir—más anuncios para atraer a los recién llegados o más experiencias para mantener a tu audiencia actual comprometida—se siente como caminar por una cuerda floja entre las ganancias a corto plazo y el crecimiento duradero.", "plural": "¿Alguna vez han enfrentado el desafío de decidir si enfocarse en atraer nuevos usuarios o en mantener a los que ya tienen? Es un dilema común en cualquier empresa en crecimiento. Por un lado, la adquisición impulsa la visibilidad, la expansión y la emoción. Por otro, la retención construye lealtad, estabilidad y valor a largo plazo. Cuando los recursos son limitados, elegir dónde invertir—más anuncios para atraer a los recién llegados o más experiencias para mantener a su audiencia actual comprometida—se siente como caminar por una cuerda floja entre las ganancias a corto plazo y el crecimiento duradero." }

source: This kind of trade-off isn’t unique to marketing. Product teams constantly balance innovation and reliability. Operations managers weigh efficiency against flexibility. Data scientists tune models to maximize accuracy while minimizing bias or computational cost. These are all examples of competing objectives that must coexist within finite resources. Multi-objective optimization provides a systematic framework for navigating these tensions. It allows decision-makers to explore how improving one goal may compromise another, and to find balanced solutions along the Pareto frontier—the set of decisions where no objective can be improved without sacrificing another. In essence, it transforms difficult trade-offs into informed, strategic choices.
es: { "singular": "Este tipo de compensación no es exclusivo del marketing. Los equipos de producto equilibran constantemente la innovación y la fiabilidad. Los gerentes de operaciones sopesan la eficiencia frente a la flexibilidad. Los científicos de datos ajustan modelos para maximizar la precisión mientras minimizan el sesgo o el costo computacional. Todos estos son ejemplos de objetivos en competencia que deben coexistir dentro de recursos finitos. La optimización multiobjetivo proporciona un marco sistemático para navegar estas tensiones. Permite a los tomadores de decisiones explorar cómo mejorar un objetivo puede comprometer otro, y encontrar soluciones equilibradas a lo largo de la frontera de Pareto: el conjunto de decisiones donde ningún objetivo puede ser mejorado sin sacrificar otro. En esencia, transforma difíciles compensaciones en elecciones informadas y estratégicas.", "plural": "Estos tipos de compensaciones no son exclusivos del marketing. Los equipos de producto equilibran constantemente la innovación y la fiabilidad. Los gerentes de operaciones sopesan la eficiencia frente a la flexibilidad. Los científicos de datos ajustan modelos para maximizar la precisión mientras minimizan el sesgo o el costo computacional. Todos estos son ejemplos de objetivos en competencia que deben coexistir dentro de recursos finitos. La optimización multiobjetivo proporciona un marco sistemático para navegar estas tensiones. Permite a los tomadores de decisiones explorar cómo mejorar un objetivo puede comprometer otro, y encontrar soluciones equilibradas a lo largo de la frontera de Pareto: el conjunto de decisiones donde ningún objetivo puede ser mejorado sin sacrificar otro. En esencia, transforma difíciles compensaciones en elecciones informadas y estratégicas." }

source: This notebook explores multi-objective optimization using PyMC and PyMC-Marketing, focusing on the trade-off between acquiring new users and retaining existing ones. It demonstrates how to balance competing objectives and includes practical examples of building and optimizing models (both custom and default) to achieve balanced solutions in marketing scenarios.
es: { "singular": "Este cuaderno explora la optimización multiobjetivo utilizando PyMC y PyMC-Marketing, centrándose en el equilibrio entre adquirir nuevos usuarios y retener a los existentes. Demuestra cómo equilibrar objetivos en competencia e incluye ejemplos prácticos de construcción y optimización de modelos (tanto personalizados como predeterminados) para lograr soluciones equilibradas en escenarios de marketing.", "plural": "Estos cuadernos exploran la optimización multiobjetivo utilizando PyMC y PyMC-Marketing, centrándose en el equilibrio entre adquirir nuevos usuarios y retener a los existentes. Demuestran cómo equilibrar objetivos en competencia e incluyen ejemplos prácticos de construcción y optimización de modelos (tanto personalizados como predeterminados) para lograr soluciones equilibradas en escenarios de marketing." }

source: Import dependencies
es: { "singular": "Importar dependencias", "plural": "Importar dependencias" }

source: Notebook settings
es: { "singular": "Configuración del cuaderno", "plural": "Configuraciones del cuaderno" }

source: Optimizing Custom PyMC Models
es: { "singular": "Optimizando Modelos Personalizados de PyMC", "plural": "Optimizando Modelos Personalizados de PyMC" }

source: First, we'll show some of the under-the-hood functions and how you can apply them to your custom PyMC model.
es: { "singular": { "msgid": "First, we'll show some of the under-the-hood functions and how you can apply them to your custom PyMC model.", "msgstr": "Primero, mostraremos algunas de las funciones internas y cómo puede aplicarlas a su modelo PyMC personalizado." }, "plural": { "msgid": "First, we'll show some of the under-the-hood functions and how you can apply them to your custom PyMC model.", "msgstr": "Primero, mostraremos algunas de las funciones internas y cómo puede aplicarlas a su modelo PyMC personalizado." } }

source: To do so, we first need to generate a simple model and some data.
es: { "singular": "Para ello, primero necesitamos generar un modelo simple y algunos datos.", "plural": "Para ello, primero necesitamos generar modelos simples y algunos datos." }

source: We set the `impressions` variable as a set of independent random walks, each with a specific mean and standard deviation.
es: { "singular": "Establecemos la variable `impressions` como un conjunto de caminatas aleatorias independientes, cada una con una media y una desviación estándar específicas.", "plural": "Establecemos la variable `impressions` como un conjunto de caminatas aleatorias independientes, cada una con una media y una desviación estándar específicas." }

source: Once we have all the data in place, we can consolidate it into a dataframe. This will help us define our model structure, which in this case will depend only on impressions from channels $x1$, $x2$, $x3$, and $x4$.
es: { "singular": "Una vez que tengamos todos los datos en su lugar, podemos consolidarlos en un dataframe. Esto nos ayudará a definir la estructura de nuestro modelo, que en este caso dependerá únicamente de las impresiones de los canales $x1$, $x2$, $x3$ y $x4$.", "plural": "Una vez que tengamos todos los datos en su lugar, podemos consolidarlos en un dataframe. Esto nos ayudará a definir la estructura de nuestros modelos, que en este caso dependerá únicamente de las impresiones de los canales $x1$, $x2$, $x3$ y $x4$." }

source: The initial model constructed in this notebook is a straightforward Bayesian model designed to capture the relationship between input features and a target variable. The model is defined as:
es: { "singular": "El modelo inicial construido en este cuaderno es un modelo bayesiano sencillo diseñado para capturar la relación entre las características de entrada y una variable objetivo. El modelo se define como:", "plural": "Los modelos iniciales construidos en estos cuadernos son modelos bayesianos sencillos diseñados para capturar la relación entre las características de entrada y una variable objetivo. Los modelos se definen como:" }

source: Y \sim f(X, \theta) + \epsilon
es: { "singular": "Y \\sim f(X, \\theta) + \\epsilon", "plural": "Y \\sim f(X, \\theta) + \\epsilon" }

source: Where:
es: { "singular": { "msgid": "Where:", "msgstr": "Dónde:" }, "plural": { "msgid": "Where:", "msgstr": "Dónde:" } }

source: $Y$ is the target variable.
es: { "singular": "$Y$ es la variable objetivo.", "plural": "$Y$ son las variables objetivo." }

source: $X$ represents the input features.
es: { "singular": "$X$ representa la características de entrada.", "plural": "$X$ representan las características de entrada." }

source: $\theta$ denotes the model parameters.
es: { "singular": "$\\theta$ denota los parámetros del modelo.", "plural": "$\\theta$ denota los parámetros del modelo." }

source: $\epsilon$ denotes the base sales, which are not dependent on marketing.
es: { "singular": "$\epsilon$ denota las ventas base, que no dependen del marketing.", "plural": "$\epsilon$ denota las ventas base, que no dependen del marketing." }

source: The function $f(X, \theta)$ is a deterministic transformation of the input features $X$ using the parameters $\theta$, which in this context, is modeled using a Michaelis-Menten saturation function. This function is particularly useful for capturing diminishing returns in marketing scenarios, where the effect of increasing input (e.g., advertising spend) on the output (e.g., sales) eventually plateaus.
es: { "singular": "La función $f(X, \theta)$ es una transformación determinista de las características de entrada $X$ utilizando los parámetros $\theta$, que en este contexto, se modela utilizando una función de saturación de Michaelis-Menten. Esta función es particularmente útil para capturar rendimientos decrecientes en escenarios de marketing, donde el efecto de aumentar la entrada (por ejemplo, el gasto en publicidad) sobre la salida (por ejemplo, las ventas) eventualmente se estabiliza.", "plural": "Las funciones $f(X, \theta)$ son transformaciones deterministas de las características de entrada $X$ utilizando los parámetros $\theta$, que en este contexto, se modelan utilizando funciones de saturación de Michaelis-Menten. Estas funciones son particularmente útiles para capturar rendimientos decrecientes en escenarios de marketing, donde el efecto de aumentar la entrada (por ejemplo, el gasto en publicidad) sobre la salida (por ejemplo, las ventas) eventualmente se estabiliza." }

source: Since the model is a simple saturation function, we only need to define priors for its parameters, the intercept, and the aleatoric uncertainty.
es: { "singular": "Dado que el modelo es una función de saturación simple, solo necesitamos definir priors para sus parámetros, la intersección y la incertidumbre aleatoria.", "plural": "Dado que los modelos son funciones de saturación simples, solo necesitamos definir priors para sus parámetros, las intersecciones y las incertidumbres aleatorias." }

source: With all our priors defined, we can create the model structure. Both models will share the same structure but will have different target variables. (We can create a function to generate the same base model based on certain inputs).
es: { "singular": "Con todos nuestros priors definidos, podemos crear la estructura del modelo. Ambos modelos compartirán la misma estructura pero tendrán diferentes variables objetivo. (Podemos crear una función para generar el mismo modelo base basado en ciertas entradas).", "plural": "Con todos nuestros priors definidos, podemos crear la estructura del modelo. Ambos modelos compartirán la misma estructura pero tendrán diferentes variables objetivo. (Podemos crear una función para generar el mismo modelo base basado en ciertas entradas)." }

source: Let's take a look at our base model
es: { "singular": "Echemos un vistazo a nuestro modelo base", "plural": "Echemos un vistazo a nuestros modelos base" }

source: Using this simple structure, we can now generate the target variable based on fixed parameters. To do so, we'll use the `pm.do` function from PyMC. You can [read more about it here](https://www.pymc.io/projects/examples/en/latest/causal_inference/interventional_distribution.html).
es: { "singular": "Usando esta estructura simple, ahora podemos generar la variable objetivo basada en parámetros fijos. Para ello, utilizaremos la función `pm.do` de PyMC. Puedes [leer más sobre ello aquí](https://www.pymc.io/projects/examples/en/latest/causal_inference/interventional_distribution.html).", "plural": "Usando esta estructura simple, ahora podemos generar las variables objetivo basadas en parámetros fijos. Para ello, utilizaremos la función `pm.do` de PyMC. Puedes [leer más sobre ello aquí](https://www.pymc.io/projects/examples/en/latest/causal_inference/interventional_distribution.html)." }

source: We'll set a grid of true parameters (the ones the model should be able to recover) for our model's internal functions.
es: { "singular": "Estableceremos una cuadrícula de parámetros verdaderos (los que el modelo debería ser capaz de recuperar) para las funciones internas de nuestro modelo.", "plural": "Estableceremos una cuadrícula de parámetros verdaderos (los que el modelo debería ser capaz de recuperar) para las funciones internas de nuestros modelos." }

source: Now that our **true models** are defined, we can draw from the fixed parameters to generate data. This will help us create a dataset with two target variables. Both are dependent on the same inputs, but while they are generated similarly, their weights are different.
es: { "singular": "Ahora que nuestros **modelos verdaderos** están definidos, podemos extraer de los parámetros fijos para generar datos. Esto nos ayudará a crear un conjunto de datos con dos variables objetivo. Ambas dependen de las mismas entradas, pero aunque se generan de manera similar, sus pesos son diferentes.", "plural": "Ahora que nuestros **modelos verdaderos** están definidos, podemos extraer de los parámetros fijos para generar datos. Esto nos ayudará a crear un conjunto de datos con dos variables objetivo. Ambas dependen de las mismas entradas, pero aunque se generan de manera similar, sus pesos son diferentes." }

source: This will position us in the situation we want: *two different outcomes, driven by the same drivers*.
es: { "singular": "Esto nos posicionará en la situación que queremos: *dos resultados diferentes, impulsados por los mismos factores*.", "plural": "Esto nos posicionará en la situación que queremos: *dos resultados diferentes, impulsados por los mismos factores*." }

source: This looks fantastic! Our outcomes are quite different, even though the internal variables are the same. This is where the real challenge begins.
es: { "singular": { "msgid": "This looks fantastic! Our outcomes are quite different, even though the internal variables are the same. This is where the real challenge begins.", "msgstr": "¡Esto se ve fantástico! Nuestros resultados son bastante diferentes, aunque las variables internas son las mismas. Aquí es donde comienza el verdadero desafío." }, "plural": { "msgid": "This looks fantastic! Our outcomes are quite different, even though the internal variables are the same. This is where the real challenge begins.", "msgstr": "¡Esto se ve fantástico! Nuestros resultados son bastante diferentes, aunque las variables internas son las mismas. Aquí es donde comienza el verdadero desafío." } }

source: Because we have two different target variables, we can say, "*Let's build two different models, one for each target variable.*" This is a promising idea, and we can simulate this situation using our `build_simple_mmm` function again.
es: { "singular": "Debido a que tenemos dos variables objetivo diferentes, podemos decir, \"Construyamos dos modelos diferentes, uno para cada variable objetivo.\" Esta es una idea prometedora, y podemos simular esta situación utilizando nuestra función `build_simple_mmm` nuevamente.", "plural": "Debido a que tenemos dos variables objetivo diferentes, podemos decir, \"Construyamos dos modelos diferentes, uno para cada variable objetivo.\" Esta es una idea prometedora, y podemos simular esta situación utilizando nuestra función `build_simple_mmm` nuevamente." }

source: With our two models built, we can now train them!
es: { "singular": "¡Con nuestros dos modelos construidos, ahora podemos entrenarlos!", "plural": "¡Con nuestros dos modelos construidos, ahora podemos entrenarlos!" }

source: Now that both of our models are trained on our data, we can proceed with optimization.
es: { "singular": { "msgid": "Now that both of our models are trained on our data, we can proceed with optimization.", "msgstr": "Ahora que ambos de nuestros modelos están entrenados con nuestros datos, podemos proceder con la optimización." }, "plural": { "msgid": "Now that both of our models are trained on our data, we can proceed with optimization.", "msgstr": "Ahora que ambos de nuestros modelos están entrenados con nuestros datos, podemos proceder con la optimización." } }

source: Before optimizing, we need to wrap our models in a protocol that allows the optimizer to use them. We have built a small wrapper to make any PyMC model compatible quickly.
es: { "singular": "Antes de optimizar, necesitamos envolver nuestros modelos en un protocolo que permita al optimizador utilizarlos. Hemos construido un pequeño envoltorio para hacer que cualquier modelo de PyMC sea compatible rápidamente.", "plural": "Antes de optimizar, necesitamos envolver nuestros modelos en un protocolo que permita al optimizador utilizarlos. Hemos construido un pequeño envoltorio para hacer que cualquier modelo de PyMC sea compatible rápidamente." }

source: You only need to provide your channel list (you can use the model coordinates for this), the `idata`, and the PyMC model object.
es: { "singular": "Solo necesita proporcionar su lista de canales (puede usar las coordenadas del modelo para esto), el `idata` y el objeto del modelo PyMC.", "plural": "Solo necesitan proporcionar su lista de canales (pueden usar las coordenadas del modelo para esto), el `idata` y el objeto del modelo PyMC." }

source: Building a custom class wrapper is quite easy. Your model only needs to follow the protocol in `OptimizerCompatibleModelWrapper`. Internally, you can customize it as much as you want.
es: { "singular": "Construir un envoltorio de clase personalizado es bastante fácil. Su modelo solo necesita seguir el protocolo en `OptimizerCompatibleModelWrapper`. Internamente, puede personalizarlo tanto como desee.", "plural": "Construir envoltorios de clase personalizados es bastante fácil. Sus modelos solo necesitan seguir el protocolo en `OptimizerCompatibleModelWrapper`. Internamente, pueden personalizarlos tanto como deseen." }

source: Once your model is wrapped, we must create a custom objective function that allows you to work with the variable to be optimized. Our model has the deterministic variable `contribution`, which has the dimensions `sample, date, channel`. The optimizer works with the posterior over all dimensions, meaning we need to collapse the `date` and `channel` dimensions.
es: { "singular": "Una vez que su modelo esté envuelto, debemos crear una función objetivo personalizada que le permita trabajar con la variable a optimizar. Nuestro modelo tiene la variable determinista `contribution`, que tiene las dimensiones `sample, date, channel`. El optimizador trabaja con la posterior sobre todas las dimensiones, lo que significa que necesitamos colapsar las dimensiones `date` y `channel`.", "plural": "Una vez que sus modelos estén envueltos, debemos crear funciones objetivo personalizadas que le permitan trabajar con las variables a optimizar. Nuestros modelos tienen las variables deterministas `contribution`, que tienen las dimensiones `sample, date, channel`. Los optimizadores trabajan con las posteriores sobre todas las dimensiones, lo que significa que necesitamos colapsar las dimensiones `date` y `channel`." }

source: Take a look at how it works!
es: { "singular": "¡Echa un vistazo a cómo funciona!", "plural": "¡Echen un vistazo a cómo funciona!" }

source: With our function in place, all we need to do is define our optimization horizon, and we are set. We pass our variable to be optimized and the utility function that gets this variable and performs an operation. In this case, it takes the mean value of the posterior from the total contribution over channels and days.
es: { "singular": "Con nuestra función en su lugar, todo lo que necesitamos hacer es definir nuestro horizonte de optimización, y estamos listos. Pasamos nuestra variable a optimizar y la función de utilidad que recibe esta variable y realiza una operación. En este caso, toma el valor medio de la posterior de la contribución total a través de canales y días.", "plural": "Con nuestras funciones en su lugar, todo lo que necesitamos hacer es definir nuestros horizontes de optimización, y estamos listos. Pasamos nuestras variables a optimizar y las funciones de utilidad que reciben estas variables y realizan una operación. En este caso, toman el valor medio de la posterior de la contribución total a través de canales y días." }

source: Because we have two models, we will run two optimizations. Take a moment to look in detail at how the optimizer must be called 🙌🏻
es: { "singular": "Debido a que tenemos dos modelos, realizaremos dos optimizaciones. Tómese un momento para observar en detalle cómo debe ser llamado el optimizador 🙌🏻", "plural": "Debido a que tenemos dos modelos, realizaremos dos optimizaciones. Tómese un momento para observar en detalle cómo deben ser llamados los optimizadores 🙌🏻" }

source: Once both optimizations are complete, we can observe the results!
es: { "singular": "¡Una vez que ambas optimizaciones estén completas, podemos observar los resultados!", "plural": "¡Una vez que ambas optimizaciones estén completas, podemos observar los resultados!" }

source: The picture makes everything crystal clear: the channels that drive new users are not the same as those that drive re-engaged users. This is problematic because if we want to optimize for new users, our allocation is directionally different from the one for re-engaged users.
es: { "singular": "La imagen deja todo claro como el cristal: los canales que atraen a nuevos usuarios no son los mismos que los que atraen a usuarios reenganchados. Esto es problemático porque si queremos optimizar para nuevos usuarios, nuestra asignación es direccionalmente diferente de la de los usuarios reenganchados.", "plural": "Las imágenes dejan todo claro como el cristal: los canales que atraen a nuevos usuarios no son los mismos que los que atraen a usuarios reenganchados. Esto es problemático porque si queremos optimizar para nuevos usuarios, nuestra asignación es direccionalmente diferente de la de los usuarios reenganchados." }
