Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_lift_test.po
Languages: es

source: Careful examination of these 2 plots shows that the posterior mean has shifted closer to the true parameter value and/or the HDI is shrinking, indicating improved precision of our estimates.
es: Un examen cuidadoso de estos 2 gráficos muestra que la media posterior se ha desplazado más cerca del valor verdadero del parámetro y/o el HDI se está reduciendo, lo que indica una mejora en la precisión de nuestras estimaciones.

source: Let's return to our estimated channel contributions over time. The HDI's are narrower than before, indicating that we have reduced the uncertainty in our channel contribution estimates. Even more impressively, the posterior mean estimates are now much closer to the actual channel contributions.
es: Volvamos a nuestras contribuciones estimadas de canal a lo largo del tiempo. Los HDI son más estrechos que antes, lo que indica que hemos reducido la incertidumbre en nuestras estimaciones de contribución de canal. Aún más impresionante, las estimaciones de la media posterior ahora están mucho más cerca de las contribuciones reales del canal.

source: Add Additional Lift Tests
es: Agregar Pruebas de Elevación Adicionales

source: We can add even more lift tests.
es: Podemos agregar incluso más pruebas de elevación.

source: They can either all be added at one time or separately.
es: Pueden ser añadidos todos a la vez o por separado.

source: Use the `name` parameter in order to separate the two sets of observations in the model graph.
es: Utilice el parámetro `name` para separar los dos conjuntos de observaciones en el gráfico del modelo.

source: The response curve is shifting more and more
es: La curva de respuesta se está desplazando cada vez más.

source: So we can see in the 2 plots above that when we add even more lift test data to our MMM, the parameter estimates relating to the saturation curves are getting closer to the true values.
es: Así podemos ver en los 2 gráficos anteriores que cuando añadimos aún más datos de prueba de elevación a nuestro MMM, las estimaciones de los parámetros relacionadas con las curvas de saturación se están acercando a los valores verdaderos.

source: Now, for a final time, let's check in on our channel contributions over time. The HDI's are much narrower when we compare to the original model - adding a number of lift test results has reduced our uncertainty in our channel contribution estimates. And the posterior means are now much closer to the actual channel contributions compared to before we added the lift test data to the MMM.
es: Ahora, por última vez, revisemos nuestras contribuciones de canal a lo largo del tiempo. Los HDI son mucho más estrechos cuando comparamos con el modelo original; añadir una serie de resultados de pruebas de elevación ha reducido nuestra incertidumbre en nuestras estimaciones de contribución de canal. Y las medias posteriores ahora están mucho más cerca de las contribuciones reales del canal en comparación con antes de que añadimos los datos de la prueba de elevación al MMM.

source: Constraint based on Cost Per Target
es: Restricción basada en el Costo Por Objetivo

source: If you don't have experimental information in that shape, you can provide the estimated cost per target for each channel (e.g: cost per install, cost per registration, cost per action, cost per unit sale) and calibrate the model response based on it.
es: Si no dispone de información experimental en esa forma, puede proporcionar el costo estimado por objetivo para cada canal (por ejemplo: costo por instalación, costo por registro, costo por acción, costo por venta unitario) y calibrar la respuesta del modelo en función de ello.

source: Conclusion
es: Conclusión

source: The `add_lift_test_measurements` method can be used in order to incorporate experiments into our model likelihood and nudge the model parameters closer to the actuals in this example.
es: El método `add_lift_test_measurements` se puede utilizar para incorporar experimentos en la verosimilitud de nuestro modelo y ajustar los parámetros del modelo más cerca de los valores reales en este ejemplo.

source: Conducting various experiments for each channel at various spends will bring the best results.
es: Realizar diversos experimentos para cada canal con diferentes gastos traerá los mejores resultados.
