Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_sensitivity_analysis.po
Languages: es

source: These plots show the expected uplift and marginal effects. We get a similar general pattern of results - if we consider scenarios where we had spent progressively more, then we would get positive uplift, but as we reach a certain level of spend, the advertising channel saturates and the marginal effects drop to near zero.
es: Estos gráficos muestran el aumento esperado y los efectos marginales. Obtenemos un patrón general de resultados similar: si consideramos escenarios en los que hemos gastado progresivamente más, obtendríamos un aumento positivo, pero a medida que alcanzamos un cierto nivel de gasto, el canal publicitario se satura y los efectos marginales caen cerca de cero.

source: Sensitivity analysis on the free shipping threshold
es: Análisis de sensibilidad sobre el umbral de envío gratuito

source: We've had a thorough look at the influencer spend variable and we've got some interesting insights into how it affects the outcome (sales) under different counterfactual scenarios.
es: Hemos examinado detenidamente la variable de gasto en influencers y hemos obtenido algunas ideas interesantes sobre cómo afecta el resultado (ventas) en diferentes escenarios contrafactuales.

source: But we can also do the same for the free shipping threshold driver. The reason why this is interesting in our example is because this driver is assumed to have linear effects on the outcome, with no saturation or adstock function applied.
es: Pero también podemos hacer lo mismo para el controlador del umbral de envío gratuito. La razón por la que esto es interesante en nuestro ejemplo es porque se asume que este controlador tiene efectos lineales en el resultado, sin que se aplique ninguna función de saturación o adstock.

source: We won't exhaustively run through all the different sweeps we can do, but we will just demonstrate an absolute sweep.
es: No vamos a repasar exhaustivamente todos los diferentes barridos que podemos realizar, pero solo demostraremos un barrido absoluto.

source: We can see the linear nature of the effects of the free shipping threshold on the outcome variable. The expected uplift is positive when we lower the threshold (people buy more when shipping is free), and the marginal effects are constant across the sweep values. This is because we assumed a linear relationship between the free shipping threshold and sales, so the marginal effect does not change as we adjust the threshold. The constant negative value is equal to the change in uplift as we increase the shipping threshold by \$1.
es: Podemos observar la naturaleza lineal de los efectos del umbral de envío gratuito en la variable de resultado. El aumento esperado es positivo cuando disminuimos el umbral (las personas compran más cuando el envío es gratuito), y los efectos marginales son constantes a lo largo de los valores de barrido. Esto se debe a que asumimos una relación lineal entre el umbral de envío gratuito y las ventas, por lo que el efecto marginal no cambia a medida que ajustamos el umbral. El valor negativo constante es igual al cambio en el aumento a medida que incrementamos el umbral de envío en \$1.

source: We can verify this by changing the sweep step size and seeing that we get identical marginal effects estimates (albeit with numerical estimation error).
es: Podemos verificar esto cambiando el tamaño del paso de barrido y observando que obtenemos estimaciones de efectos marginales idénticas (aunque con error de estimación numérica).

source: **Why should I be interested in a straight line and a flat line?** These are the kinds of plots that you can run through to get a sense check of whether the model is behaving as expected.
es: **¿Por qué debería interesarme en una línea recta y una línea plana?** Estos son los tipos de gráficos que puede utilizar para verificar si el modelo se comporta como se esperaba.

source: Maybe you (or a client) realises that a negative linear relationship between shipping threshold and sales is too simplistic. This can then drive model iteration and improvement - you could explore alternative functional forms for example.
es: Quizás usted (o un cliente) se da cuenta de que una relación lineal negativa entre el umbral de envío y las ventas es demasiado simplista. Esto puede impulsar la iteración y mejora del modelo; por ejemplo, podría explorar formas funcionales alternativas.

source: Summary
es: Resumen

source: We've introduced a simple but powerful tool for probing deeper into your MMM results. You can explore a sweep of perterbations to one or more driver variables and compute the expected outcomes and marginal effects for each scenario. You can consider different forms of peterbation, here we've shown multiplicative, absolute and additive sweeps.
es: Hemos introducido una herramienta simple pero poderosa para profundizar en sus resultados de MMM. Puede explorar una serie de perturbaciones en una o más variables de control y calcular los resultados esperados y los efectos marginales para cada escenario. Puede considerar diferentes formas de perturbación; aquí hemos mostrado barridos multiplicativos, absolutos y aditivos.

source: This allows you to answer "what if" questions with precision and clarity, providing actionable insights into how different levers affect your business outcomes. You can produce simple and interpretable plots that you can use to communicate how the model works and get sense-checks on the model's behaviour and assumptions.
es: Esto le permite responder preguntas de "qué pasaría si" con precisión y claridad, proporcionando información útil sobre cómo diferentes palancas afectan los resultados de su negocio. Puede producir gráficos simples e interpretables que puede utilizar para comunicar cómo funciona el modelo y obtener verificaciones de sentido sobre el comportamiento y las suposiciones del modelo.
