Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_gam_options.po
Languages: es

source: In PyMC-Marketing, we can incorporate these controls as an **additional linear term** in the model’s mean function. Formally, if we denote our control variables as $Z_{i,t}$ and their corresponding coefficients as $\beta_{Z_i}$, the new model becomes:
es: En PyMC-Marketing, podemos incorporar estos controles como un **término lineal adicional** en la función media del modelo. Formalmente, si denotamos nuestras variables de control como $Z_{i,t}$ y sus correspondientes coeficientes como $\beta_{Z_i}$, el nuevo modelo se convierte en:

source: $X_{i,t}$ are the marketing drivers with parameters $\theta_i$,
es: $X_{i,t}$ son los impulsores de marketing con parámetros $\theta_i$,

source: $Z_{i,t}$ are the control covariates with parameters $\beta_{Z_i}$, and
es: $Z_{i,t}$ son las covariables de control con parámetros $\beta_{Z_i}$, y

source: $\varepsilon_t$ remains the residual noise term.
es: $\varepsilon_t$ sigue siendo el término de ruido residual.

source: In practice, this means that after defining your main marketing components, you can simply pass your control variables to the model — typically as a tensor with shape `(date, control)` — and PyMC-Marketing will automatically handle the rest.
es: En la práctica, esto significa que después de definir sus componentes principales de marketing, puede simplemente pasar sus variables de control al modelo —típicamente como un tensor con forma `(fecha, control)`— y PyMC-Marketing se encargará automáticamente del resto.

source: Arbitrary terms in PyMC-Marketing
es: Términos arbitrarios en PyMC-Marketing

source: Sometimes you need a term that isn’t part of the built-ins. PyMC-Marketing lets you go fully custom: you can add **any** function of your inputs—of any shape or dimensionality—directly into the mean function. This does require a few more lines of code (you’re interfacing with PyMC internals), but the **protocol-based design** provides guardrails so you don’t break the model. The trade-off is straightforward: more flexibility and control in exchange for a bit more boilerplate. If you implement a class that follows the expected protocol, you can compose virtually anything.
es: A veces necesita un término que no forma parte de los elementos incorporados. PyMC-Marketing le permite ser completamente personalizado: puede agregar **cualquier** función de sus entradas—de cualquier forma o dimensionalidad—directamente en la función media. Esto requiere algunas líneas más de código (está interfiriendo con los internos de PyMC), pero el **diseño basado en protocolos** proporciona barandillas para que no rompa el modelo. La compensación es sencilla: más flexibilidad y control a cambio de un poco más de código repetitivo. Si implementa una clase que sigue el protocolo esperado, puede componer prácticamente cualquier cosa.

source: In the example below, we introduce two custom pieces:
es: En el ejemplo a continuación, presentamos dos piezas personalizadas:

source: **A custom transformation** `InverseHillSaturation` that transforms inputs with an inverse-Hill form:
es: **Una transformación personalizada** `InverseHillSaturation` que transforma las entradas con una forma inversa de Hill:

source: **A wrapper effect** `TransformedControlsEffect` that (a) ingests a set of control covariates, (b) applies any `Transformation` (here, our custom InverseHillSaturation) respecting the model’s coordinates, and (c) **adds the resulting contribution into the mean** $\mu_t$. Concretely, if the special controls are $H_{k,t}$ with parameters $(\lambda_k, \beta_k)$, the additional term is:
es: **Un efecto envolvente** `TransformedControlsEffect` que (a) ingiere un conjunto de covariables de control, (b) aplica cualquier `Transformation` (aquí, nuestra InverseHillSaturation personalizada) respetando las coordenadas del modelo, y (c) **agrega la contribución resultante a la media** $\mu_t$. Concretamente, si los controles especiales son $H_{k,t}$ con parámetros $(\lambda_k, \beta_k)$, el término adicional es:

source: Putting this together with the existing marketing drivers $X_{i,t}$ and any standard linear controls, the mean function becomes:
es: Al combinar esto con los impulsores de marketing existentes $X_{i,t}$ y cualquier control lineal estándar, la función media se convierte en:

source: \textstyle Y_t = \sum_{i=1}^{I} f(X_{i,t}, \theta_i) \;+\; \underbrace{\sum_{j=1}^{J} \beta_{Z_j} Z_{j,t}}_{\text{linear controls}} \;+\; \underbrace{\sum_{k=1}^{K}\frac{\beta_k}{1+(Z_{k,t}/\lambda_k)^2}}_{\text{special transformed controls}} \;+\; . . . + \varepsilon_t.
es: \textstyle Y_t = \sum_{i=1}^{I} f(X_{i,t}, \theta_i) \;+\; \underbrace{\sum_{j=1}^{J} \beta_{Z_j} Z_{j,t}}_{\text{linear controls}} \;+\; \underbrace{\sum_{k=1}^{K}\frac{I}0{1+(Z_{I}1/\lambda_k)^2}}_{\text{I}2} \;+\; . . . + \varepsilon_t.

source: What are those guardrails you must follow?
es: ¿Cuáles son esas pautas que debes seguir?

source: A component that you push into `mu_effects` is expected to behave like the examples in `pymc_marketing/mmm/additive_effect.py`. The implicit “*MuEffect protocol*” is only three methods, but each has to satisfy some invariants so that the class can be called during model build‐time and again later when the model is cloned for posterior-predictive sampling.
es: Un componente que se inserta en `mu_effects` se espera que se comporte como los ejemplos en `pymc_marketing/mmm/additive_effect.py`. El implícito “*protocolo MuEffect*” consta de solo tres métodos, pero cada uno debe satisfacer algunas invariantes para que la clase pueda ser llamada durante el tiempo de construcción del modelo y nuevamente más tarde cuando el modelo se clone para el muestreo posterior predictivo.

source: `create effect`: Should return the tensor to be added additively to the model `mu_var`.
es: crear efecto: Debe devolver el tensor que se añadirá aditivamente al modelo `mu_var`.

source: `set_data`: Process to be able to run `sample_posterior_predictive` on existing or new data.
es: `set_data`: Proceso para poder ejecutar `sample_posterior_predictive` en datos existentes o nuevos.

source: `create_data`: Process to add the `pm.Data` container with the information for the custom component.
es: create_data: Proceso para agregar el contenedor `pm.Data` con la información para el componente personalizado.

source: Don't forget the following 👇🏻
es: No olvides lo siguiente 👇🏻

source: Unique names: choose a distinct prefix so your variables don’t collide with built-ins like "control_contribution". Always add a deterministic with a “contribution” suffix if you want the user to retrieve it later; otherwise name clashes are possible.
es: Nombres únicos: elija un prefijo distinto para que sus variables no colisionen con los elementos integrados como "control_contribution". Siempre añada un determinista con un sufijo de “contribution” si desea que el usuario pueda recuperarlo más tarde; de lo contrario, son posibles conflictos de nombres.

source: Return dims: the tensor returned by create_effect must broadcast to the MMM target dims exactly (("date", *mmm.dims)). Failure to do so raises dimension errors when the model is summed.
es: Dimensiones de retorno: el tensor devuelto por create_effect debe ajustarse exactamente a las dimensiones de destino MMM (("fecha", *mmm.dims)). No hacerlo genera errores de dimensión cuando se suma el modelo.

source: Broadcasting helpers: when your internal effect has fewer dims, use create_dim_handler to align it.
es: Ayudantes de transmisión: cuando su efecto interno tiene menos dimensiones, use create_dim_handler para alinearlo.

source: Coordinate additions: if you introduce a new dimension (e.g. "event" or "fourier_mode"), add it once with model.add_coord(name, values) inside create_data.
es: Adiciones de coordenadas: si introduces una nueva dimensión (por ejemplo, "event" o "fourier_mode"), añádela una vez con model.add_coord(name, values) dentro de create_data.

source: Re-use pm.Data names consistently between create_data and set_data; otherwise pm.set_data can’t find the shared variable.
es: Reutilice los nombres de pm.Data de manera consistente entre create_data y set_data; de lo contrario, pm.set_data no podrá encontrar la variable compartida.

source: Do not mutate mmm.model.coords["date"]. If you need dates, read them from the coords; for new prediction dates, rely on the cloned model’s coords inside set_data.
es: No mutes mmm.model.coords["date"]. Si necesitas fechas, léelas de las coords; para nuevas fechas de predicción, confía en las coords del modelo clonado dentro de set_data.

source: Follow these rules and your component will plug into the MMM training, posterior sampling, and posterior-predictive workflows without surprises.
es: Siga estas reglas y su componente se integrará en los flujos de trabajo de entrenamiento MMM, muestreo posterior y predicción posterior sin sorpresas.

source: That being said, let's built our special covariates!
es: Dicho esto, ¡construyamos nuestras covariables especiales!

source: Where are the GAMs?
es: ¿Dónde están los GAM?

source: At this point, you might be wondering — *where are the GAMs?* After all, most of what we’ve built so far has looked like a sequence of linear and nonlinear regressions with extra structure. And that’s true: wrapping a linear predictor in a nonlinear function doesn’t automatically make it a **Generalized Additive Model**.
es: En este punto, podría estar preguntándose — *¿dónde están los GAMs?* Después de todo, la mayor parte de lo que hemos construido hasta ahora ha parecido una secuencia de regresiones lineales y no lineales con estructura adicional. Y eso es cierto: envolver un predictor lineal en una función no lineal no lo convierte automáticamente en un **Modelo Aditivo Generalizado**.

source: However, if we introduce a **nonparametric adstock** and **monotone saturation** functions, the model truly began to take the shape of a GAM. Each channel now contributes its own smooth function of the transformed exposure — not a fixed parametric curve, but a data-driven, regularized shape. The mean of the response can now be expressed as an additive combination of smooth terms:
es: Sin embargo, si introducimos funciones de **adstock no paramétrico** y **saturación monótona**, el modelo realmente comenzó a tomar la forma de un GAM. Cada canal ahora contribuye con su propia función suave de la exposición transformada — no una curva paramétrica fija, sino una forma regularizada impulsada por los datos. La media de la respuesta ahora se puede expresar como una combinación aditiva de términos suaves:

source: $e_{i,t} = (x_i * w_i)_t$ is the **adstocked exposure** — a distributed-lag convolution with a smooth kernel $w_i$,
es: $e_{i,t} = (x_i * w_i)_t$ es la **exposición adstock** — una convolución de rezago distribuido con un núcleo suave $w_i$,

source: $f_i(\cdot)$ is a **monotone smooth saturation function**, learned nonparametrically,
es: $f_i(\cdot)$ es una **función de saturación suave monótona**, aprendida de manera no paramétrica,

source: and $s_{\text{trend}}$ and $s_{\text{season}}$ are smooth time effects built from linear trends and Fourier terms.
es: y $s_{\text{trend}}$ y $s_{\text{season}}$ son efectos temporales suaves construidos a partir de tendencias lineales y términos de Fourier.

source: Put differently, what makes our model a GAM is not any single transformation, but the fact that its **mean structure is additive over smooth components**. Each effect — adstock, saturation, trend, seasonality, or control — acts as one of the additive smooths that define a GAM.
es: Dicho de otra manera, lo que hace que nuestro modelo sea un GAM no es ninguna transformación única, sino el hecho de que su **estructura media es aditiva sobre componentes suaves**. Cada efecto — adstock, saturación, tendencia, estacionalidad o control — actúa como uno de los suavizados aditivos que definen un GAM.

source: So while not every MMM is a GAM, a **flexible MMM** like ours *is one*. That’s the real power of the PyMC-Marketing framework: it lets you move naturally from a standard linear regression to a traditional MMM toward a fully Bayesian **Generalized Additive Model**, without changing your workflow or code structure.
es: Así que, aunque no todos los MMM son GAM, un **MMM flexible** como el nuestro *sí lo es*. Ese es el verdadero poder del marco PyMC-Marketing: te permite pasar de manera natural de una regresión lineal estándar a un MMM tradicional hacia un **Modelo Aditivo Generalizado** completamente bayesiano, sin cambiar tu flujo de trabajo ni la estructura de tu código.

source: Check how this can be implemented following the same structures shown above!
es: ¡Verifique cómo se puede implementar esto siguiendo las mismas estructuras mostradas arriba!

source: The following implementations are experimental and serve as proof-of-concept demonstrations for this notebook. They are not part of the official PyMC-Marketing suite and should be used for educational purposes only.
es: Las siguientes implementaciones son experimentales y sirven como demostraciones de prueba de concepto para este cuaderno. No forman parte de la suite oficial de PyMC-Marketing y deben ser utilizadas únicamente con fines educativos.

source: Amazing, our **Generalized Additive Media Mix Model** is alive and sampling 🔥
es: Increíble, nuestro **Modelo de Mezcla de Medios Aditivos Generalizados** está activo y muestreando 🔥

source: Recap: From Simple Lines to Complex Structures
es: Resumen: De líneas simples a estructuras complejas

source: Throughout this notebook, we’ve seen how **PyMC-Marketing** evolves from a simple linear regression into a flexible probabilistic framework capable of modeling rich time-series structures. We began with a basic linear model, showing how each component — adstock, saturation, trends, Fourier seasonality, and controls — can be added seamlessly using a consistent API and only a few lines of code. Each addition preserved the same conceptual foundation while expanding the expressive power of the model.
es: A lo largo de este cuaderno, hemos visto cómo **PyMC-Marketing** evoluciona de una simple regresión lineal a un marco probabilístico flexible capaz de modelar estructuras de series temporales complejas. Comenzamos con un modelo lineal básico, mostrando cómo cada componente — adstock, saturación, tendencias, estacionalidad de Fourier y controles — puede ser añadido sin problemas utilizando una API consistente y solo unas pocas líneas de código. Cada adición preservó la misma base conceptual mientras expandía el poder expresivo del modelo.

source: We introduced **dimensionality** (such as countries or regions) without adding complexity to the code, leveraged **broadcasting** to align parameters automatically, and integrated both **linear covariates** and **nonlinear transformations** to capture more realistic behaviors. Finally, we extended the system with **arbitrary effects**, where users can define their own transformations, saturation functions, or additive processes, provided they follow the library’s protocol-based design.
es: Introdujimos **dimensionalidad** (como países o regiones) sin añadir complejidad al código, aprovechamos **broadcasting** para alinear parámetros automáticamente, e integramos tanto **covariables lineales** como **transformaciones no lineales** para capturar comportamientos más realistas. Finalmente, extendimos el sistema con **efectos arbitrarios**, donde los usuarios pueden definir sus propias transformaciones, funciones de saturación o procesos aditivos, siempre que sigan el diseño basado en protocolos de la biblioteca.

source: By doing so, your models can grow as much as you want in complexity — and you can rely on PyMC-Marketing to handle it elegantly. With minimal lines of code, you can increase dimensionality, enable automatic broadcasting, and add linear or nonlinear transformations, as well as linear covariates. And with just a few more lines, you can implement entirely custom transformations or arbitrary additive components tailored to your specific use case.
es: Al hacerlo, sus modelos pueden crecer tanto como desee en complejidad, y puede confiar en PyMC-Marketing para manejarlo de manera elegante. Con mínimas líneas de código, puede aumentar la dimensionalidad, habilitar la difusión automática y agregar transformaciones lineales o no lineales, así como covariables lineales. Y con solo unas pocas líneas más, puede implementar transformaciones completamente personalizadas o componentes aditivos arbitrarios adaptados a su caso de uso específico.

source: Of course, this flexibility comes at a cost: as your model grows, so does the number of parameters, sometimes to the point where sampling becomes computationally expensive or even infeasible. Let’s take a closer look at how the parameter count has evolved across our models so far — considering each random variable multiplied by its respective dimensionality.
es: Por supuesto, esta flexibilidad tiene un costo: a medida que su modelo crece, también lo hace el número de parámetros, a veces hasta el punto en que el muestreo se vuelve costoso computacionalmente o incluso inviable. Echemos un vistazo más de cerca a cómo ha evolucionado el conteo de parámetros en nuestros modelos hasta ahora, considerando cada variable aleatoria multiplicada por su respectiva dimensionalidad.

source: Parameter Growth & Sampling Time
es: Parámetro de Crecimiento y Tiempo de Muestreo

source: As the model evolved, the parameter count grew rapidly.
es: A medida que el modelo evolucionó, el conteo de parámetros creció rápidamente.

source: This illustrates a key reality of additive, multidimensional Bayesian models: **parameter space often grows super-linearly** (and can feel exponential) as you stack effects (trend, seasonality, adstock, saturation), add controls, and expand over indices (e.g., country, product, region). Computational cost typically rises with both **data size** and **parameter dimensionality**; for gradient-based MCMC like NUTS, wall-time per effective sample can increase sharply as posteriors become higher-dimensional and more correlated. That’s why we didn’t fit every variant here—much as we love writing notebooks, we don’t love writing them for **hours**. 😉
es: Esto ilustra una realidad clave de los modelos bayesianos aditivos y multidimensionales: **el espacio de parámetros a menudo crece de manera superlineal** (y puede parecer exponencial) a medida que apilas efectos (tendencia, estacionalidad, adstock, saturación), agregas controles y te expandes sobre índices (por ejemplo, país, producto, región). El costo computacional típicamente aumenta tanto con el **tamaño de los datos** como con la **dimensionalidad de los parámetros**; para MCMC basado en gradientes como NUTS, el tiempo de muro por muestra efectiva puede aumentar drásticamente a medida que las distribuciones posteriores se vuelven de mayor dimensión y más correlacionadas. Por eso no ajustamos cada variante aquí; por mucho que nos encante escribir cuadernos, no nos encanta escribirlos durante **horas**. 😉

source: Excluding Variables from Sampling with `MaskedPrior`
es: Excluyendo variables del muestreo con `MaskedPrior`

source: When models grow across many dimensions — countries, regions, product types, and channels — not every combination is meaningful or even observed in the data. For instance, some products may not be sold in certain countries, or some channels may not operate in specific regions. In those cases, it’s inefficient (and potentially misleading) to assign priors and sample parameters for every combination. That’s where **`MaskedPrior`** comes in.
es: Cuando los modelos crecen en muchas dimensiones — países, regiones, tipos de productos y canales — no todas las combinaciones son significativas o incluso observadas en los datos. Por ejemplo, algunos productos pueden no venderse en ciertos países, o algunos canales pueden no operar en regiones específicas. En esos casos, es ineficiente (y potencialmente engañoso) asignar priors y muestrear parámetros para cada combinación. Ahí es donde entra **`MaskedPrior`**.

source: `MaskedPrior` allows you to define priors only over the *active* subset of your parameter space. You provide it with:
es: `MaskedPrior` le permite definir priors solo sobre el subconjunto *activo* de su espacio de parámetros. Usted le proporciona:

source: a **base prior** (e.g., `Prior("Normal", mu=0, sigma=1, dims=("country", "channel"))`), and
es: una **base previa** (por ejemplo, `Prior("Normal", mu=0, sigma=1, dims=("country", "channel"))`), y

source: a **boolean mask** (`xarray.DataArray`) indicating which parameter entries should be active (`True`) or excluded (`False`).
es: una **máscara booleana** (`xarray.DataArray`) que indica qué entradas de parámetro deben estar activas (`True`) o excluidas (`False`).

source: Internally, `MaskedPrior` performs three main steps:
es: Internamente, `MaskedPrior` realiza tres pasos principales:

source: **Subset creation:** It builds a reduced variable over only the active entries (those marked `True` in the mask).
es: **Creación de subconjuntos:** Se construye una variable reducida solo sobre las entradas activas (aquellas marcadas como `True` en la máscara).

source: **Sampling on active subset:** The sampler draws values only for this smaller subset, ignoring inactive combinations completely.
es: **Muestreo en subconjunto activo:** El muestreador extrae valores solo para este subconjunto más pequeño, ignorando completamente las combinaciones inactivas.

source: **Expansion back to full shape:** The reduced variable is re-expanded to the original dimensional shape, filling inactive positions with deterministic zeros.
es: **Expansión de nuevo a la forma completa:** La variable reducida se reexpande a la forma dimensional original, llenando las posiciones inactivas con ceros deterministas.

source: See as the following, if you define a mask $M_{i,j} \in \{0,1\}$ over a parameter $\theta_{i,j}$, the masked parameter becomes:
es: Vea lo siguiente, si define una máscara $M_{i,j} \in \{0,1\}$ sobre un parámetro $\theta_{i,j}$, el parámetro enmascarado se convierte en:

source: Sampling occurs only for the active subset:
es: La muestreo ocurre solo para el subconjunto activo:

source: and the total number of random variables is reduced to $\sum_{i,j} M_{i,j}$.
es: y el número total de variables aleatorias se reduce a $\sum_{i,j} M_{i,j}$.

source: The benefits are significant:
es: Los beneficios son significativos:

source: **Parameter reduction:** Only meaningful parameters are sampled, reducing computational burden and improving sampling efficiency.
es: **Reducción de parámetros:** Solo se muestrean los parámetros significativos, lo que reduce la carga computacional y mejora la eficiencia del muestreo.

source: **Faster convergence:** With fewer parameters, NUTS and ADVI can converge more quickly and stably.
es: **Convergencia más rápida:** Con menos parámetros, NUTS y ADVI pueden converger de manera más rápida y estable.

source: **Structural clarity:** The mask explicitly documents which parameter combinations are valid in your model.
es: **Claridad estructural:** La máscara documenta explícitamente qué combinaciones de parámetros son válidas en su modelo.

source: **Compatibility:** Masked priors integrate seamlessly with PyMC-Marketing’s components, like adstock and saturation transformations, through standard prior definitions.
es: **Compatibilidad:** Los priors enmascarados se integran a la perfección con los componentes de PyMC-Marketing, como las transformaciones de adstock y saturación, a través de definiciones de prior estándar.
