Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_budget_allocation_example.po
Languages: es

source: Budget Allocation with PyMC-Marketing
es: Asignación de Presupuesto con PyMC-Marketing

source: The purpose of this notebook is to explore the recently included function in the PyMC-Marketing library that focuses on budget allocation. This function's underpinnings are based on the methodologies inspired by Bolt's work in the article, ["Budgeting with Bayesian Models"](https://bolt.eu/en/blog/budgeting-with-bayesian-models-pymc-marketing/).
es: El propósito de este cuaderno es explorar la función recientemente incluida en la biblioteca PyMC-Marketing que se centra en la asignación de presupuestos. Los fundamentos de esta función se basan en las metodologías inspiradas en el trabajo de Bolt en el artículo, ["Budgeting with Bayesian Models"](https://bolt.eu/en/blog/budgeting-with-bayesian-models-pymc-marketing/).

source: Prerequisite Knowledge
es: Conocimientos Previos

source: The notebook assumes the reader has knowledge of the essential functionalities of PyMC-Marketing. If one is unfamiliar, the ["MMM Example Notebook"](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html) serves as an excellent starting point, offering a comprehensive introduction to media mix models in this context.
es: El cuaderno asume que el lector tiene conocimiento de las funcionalidades esenciales de PyMC-Marketing. Si no está familiarizado, el ["Cuaderno de Ejemplo de MMM"](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html) sirve como un excelente punto de partida, ofreciendo una introducción completa a los modelos de mezcla de medios en este contexto.

source: Introducing the budget allocator
es: Presentamos el asignador de presupuesto

source: This notebook instigates an examination of the function within the PyMC-Marketing library, which addresses these challenges using Bayesian models. The function intends to provide:
es: Este cuaderno provoca un examen de la función dentro de la biblioteca PyMC-Marketing, que aborda estos desafíos utilizando modelos bayesianos. La función tiene la intención de proporcionar:

source: Quantitative measures of the effectiveness of different media channels.
es: Medidas cuantitativas de la efectividad de diferentes canales de medios.

source: Probabilistic ROI estimates under a range of budget scenarios.
es: Estimaciones de ROI probabilísticas bajo una variedad de escenarios de presupuesto.

source: Basic Setup
es: Configuración básica

source: Like previous notebooks revolving around PyMC-Marketing, this relies on a specific library set. Here are the requisite imports necessary for executing the provided code snippets subsequently.
es: Al igual que los cuadernos anteriores relacionados con PyMC-Marketing, este se basa en un conjunto específico de bibliotecas. A continuación se presentan las importaciones necesarias para ejecutar los fragmentos de código proporcionados.

source: These imports and configurations form the fundamental setup necessary for the entire span of this notebook.
es: Estas importaciones y configuraciones forman la configuración fundamental necesaria para todo el alcance de este cuaderno.

source: The expectation is that a model has already been trained using the functionalities provided in prior versions of the PyMC-Marketing library. Thus, the data generation and training processes will be replicated in a different notebook. Those unfamiliar with these procedures are advised to refer to the ["MMM Example Notebook."](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html)
es: La expectativa es que un modelo ya ha sido entrenado utilizando las funcionalidades proporcionadas en versiones anteriores de la biblioteca PyMC-Marketing. Por lo tanto, los procesos de generación de datos y entrenamiento se replicarán en un cuaderno diferente. Se aconseja a aquellos que no estén familiarizados con estos procedimientos que consulten el ["Cuaderno de Ejemplo de MMM."](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html)

source: Loading a Pre-Trained Model
es: Cargando un modelo preentrenado

source: To utilize a saved model, load it into a new instance of the MMM class using the `build_mmm_from_yaml` method below.
es: Para utilizar un modelo guardado, cárguelo en una nueva instancia de la clase MMM utilizando el método `build_mmm_from_yaml` a continuación.

source: For more details on the `build_mmm_from_yaml`, consult the [pymc-marketing documentation](https://www.pymc-marketing.io/en/stable/guide/benefits) on Model Deployment.
es: Para más detalles sobre `build_mmm_from_yaml`, consulte la [documentación de pymc-marketing](https://www.pymc-marketing.io/en/stable/guide/benefits) sobre el Despliegue de Modelos.

source: Alternatively, load a model that has been saved to MLflow via `pymc_marketing.mlflow.log_inference_data` or has been autologged to MLflow via `pymc_marketing.mlflow.autolog(log_mmm=True)`, from the [PyMC-Marketing MLflow module](https://github.com/pymc-labs/pymc-marketing/blob/main/pymc_marketing/mlflow.py).
es: Alternativamente, cargue un modelo que ha sido guardado en MLflow a través de `pymc_marketing.mlflow.log_inference_data` o que ha sido registrado automáticamente en MLflow a través de `pymc_marketing.mlflow.autolog(log_mmm=True)`, desde el [módulo PyMC-Marketing MLflow](https://github.com/pymc-labs/pymc-marketing/blob/main/pymc_marketing/mlflow.py).

source: Problem Statement
es: Declaración del problema

source: Before jumping into the data, let’s first define the business problem we are trying to solve. In a progressively competitive scenario, marketers are tasked with distributing a predetermined marketing budget across various channels to maximize a certain response. Consider a forthcoming quarter wherein a marketing team must decide the division of its operations between two advertising channels, represented as x1 and x2. These could effectively symbolize any medium, such as TV, digital advertising, print, etc.
es: Antes de sumergirnos en los datos, primero definamos el problema empresarial que estamos tratando de resolver. En un escenario cada vez más competitivo, se encarga a los especialistas en marketing la distribución de un presupuesto de marketing predeterminado entre varios canales para maximizar una determinada respuesta. Consideremos un próximo trimestre en el que un equipo de marketing debe decidir la división de sus operaciones entre dos canales publicitarios, representados como x1 y x2. Estos podrían simbolizar efectivamente cualquier medio, como televisión, publicidad digital, impresión, etc.

source: The task lies in making decisions that invoke data, comply with factual evidence, and align with business logic. For instance, how can one incorporate prior information like budget restrictions, platform trends, constraints, or even distinctive features of each channel into the decision-making process?
es: La tarea consiste en tomar decisiones que invoquen datos, cumplan con la evidencia fáctica y se alineen con la lógica empresarial. Por ejemplo, ¿cómo se puede incorporar información previa como restricciones presupuestarias, tendencias de la plataforma, limitaciones o incluso características distintivas de cada canal en el proceso de toma de decisiones?

source: Introducing Budget Allocation Function
es: Introduciendo la Función de Asignación de Presupuesto

source: The budget allocation capabilities in PyMC-Marketing aims to tackle this issue by offering a Bayesian framework for optimal allocation. This enables marketers to:
es: Las capacidades de asignación de presupuesto en PyMC-Marketing tienen como objetivo abordar este problema al ofrecer un marco bayesiano para la asignación óptima. Esto permite a los comercializadores:

source: Integrate the outcomes of Media Mix Modeling (MMM), quantifying each channel's effectiveness in metrics like ROI, incremental sales, etc.
es: Integre los resultados de la Modelización de Mezcla de Medios (MMM), cuantificando la efectividad de cada canal en métricas como el ROI, las ventas incrementales, etc.

source: Merge this empirical data with prior business knowledge and logic for making holistic and robust decisions.
es: Fusiona estos datos empíricos con el conocimiento y la lógica empresarial previos para tomar decisiones holísticas y sólidas.

source: By utilizing this function, marketers can guarantee that the budget spread not only obeys the mathematical rigor furnished by the MMM outcomes but also incorporates business-specific factors, thereby achieving a balanced and optimized budget plan.
es: Al utilizar esta función, los especialistas en marketing pueden garantizar que la distribución del presupuesto no solo obedezca al rigor matemático proporcionado por los resultados del MMM, sino que también incorpore factores específicos del negocio, logrando así un plan de presupuesto equilibrado y optimizado.

source: Getting started
es: Comenzando

source: Media Mix Modeling (MMM) acts as a dependable method to estimate the contribution of each channel (e.g., x1, x2) to a target variable like sales or any variable.
es: El Modelado de Mezcla de Medios (MMM) actúa como un método confiable para estimar la contribución de cada canal (por ejemplo, x1, x2) a una variable objetivo como las ventas o cualquier variable.

source: The function `saturation_scatterplot()` allows for visualization of this direct channel impact. However, it is crucial to remember that this only unveils the "observable space" for values of X (spend) and Y (contribution).
es: La función `saturation_scatterplot()` permite visualizar este impacto directo del canal. Sin embargo, es crucial recordar que esto solo revela el "espacio observable" para los valores de X (gasto) e Y (contribución).

source: The observable space only encompasses our data points and does not illustrate what transpires beyond those points. As a result, it is not assured that the maximum contribution point for each channel lies within this observable range.
es: El espacio observable solo abarca nuestros puntos de datos y no ilustra lo que ocurre más allá de esos puntos. Como resultado, no se asegura que el punto de máxima contribución para cada canal se encuentre dentro de este rango observable.

source: If we want to visualize certain level of response, we can use `sample_curve` to get an estimate of our response in scaled space given a max value of X in scaled space as well. In the example below, we are using the value `3` which represent 3X the max historical value on each channel. Depending on your scaling method, `max_value` could represent a different thing.
es: Si queremos visualizar cierto nivel de respuesta, podemos utilizar `sample_curve` para obtener una estimación de nuestra respuesta en un espacio escalado dado un valor máximo de X en el espacio escalado también. En el ejemplo a continuación, estamos utilizando el valor `3`, que representa 3X el valor histórico máximo en cada canal. Dependiendo de su método de escalado, `max_value` podría representar algo diferente.

source: After it, using the function `saturation_curves`, we can predict the shape of the model fitting curve for the amount spent that was not previously observed.
es: Después de eso, utilizando la función `saturation_curves`, podemos predecir la forma de la curva de ajuste del modelo para la cantidad gastada que no se había observado previamente.

source: We can identify which saturation function was used in the pre-trained model:
es: Podemos identificar qué función de saturación se utilizó en el modelo preentrenado:

source: Within PyMC-Marketing we have different saturation functions, you can observe all in the [transformer module](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.transformers.html).
es: Dentro de PyMC-Marketing tenemos diferentes funciones de saturación, puedes observar todas en el [módulo transformer](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.transformers.html).

source: Once these parameters are obtained, you can visualize it using the `arviz.summary` function (each parameter has the prefix `saturation` or `adstock` respectively) and, if desired, you can recreate the curves for each channel independently based on them. More crucially, these parameter values are indispensable when using the `budget_allocator` function, which leverages this information to optimize your marketing budget across distinct channels. This section is fundamental to budget optimization.
es: Una vez que se obtienen estos parámetros, puede visualizarlos utilizando la función `arviz.summary` (cada parámetro tiene el prefijo `saturation` o `adstock` respectivamente) y, si lo desea, puede recrear las curvas para cada canal de manera independiente basándose en ellos. Más crucialmente, estos valores de parámetros son indispensables al utilizar la función `budget_allocator`, que aprovecha esta información para optimizar su presupuesto de marketing a través de distintos canales. Esta sección es fundamental para la optimización del presupuesto.

source: Example Use-Cases
es: Ejemplos de Casos de Uso

source: The `optimize_budget` function within PyMC-Marketing boasts a myriad of applications that can solve various business predicaments. Here, we present five critical use cases that exemplify its utility in real-world marketing scenarios.
es: La función `optimize_budget` dentro de PyMC-Marketing cuenta con una multitud de aplicaciones que pueden resolver diversas problemáticas empresariales. Aquí, presentamos cinco casos de uso críticos que ejemplifican su utilidad en escenarios de marketing del mundo real.

source: What are we optimizing?
es: ¿Qué estamos optimizando?

source: Before jumping into the examples, we need to understand the basis of our optimizer.
es: Antes de entrar en los ejemplos, necesitamos entender la base de nuestro optimizador.

source: We aim to optimize the allocation of budgets across multiple channels to maximize the overall contribution to key performance indicators (KPIs), such as sales or conversions. Each channel has its own forward pass function, which can internal consider a sigmoid or michaelis-menten curve, representing the relationship between the amount spent and the resultant performance.
es: Nuestro objetivo es optimizar la asignación de presupuestos a través de múltiples canales para maximizar la contribución general a los indicadores clave de rendimiento (KPI), como las ventas o las conversiones. Cada canal tiene su propia función de avance, que puede considerar internamente una curva sigmoide o de Michaelis-Menten, representando la relación entre la cantidad gastada y el rendimiento resultante.

source: These curves vary in characteristics: some channels saturate quickly, meaning that additional spending yields diminishing returns, while others may offer more linear growth in contribution with increased spending.
es: Estas curvas varían en características: algunos canales se saturan rápidamente, lo que significa que el gasto adicional produce rendimientos decrecientes, mientras que otros pueden ofrecer un crecimiento más lineal en la contribución con un aumento del gasto.

source: To solve this optimization problem, we employ the Sequential Least Squares Quadratic Programming ([SLSQP](https://docs.scipy.org/doc/scipy/reference/optimize.minimize-slsqp.html#optimize-minimize-slsqp)) algorithm, a gradient-based optimization technique. SLSQP is well-suited for this application as it allows for the imposition of both equality and inequality constraints, ensuring that the budget allocation adheres to business rules or limitations.
es: Para resolver este problema de optimización, empleamos el algoritmo de Programación Cuadrática de Mínimos Cuadrados Secuenciales ([SLSQP](https://docs.scipy.org/doc/scipy/reference/optimize.minimize-slsqp.html#optimize-minimize-slsqp)), una técnica de optimización basada en gradientes. SLSQP es especialmente adecuado para esta aplicación, ya que permite la imposición de restricciones tanto de igualdad como de desigualdad, asegurando que la asignación del presupuesto se adhiera a las reglas o limitaciones del negocio.

source: The algorithm works by iteratively approximating the objective function and constraints using quadratic functions and solving the resulting sub-problems to find a local minimum. This enables us to effectively navigate the multidimensional space of budget allocations to find the most efficient distribution of resources.
es: El algoritmo funciona aproximando iterativamente la función objetivo y las restricciones utilizando funciones cuadráticas y resolviendo los subproblemas resultantes para encontrar un mínimo local. Esto nos permite navegar de manera efectiva por el espacio multidimensional de asignaciones presupuestarias para encontrar la distribución de recursos más eficiente.

source: The optimizer aims to maximize the total contribution from all channels while adhering to the following constraints:
es: El optimizador tiene como objetivo maximizar la contribución total de todos los canales, cumpliendo con las siguientes restricciones:

source: Budget Limitations: The total spending across all channels should not exceed the overall marketing budget.
es: Limitaciones del presupuesto: El gasto total en todos los canales no debe exceder el presupuesto de marketing general.

source: Channel-specific Constraints: Some channels may have minimum or maximum spending limits.
es: Restricciones específicas del canal: Algunos canales pueden tener límites de gasto mínimos o máximos.

source: By leveraging the SLSQP algorithm, we can optimize the multi-channel budget allocation in a rigorous, mathematically sound manner, ensuring that we get the highest possible return on investment.
es: Al aprovechar el algoritmo SLSQP, podemos optimizar la asignación del presupuesto multicanal de manera rigurosa y matemáticamente sólida, asegurando que obtengamos el mayor retorno de inversión posible.

source: Maximizing Contribution
es: Maximizando la Contribución

source: Assume you're managing the marketing for a retail company with a substantial budget to allocate for advertising across multiple channels. Given that, you're contemplating ways to optimize the forthcoming quarter's outlay to maximize the overall contribution.
es: Asuma que está gestionando el marketing de una empresa minorista con un presupuesto sustancial para asignar a la publicidad en múltiples canales. Dado esto, está contemplando formas de optimizar el gasto del próximo trimestre para maximizar la contribución general.

source: You might have considered scattering your money in the same way than you did historically without an MMM model - let's repeat the know formula. However, you wish to explore better alternatives now that you possess an MMM model. Given that you lack prior knowledge, you impose the same restrictions on both channels. They must each expend a minimum of 500 euros and no more than 2,000 euros, equating to your total budget.
es: Es posible que haya considerado dispersar su dinero de la misma manera que lo hizo históricamente sin un modelo MMM; repitamos la fórmula conocida. Sin embargo, desea explorar mejores alternativas ahora que posee un modelo MMM. Dado que carece de conocimientos previos, impone las mismas restricciones a ambos canales. Cada uno debe gastar un mínimo de 500 euros y no más de 2,000 euros, lo que equivale a su presupuesto total.

source: Our current model was trained with weekly data, meaning each period (time unit) represents a week. If we plan to create a budget allocation for a specific quarter, we need to add 12 weeks to our initial date. By doing so, we can initialize our class that wraps our **MMM**.
es: Nuestro modelo actual fue entrenado con datos semanales, lo que significa que cada período (unidad de tiempo) representa una semana. Si planeamos crear una asignación de presupuesto para un trimestre específico, necesitamos añadir 12 semanas a nuestra fecha inicial. Al hacerlo, podemos inicializar nuestra clase que envuelve nuestro **MMM**.

source: Before we proceed to evaluate the effectiveness of our optimization, we can estimate the response by following our initial plan, which involves distributing our budget based on historical spending patterns.
es: Antes de proceder a evaluar la efectividad de nuestra optimización, podemos estimar la respuesta siguiendo nuestro plan inicial, que implica distribuir nuestro presupuesto en función de los patrones de gasto históricos.

source: The response will be expose as a data array with different variables, such as:
es: La respuesta se expondrá como un array de datos con diferentes variables, tales como:

source: y (Target variables)
es: y (Variables objetivo)

source: allocation (The allocation strategy shared)
es: asignación (La estrategia de asignación compartida)

source: channel variables (Every channel column with the corresponding units used to get the prediction).
es: variables de canal (Cada columna de canal con las unidades correspondientes utilizadas para obtener la predicción).

source: Total Media Channel Contribution in Original Scale (The posterior distribution of the sum of media channel by date)
es: Contribución Total del Canal de Medios en Escala Original (La distribución posterior de la suma del canal de medios por fecha)

source: Great, we can see that our initial estimation it's giving us around 146K new units (sales in this case) given marketing. But given the same budget, could we do better?
es: Excelente, podemos ver que nuestra estimación inicial nos está dando alrededor de 146K nuevas unidades (ventas en este caso) dado el marketing. Pero, dado el mismo presupuesto, ¿podríamos hacerlo mejor?

source: Great, we can see that given the allocation the optimizer maximize the total response from both channel, and give us back 5,000 extra units, given the same spend. We can visualize the mean response per channel, given the spend using the function `plot.budget_allocation`
es: Excelente, podemos ver que dada la asignación, el optimizador maximiza la respuesta total de ambos canales y nos devuelve 5,000 unidades adicionales, dado el mismo gasto. Podemos visualizar la respuesta media por canal, dado el gasto, utilizando la función `plot.budget_allocation`.

source: We could visualize the response over time if we want.
es: Podríamos visualizar la respuesta a lo largo del tiempo si lo deseamos.

source: As you probably observe, the response it's quite flat and saturated. As shown before in the joint distribution of the sum of effects, the mean only increase because the uncertanty was bigger, but majority of the density it's not to far from the biggest density in the initial allocation.
es: Como probablemente observe, la respuesta es bastante plana y saturada. Como se mostró anteriormente en la distribución conjunta de la suma de efectos, la media solo aumenta porque la incertidumbre fue mayor, pero la mayoría de la densidad no está muy lejos de la mayor densidad en la asignación inicial.

source: Why this happens? let's take a look to the response curves!
es: ¿Por qué sucede esto? ¡Echemos un vistazo a las curvas de respuesta!

source: As expected, the allocated budget (red line) lies into the saturation zone, meaning, we have very little movement given the current spend. At least for some channels.
es: Como era de esperar, el presupuesto asignado (línea roja) se encuentra en la zona de saturación, lo que significa que tenemos muy poco movimiento dado el gasto actual. Al menos para algunos canales.

source: We can iterate over different budgets, adding a bit less or more and validate how much our response move forward given the additional budget.
es: Podemos iterar sobre diferentes presupuestos, añadiendo un poco menos o más y validar cuánto avanza nuestra respuesta dado el presupuesto adicional.
