Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_build_from_yml_example.po
Languages: es

source: Learning how to create models with yml files
es: Aprendiendo a crear modelos con archivos yml

source: The following notebook will teach you to create pymc-marketing models from yml files, allowing you to easily recreate your models in production environments without several lines of code.
es: El siguiente cuaderno le enseñará a crear modelos de pymc-marketing a partir de archivos yml, lo que le permitirá recrear fácilmente sus modelos en entornos de producción sin varias líneas de código.

source: Setup
es: Configuración

source: Multidimensional model
es: Modelo multidimensional

source: How the config works?
es: ¿Cómo funciona la configuración?

source: The configuration file uses a structured YAML format with several key sections:
es: El archivo de configuración utiliza un formato YAML estructurado con varias secciones clave:

source: schema_version: Version identifier for the configuration schema
es: schema_version: Identificador de versión para el esquema de configuración

source: model: The main model configuration
es: modelo: La configuración principal del modelo

source: class: The Python class to instantiate (fully qualified name)
es: clase: La clase de Python a instanciar (nombre completamente calificado)

source: kwargs: Arguments passed to the model constructor
es: kwargs: Argumentos pasados al constructor del modelo

source: Including data columns, transformations (adstock, saturation)
es: Incluyendo columnas de datos, transformaciones (adstock, saturación)

source: sample_kwargs: Optional parameters for the sampling process
es: sample_kwargs: Parámetros opcionales para el proceso de muestreo

source: data: Optional paths to data files
es: data: Rutas opcionales a archivos de datos

source: The build_mmm_from_yaml function:
es: La función build_mmm_from_yaml:

source: Parses this YAML configuration
es: Analiza esta configuración YAML

source: Uses the 'build' function to instantiate objects recursively
es: Utiliza la función 'build' para instanciar objetos de manera recursiva.

source: Handles special cases like priors and distributions
es: Maneja casos especiales como priors y distribuciones

source: Returns a fully configured MMM model ready for sampling
es: Devuelve un modelo MMM completamente configurado listo para muestreo.

source: If idata_path is provided then the idata from a previous class is used in the model in the idata property.
es: Si se proporciona idata_path, entonces el idata de una clase anterior se utiliza en el modelo en la propiedad idata.

source: Basic model
es: Modelo básico

source: Multidimensional Hierarchical Model
es: Modelo Jerárquico Multidimensional

source: Multidimensional Hierarchical with arbitrary effects and calibration
es: Jerárquico Multidimensional con efectos arbitrarios y calibración
