Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_upper_funnel_causal_approach.po
Languages: es

source: Measuring Upper-Funnel Impact with PyMC‑Marketing
es: Midiendo el impacto en la parte superior del embudo con PyMC‑Marketing

source: This notebook is a practical, end-to-end walkthrough for quantifying the impact of **upper-funnel channels** on a downstream business outcome using **Bayesian Marketing Mix Modeling (MMM)**. We will combine a causal DAG, a transparent data-generating process, and a PyMC-Marketing implementation that respects time dynamics (adstock) and nonlinear response (saturation). The emphasis is on **causal reasoning first**, modeling second.
es: Este cuaderno es una guía práctica y completa para cuantificar el impacto de los **canales de embudo superior** en un resultado comercial posterior utilizando **Modelado de Mezcla de Marketing Bayesiano (MMM)**. Combinaremos un DAG causal, un proceso generador de datos transparente y una implementación de PyMC-Marketing que respeta las dinámicas temporales (adstock) y la respuesta no lineal (saturación). El énfasis está en **el razonamiento causal primero**, el modelado segundo.

source: What you’ll build (at a glance)
es: Lo que construirás (a simple vista)

source: A **PyMC-Marketing MMM** with **Geometric Adstock** and **Michaelis–Menten** saturation for the outcome.
es: Un **PyMC-Marketing MMM** con **Adstock Geométrico** y saturación **Michaelis–Menten** para el resultado.

source: A **mediator model** that links upper-funnel activity to downstream exposure.
es: Un **modelo de mediador** que vincula la actividad de la parte superior del embudo con la exposición posterior.

source: A **simulation-based effect estimator** that converts “what-if” changes in the upper funnel into outcome deltas, with uncertainty.
es: Un **estimador de efectos basado en simulaciones** que convierte los cambios de "qué pasaría si" en la parte superior del embudo en deltas de resultados, con incertidumbre.

source: Why this matters
es: Por qué esto es importante

source: Upper-funnel signals rarely act instantaneously or directly to our target variable. Treating them as simple features in a single regression collapses mediation, ignores carryover, and obscures the operating point where marginal returns live. A causal-first MMM clarifies **where** effects originate.
es: Las señales de embudo superior rara vez actúan de manera instantánea o directa sobre nuestra variable objetivo. Tratarles como características simples en una única regresión colapsa la mediación, ignora el arrastre y oscurece el punto operativo donde residen los rendimientos marginales. Un MMM causal-prioritario aclara **dónde** se originan los efectos.

source: Who this is for
es: Para quién es esto

source: Analysts and data scientists who need a **defensible** way to attribute upper-funnel investments to outcomes, and who are comfortable with Bayesian inference, time-series structure, and basic causal diagrams.
es: Analistas y científicos de datos que necesitan una forma **defendible** de atribuir inversiones en la parte superior del embudo a resultados, y que se sienten cómodos con la inferencia bayesiana, la estructura de series temporales y diagramas causales básicos.

source: By the end, you’ll have a repeatable template for answering the “eternal question” of upper-funnel measurement—not by asking MMM to do everything, but by **aligning MMM with your causal understanding of the marketing system**.
es: Al final, tendrás una plantilla repetible para responder a la “pregunta eterna” de la medición en la parte superior del embudo, no pidiendo a MMM que lo haga todo, sino **alineando MMM con tu comprensión causal del sistema de marketing**.

source: What this notebook covers
es: Lo que cubre este cuaderno

source: **Framing the problem:** Why upper-funnel measurement is hard and how naive regressions misattribute lift.
es: **Enmarcando el problema:** Por qué la medición en la parte superior del embudo es difícil y cómo las regresiones ingenuas atribuyen erróneamente el aumento.

source: **Causal scaffold:** A minimal DAG that separates **drivers**, **mediators**, and **outcomes**, clarifying what the *total* effect means.
es: **Andamiaje causal:** Un DAG mínimo que separa **conductores**, **mediadores** y **resultados**, aclarando lo que significa el *efecto total*.

source: **Dynamic response modeling:** How **adstock** (carryover) and **saturation** (diminishing returns) shape observable performance.
es: **Modelado de respuesta dinámica:** Cómo el **adstock** (arrastre) y la **saturación** (rendimientos decrecientes) moldean el rendimiento observable.

source: A mediator block to translate upper-funnel shifts into lower-funnel impressions.
es: Un bloque de mediador para traducir los cambios en la parte superior del embudo en impresiones en la parte inferior del embudo.

source: An outcome block to map those impressions into business impact.
es: Un bloque de resultados para traducir esas impresiones en impacto empresarial.

source: **Counterfactual thinking:** Turning interventions on upper-funnel channels into predicted changes in the outcome (g-computation).
es: **Pensamiento contrafactual:** Convertir intervenciones en canales de embudo superior en cambios predichos en el resultado (g-cálculo).

source: **Model checking:** Posterior predictive checks and sanity tests that prevent self-deception.
es: **Verificación de modelos:** Comprobaciones predictivas posteriores y pruebas de cordura que previenen la autoengaño.

source: **Reporting effects:** Impulse responses, cumulative lift, and state-dependent elasticities that decision-makers can use.
es: **Efectos de informes:** Respuestas al impulso, aumento acumulativo y elasticidades dependientes del estado que los tomadores de decisiones pueden utilizar.

source: A consumer brand invests heavily in awareness (video, influencers, PR). Leadership sees short-term sales plateauing and asks: *“Are our upper-funnel dollars doing anything?”* Standard dashboards show weak contemporaneous relations, and channel teams argue that “it all pays back later.” We need a defensible way to quantify how **upper-funnel exposure** propagates through **mid-funnel engagement** to **lower-funnel conversions**—without relying on feelings or opinions only.
es: Una marca de consumo invierte fuertemente en la concienciación (video, influencers, relaciones públicas). La dirección observa que las ventas a corto plazo se estancan y pregunta: *“¿Están nuestros dólares de la parte superior del embudo haciendo algo?”* Los paneles de control estándar muestran relaciones contemporáneas débiles, y los equipos de canal argumentan que “todo se recupera más tarde.” Necesitamos una forma defendible de cuantificar cómo **la exposición en la parte superior del embudo** se propaga a través del **compromiso en la parte media del embudo** hasta las **conversiones en la parte inferior del embudo**—sin depender únicamente de sentimientos u opiniones.

source: We start by sketching the world we believe we operate in: a small causal story that will guide every modeling decision that follows.
es: Comenzamos esbozando el mundo en el que creemos que operamos: una pequeña historia causal que guiará cada decisión de modelado que siga.

source: The Ecosystem based on the Causal DAG
es: El ecosistema basado en el DAG causal

source: The previous DAG shows three types of effects on it.
es: El DAG anterior muestra tres tipos de efectos sobre él.

source: $X1$ **Upper funnel (Awareness impressions):** Broad reach media (e.g., online video, display, influencer bursts). Drives *latent consideration* and brand memory, not immediate purchases.
es: $X1$ **Parte superior del embudo (Impresiones de conocimiento):** Medios de amplio alcance (por ejemplo, video en línea, display, ráfagas de influencers). Genera *consideración latente* y memoria de marca, no compras inmediatas.

source: $X3$: Remarketing impressions (people re-engage after a first touch). These are **mediators**—they translate awareness into actionable intent.
es: $X3$: Impresiones de remarketing (personas que vuelven a involucrarse después de un primer contacto). Estos son **mediadores**—traducen la conciencia en una intención accionable.

source: $X4$ **Lower funnel (High-intent exposures):** Brand search. These are the **proximal drivers** of the commercial outcome.
es: $X4$ **Embudo inferior (Exposiciones de alta intención):** Búsqueda de marca. Estos son los **impulsores proximales** del resultado comercial.

source: *U1*, *U4* **Exogenous shocks:** Competitor moves, Budgets allocated to teams, or market dynamics changes can perturb each node separately.
es: *U1*, *U4* **Choques exógenos:** Los movimientos de los competidores, los presupuestos asignados a los equipos o los cambios en la dinámica del mercado pueden perturbar cada nodo por separado.

source: Traditional MMMs often toss all channels into one regression and look for a global fit. For upper funnel channels, that approach can:
es: Los MMM tradicionales a menudo combinan todos los canales en una sola regresión y buscan un ajuste global. Para los canales de la parte superior del embudo, ese enfoque puede:

source: **Under-credit X1** (because its effect is indirect and delayed)
es: **Subcrédito X1** (porque su efecto es indirecto y retrasado)

source: **Overfit to X4** (because it is nearest to the outcome)
es: **Sobreajustar a X4** (porque es el más cercano al resultado)

source: The Business Questions
es: Las Preguntas Empresariales

source: **Q1.** How much does a marginal change in *awareness* (X1) ultimately shift the outcome, via the funnel?
es: **Q1.** ¿Cuánto cambia un cambio marginal en *conciencia* (X1) el resultado, a través del embudo?

source: **Q2.** Where are we on the **response curve** (are we close to saturation)?
es: **Q2.** ¿Dónde estamos en la **curva de respuesta** (¿estamos cerca de la saturación)?

source: **Q3.** What is the expected **cumulative lift** from a planned upper-funnel flight?
es: **Q3.** ¿Cuál es el **incremento acumulado** esperado de una campaña planificada en la parte superior del embudo?

source: We’ll work with PyMC-Marketing for MMM components, ArviZ for diagnostics, and Pytensor to keep our simulator honest.
es: Trabajaremos con PyMC-Marketing para los componentes de MMM, ArviZ para diagnósticos y Pytensor para mantener nuestro simulador honesto.

source: To keep figures consistent and runs reproducible, we lock a seed and a plotting style.
es: Para mantener las cifras consistentes y las ejecuciones reproducibles, bloqueamos una semilla y un estilo de trazado.

source: Based on the previous DAG, we'll start to simulate data using pytensor, during the simulation we'll need to state how the precise relationships (arrows between nodes) are represented and as consequence understand by the model.
es: Basado en el DAG anterior, comenzaremos a simular datos utilizando pytensor; durante la simulación necesitaremos indicar cómo se representan las relaciones precisas (flechas entre nodos) y, como consecuencia, entenderlas por el modelo.

source: Here, we'll assume a fully additive model, and will understand the interactions between channels as additive models as well, by consequence the structural causal equation to build will be:
es: Aquí, asumiremos un modelo completamente aditivo y entenderemos las interacciones entre canales como modelos aditivos también; por consecuencia, la ecuación causal estructural que se construirá será:

source: Based on the previous DAG, we'll simulate data in `pytensor`. We make the relationships **additive** at each node and allow **nonlinear response** only in the final mapping from lower-funnel exposure to outcome. Time is indexed by $t=1,\dots,T$.
es: Basado en el DAG anterior, simularemos datos en `pytensor`. Hacemos que las relaciones sean **aditivas** en cada nodo y permitimos una **respuesta no lineal** solo en el mapeo final de la exposición de embudo inferior al resultado. El tiempo está indexado por $t=1,\dots,T$.

source: $\mu_{j,t}$ are the exogenous components of the impressions (e.g: those changes not dependent on other nodes).
es: $\mu_{j,t}$ son los componentes exógenos de las impresiones (por ejemplo: aquellos cambios que no dependen de otros nodos).

source: Let $f(\cdot)$ denote the nonlinear response function (e.g., Geometric Adstock, Michaelis–Menten). The outcome combines transformed lower-funnel pressure with additive controls:
es: Sea $f(\cdot)$ la función de respuesta no lineal (por ejemplo, Geometric Adstock, Michaelis–Menten). El resultado combina la presión transformada del embudo inferior con controles aditivos:

source: $\text{Events}_t$: superposition of localized event basis functions.
es: $\text{Events}_t$: superposición de funciones base de eventos localizados.

source: $\theta$: parameters of the nonlinear response function (e.g., saturation/adstock).
es: $\theta$: parámetros de la función de respuesta no lineal (por ejemplo, saturación/adstock).

source: **Summary:** We assume additive structure at each node, linear mediation $X_1\!\to\!(X_2,X_3)\!\to\!X_4$, dynamic carryover on $X_4$ via adstock, and a nonlinear mapping $f$ from adstocked exposure to $Y$, plus additive trend/events and noise.
es: **Resumen:** Asumimos una estructura aditiva en cada nodo, mediación lineal $X_1\!\to\!(X_2,X_3)\!\to\!X_4$, transferencia dinámica en $X_4$ a través de adstock, y un mapeo no lineal $f$ de la exposición adstocked a $Y$, además de una tendencia/eventos aditivos y ruido.

source: Our story unfolds day by day; we create a daily timeline with a few simple calendar features.
es: Nuestra historia se desarrolla día a día; creamos una línea de tiempo diaria con algunas características de calendario simples.

source: Using Pytensor, we can symbolically represent the causal Directed Acyclic Graph (DAG) in an abstract way before diving into any actual computation. This framework allows us to clearly define the relationships that our data generation process must adhere to. Pytensor simplifies this task and enables us to visualize the resulting graphical model—though it’s a computational DAG rather than a causal one—helping us to confirm that the entire process aligns with our expectations.
es: Usando Pytensor, podemos representar simbólicamente el Grafo Acíclico Dirigido (DAG) causal de manera abstracta antes de sumergirnos en cualquier cálculo real. Este marco nos permite definir claramente las relaciones a las que debe adherirse nuestro proceso de generación de datos. Pytensor simplifica esta tarea y nos permite visualizar el modelo gráfico resultante—aunque se trata de un DAG computacional en lugar de uno causal—ayudándonos a confirmar que todo el proceso se alinea con nuestras expectativas.

source: Take a quick glance at the computational graph so we don’t fool ourselves: the ingredients combine exactly as intended. Next, we write down how awareness spills into consideration and then into high‑intent exposures. These links are simple—by design—so we can focus on the causal path rather than curve fitting.
es: Echemos un vistazo rápido al gráfico computacional para no engañarnos: los ingredientes se combinan exactamente como se pretende. A continuación, anotamos cómo la conciencia se transforma en consideración y luego en exposiciones de alta intención. Estos vínculos son simples—por diseño—para que podamos centrarnos en la ruta causal en lugar de ajustar curvas.

source: Creating the data for our symbolic place holders.
es: Creando los datos para nuestros marcadores de posición simbólicos.

source: First, we kick-off filling in the values for our event and trend variables. Then we craft a gently rising baseline, sprinkle in Gaussian event pulses, and add a whisper of noise.
es: Primero, comenzamos a llenar los valores para nuestras variables de evento y tendencia. Luego, creamos una línea base que sube suavemente, añadimos pulsos de evento gaussianos y agregamos un susurro de ruido.

source: We plot the pieces before we mix them.
es: Colocamos las piezas antes de mezclarlas.

source: We'll simulate our media variables (e.g: Impressions) as random walks. Upper, mid, and lower‑funnel exposures don’t typically jump randomly; they meander around a consistent value. A bounded random walk captures that inertia.
es: Simularemos nuestras variables de medios (por ejemplo: Impresiones) como caminatas aleatorias. Las exposiciones en la parte superior, media e inferior del embudo no suelen saltar aleatoriamente; se deslizan alrededor de un valor consistente. Una caminata aleatoria acotada captura esa inercia.

source: We let each stream wander within bounds and take a first look at the behavior.
es: Dejamos que cada flujo deambule dentro de los límites y eche un primer vistazo al comportamiento.

source: Now, we need to define the strength of the relationships, those will be the betas of every variable over the other. Doing so, we can create all missing nodes.
es: Ahora, necesitamos definir la fuerza de las relaciones, esas serán las betas de cada variable sobre las otras. Al hacerlo, podemos crear todos los nodos que faltan.

source: Only `X4` reaches the outcome in our story. That’s where we add memory (adstock) and diminishing returns (saturation).
es: Solo `X4` alcanza el resultado en nuestra historia. Ahí es donde añadimos memoria (adstock) y rendimientos decrecientes (saturación).

source: With everything in place, we can evaluate the target variable.
es: Con todo en su lugar, podemos evaluar la variable objetivo.

source: We package our story into a single pandas dataframe with features, controls, and the outcome.
es: Empacamos nuestra historia en un único dataframe de pandas con características, controles y el resultado.

source: We keep a holdout to test whether our counterfactual story travels beyond the training window.
es: Mantenemos un grupo de retención para probar si nuestra historia contrafactual se extiende más allá de la ventana de entrenamiento.

source: All-in causal MMM
es: MMM causal todo en uno

source: **What this is.** A single MMM with *all* channels modeled as if they directly affect $Y$. Each channel uses Geometric Adstock + Michaelis–Menten saturation; the likelihood is censored Normal. This strategy is very common, basically reflecting the put-it-all-into-the-blender approach.
es: **Qué es esto.** Un único MMM con *todos* los canales modelados como si afectaran directamente a $Y$. Cada canal utiliza Adstock Geométrico + saturación de Michaelis–Menten; la probabilidad es Normal censurada. Esta estrategia es muy común, reflejando básicamente el enfoque de mezclarlo todo en la licuadora.

source: We can define the model priors for every part, saturation and adstock as usual for pymc-marketing models.
es: Podemos definir los priors del modelo para cada parte, saturación y adstock como es habitual en los modelos de pymc-marketing.

source: Doing the same, we can define the Prior for the likelihood. We set a censored Normal likelihood (no negatives) and sampling defaults that behave well in practice.
es: Haciendo lo mismo, podemos definir el Prior para la verosimilitud. Establecemos una verosimilitud Normal censurada (sin negativos) y valores predeterminados de muestreo que se comportan bien en la práctica.

source: With the config ready, we build the all‑in model and draw from its posterior.
es: Con la configuración lista, construimos el modelo integral y extraemos de su posterior.

source: We also generate posterior predictions to peek at in‑sample recover effects.
es: También generamos predicciones posteriores para vislumbrar los efectos de recuperación en la muestra.

source: Oh! We can see the model already is getting troubles exploring the parameter space and diverging.
es: Oh! Podemos ver que el modelo ya está teniendo problemas para explorar el espacio de parámetros y está divergiendo.

source: Nevertheless, let's go directly to the question: **Can the model recover the true contribution if we were not spending anything at all in X1?**
es: Sin embargo, vayamos directamente a la pregunta: **¿Puede el modelo recuperar la verdadera contribución si no estuviéramos gastando nada en X1?**

source: We can use the `plot.contributions_over_time` and get the contribution output to find out. If the blender was enough, it would recover the true `X1` contribution. Let's check.
es: Podemos utilizar `plot.contributions_over_time` y obtener la salida de contribuciones para averiguarlo. Si el mezclador fue suficiente, recuperaría la verdadera contribución `X1`. Verifiquemos.

source: This is great, but we need to get the real contribution if x1 (We can compute it from our pytensor graph, assuming it was zero and taking that from target).
es: Esto es genial, pero necesitamos obtener la contribución real si x1 (Podemos calcularlo a partir de nuestro gráfico de pytensor, asumiendo que era cero y tomando eso del objetivo).

source: Now that we have both, we can compare.
es: Ahora que tenemos ambos, podemos comparar.

source: As expected, put-it-all-in-the blender overestimates the upper funnel effects. But why the naïve approach fails?
es: Como era de esperar, poner-todo-en-la-licuadora sobreestima los efectos del embudo superior. Pero, ¿por qué falla el enfoque ingenuo?

source: When we fit a model including all variables ($X_1, X_2, X_3, X_4, Y$), we observed that the coefficient linking $X_1$ to $Y$ was **too large**. This happens because the model does not respect the **causal structure** defined by our structural equations.
es: Cuando ajustamos un modelo que incluye todas las variables ($X_1, X_2, X_3, X_4, Y$), observamos que el coeficiente que vincula $X_1$ con $Y$ era **demasiado grande**. Esto sucede porque el modelo no respeta la **estructura causal** definida por nuestras ecuaciones estructurales.

source: The true causal mechanism
es: El verdadero mecanismo causal

source: In our data-generating process, $X_1$ does **not** directly affect $Y$. Its influence passes entirely through the sequence:
es: En nuestro proceso de generación de datos, $X_1$ **no** afecta directamente a $Y$. Su influencia pasa completamente a través de la secuencia:

source: Each link adds its contribution, and the final step ($X_4 \to Y$) can be **nonlinear** (for example, showing saturation or adstock effects).
es: Cada enlace añade su contribución, y el paso final ($X_4 \to Y$) puede ser **no lineal** (por ejemplo, mostrando efectos de saturación o adstock).

source: The real total effect of $X_1$ on $Y$ depends on how much $X_1$ changes $X_4$ and how sensitive $Y$ is to $X_4$. Symbolically,
es: El efecto total real de $X_1$ sobre $Y$ depende de cuánto $X_1$ cambie $X_4$ y de cuán sensible sea $Y$ a $X_4$. Simbólicamente,

source: A regression that includes both $X_1$ and $X_4$ as predictors of $Y$ breaks the logic of the causal graph. Because a standard regression implicitly assumes that each predictor explains variation in $Y$ **conditional on the others**, not respecting causal direction. Mathematically, the estimated coefficients $(\hat\beta_1, \hat\beta_4)$ in
es: Una regresión que incluye tanto $X_1$ como $X_4$ como predictores de $Y$ rompe la lógica del gráfico causal. Porque una regresión estándar asume implícitamente que cada predictor explica la variación en $Y$ **condicional a los otros**, sin respetar la dirección causal. Matemáticamente, los coeficientes estimados $(\hat\beta_1, \hat\beta_4)$ en

source: come from minimizing the joint residual variance, i.e., solving the **normal equations**:
es: proviene de minimizar la varianza residual conjunta, es decir, resolver las **ecuaciones normales**:
