Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_allocation_assessment.po
Languages: es

source: Budget Allocation Risk Assessment with PyMC-Marketing
es: Evaluación de Riesgo de Asignación de Presupuesto con PyMC-Marketing

source: This notebook is centered around evaluating the risks tied to different budget allocations across various marketing channels. You'll discover how to create an optimal budget allocation that aligns with your specific risk tolerance. This knowledge will empower you to make well-informed decisions regarding your budget distribution.
es: Este cuaderno se centra en evaluar los riesgos asociados a diferentes asignaciones presupuestarias en varios canales de marketing. Descubrirá cómo crear una asignación presupuestaria óptima que se alinee con su tolerancia al riesgo específica. Este conocimiento le permitirá tomar decisiones bien fundamentadas respecto a la distribución de su presupuesto.

source: Prerequisite Knowledge
es: Conocimientos Previos

source: The notebook assumes the reader has knowledge of the essential functionalities of PyMC-Marketing. If one is unfamiliar, the ["MMM Example Notebook"](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html) serves as an excellent starting point, offering a comprehensive introduction to media mix models in this context.
es: El cuaderno asume que el lector tiene conocimiento de las funcionalidades esenciales de PyMC-Marketing. Si no está familiarizado, el ["Cuaderno de Ejemplo de MMM"](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html) sirve como un excelente punto de partida, ofreciendo una introducción completa a los modelos de mezcla de medios en este contexto.

source: Expected Outcomes
es: Resultados Esperados

source: Upon completion of this notebook, readers will acquire a comprehensive understanding of how to evaluate the risks associated with various budget allocations and how to develop an optimal budget allocation based on specified risk tolerance criteria.
es: Al completar este cuaderno, los lectores adquirirán una comprensión integral de cómo evaluar los riesgos asociados con diversas asignaciones presupuestarias y cómo desarrollar una asignación presupuestaria óptima basada en criterios de tolerancia al riesgo especificados.

source: Preliminary Setup
es: Configuración preliminar

source: Consistent with previous notebooks in the PyMC-Marketing series, this document relies on a specific set of libraries. Below are the necessary imports required for executing the code snippets presented hereafter.
es: Consistente con los cuadernos anteriores de la serie PyMC-Marketing, este documento se basa en un conjunto específico de bibliotecas. A continuación se presentan las importaciones necesarias para ejecutar los fragmentos de código que se presentan a continuación.

source: The expectation is that a model has already been trained using the functionalities provided in prior versions of the PyMC-Marketing library. Thus, the data generation and training processes will be replicated in a different notebook. Those unfamiliar with these procedures are advised to refer to the ["MMM Example Notebook."](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html)
es: La expectativa es que un modelo ya ha sido entrenado utilizando las funcionalidades proporcionadas en versiones anteriores de la biblioteca PyMC-Marketing. Por lo tanto, los procesos de generación de datos y entrenamiento se replicarán en un cuaderno diferente. Se aconseja a aquellos que no estén familiarizados con estos procedimientos que consulten el ["Cuaderno de Ejemplo de MMM."](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_example.html)

source: Loading a Pre-Trained Model
es: Cargando un modelo preentrenado

source: To utilize a saved model, load it into a new instance of the MMM class using the load method below.
es: Para utilizar un modelo guardado, cárguelo en una nueva instancia de la clase MMM utilizando el método load a continuación.

source: Formulating the Budget Allocation Challenge
es: Formulando el Desafío de Asignación del Presupuesto

source: As in earlier notebooks, it is essential to delineate the budget allocation challenge. Specifically, we must define the duration of our budget allocation and the permissible expenditure per time unit. Our model utilizes weekly data; therefore, we will maintain the same temporal granularity.
es: Como en cuadernos anteriores, es esencial delinear el desafío de la asignación del presupuesto. Específicamente, debemos definir la duración de nuestra asignación presupuestaria y el gasto permitido por unidad de tiempo. Nuestro modelo utiliza datos semanales; por lo tanto, mantendremos la misma granularidad temporal.

source: In this example, we aim to distribute a budget across two channels over the course of eight weeks, with a weekly budget of 3 Million. Consequently, the total budget available for allocation amounts to 24 Million.
es: En este ejemplo, nuestro objetivo es distribuir un presupuesto entre dos canales a lo largo de ocho semanas, con un presupuesto semanal de 3 millones. En consecuencia, el presupuesto total disponible para asignación asciende a 24 millones.

source: Based on our intuition, we were thinking of distributing this budget into 80% Million for Google ($x2$) and 20% Million for Facebook ($x1$). Using this allocation, we can compute the response distribution and plot it.
es: Basado en nuestra intuición, estábamos pensando en distribuir este presupuesto en 80% millones para Google ($x2$) y 20% millones para Facebook ($x1$). Usando esta asignación, podemos calcular la distribución de respuestas y graficarla.

source: This is great, apparently we could get 123,226 units sold given our 39,000 total budget (3,000 Daily) which is mostly allocated to $X2$.
es: Esto es excelente, aparentemente podríamos vender 123,226 unidades dado nuestro presupuesto total de 39,000 (3,000 Diarios) que está mayormente asignado a $X2$.

source: Could we do better? The usual approach is to allocate the budget to maximize the response. We can use the `optimize_budget` method to do so, here we will compute the response given several budget combinations, and we'll prefer the one that maximizes the response. It's important to note that this example doesn't use any bounds, or constraints, so the optimizer will seek to use the entire budget.
es: ¿Podríamos hacerlo mejor? El enfoque habitual es asignar el presupuesto para maximizar la respuesta. Podemos utilizar el método `optimize_budget` para ello; aquí calcularemos la respuesta dada varias combinaciones de presupuesto, y preferiremos la que maximice la respuesta. Es importante señalar que este ejemplo no utiliza ningún límite ni restricciones, por lo que el optimizador buscará utilizar el presupuesto completo.

source: Great! Looks like we could get 145,255 units sold given our 3,000 time unit budget, meaning the optimizer found a better allocation which maximizes the response for the same budget. We could follow the same approach and plot the two distributions to compare them.
es: ¡Genial! Parece que podríamos vender 145,255 unidades dado nuestro presupuesto de 3,000 unidades de tiempo, lo que significa que el optimizador encontró una mejor asignación que maximiza la respuesta para el mismo presupuesto. Podríamos seguir el mismo enfoque y trazar las dos distribuciones para compararlas.

source: This makes everything clear, the optimized allocation has a higher mean. But looks like the optimized allocation has a higher risk, as the distribution is wider, respect to the initial guessed allocation.
es: Esto aclara todo, la asignación optimizada tiene una media más alta. Pero parece que la asignación optimizada tiene un mayor riesgo, ya que la distribución es más amplia, en comparación con la asignación inicial estimada.

source: Based on this, using the optimized allocation its very likely to get a respose of 145,255 units sold but also the budget could bring as low as 125,000 units sold or as big as 162,000 units sold. On the other hand, using the guessed allocation its very likely to get a respose of 123,000 units sold but also the budget could bring as low as 117,000 units sold or as big as 133,000 units sold.
es: Basado en esto, utilizando la asignación optimizada es muy probable obtener una respuesta de 145,255 unidades vendidas, pero también el presupuesto podría llevar a vender tan solo 125,000 unidades o hasta 162,000 unidades vendidas. Por otro lado, utilizando la asignación estimada es muy probable obtener una respuesta de 123,000 unidades vendidas, pero también el presupuesto podría llevar a vender tan solo 117,000 unidades o hasta 133,000 unidades vendidas.

source: During this notebook will give you the tools to answer this question. If you face a situation where the best bet is not the safer bet, which one would you prefer? Higher mean, but with more risk? Or lower mean, but with less risk? A safer bet or a riskier bet?
es: Durante este cuaderno, le proporcionará las herramientas para responder a esta pregunta. Si se enfrenta a una situación en la que la mejor apuesta no es la más segura, ¿cuál preferiría? ¿Mayor media, pero con más riesgo? ¿O menor media, pero con menos riesgo? ¿Una apuesta más segura o una apuesta más arriesgada?

source: This is where risk assessment comes into play, we can use different risk assessment criteria to help us decide which allocation is better based on our risk tolerance.
es: Aquí es donde entra en juego la evaluación de riesgos; podemos utilizar diferentes criterios de evaluación de riesgos para ayudarnos a decidir cuál asignación es mejor según nuestra tolerancia al riesgo.

source: Introduction to Risk Assessment
es: Introducción a la Evaluación de Riesgos

source: The `budget_optimizer` module encompasses various risk assessment criteria that facilitate the evaluation of risks associated with different budget allocations.
es: El módulo `budget_optimizer` abarca diversos criterios de evaluación de riesgos que facilitan la evaluación de los riesgos asociados con diferentes asignaciones presupuestarias.

source: Utilization of the `ut` class allows for the computation of risks linked to various budget allocations. Should the need arise to implement a customized risk assessment criterion, one can develop an individual function and incorporate it into the `optimize_budget` method as necessary. Subsequently, guidance on creating a personalized risk assessment criterion will be provided.
es: La utilización de la clase `ut` permite el cálculo de riesgos vinculados a diversas asignaciones presupuestarias. Si surge la necesidad de implementar un criterio de evaluación de riesgos personalizado, se puede desarrollar una función individual e incorporarla al método `optimize_budget` según sea necesario. Posteriormente, se proporcionará orientación sobre cómo crear un criterio de evaluación de riesgos personalizado.

source: Optimizing Budget Allocation Using Mean Tightness Score (MTS)
es: Optimización de la Asignación del Presupuesto Utilizando el Puntaje de Ajuste Medio (MTS)

source: This section focuses on the optimization of marketing budget allocation while incorporating risk considerations. Specifically, we employ the Mean Tightness Score (MTS) as the utility function to ensure that our budget plan effectively minimizes potential losses within a defined HDI (highest density interval).
es: Esta sección se centra en la optimización de la asignación del presupuesto de marketing, incorporando consideraciones de riesgo. Específicamente, empleamos el Puntaje de Ajuste Medio (MTS) como la función de utilidad para garantizar que nuestro plan de presupuesto minimice efectivamente las pérdidas potenciales dentro de un HDI (intervalo de mayor densidad) definido.

source: Overview of the Process
es: Descripción general del proceso

source: We invoke `mmm.optimize_budget` to ascertain the optimal allocation of the marketing budget across various channels over specified time periods, mirroring the approach undertaken in the prior section.
es: Invocamos `mmm.optimize_budget` para determinar la asignación óptima del presupuesto de marketing a través de varios canales durante períodos de tiempo específicos, reflejando el enfoque adoptado en la sección anterior.

source: The parameters remain consistent with those from the preceding section, with the addition of the `utility_function` parameters. In this instance:
es: Los parámetros se mantienen consistentes con los de la sección anterior, con la adición de los parámetros de `utility_function`. En este caso:

source: `utility_function`: This parameter is assigned to `mean_tightness_score`.
es: `utility_function`: Este parámetro se asigna a `mean_tightness_score`.

source: The Mean Tightness Score represents a risk-adjusted metric that harmonizes the mean return with the tail variability within a distribution. This metric is computed as follows:
es: El Puntaje Medio de Ajuste representa una métrica ajustada al riesgo que armoniza el retorno medio con la variabilidad en la cola dentro de una distribución. Esta métrica se calcula de la siguiente manera:

source: Mean\ Tightness\ Score = (\mu - \alpha \cdot Tail\ Distance) / \mu
es: Puntuación de Tensión Media = (\mu - \alpha \cdot Distancia de Cola) / \mu

source: In this formula, $\mu$ signifies the mean of the sample returns, $Tail\ Distance$ represents the tail distance metric, and $\alpha$ denotes the risk tolerance parameter.
es: En esta fórmula, $\mu$ significa la media de los retornos de la muestra, $Tail\ Distance$ representa la métrica de distancia de cola, y $\alpha$ denota el parámetro de tolerancia al riesgo.

source: The majority of the budget is allocated to $X1$. This allocation has been determined to minimize potential risk. Essentially, this approach indicates that we are prepared to accept lower returns if those returns are characterized by a higher degree of certainty. This is evident in the response distribution plot, which should exhibit a tight distribution with narrow tails.
es: La mayor parte del presupuesto se destina a $X1$. Esta asignación se ha determinado para minimizar el riesgo potencial. Esencialmente, este enfoque indica que estamos dispuestos a aceptar rendimientos más bajos si esos rendimientos se caracterizan por un mayor grado de certeza. Esto es evidente en el gráfico de distribución de respuestas, que debería mostrar una distribución ajustada con colas estrechas.

source: Now the budget change quite a bit, but the risk is lower compared to the non-risk optimized allocation, if we observe the distributions the density is narrower for the MTS optimized allocation.
es: Ahora el cambio en el presupuesto es bastante significativo, pero el riesgo es menor en comparación con la asignación no optimizada por riesgo. Si observamos las distribuciones, la densidad es más estrecha para la asignación optimizada por MTS.

source: This strategy is logical, as $X1$ demonstrates a response with reduced uncertainty, whereas $X2$ is associated with greater uncertainty. Consequently, the optimizer allocates a larger portion of the budget to $X1$, as it represents a more secure investment option.
es: Esta estrategia es lógica, ya que $X1$ demuestra una respuesta con menor incertidumbre, mientras que $X2$ está asociada con una mayor incertidumbre. En consecuencia, el optimizador asigna una mayor parte del presupuesto a $X1$, ya que representa una opción de inversión más segura.

source: We can exhibit this behavior on a more evident way; if we want to maximize a response that is less certain, we should get the opposite scenario. Let's set the mean tightness score with a higher alpha parameter, meaning, we have a higher risk tolerance.
es: Podemos exhibir este comportamiento de una manera más evidente; si queremos maximizar una respuesta que es menos cierta, deberíamos obtener el escenario opuesto. Establezcamos la puntuación de rigidez media con un parámetro alfa más alto, lo que significa que tenemos una mayor tolerancia al riesgo.

source: We are spending more in $X2$, and less in $X1$ compared to the previous allocation. Let's see the response distribution plot, again to compare it with the previous one.
es: Estamos gastando más en $X2$ y menos en $X1$ en comparación con la asignación anterior. Veamos el gráfico de distribución de respuestas, nuevamente para compararlo con el anterior.

source: As expected, the distribution has bigger tails now, and the mean is higher as well. We got bigger returns, but with more risk. The extra risk is coming from the additional budget allocated to $X2$.
es: Como era de esperar, la distribución ahora tiene colas más grandes, y la media también es más alta. Obtuvimos mayores rendimientos, pero con más riesgo. El riesgo adicional proviene del presupuesto extra asignado a $X2$.

source: If you see this distribution, you'll probably note it is similar to the initial unaware risk optimization. This is because, as alpha approximate to 1 your risk profile is high, and the optimization start to become closer to a simple `mean(posterior)`.
es: { "singular": "Si ve esta distribución, probablemente notará que es similar a la optimización de riesgo inicial no consciente. Esto se debe a que, a medida que alpha se aproxima a 1, su perfil de riesgo es alto, y la optimización comienza a acercarse a un simple `mean(posterior)`.", "plural": "Si ven esta distribución, probablemente notarán que es similar a la optimización de riesgo inicial no consciente. Esto se debe a que, a medida que alpha se aproxima a 1, su perfil de riesgo es alto, y la optimización comienza a acercarse a un simple `mean(posterior)`." }

source: Optimizing Budget Allocation through ROAS and Value at Risk (VaR)
es: Optimización de la Asignación del Presupuesto a través del ROAS y el Valor en Riesgo (VaR)

source: In order to enhance decision-making regarding budget allocation, we can integrate various risk assessment criteria to develop a more sophisticated utility function. In this context, we will utilize the Return on Advertising Spend (ROAS) associated with each allocation, alongside the Value at Risk (VaR) as our risk assessment criterion. This approach will facilitate the identification of the allocation that maximizes ROAS while concurrently minimizing potential risks.
es: Para mejorar la toma de decisiones respecto a la asignación del presupuesto, podemos integrar diversos criterios de evaluación de riesgos para desarrollar una función de utilidad más sofisticada. En este contexto, utilizaremos el Retorno sobre la Inversión en Publicidad (ROAS) asociado a cada asignación, junto con el Valor en Riesgo (VaR) como nuestro criterio de evaluación de riesgos. Este enfoque facilitará la identificación de la asignación que maximiza el ROAS mientras minimiza simultáneamente los riesgos potenciales.

source: Value at Risk is a statistical method employed to quantify the risk of financial loss within a portfolio or investment. Within the realm of marketing, it assists in understanding the potential worst-case loss (ROAS) associated with a particular budget allocation, evaluated at a specified HDI (highest density interval). By minimizing VaR, we aim to select an allocation that ensures, even in adverse scenarios, the ROAS remains as elevated as feasibly possible.
es: El Valor en Riesgo es un método estadístico utilizado para cuantificar el riesgo de pérdida financiera dentro de un portafolio o inversión. En el ámbito del marketing, ayuda a comprender la posible pérdida en el peor de los casos (ROAS) asociada con una asignación presupuestaria particular, evaluada en un HDI específico (intervalo de densidad más alta). Al minimizar el VaR, nuestro objetivo es seleccionar una asignación que garantice, incluso en escenarios adversos, que el ROAS se mantenga tan elevado como sea factiblemente posible.

source: The optimizer is once again allocating the budget to $X1$ majority, nevertheless $X2$ it's getting more money this time. However, this decision is informed by the expectation that the current combination will yield a higher Return on Advertising Spend (ROAS), while also presenting a small lower risk profile compared to the previous allocation.
es: El optimizador está nuevamente asignando el presupuesto a $X1$ en su mayoría, sin embargo, $X2$ está recibiendo más dinero esta vez. Sin embargo, esta decisión se basa en la expectativa de que la combinación actual generará un mayor Retorno sobre el Gasto Publicitario (ROAS), al mismo tiempo que presenta un perfil de riesgo ligeramente más bajo en comparación con la asignación anterior.

source: Custom Risk Assessment Criterion
es: Criterio de Evaluación de Riesgos Personalizado

source: We have the capacity to establish a bespoke risk assessment criterion by formulating a function that inputs the samples and assets and outputs a scalar value to be optimized. In this context, our objective is to maximize the value at risk, with particular consideration given to the diversification ratio.
es: Tenemos la capacidad de establecer un criterio de evaluación de riesgos a medida mediante la formulación de una función que introduce las muestras y activos y produce un valor escalar a optimizar. En este contexto, nuestro objetivo es maximizar el valor en riesgo, prestando especial atención al ratio de diversificación.

source: We aim to favor allocation strategies that exhibit the highest mean tightness score, while simultaneously ensuring a high level of diversification across marketing channels. As we already possess a foundational understanding of value at risk, we will concentrate our efforts on portfolio entropy.
es: Nuestro objetivo es favorecer estrategias de asignación que exhiban el puntaje medio de ajuste más alto, al mismo tiempo que garantizamos un alto nivel de diversificación a través de los canales de marketing. Dado que ya poseemos una comprensión fundamental del valor en riesgo, concentraremos nuestros esfuerzos en la entropía de la cartera.

source: We can see that the portfolio entropy is higher when the budget is allocated evenly, meaning that the diversification is higher.
es: Podemos ver que la entropía de la cartera es mayor cuando el presupuesto se asigna de manera uniforme, lo que significa que la diversificación es mayor.

source: Now, we can create our own risk assessment criterion by combining the value at risk and the portfolio entropy. In this case, we'll compute the mean tightness score and will multiply the response by the entropy in the portafolio. This will moderate our score, and we'll prefer the allocation that has the highest score, but with a high diversification between the marketing channels.
es: Ahora, podemos crear nuestro propio criterio de evaluación de riesgos combinando el valor en riesgo y la entropía de la cartera. En este caso, calcularemos la puntuación media de ajuste y multiplicaremos la respuesta por la entropía en la cartera. Esto moderará nuestra puntuación, y preferiremos la asignación que tenga la puntuación más alta, pero con una alta diversificación entre los canales de marketing.

source: We can see that the optimizer is allocating the budget more evenly between the two channels ($X1$ and $X2$), they are spending almost the same amount. This allocation is more balanced than the previous ones. Nevertheless, the total allocated budget is more balanced, the risk is higher, in response terms.
es: Podemos ver que el optimizador está asignando el presupuesto de manera más equitativa entre los dos canales ($X1$ y $X2$), están gastando casi la misma cantidad. Esta asignación es más equilibrada que las anteriores. Sin embargo, el presupuesto total asignado es más equilibrado, el riesgo es mayor, en términos de respuesta.
