Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_time_varying_media_example.po
Languages: es

source: In this particular case, we can perfectly suspect why the model had divergences. The internal structure from our world model (MMM) is neglecting time when this one is an important factor (we know this because we have carried out the due process of data generation).
es: En este caso particular, podemos sospechar perfectamente por qué el modelo tuvo divergencias. La estructura interna de nuestro modelo del mundo (MMM) está desestimando el tiempo cuando este es un factor importante (sabemos esto porque hemos llevado a cabo el debido proceso de generación de datos).

source: Despite that, let's take a look at the data that we were able to recover through this basic model.
es: A pesar de eso, echemos un vistazo a los datos que pudimos recuperar a través de este modelo básico.

source: If we decompose the posterior predictive distribution into the different components, everything becomes clear:
es: Si descomponemos la distribución predictiva posterior en los diferentes componentes, todo queda claro:

source: Some contributions end up having more units than the target value, forcing the model to compensate. Resulting in an incorrect decomposition of our marketing activities.
es: Algunas contribuciones terminan teniendo más unidades que el valor objetivo, lo que obliga al modelo a compensar. Esto resulta en una descomposición incorrecta de nuestras actividades de marketing.

source: For example, our time series ends up with a long tail of probable values ​​for marketing contributions, this tail being up to 3X greater than the maximum value of our target.
es: Por ejemplo, nuestra serie temporal termina con una larga cola de valores probables para las contribuciones de marketing, siendo esta cola hasta 3X mayor que el valor máximo de nuestro objetivo.

source: But why the contributions are over estimated? The contributions are poorly estimated because the parameters of our transformations are also poorly estimated. For example, the parameters that control the maximum effectiveness (At the saturation function) of each channel are much higher than the real ones for both channels.
es: Pero, ¿por qué se sobreestiman las contribuciones? Las contribuciones están mal estimadas porque los parámetros de nuestras transformaciones también están mal estimados. Por ejemplo, los parámetros que controlan la efectividad máxima (en la función de saturación) de cada canal son mucho más altos que los reales para ambos canales.

source: What would change if we now consider time as a factor in our model?
es: ¿Qué cambiaría si ahora consideramos el tiempo como un factor en nuestro modelo?

source: Now we can do this by adding the following parameter to the initialization of our `time_varying_media` model and changing it to `True`.
es: Ahora podemos hacer esto añadiendo el siguiente parámetro a la inicialización de nuestro modelo `time_varying_media` y cambiándolo a `True`.

source: By doing this, now our model config will have a new key `media_tvp_config` with the parameters that control the priors of our HSGP.
es: Al hacer esto, ahora nuestra configuración del modelo tendrá una nueva clave `media_tvp_config` con los parámetros que controlan los priors de nuestro HSGP.

source: Most of the divergences disappeared, this is a good sign! 🚀
es: La mayoría de las divergencias han desaparecido, ¡esto es una buena señal! 🚀

source: Let's check our samples!
es: ¡Revisemos nuestras muestras!

source: Everything seems fine for now, there is nothing that raises red flags when analyzing our trace. But what about the decomposition?
es: Todo parece estar bien por ahora, no hay nada que genere alertas al analizar nuestro rastro. Pero, ¿qué pasa con la descomposición?

source: The decomposition looks much better now 🔥 It seems that we are estimating each parameter better, and there are no obvious trade-offs between components!
es: La descomposición se ve mucho mejor ahora 🔥 Parece que estamos estimando cada parámetro de manera más precisa, ¡y no hay compromisos obvios entre los componentes!

source: Let's see how well the original parameters have managed to be recovered?
es: Veamos qué tan bien se han logrado recuperar los parámetros originales.

source: The parameters of the saturation function seem to be recovered practically in their entirety for both channels! This is great 🎉
es: ¡Los parámetros de la función de saturación parecen haberse recuperado prácticamente en su totalidad para ambos canales! ¡Esto es genial 🎉!

source: Let's see how much we manage to recover from the true variation. We can analyze the variable `media_temporal_latent_multiplier` and compare it against the original variable used in the original process.
es: Veamos cuánto logramos recuperar de la verdadera variación. Podemos analizar la variable `media_temporal_latent_multiplier` y compararla con la variable original utilizada en el proceso original.

source: Incredible 🚀 we recovered the latent process almost perfectly. Although it seems a little overestimated, it is quite close to the real thing!
es: Increíble 🚀 hemos recuperado el proceso latente casi a la perfección. Aunque parece un poco sobreestimado, ¡está bastante cerca de la realidad!

source: This is reflected when comparing the recovered contribution against the original. We can see that they are exactly the same!
es: Esto se refleja al comparar la contribución recuperada con la original. ¡Podemos ver que son exactamente iguales!

source: We can compare now the contributions split by channel between our two models.
es: Podemos comparar ahora la distribución de las contribuciones por canal entre nuestros dos modelos.

source: Contributions per channel were also recovered correctly, unlike our first model! Actually, we see how the base model tries (and fails!) to capture the true variation. The reason is clear: lack of flexibility.
es: Las contribuciones por canal también se recuperaron correctamente, ¡a diferencia de nuestro primer modelo! De hecho, vemos cómo el modelo base intenta (¡y falla!) capturar la verdadera variación. La razón es clara: falta de flexibilidad.

source: Insights
es: Perspectivas

source: The Bayesian approach not only facilitates hypothesis testing and model validation but also provides a structured way to incorporate prior knowledge and test various assumptions about the data-generating process. The occurrence of divergences, as observed in our initial model fitting, underscores the importance of model specification and alignment with the underlying data structure. These divergences serve as a diagnostic tool, guiding further refinement and improvement of the model.
es: El enfoque bayesiano no solo facilita la prueba de hipótesis y la validación de modelos, sino que también proporciona una manera estructurada de incorporar conocimientos previos y probar diversas suposiciones sobre el proceso de generación de datos. La ocurrencia de divergencias, como se observó en nuestro ajuste inicial del modelo, subraya la importancia de la especificación del modelo y su alineación con la estructura subyacente de los datos. Estas divergencias sirven como una herramienta de diagnóstico, guiando el posterior refinamiento y mejora del modelo.

source: In summary, using PyMC-Marketing to build time-aware MMM models enables marketers to gain deeper insights and achieve a more accurate understanding of the impact of their efforts. This methodology enhances the ability to make data-driven decisions, optimize marketing strategies, and ultimately drive better business outcomes.
es: En resumen, utilizar PyMC-Marketing para construir modelos MMM conscientes del tiempo permite a los mercadólogos obtener una comprensión más profunda y precisa del impacto de sus esfuerzos. Esta metodología mejora la capacidad de tomar decisiones basadas en datos, optimizar estrategias de marketing y, en última instancia, impulsar mejores resultados comerciales.

source: Conclusion
es: Conclusión

source: Throughout this notebook, we have explored the implementation of a Bayesian Marketing Mix Model (MMM) using PyMC, comparing the performance and insights gained from models with and without a time component. The key takeaway from our analysis is the significant advantage of incorporating time-varying factors into MMM.
es: A lo largo de este cuaderno, hemos explorado la implementación de un Modelo de Mezcla de Marketing Bayesiano (MMM) utilizando PyMC, comparando el rendimiento y los conocimientos obtenidos de modelos con y sin un componente temporal. La conclusión clave de nuestro análisis es la ventaja significativa de incorporar factores que varían en el tiempo en el MMM.

source: Uncovering Real Causal Relationships
es: Descubriendo Relaciones Causales Reales

source: By integrating a time component, we can uncover the true causal relationships between our target variable (such as sales) and our marketing efforts. The traditional approach, which neglects temporal dynamics, often fails to capture the complex and fluctuating nature of real-world marketing performance. In contrast, the time-dependent model provides a more accurate and nuanced understanding of how marketing activities influence outcomes over time.
es: Al integrar un componente temporal, podemos descubrir las verdaderas relaciones causales entre nuestra variable objetivo (como las ventas) y nuestros esfuerzos de marketing. El enfoque tradicional, que descuida las dinámicas temporales, a menudo no logra capturar la naturaleza compleja y fluctuante del rendimiento del marketing en el mundo real. En contraste, el modelo dependiente del tiempo proporciona una comprensión más precisa y matizada de cómo las actividades de marketing influyen en los resultados a lo largo del tiempo.

source: Advantages of PyMC-Marketing
es: Ventajas de PyMC-Marketing

source: PyMC-Marketing, offers powerful tools to implement these advanced methodologies. The new features and functionalities, including the handling differents adstock effects, saturation effects, and Hilbert Space Gaussian processes (HSGP) for modeling time-varying components, allow for more precise and reliable modeling of marketing data.
es: PyMC-Marketing ofrece herramientas poderosas para implementar estas metodologías avanzadas. Las nuevas características y funcionalidades, que incluyen el manejo de diferentes efectos de adstock, efectos de saturación y procesos gaussianos en el espacio de Hilbert (HSGP) para modelar componentes que varían en el tiempo, permiten un modelado más preciso y confiable de los datos de marketing.

source: We encourage practitioners to leverage these advanced techniques and the capabilities of PyMC-Marketing to improve their marketing analytics and gain a competitive edge in their strategic planning.
es: Animamos a los profesionales a aprovechar estas técnicas avanzadas y las capacidades de PyMC-Marketing para mejorar su análisis de marketing y obtener una ventaja competitiva en su planificación estratégica.

source: Bonus
es: Bono

source: This notebook simulated a very simple variation, it is possible that the true time-dependent latent processes hidden in your data are more complex therefore, you will need to use `priors` to guide your model to find the real data.
es: Este cuaderno simuló una variación muy simple, es posible que los verdaderos procesos latentes dependientes del tiempo ocultos en sus datos sean más complejos, por lo tanto, necesitará utilizar `priors` para guiar su modelo a encontrar los datos reales.

source: One way to achieve this is through modifying the model configuration.
es: Una forma de lograr esto es mediante la modificación de la configuración del modelo.
