Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_example.po
Languages: es

source: 2. Model Specification
es: 2. Especificación del modelo

source: We can specify the model structure using the {class}`MMM <pymc_marketing.mmm.mmm.MMM>` class. This class, handles a lot of internal boilerplate code for us such us scaling the data (see details below) and handy diagnostics and reporting plots. One great feature is that we can specify the channel priors distributions ourselves, which fundamental component of the [bayesian workflow](https://arxiv.org/abs/2011.01808) as we can incorporate our prior knowledge into the model. This is one of the most important advantages of using a bayesian approach. Let's see how we can do it.
es: Podemos especificar la estructura del modelo usando la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>`. Esta clase maneja gran parte del código interno repetitivo por nosotros, como el escalado de los datos (ver detalles más abajo) y útiles diagnósticos y gráficas de reporte. Una gran característica es que podemos especificar nosotros mismos las distribuciones a priori por canal, lo cual es un componente fundamental del [flujo de trabajo bayesiano](https://arxiv.org/abs/2011.01808) ya que podemos incorporar nuestro conocimiento previo en el modelo. Esta es una de las ventajas más importantes de usar un enfoque bayesiano. Veamos cómo hacerlo.

source: As we do not know much more about the channels, we start with a simple heuristic:
es: Como no sabemos mucho más sobre los canales, empezamos con una heurística sencilla:

source: The channel contributions should be positive, so we can for example use a {class}`HalfNormal <pymc.distributions.continuous.HalfNormal>` distribution as prior. We need to set the `sigma` parameter per channel. The higher the `sigma`, the more "freedom" it has to fit the data. To specify `sigma` we can use the following point.
es: Las contribuciones de los canales deberían ser positivas, por lo que, por ejemplo, podemos usar una distribución {class}`HalfNormal <pymc.distributions.continuous.HalfNormal>` como prior. Necesitamos fijar el parámetro `sigma` por canal. Cuanto mayor sea `sigma`, más "libertad" tendrá para ajustar los datos. Para especificar `sigma` podemos usar el siguiente punto.

source: We expect channels where we spend the most to have more attributed sales , before seeing the data. This is a very reasonable assumption (note that we are not imposing anything at the level of efficiency!).
es: Esperamos que los canales donde más gastamos tengan más ventas atribuidas, antes de ver los datos. Este es un supuesto muy razonable (¡ten en cuenta que no estamos imponiendo nada a nivel de eficiencia!).

source: How to incorporate this heuristic into the model? To begin with, it is important to note that the {class}`MMM <pymc_marketing.mmm.mmm.MMM>` class scales the target and input variables through an [`MaxAbsScaler`](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MaxAbsScaler.html) transformer from [`scikit-learn`](https://scikit-learn.org/stable/), its important to specify the priors in the scaled space (i.e. between 0 and 1). One way to do it is to use the spend share as the `sigma` parameter for the `HalfNormal` distribution. We can actually add a scaling factor to take into account the support of the distribution.
es: ¿Cómo incorporar esta heurística en el modelo? Para empezar, es importante notar que la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>` escala las variables objetivo y de entrada mediante un transformador [`MaxAbsScaler`](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MaxAbsScaler.html) de [`scikit-learn`](https://scikit-learn.org/stable/); es importante especificar los priors en el espacio escalado (es decir, entre 0 y 1). Una forma de hacerlo es usar la cuota de gasto como parámetro `sigma` para la distribución `HalfNormal`. De hecho, podemos añadir un factor de escalado para tener en cuenta el soporte de la distribución.

source: First, let's compute the share of spend per channel:
es: Primero, calculemos la cuota de gasto por canal:

source: Next, we specify the `sigma` parameter per channel:
es: A continuación, especificamos el parámetro `sigma` por canal:

source: Delayed Saturated MMM follows sklearn convention, so we need to split our data into X (predictors) and y(target value)
es: El MMM Saturado con Retardo sigue la convención de sklearn, por lo que debemos dividir nuestros datos en X (predictores) e y (valor objetivo)

source: You can use the optional parameter 'model_config' to apply your own priors to the model. Each entry in the 'model_config' contains a key that corresponds to a registered distribution name in our model. The value of the key is a dictionary that describes the input parameters of that specific distribution.
es: Puedes usar el parámetro opcional 'model_config' para aplicar tus propios priors al modelo. Cada entrada en 'model_config' contiene una clave que corresponde a un nombre de distribución registrado en nuestro modelo. El valor de la clave es un diccionario que describe los parámetros de entrada de esa distribución específica.

source: If you're unsure how to define your own priors, you can use the 'default_model_config' property of {class}`MMM <pymc_marketing.mmm.mmm.MMM>` to see the required structure.
es: Si no estás seguro de cómo definir tus propios priors, puedes usar la propiedad 'default_model_config' de {class}`MMM <pymc_marketing.mmm.mmm.MMM>` para ver la estructura requerida.

source: You can change only the prior parameters that you wish, no need to alter all of them, unless you'd like to!
es: Puedes cambiar únicamente los parámetros a priori que desees; no es necesario modificar todos, ¡a menos que quieras!

source: **Remark:** For the prior specification there is no right or wrong answer. It all depends on the data, the context and the assumptions you are willing to make. It is always recommended to do some prior predictive sampling and sensitivity analysis to check the impact of the priors on the posterior. We skip this here for the sake of simplicity. If you are not sure about specific priors, the {class}`MMM <pymc_marketing.mmm.mmm.MMM>` class has some default priors that you can use as a starting point.
es: **Nota:** Para la especificación de priors no hay una respuesta correcta o incorrecta. Todo depende de los datos, el contexto y los supuestos que estés dispuesto a hacer. Siempre se recomienda realizar muestreo predictivo previo y análisis de sensibilidad para comprobar el impacto de los priors en el posterior. Omitimos esto aquí por simplicidad. Si no estás seguro sobre priors específicos, la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>` tiene algunos priors predeterminados que puedes usar como punto de partida.

source: Model sampler allows specifying set of parameters that will be passed to fit the same way as the `kwargs` are getting passed so far. It doesn't disable the fit kwargs, but rather extend them, to enable customizable and preservable configuration. By default the sampler_config for {class}`MMM <pymc_marketing.mmm.mmm.MMM>` is empty. But if you'd like to use it, you can define it like showed below:
es: El muestreador del modelo permite especificar un conjunto de parámetros que se pasarán a `fit` de la misma manera que se han estado pasando los `kwargs` hasta ahora. No deshabilita los kwargs de `fit`, sino que los amplía para permitir una configuración personalizable y preservable. Por defecto, `sampler_config` para {class}`MMM <pymc_marketing.mmm.mmm.MMM>` está vacío. Pero si deseas usarlo, puedes definirlo como se muestra a continuación:

source: Now we are ready to use the {class}`MMM <pymc_marketing.mmm.mmm.MMM>` class to define the model.
es: Ahora estamos listos para usar la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>` para definir el modelo.

source: Observe how the media transformations were handled by the class `MMM`.
es: Observa cómo la clase `MMM` gestionó las transformaciones de medios.

source: To assess the model prior parameters we can look into the prior predictive plot:
es: Para evaluar los parámetros a priori del modelo podemos consultar la gráfica predictiva previa:

source: The prior predictive plot shows that the priors are not too informative.
es: La gráfica predictiva previa muestra que los priors no son demasiado informativos.

source: 3. Model Fitting
es: 3. Ajuste del modelo

source: We can now fit the model:
es: Ahora podemos ajustar el modelo:

source: You can use other NUTS samplers to fit the model as one can do with PyMC models. You just need to make sure to have the packages installed in your local environment. See {ref}`other_nuts_samplers`.
es: Puedes usar otros muestreadores NUTS para ajustar el modelo como se puede hacer con modelos de PyMC. Solo necesitas asegurarte de tener los paquetes instalados en tu entorno local. Consulta {ref}`other_nuts_samplers`.

source: You can access `pymc` model as `mmm.model`.
es: Puedes acceder al modelo `pymc` como `mmm.model`.

source: We can easily see the explicit model structure:
es: Podemos ver fácilmente la estructura explícita del modelo:

source: Note: You may notice that the graph here is an explicit version of our initial drawing (DAG), where we can now explicitly see all the different components that were included in each node, including their dimensionality. This graph is another way of looking at the same causal assumptions, made during the construction of the bayesian generative model.
es: Nota: Puedes notar que el gráfico aquí es una versión explícita de nuestro dibujo inicial (DAG), donde ahora podemos ver explícitamente todos los componentes diferentes que se incluyeron en cada nodo, incluyendo su dimensionalidad. Este gráfico es otra forma de ver las mismas suposiciones causales, realizadas durante la construcción del modelo generativo bayesiano.

source: 4. Model Diagnostics
es: 4. Diagnóstico del modelo

source: A good place to start is by looking if the model had any divergences:
es: Un buen lugar para empezar es verificar si el modelo tuvo alguna divergencia:

source: We got none! 🙌
es: ¡No obtuvimos ninguna! 🙌

source: The {func}`fit_result <pymc_marketing.mmm.mmm.MMM.fit_result>` attribute contains the `pymc` trace object.
es: El atributo {func}`fit_result <pymc_marketing.mmm.mmm.MMM.fit_result>` contiene el objeto de traza `pymc`.

source: We can therefore use all the `pymc` machinery to run model diagnostics. First, let's see the summary of the trace:
es: Por lo tanto, podemos usar toda la maquinaria `pymc` para ejecutar el diagnóstico del modelo. Primero, veamos el resumen de la traza:

source: Observe that the estimated parameters for $\alpha$ and $\lambda$ are very close to the ones we set in the data generation process! Let's plot the trace for the parameters:
es: Observa que los parámetros estimados para $\alpha$ y $\lambda$ son muy cercanos a los que establecimos en el proceso de generación de datos! Vamos a trazar la traza para los parámetros:

source: Now we sample from the posterior predictive distribution:
es: Ahora tomamos muestras de la distribución predictiva posterior:

source: We can now plot the posterior predictive distribution for the target variable. By default, the `plot_posterior_predictive` method will plot the mean prediction along with a 94% and 50% HDI.
es: Ahora podemos trazar la distribución predictiva posterior para la variable objetivo. Por defecto, el método `plot_posterior_predictive` trazará la predicción media junto con un 94% y 50% HDI.

source: But you can also remove the mean and HDI and add a gradient, which shows the range of the posterior predictive distribution.
es: Pero también puedes eliminar la media y el HDI y añadir un gradiente, que muestra el rango de la distribución predictiva posterior.

source: The fit looks very good (as expected)!
es: El ajuste parece muy bueno (como se esperaba)!

source: We can inspect the model errors:
es: Podemos inspeccionar los errores del modelo:

source: We can actually extract the whole error posterior distribution for custom error analyzes:
es: Podemos extraer realmente la distribución posterior completa de los errores para análisis de errores personalizados:

source: Next, we can decompose the posterior predictive distribution into the different components:
es: A continuación, podemos descomponer la distribución predictiva posterior en los diferentes componentes:

source: **Remark:** This plot shows the decomposition of the normalized target variable when by dividing by its maximum value. Do not forget that internally we are scaling the variables to make the model sample more efficiently. You can recover the transformations from the API methods, e.g.
es: **Nota:** Este gráfico muestra la descomposición de la variable objetivo normalizada al dividir por su valor máximo. No olvides que internamente escalamos las variables para hacer que el modelo muestre más eficientemente. Puedes recuperar las transformaciones de los métodos de API, por ejemplo.

source: We plot in the original scale by simply passing the `original_scale=True` argument:
es: Trazamos en la escala original pasando el argumento `original_scale=True`:

source: A similar decomposition can be achieved using an area plot:
es: Se puede lograr una descomposición similar usando un gráfico de área:

source: Note that this only works if the contributions of the channel or control variable are strictly positive.
es: Nota: Esto solo funciona si las contribuciones del canal o la variable de control son estrictamente positivas.

source: Next, we look into the absolute historical contributions of each component:
es: A continuación, miramos las contribuciones históricas absolutas de cada componente:

source: Note that we have recovered the true values for all the parameters! Well, in fact the contributions of the `intercept` and `t` are not exactly the same as int the data generating process, but the aggregate does match the true values of `intercept` + `trend`. The reason is that the true latent trend is not completely linear. One could use the time-varying intercept feature to capture this effect.
es: Nota: Hemos recuperado los valores verdaderos para todos los parámetros! Bueno, de hecho, las contribuciones de `intercept` y `t` no son exactamente las mismas que en el proceso de generación de datos, pero el agregado coincide con los valores verdaderos de `intercept` + `trend`. La razón es que la tendencia latente verdadera no es completamente lineal. Uno podría usar el `intercepto variable en el tiempo` para capturar este efecto.

source: We can extract the data itself of all the input variables contributions over time, i.e. the regression coefficients times the feature values, as follows:
es: Podemos extraer los datos de las contribuciones de todas las variables de entrada a lo largo del tiempo, es decir, los coeficientes de regresión por los valores de las características, de la siguiente manera:

source: 5. Media Parameters
es: 5. Parámetros de medios

source: We can deep-dive into the media transformation parameters. We want to compare the posterior distributions against the true values.
es: Podemos profundizar en los parámetros de transformación de medios. Queremos comparar las distribuciones posteriores con los valores verdaderos.

source: We indeed see that our media parameter were successfully recovered!
es: En efecto, vemos que nuestros parámetros de medios se recuperaron con éxito!

source: 6. Media Deep-Dive
es: 6. Profundización en medios

source: First we can compute the relative contribution of each channel to the target variable. Note that we recover the true values!
es: Primero podemos calcular la contribución relativa de cada canal a la variable objetivo. Ten en cuenta que recuperamos los valores verdaderos!

source: Next, we can plot the relative contribution of each channel to the target variable.
es: A continuación, podemos trazar la contribución relativa de cada canal a la variable objetivo.

source: First we plot the **direct contribution** per channel. Again, we get very close values as the ones obtained in Part I.
es: Primero trazamos la **contribución directa** por canal. De nuevo, obtenemos valores muy cercanos a los obtenidos en la Parte I.

source: Note that trying to get the delayed cumulative contribution is not that easy as contributions from the past leak into the future. Specifically, note that we apply the saturation function to the aggregation. As the saturation function is non-linear. This is not the same as taking the sum of the saturation contributions Hence, is very hard to reverse engineer the contribution after carryover and saturation composition this way.
es: Nota: Intentar obtener la contribución acumulada con retardo no es tan fácil como las contribuciones del pasado se filtran al futuro. Específicamente, ten en cuenta que aplicamos la función de saturación a la agregación. Como la función de saturación es no lineal. Esto no es lo mismo que tomar la suma de las contribuciones de saturación. Por lo tanto, es muy difícil invertir el cálculo de la contribución después de la composición de adstock y saturación de esta manera.

source: A more transparent alternative is to evaluate the channel contribution at different share spend levels for the complete training period. Concretely, if the denote by $\delta$ the input channel data percentage level, so that for $\delta = 1$ we have the model input spend data and for $\delta = 1.5$ we have a $50\%$ increase in the spend, then we can compute the channel contribution at a grid of $\delta$-values and plot the results:
es: Una alternativa más transparente es evaluar la contribución del canal en diferentes niveles de gasto compartido para el período de entrenamiento completo. Concretamente, si denotamos por $\delta$ el nivel porcentual de los datos de entrada del canal, de modo que para $\delta = 1$ tenemos los datos de gasto de entrada del modelo y para $\delta = 1.5$ tenemos un aumento del 50% en el gasto, entonces podemos calcular la contribución del canal en una cuadrícula de valores $\delta$ y trazar los resultados:

source: This plot does account for carryover (adstock) and saturation effects.
es: Este gráfico tiene en cuenta el arrastre (adstock) y el efecto de saturación.

source: We see that when we have no spend, the contribution is zero (assuming there twas no spend in the past, otherwise the carryover effect would be non-zero).
es: Vemos que cuando no hay gasto, la contribución es cero (suponiendo que no hubo gasto en el pasado, de lo contrario el efecto de arrastre no sería cero).

source: Observe that these grid values serve as inputs for an optimization step.
es: Observa que estos valores de cuadrícula sirven como entradas para un paso de optimización.

source: We can also plot the same contribution using the x-axis as the total channel input (e.g. total spend in EUR).
es: También podemos trazar la misma contribución usando el eje x como la entrada total del canal (p. ej., el gasto total en EUR).

source: 7. Contribution Recovery
es: 7. Recuperación de contribuciones

source: Next, we can plot the direct contribution of each channel to the target variable over time.
es: A continuación, podemos trazar la contribución directa de cada canal a la variable objetivo a lo largo del tiempo.

source: The results look great! We therefore successfully recovered the true values from the data generation process. We have also seen how easy is to use the {class}`MMM <pymc_marketing.mmm.mmm.MMM>` class to fit media mix models! It takes over the model specification and the media transformations, while having all the flexibility of `pymc`!
es: ¡Los resultados son excelentes! Por lo tanto, recuperamos con éxito los valores del proceso de generación de datos. También hemos visto lo fácil que es usar la clase {class}`MMM <pymc_marketing.mmm.mmm.MMM>` para ajustar modelos de mezcla de medios! Toma sobre la especificación del modelo y las transformaciones de medios, mientras que tiene toda la flexibilidad de `pymc`!

source: Finally, we can compute the (approximate) ROAS posterior distribution for each channel.
es: Finalmente, podemos calcular la distribución posterior (aproximada) de ROAS para cada canal.

source: We see that the ROAS posterior distributions are centered around the true values! We also see that, even considering the uncertainty, channel $x_{1}$ is more efficient than channel $x_{2}$.
es: Vemos que las distribuciones posteriores de ROAS están centradas en los valores verdaderos. También vemos que, incluso considerando la incertidumbre, el canal $x_{1}$ es más eficiente que el canal $x_{2}$.

source: It is also useful to compare the ROAS and the contribution share. In the next plot we plot these two these two inferred estimates per channel.
es: También es útil comparar el ROAS y la contribución de la cuota. En el siguiente gráfico trazamos estas dos estimaciones inferidas por canal.

source: This plot is very effective summarizing channel efficiency. In this example, it turns out that the most efficient channel $x_1$ has a higher contribution share than the less efficient channel $x_2$.
es: Este gráfico es muy efectivo para resumir la eficiencia del canal. En este ejemplo, resulta que el canal más eficiente $x_1$ tiene una cuota de contribución mayor que el canal menos eficiente $x_2$.

source: 9. Out of Sample Predictions
es: 9. Predicciones fuera de muestra

source: Out of sample predictions are done with the `predict` and `posterior_predictive` methods. These include
es: Las predicciones fuera de muestra se realizan con los métodos `predict` y `posterior_predictive`. Estos incluyen

source: `sample_posterior_predictive` : Get the full posterior predictive distribution
es: `sample_posterior_predictive` : Obtener la distribución predictiva posterior completa

source: `predict`: Get the mean of the posterior predictive distribution
es: `predict`: Obtener la media de la distribución predictiva posterior

source: These methods take new data, `X`, and some additional `kwargs` for new predictions. Namely,
es: Estos métodos toman nuevos datos, `X`, y algunos `kwargs` adicionales para nuevas predicciones. Específicamente,

source: `include_last_observations` : boolean flag in order to carry adstock effects from last observations in the training dataset
es: `include_last_observations` : booleano para llevar efectos de adstock de las últimas observaciones en el conjunto de datos de entrenamiento

source: The new data needs to have all the features that are specified in the model. There is no need to worry about:
es: Los nuevos datos necesitan tener todas las características que se especifican en el modelo. No hay que preocuparse por:

source: input scaling of channel spends
es: escalado de gastos de canales de entrada

source: creating fourier transformations on the `date_column`
es: creación de transformaciones de Fourier en la columna `date_column`

source: inverse scaling back to target domain
es: escalado inverso al dominio de destino

source: That will be done automatically! However, please note that control variables are NOT automatically scaled - if needed, you must scale them before passing the data to the model.
es: ¡Esto se hará automáticamente! Sin embargo, por favor ten en cuenta que las variables de control NO se escalan automáticamente - si es necesario, debes escalarlas antes de pasar los datos al modelo.

source: Call the desired method to get the new samples! The new coordinates will be from the new dates
es: Llama al método deseado para obtener las nuevas muestras! Las nuevas coordenadas serán de las nuevas fechas
