Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_counterfactuals.po
Languages: es

source: MMMs and Pearl's ladder of causal inference
es: MMMs y la escalera de inferencia causal de Pearl

source: In this notebook, we will explore [Judea Pearl's](https://en.wikipedia.org/wiki/Judea_Pearl) causal ladder and how it can be applied to solve business problems with Media Mix Models (MMMs). We will assume familiarity with the basics of MMMs in order to focus on causal inference.
es: En este cuaderno, exploraremos la escalera causal de [Judea Pearl](https://en.wikipedia.org/wiki/Judea_Pearl) y cómo se puede aplicar para resolver problemas empresariales con Modelos de Mezcla de Medios (MMM). Supondremos familiaridad con los conceptos básicos de los MMM para centrarnos en la inferencia causal.

source: What is Pearl's causal ladder?
es: ¿Cuál es la escalera causal de Pearl?

source: Pearl's causal ladder outlines 3 successively more sophisticated levels of causal reasoning:
es: La escalera causal de Pearl describe 3 niveles de razonamiento causal sucesivamente más sofisticados:

source: **Prediction / Forecasting / Association:** With the first step on the ladder, we could use a model to predict future sales based on past data. This does not involve causal reasoning, just prediction.
es: **Predicción / Pronóstico / Asociación:** Con el primer paso en la escalera, podríamos utilizar un modelo para predecir las ventas futuras basándonos en datos pasados. Esto no implica razonamiento causal, solo predicción.

source: **Intervention:** The second step on the ladder involves using a model to predict the future effect of an intervention. It is similar to step 1 in that it involves prediction/forecasting, but it is different in that we consider a potential intervention that will have effects in the future.
es: **Intervención:** El segundo paso en la escalera implica utilizar un modelo para predecir el efecto futuro de una intervención. Es similar al paso 1 en que involucra predicción/forecasting, pero es diferente en que consideramos una intervención potencial que tendrá efectos en el futuro.

source: **Counterfactuals:** The third and final step on the ladder could use a to estimate how the world _would_ have been different if we had taken a different action in the past. This is clearly different from the first two steps in that it is retrospective. It is also the most sophisticated level of causal reasoning - it involves learning about the world from historical data, but then imagining how the world _could_ have been different in a counterfactual scenario.
es: **Contrafactuales:** El tercer y último paso en la escalera podría utilizar un {like_this} para estimar cómo habría sido diferente el mundo si hubiéramos tomado una acción diferente en el pasado. Esto es claramente diferente de los dos primeros pasos en que es retrospectivo. También es el nivel más sofisticado de razonamiento causal: implica aprender sobre el mundo a partir de datos históricos, pero luego imaginar cómo podría haber sido diferente el mundo en un escenario contrafactual.

source: ![Causal Ladder](../../_static/causal_ladder.png)
es: ![Escalera Causal](../../_static/causal_ladder.png)

source: Causal Ladder
es: Escalera Causal

source: The image of Pearl's causal ladder appears in the book "[The Book of Why](https://en.wikipedia.org/wiki/The_Book_of_Why)" by Judea Pearl and Dana Mackenzie. The book is a great introduction to causal inference.
es: La imagen de la escalera causal de Pearl aparece en el libro "[The Book of Why](https://en.wikipedia.org/wiki/The_Book_of_Why)" de Judea Pearl y Dana Mackenzie. El libro es una excelente introducción a la inferencia causal.

source: The do-operator
es: El operador do

source: The do-operator is a key concept in Pearl's causal inference framework and is required for causal reasoning on steps 2 or 3 of the causal ladder. It is used to denote interventions in a system. If we think about our modeling efforts as describing a Bayesian structural causal model, then the do-operator is used to denote the effect of changing a variable in the model. Any incoming causal links to that node are severed, and the node is set to the value specified by the do-operator.
es: El operador do es un concepto clave en el marco de inferencia causal de Pearl y es necesario para el razonamiento causal en los pasos 2 o 3 de la escalera causal. Se utiliza para denotar intervenciones en un sistema. Si pensamos en nuestros esfuerzos de modelado como la descripción de un modelo causal estructural bayesiano, entonces el operador do se utiliza para denotar el efecto de cambiar una variable en el modelo. Cualquier enlace causal entrante a ese nodo se corta, y el nodo se establece en el valor especificado por el operador do.

source: For practical examples of the do-operator in action, the following resources are useful:
es: Para ejemplos prácticos del operador do en acción, los siguientes recursos son útiles:

source: [Causal analysis with PyMC: Answering "What If?" with the new do operator](https://www.pymc-labs.com/blog-posts/causal-analysis-with-pymc-answering-what-if-with-the-new-do-operator/)
es: Análisis causal con PyMC: Respondiendo a "¿Qué pasaría si?" con el nuevo operador do

source: [Interventional distributions and graph mutation with the do-operator](https://www.pymc.io/projects/examples/en/latest/causal_inference/interventional_distribution.html)
es: Distribuciones interventionales y mutación de gráficos con el operador do.

source: How does this help us solve business problems?
es: ¿Cómo nos ayuda esto a resolver problemas de negocio?

source: Now we've recapped the causal ladder, let's consider how it can help us solve business problems, specifically with MMMs. Let's look at a few example use cases and see what level of the causal ladder they correspond to:
es: Ahora que hemos resumido la escalera causal, consideremos cómo puede ayudarnos a resolver problemas empresariales, específicamente con los MMM. Veamos algunos casos de uso de ejemplo y veamos a qué nivel de la escalera causal corresponden:

source: **Predicting future sales:** A very common use-case of MMM's is to make forecasts of our outcome variable (e.g. sales). This can be particularly useful ingredient in demand forecasting for example. Once we've trained an MMM on historical data we can use the MMM to predict future sales (out of sample prediction) based on past sales, marketing spend, and other predictor variables. This would correspond to step 1 on the causal ladder - we are forecasting into the future but not considering any changes to our marketing strategy. See our docs {ref}`mmm_budget_allocation_example` for a worked example.
es: **Predicción de ventas futuras:** Un caso de uso muy común de los MMM es hacer pronósticos de nuestra variable de resultado (por ejemplo, ventas). Esto puede ser un ingrediente particularmente útil en la previsión de la demanda, por ejemplo. Una vez que hemos entrenado un MMM con datos históricos, podemos utilizar el MMM para predecir ventas futuras (predicción fuera de muestra) basándonos en ventas pasadas, gasto en marketing y otras variables predictoras. Esto correspondería al paso 1 en la escalera causal: estamos pronosticando hacia el futuro pero no considerando ningún cambio en nuestra estrategia de marketing. Consulte nuestra documentación {ref}`mmm_budget_allocation_example` para un ejemplo trabajado.

source: **Optimizing existing marketing spend:** A more sophisticated use-case of MMM's is to use the model to predict the effect of different marketing strategies (see our docs {ref}`mmm_time_slice_cross_validation`). For example, we could use it to predict the effect of various different changes to media spend. We could then predict the expected sales under these scenarios and pick a scenario which maximises sales or profit, for example. This corresponds to step 2 on the causal ladder - intervention. This is a more sophisticated level of causal reasoning, as it involves prediction, but in the presence of an altered marketing strategies (i.e. interventions).
es: **Optimización del gasto en marketing existente:** Un caso de uso más sofisticado de los MMM es utilizar el modelo para predecir el efecto de diferentes estrategias de marketing (consulte nuestra documentación {ref}`mmm_time_slice_cross_validation`). Por ejemplo, podríamos usarlo para predecir el efecto de varios cambios en el gasto en medios. Luego podríamos predecir las ventas esperadas bajo estos escenarios y elegir un escenario que maximice las ventas o el beneficio, por ejemplo. Esto corresponde al paso 2 en la escalera causal - intervención. Este es un nivel más sofisticado de razonamiento causal, ya que implica predicción, pero en presencia de estrategias de marketing alteradas (es decir, intervenciones).

source: **Planning an increase in marketing spend:** Let's say our business wants to gain more market share and has decided to increase marketing spend by 20% over the next quarter. You are tasked with proposing a number of different future media spend strategies that you think will cause the largest increase in sales. This corresponds to step 2 on the causal ladder - intervention. We are predicting the effect of an intervention (increasing media spend) on sales.
es: **Planificación de un aumento en el gasto en marketing:** Supongamos que nuestro negocio desea ganar más cuota de mercado y ha decidido aumentar el gasto en marketing en un 20% durante el próximo trimestre. Se le ha encomendado la tarea de proponer una serie de diferentes estrategias de gasto en medios futuros que usted cree que causarán el mayor aumento en las ventas. Esto corresponde al paso 2 en la escalera causal - intervención. Estamos prediciendo el efecto de una intervención (aumento del gasto en medios) en las ventas.

source: **Evaluating the impact of a previous increase in marketing spend:** Let's say our business increased TV spend by 20% over the last quarter and we want to know what impact this had on sales. We can answer this question by comparing what _actually_ happened, to what we think _would have happened_ under some alternative imagined counterfactual scenario such as not increasing TV spend by 20%. Importantly, this counterfactual reasoning is _retrospective_, but it uses the knowledge we have learnt from all observations so far. This corresponds to step 3 on the causal ladder - counterfactual inference. We are learning from historical data, but then imagining how the world _could_ have been different in a counterfactual scenario. So this involves retrospective causal reasoning.
es: **Evaluando el impacto de un aumento previo en el gasto de marketing:** Supongamos que nuestro negocio aumentó el gasto en televisión en un 20% durante el último trimestre y queremos saber qué impacto tuvo esto en las ventas. Podemos responder a esta pregunta comparando lo que _realmente_ sucedió con lo que creemos que _habría sucedido_ en algún escenario contrafactual alternativo imaginado, como no haber aumentado el gasto en televisión en un 20%. Es importante destacar que este razonamiento contrafactual es _retrospectivo_, pero utiliza el conocimiento que hemos aprendido de todas las observaciones hasta ahora. Esto corresponde al paso 3 en la escalera causal - inferencia contrafactual. Estamos aprendiendo de datos históricos, pero luego imaginamos cómo el mundo _podría_ haber sido diferente en un escenario contrafactual. Así que esto implica un razonamiento causal retrospectivo.

source: Notebook setup
es: Configuración del cuaderno

source: Generate synthetic data
es: Generar datos sintéticos

source: Now we'll generate some synthetic data to use in the rest of the notebook. In short, we will consider a relatively simple situation where we have two media channels ($x_1$ and $x_2$), and we consider the effects of time in terms of an underlying trend in sales as well as seasonal effects. We can draw our causal DAG like this:
es: Ahora generaremos algunos datos sintéticos para utilizar en el resto del cuaderno. En resumen, consideraremos una situación relativamente simple en la que tenemos dos canales de medios ($x_1$ y $x_2$), y consideramos los efectos del tiempo en términos de una tendencia subyacente en las ventas, así como efectos estacionales. Podemos representar nuestro DAG causal de la siguiente manera:

source: In the code below we will generate some synthetic data with the general structure described above. Our dataset is going to include a marketing campaign where we elevate the spending on one media channel for a period of time. This is going to be used later on when we come to examine Step 3 where we will evaluate the impact of this campaign.
es: En el código a continuación, generaremos algunos datos sintéticos con la estructura general descrita anteriormente. Nuestro conjunto de datos incluirá una campaña de marketing en la que aumentamos el gasto en un canal de medios durante un período de tiempo. Esto se utilizará más adelante cuando lleguemos a examinar el Paso 3, donde evaluaremos el impacto de esta campaña.

source: As a slight twist is that because we are using simulated data, we are in the privileged position of knowing the true causal relationships in the data. This is not the case in the real world, where we have to infer these relationships from the data. So we'll first generate a _counterfactual_ scenario (where we didn not run the campaign) and then generate the _actual_ scenario (where we did run the campaign). This allows us to compare our _estimated_ causal impact of the campaign with the _true_ causal impact of the campaign. But more on this when we reach Step 3 of the causal ladder.
es: Como una ligera variación, dado que estamos utilizando datos simulados, nos encontramos en la posición privilegiada de conocer las verdaderas relaciones causales en los datos. Este no es el caso en el mundo real, donde debemos inferir estas relaciones a partir de los datos. Por lo tanto, primero generaremos un escenario _contrafactual_ (donde no ejecutamos la campaña) y luego generaremos el escenario _real_ (donde sí ejecutamos la campaña). Esto nos permite comparar nuestro impacto causal _estimado_ de la campaña con el impacto causal _verdadero_ de la campaña. Pero hablaremos más sobre esto cuando lleguemos al Paso 3 de la escalera causal.

source: Let's generate some synthetic data - more specifically some predictors such as media spend, intercept, seasonality, and trend.
es: Generemos algunos datos sintéticos, más específicamente algunos predictores como el gasto en medios, la intersección, la estacionalidad y la tendencia.

source: Now we'll write a function to forward simulate the response (sales), given these predictor variables. The functions below simply calculate a weighted sum of the predictor variables, after having passed the media channels through our trusty adstock and saturation functions.
es: Ahora escribiremos una función para simular hacia adelante la respuesta (ventas), dado estas variables predictoras. Las funciones a continuación simplemente calculan una suma ponderada de las variables predictoras, después de haber pasado los canales de medios a través de nuestras confiables funciones de adstock y saturación.

source: Now let's use those functions to generate synthetic data that represents what happens in our simulated world under a 'business as usual' (or counterfactual) scenario of no media campaign.
es: Ahora utilicemos esas funciones para generar datos sintéticos que representen lo que ocurre en nuestro mundo simulado bajo un escenario de 'negocios como siempre' (o contrafactual) de ausencia de campaña mediática.

source: Finally, let's create a copy of this data, but one where we conducted an intervention. That is, a marketing campaign where we increased media spend in channel 1 by 40% for Q1 of 2021. This `df_actual` data will represent what actually happened in our world. The `df_counterfactual` data will represent what _would_ have happened if we had not conducted the intervention, and this will be used when we encounter Step 3 of the causal ladder.
es: Finalmente, creemos una copia de estos datos, pero una en la que realizamos una intervención. Es decir, una campaña de marketing en la que aumentamos el gasto en medios en el canal 1 en un 40% para el primer trimestre de 2021. Estos datos `df_actual` representarán lo que realmente sucedió en nuestro mundo. Los datos `df_counterfactual` representarán lo que _habría_ sucedido si no hubiéramos realizado la intervención, y esto se utilizará cuando lleguemos al Paso 3 de la escalera causal.

source: Let's visialize the dataset:
es: Vamos a visualizar el conjunto de datos:

source: This plot shows our (normalised) media spends (top two panels) and the resulting sales (bottom panel). Our dataset also involves a period (between dashed red lines) where we ran a marketing campaign that increased our media spend by 40%.
es: Este gráfico muestra nuestros gastos en medios (normalizados) (paneles superiores) y las ventas resultantes (panel inferior). Nuestro conjunto de datos también incluye un período (entre las líneas rojas discontinuas) en el que realizamos una campaña de marketing que incrementó nuestro gasto en medios en un 40%.

source: Build an MMM and fit to data
es: Construya un MMM y ajuste a los datos

source: As part of our regular MMM workflow, we'll build an MMM object and fit it to our synthetic data.
es: Como parte de nuestro flujo de trabajo regular de MMM, construiremos un objeto MMM y lo ajustaremos a nuestros datos sintéticos.

source: Before starting our procedure for counterfactual inference, let's first confirm that the MMM is doing a reasonable job of accounting for the data. Below is a plot of the posterior predictive distribution for the sales (shaded regions) and the actual sales (black line).
es: Antes de comenzar nuestro procedimiento para la inferencia contrafactual, primero confirmemos que el MMM está haciendo un trabajo razonable al contabilizar los datos. A continuación se muestra un gráfico de la distribución predictiva posterior para las ventas (regiones sombreadas) y las ventas reales (línea negra).

source: The model seems to be doing a good job of capturing the data so we can proceed.
es: El modelo parece estar haciendo un buen trabajo al capturar los datos, por lo que podemos proceder.

source: Level 1 - Association and Prediction
es: Nivel 1 - Asociación y Predicción

source: On Level 1 of the ladder, we can do at least 2 things:
es: En el Nivel 1 de la escalera, podemos hacer al menos 2 cosas:

source: Explore the model fit results - gain insights about the relationship between media spend and sales. Not note, at this point, even if our MMM represents a causal DAG that captures what we believe to be reasonable causal relationships, we are still only operating on the level of prediction and association.
es: Explora los resultados del ajuste del modelo: obtén información sobre la relación entre el gasto en medios y las ventas. No obstante, en este punto, incluso si nuestro MMM representa un DAG causal que captura lo que creemos que son relaciones causales razonables, todavía estamos operando únicamente a nivel de predicción y asociación.

source: Use the model to predict future sales. This is a common use-case of MMMs and corresponds to step 1 on the causal ladder. Let's dive in to this in more detail.
es: Utilice el modelo para predecir las ventas futuras. Este es un caso de uso común de los MMM y corresponde al paso 1 en la escalera causal. Profundicemos en esto con más detalle.

source: In order to predict future sales, we need to specify future values of our predictor variables. For simplicity, we will assume that our media spend will take on the mean of past media spends. We will then use the MMM to predict future sales. The code below generates a scenario for forecasting.
es: Para predecir las ventas futuras, necesitamos especificar los valores futuros de nuestras variables predictoras. Para simplificar, asumiremos que nuestro gasto en medios tomará el promedio de los gastos en medios pasados. Luego utilizaremos el MMM para predecir las ventas futuras. El código a continuación genera un escenario para la previsión.

source: Now we have a 'forecasting scenario' we can use our MMM to predict future sales, based upon what it has learnt from historical data.
es: Ahora tenemos un 'escenario de pronóstico' que podemos utilizar para que nuestro MMM prediga las ventas futuras, basándose en lo que ha aprendido de los datos históricos.

source: Let's vizualize the forecasted sales.
es: Visualicemos las ventas pronosticadas.

source: The plot above shows the model's prediction for future sales (shaded region). Let's take a moment to unpack what we are seeing:
es: El gráfico anterior muestra la predicción del modelo para las ventas futuras (región sombreada). Tomemos un momento para desglosar lo que estamos viendo:

source: In our forecasting scenario, we make the simplifying assumption that the future media spend (for both channels) would be at a constant level, equal to their historical averages.
es: En nuestro escenario de pronóstico, hacemos la suposición simplificadora de que el gasto futuro en medios (para ambos canales) se mantendría en un nivel constante, igual a sus promedios históricos.

source: Therefore, there is no real variation in the model's prediction for future sales _from the perspective of media spend_.
es: Por lo tanto, no hay una variación real en la predicción del modelo para las ventas futuras _desde la perspectiva del gasto en medios_.

source: However, the model does have a trend and seasonal component, so the variation in the prediction is due to these components.
es: Sin embargo, el modelo tiene una tendencia y un componente estacional, por lo que la variación en la predicción se debe a estos componentes.

source: We can of course make this more realistic by considering different scenarios for future media spend, but is is a matter of refinement. What we have seen so far is the general process of using an MMM for Step 1 style forecasting.
es: Podemos, por supuesto, hacer esto más realista considerando diferentes escenarios para el gasto en medios futuros, pero es una cuestión de refinamiento. Lo que hemos visto hasta ahora es el proceso general de utilizar un MMM para la previsión de estilo Paso 1.

source: Level 2 - Intervention
es: Nivel 2 - Intervención

source: Now we'll climb up a step and look at how we can use our MMM to predict the effect of an intervention. In this case, we will consider the effect of the historical average of channel $x_2$ and _double_ the historical average of channel $x_1$. So let's generate the predictor variables for this intervention scenario:
es: Ahora subiremos un peldaño y veremos cómo podemos utilizar nuestro MMM para predecir el efecto de una intervención. En este caso, consideraremos el efecto del promedio histórico del canal $x_2$ y _doblaremos_ el promedio histórico del canal $x_1$. Así que generemos las variables predictoras para este escenario de intervención:

source: Now we can run the intervention and ask the MMM what it believes the effect of this intervention will be on future sales. More formally, this amounts to sampling from the posterior predictive distribution, but under the intervention scenario.
es: Ahora podemos ejecutar la intervención y preguntar al MMM qué cree que será el efecto de esta intervención en las ventas futuras. Más formalmente, esto equivale a muestrear de la distribución predictiva posterior, pero bajo el escenario de intervención.
