Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_case_study.po
Languages: es

source: MMM End-to-End Case Study
es: Caso de Estudio Completo de MMM

source: In today's competitive business landscape, optimizing marketing spend across channels is crucial for maximizing return on investment and driving business growth. This notebook demonstrates how to leverage PyMC-Marketing's Media Mix Modeling (MMM) to gain actionable insights into marketing effectiveness and optimize budget allocation.
es: En el competitivo entorno empresarial actual, optimizar el gasto de marketing en todos los canales es crucial para maximizar el retorno de inversión y fomentar el crecimiento empresarial. Este cuaderno muestra cómo aprovechar el Modelado de Mezcla de Medios (MMM) de PyMC-Marketing para obtener ideas útiles sobre la efectividad del marketing y optimizar la asignación del presupuesto.

source: We'll walk through a real-world case study using data from a [PyData Global 2022](https://pydata.org/global2022/) presentation ([Hajime Takeda - Media Mix Modeling:How to Measure the Effectiveness of Advertising](https://www.youtube.com/watch?v=u4U_PUTasPQ)). Our goal is to show how MMM can help marketing teams:
es: Recorreremos un caso de estudio del mundo real utilizando datos de una presentación de [PyData Global 2022](https://pydata.org/global2022/) ([Hajime Takeda - Media Mix Modeling: How to Measure the Effectiveness of Advertising](https://www.youtube.com/watch?v=u4U_PUTasPQ)). Nuestro objetivo es mostrar cómo el MMM puede ayudar a los equipos de marketing:

source: Quantify the impact of different marketing channels on sales
es: Cuantificar el impacto de diferentes canales de marketing en las ventas

source: Understand saturation effects and diminishing returns
es: Entender los efectos de saturación y la ley de los rendimientos decrecientes

source: Identify opportunities to reallocate budget for improved performance
es: Identificar oportunidades para reubicar el presupuesto y mejorar el rendimiento

source: Make data-driven decisions about future marketing investments
es: Tomar decisiones basadas en datos sobre inversiones futuras en marketing

source: **Outline**
es: **Esquema**

source: Data Preparation and Exploratory Analysis
es: Preparación de Datos y Análisis Exploratorio

source: Model Specification and Fitting
es: Especificación y Ajuste del Modelo

source: Model Diagnostics and Validation
es: Diagnósticos y Validación del Modelo

source: Marketing Channel Deep Dive
es: Análisis Detallado de Canales de Marketing

source: Channel Contributions
es: Contribuciones del Canal

source: Saturation Curves
es: Curvas de Saturación

source: Return on Ad Spend (ROAS)
es: Retorno sobre Gasto Publicitario (ROAS)

source: Out-of-Sample Predictions
es: Predicciones Fuera de Muestra

source: Budget Optimization
es: Optimización del Presupuesto

source: Key Takeaways and Next Steps
es: Conclusiones Clave y Próximos Pasos

source: In this notebook we guide you through what a typical MMM first iteration looks like (note that what a first iteration means depends on the business context). We focus on the application of the model for a concrete business case. If you want to know more about the model specification please refer to the {ref}`mmm_example` notebook.
es: En este cuaderno te guiamos a través de cómo se ve una primera iteración típica de MMM (ten en cuenta que lo que significa una primera iteración depende del contexto empresarial). Nos centramos en la aplicación del modelo para un caso de negocio concreto. Si deseas saber más sobre la especificación del modelo, por favor consulta el cuaderno {ref}`mmm_example`.

source: Prepare Notebook
es: Preparar Cuaderno

source: We load the necessary libraries and set the notebook's configuration.
es: Cargamos las bibliotecas necesarias y configuramos el cuaderno.

source: Load Data
es: Cargar Datos

source: We load the data from a CSV file as a pandas DataFrame. We also do some light data cleaning following the filtering of the original case study. In essence, we are filtering and renaming certain marketing channels.
es: Cargamos los datos de un archivo CSV como un DataFrame de pandas. También realizamos una limpieza ligera de datos siguiendo el filtrado del caso de estudio original. En esencia, estamos filtrando y renombrando ciertos canales de marketing.

source: Exploratory Data Analysis
es: Análisis Exploratorio de Datos

source: We should always start looking at the data! We can start by plotting the target variable, i.e. the sales.
es: ¡Siempre deberíamos comenzar observando los datos! Podemos comenzar graficando la variable objetivo, es decir, las ventas.

source: This time series, which comes in weekly granularity, has a clear yearly seasonality pattern and apparently a mild downward trend.
es: Esta serie temporal, que viene en granularidad semanal, tiene un claro patrón de estacionalidad anual y aparentemente una ligera tendencia descendente.

source: Next, let's look into the marketing channels spend data. We first look into the share to get a feeling on the relative spend across channels.
es: A continuación, analicemos los datos de gasto de los canales de marketing. Primero miramos la participación para tener una idea del gasto relativo entre canales.

source: In this specific example we see that `Direct Mail` is the channel with the highest spend, followed by `Newspaper` and `Online Display`.
es: En este ejemplo específico vemos que `Direct Mail` es el canal con el gasto más alto, seguido de `Newspaper` y `Online Display`.

source: Next, we look into the time series of each of the marketing channels.
es: A continuación, examinamos las series temporales de cada uno de los canales de marketing.

source: We see an overall decerease spend over time. This might explain the downward trend in the sales time series.
es: Observamos una disminución general del gasto a lo largo del tiempo. Esto podría explicar la tendencia descendente en la serie temporal de ventas.

source: Next, we can compute the correlation between the marketing channels and the sales.
es: Luego, podemos calcular la correlación entre los canales de marketing y las ventas.

source: We all know that correlation does not imply causation. However, it is a good idea to look into the correlation between the marketing channels and the target variable. This can hel us spot issues in the data (very commom in real cases) and inspire some feature engineering.
es: Todos sabemos que la correlación no implica causalidad. Sin embargo, es una buena idea observar la correlación entre los canales de marketing y la variable objetivo. Esto puede ayudarnos a detectar problemas en los datos (muy comunes en casos reales) e inspirar algo de ingeniería de características.

source: The channels with the highest correlation with the sales are `TV`, `Insert`, and `Online Display`. Observe that the biggest channel in spend, `Direct Mail`, has the lowest correlation.
es: Los canales con la correlación más alta con las ventas son `TV`, `Insert`, y `Online Display`. Observa que el canal más grande en gasto, `Direct Mail`, tiene la correlación más baja.

source: Train Test Split
es: División Entrenamiento-Prueba

source: We are now ready to fit the model. We start by splitting the data into training and testing.
es: Ahora estamos listos para ajustar el modelo. Comenzamos dividiendo los datos en entrenamiento y prueba.

source: In a real case scenario you should use more data for training than for testing (see {ref}`mmm_time_slice_cross_validation`). In this case we are using a small dataset for demonstrative purposes.
es: En un escenario de caso real, deberías usar más datos para entrenamiento que para prueba (vea {ref}`mmm_time_slice_cross_validation`). En este caso estamos usando un conjunto de datos pequeño para fines demostrativos.

source: Model Specification
es: Especificación del Modelo

source: Assuming we are working on the first iteration, we typically would not have lift tests data to calibrate the model. This is fine, we can start with a spends priors to get started.
es: Suponiendo que estamos trabajando en la primera iteración, generalmente no tendríamos datos de pruebas de elevación para calibrar el modelo. Esto está bien, podemos comenzar con prior de gastos para empezar.

source: Ideally, in the next iteration we should have some of these lift tests to calibrate the model. For more details see {ref}`mmm_lift_test` and the {ref}`mmm_roas` case study notebook.
es: Idealmente, en la próxima iteración deberíamos tener algunas de estas pruebas de elevación para calibrar el modelo. Para más detalles, consulte el cuaderno de caso de estudio {ref}`mmm_lift_test` y {ref}`mmm_roas`.

source: The idea behind the spends priors is that we use the spend shares as a proxy for the effect of the media channels on the sales. This is not perfect but can be a good starting point. In essence, we are giving the higher spend channels more flexibility to fit the data with a wider prior. Let's see how this looks like. First, we compute the spend shares (on the training data!).
es: La idea detrás de los priors de gasto es que usamos las proporciones de gasto como un proxy para el efecto de los canales de medios en las ventas. Esto no es perfecto, pero puede ser un buen punto de partida. En esencia, estamos dando a los canales de mayor gasto más flexibilidad para ajustar los datos con un prior más amplio. Veamos cómo se ve esto. Primero, calculamos las proporciones de gasto (¡en los datos de entrenamiento!).

source: Next, we use these spend shares to set the prior of the model using the model configuration.
es: A continuación, utilizamos estas proporciones de gasto para establecer el prior del modelo utilizando la configuración del modelo.

source: We are now ready to specify the model (see {ref}`mmm_example` for more details). As the yearly seasonal component is not that strong, we use few Fourier terms.
es: Ahora estamos listos para especificar el modelo (consulte {ref}`mmm_example` para obtener más detalles). Dado que el componente estacional anual no es tan fuerte, usamos pocos términos de Fourier.

source: Prior Predictive Checks
es: Verificaciones Predictivas Previas

source: We can now generate prior predictive samples to see how the model behaves under the prior specification.
es: Ahora podemos generar muestras predictivas previas para ver cómo se comporta el modelo bajo la especificación previa.

source: Overall, the priors are not very informative and the ranges is approximately one order of magnitude of the observed data. Note that the choice of likelihood as a truncated normal is to avoid negative values for the target variable.
es: En general, los priors no son muy informativos y los rangos están aproximadamente a un orden de magnitud de los datos observados. Tenga en cuenta que la elección de la verosimilitud como una normal truncada es para evitar valores negativos para la variable objetivo.

source: Let's look into the channel contribution share **before** fitting the model.
es: Veamos la proporción de contribución del canal **antes** de ajustar el modelo.

source: We confirm these represent the spend shares as expected from the prior specification.
es: Confirmamos que estos representan las proporciones de gasto como se esperaba de la especificación previa.

source: Model Fitting
es: Ajuste del Modelo

source: We now fit the model to the training data.
es: Ahora ajustamos el modelo a los datos de entrenamiento.

source: Model Diagnostics
es: Diagnósticos del Modelo

source: Before looking into the results let's check some diagnostics.
es: Antes de examinar los resultados, vamos a verificar algunos diagnósticos.

source: We do not have divergent transitions, which is good!
es: No tenemos transiciones divergentes, lo cual es bueno!

source: On the other hand, the R-hat statistics are all close to 1, which is also good!
es: Por otro lado, todas las estadísticas R-hat están cerca de 1, ¡lo cual también es bueno!

source: Next let's look into the model trace.
es: Ahora vamos a examinar el rastro del modelo.

source: We see a good mixing in the trace, which is consistent with the good R-hat statistics.
es: Observamos una buena mezcla en el rastro, lo cual es consistente con los buenos estadísticos R-hat.

source: Posterior Predictive Checks
es: Verificaciones Predictivas Posteriores

source: As our model and posterior samples are looking good, we can now look into the posterior predictive checks.
es: Como nuestro modelo y muestras posteriores parecen buenas, ahora podemos examinar las verificaciones predictivas posteriores.

source: The posterior predictive sales look quite reasonable. We are explaining a good amount of the variance in the data and the trends are well captured.
es: Las ventas predictivas posteriores parecen bastante razonables. Estamos explicando una buena cantidad de la varianza en los datos y las tendencias están bien capturadas.

source: We can look into the errors of the model:
es: Podemos examinar los errores del modelo:

source: We do not detect any obvious patterns in the errors.
es: No detectamos patrones obvios en los errores.

source: Media Deep Dive
es: Análisis a Fondo de Medios

source: In this section we perform a deep dive into the media channels insights.
es: En esta sección realizamos un análisis a fondo de las ideas sobre los canales de medios.

source: Now that we are happy with the global model fit, we can look into the media and individual channels contributions.
es: Ahora que estamos satisfechos con el ajuste global del modelo, podemos examinar las contribuciones de los medios y de los canales individuales.

source: We start by looking into the aggregated contributions.
es: Empezamos examinando las contribuciones agregadas.

source: Next, we look into deeper into the components:
es: A continuación, analizamos más a fondo los componentes:

source: Here are some interesting observations about the model:
es: Aquí hay algunas observaciones interesantes sobre el modelo:

source: The `intercept` accounts for approximately $60\%$ of the contribution. This is what people usually call the "baseline".
es: El `intercepto` representa aproximadamente el $60\%$ de la contribución. Esto es lo que la gente suele llamar "línea base".

source: The top media contribution channels are `Online Display`, `Direct Mail` and `TV`. In some sense we see how the model is averaging the spend share (prior) and the predictive power of the media channels (posterior) .
es: Los principales canales de contribución de medios son `Online Display`, `Direct Mail` y `TV`. En cierto sentido, vemos cómo el modelo está promediando la proporción de gasto (prior) y el poder predictivo de los canales de medios (posterior).

source: We continue our analysis by looking into the direct response curves. These will be the main input for the budget optimization step below.
es: Continuamos nuestro análisis examinando las curvas de respuesta directa. Estas serán la entrada principal para la optimización del presupuesto a continuación.

source: These curves by themselves can be a great input for marketing planning! One could use them to set the budget for the next periods and manually optimize the spend for these channels depending on the saturation points. This process can be a good starting point with engage with the team. That being said, we can do better with custom optimization rutines as described in the following sections.
es: Estas curvas por sí solas pueden ser una excelente entrada para la planificación de marketing. Uno podría usarlas para establecer el presupuesto para los próximos períodos y optimizar manualmente el gasto para estos canales en función de los puntos de saturación. Este proceso puede ser un buen punto de partida para involucrar al equipo. Sin embargo, podemos hacerlo mejor con rutinas de optimización personalizadas descritas en las siguientes secciones.

source: Beside the direct response curves, we can look intro global contribution plots simulations. The idea is to vary the spend by globally multiplying the time series spend by a value $\delta > 0$ and seeing the expected contribution. PyMC-Marketing also shows the $94\%$ Highest Density Interval (HDI) of the simulations results.
es: Además de las curvas de respuesta directa, podemos examinar gráficos de simulaciones de contribuciones agregadas. La idea es variar el gasto multiplicando globalmente la serie temporal de gasto por un valor $\delta > 0$ y viendo la contribución esperada. PyMC-Marketing también muestra el $94\%$ Intervalo de Densidad de Probabilidad Más Alto (HDI) de los resultados de las simulaciones.

source: We can clearly see the saturation effects for the different channels.
es: Podemos ver claramente los efectos de saturación para los diferentes canales.

source: A complementary plot is to plot these same simulations against the actual spend:
es: Un gráfico complementario es graficar estas mismas simulaciones contra el gasto real:

source: The vertical lines show the spend from the observed data (i.e. $\delta = 1 $ above). This plot clearly shows that, for example, `Direct Mail` is won't have much incremental contribution if we keep increasing the spend. On the other hand, channels like `Online Display` and `Insert` seem to be good candidates to increase the spend. These are the concrete actionable insights you can extract from these typo of models to optimize your media spend mix 🚀!
es: Las líneas verticales muestran el gasto de los datos observados (es decir, = 1 arriba). Este gráfico muestra claramente que, por ejemplo, `Direct Mail` no tendrá mucha contribución incremental si seguimos aumentando el gasto. Por otro lado, canales como `Online Display` e `Insert` parecen ser buenos candidatos para incrementar el gasto. Estas son las ideas accionables concretas que puedes extraer de este tipo de modelos para optimizar tu mezcla de gasto en medios 🚀!

source: Return on Ads Spend (ROAS)
es: Retorno sobre Gasto Publicitario (ROAS)

source: To have a more quantitative metric of efficiency we compute the Return on Ads Spend (ROAS) over the whole training period.
es: Para tener una métrica más cuantitativa de eficiencia, calculamos el Retorno sobre Gasto de Anuncios (ROAS) durante todo el período de entrenamiento.

source: To begin lets plot the contribution share for each channel.
es: Para comenzar, vamos a graficar la contribución por canal.

source: These contributions are of course influences by the spend levels. If we want to get a better picture of the efficiency of each channel we need to look into the Return on Ads Spend (ROAS). This is done by computing the ratio of the mean contribution and the spend for each channel.
es: Estas contribuciones están, por supuesto, influidas por los niveles de gasto. Si queremos obtener una mejor imagen de la eficiencia de cada canal, debemos observar el Retorno sobre Gasto de Anuncios (ROAS). Esto se hace calculando la proporción de la contribución media y el gasto para cada canal.

source: Here we see that the channels with the highest ROAS **on average** are `Online Display` and `Insert` whereas `Direct Mail` has the lowest ROAS. This is consistent with the previous findings analyzing the direct and global response curves.
es: Aquí vemos que los canales con el ROAS más alto **en promedio** son `Online Display` e `Insert`, mientras que `Direct Mail` tiene el ROAS más bajo. Esto es consistente con los hallazgos previos al analizar las curvas de respuesta directa y global.

source: The large HDI intervals for the ROAS for the top channels come from the fact that the spend share of them during the training period is relatively small. Event though we use the spend share as priors, the overall spend levels are also reflected in the estimate (see for example how small the HDI is for `Direct Mail`).
es: Los amplios intervalos del HDI para el ROAS de los canales principales provienen del hecho de que la proporción de gasto de ellos durante el período de entrenamiento es relativamente pequeña. Aunque usamos las proporciones de gasto como priors, los niveles generales de gasto también se reflejan en la estimación (ver, por ejemplo, cuán pequeño es el HDI para `Direct Mail`).

source: We can see this as an opportunity! Based on this analysis we see that `Online Display` and `Insert` are the best channels to invest in. Hence, if we optimize our budget accordingly (more on the budget optimization below) we can improve our marketing mix and at the same time create more variance in the training data so that we get refined ROAS estimates for future iterations 😎.
es: ¡Podemos ver esto como una oportunidad! Basándonos en este análisis, vemos que `Online Display` e `Insert` son los mejores canales en los que invertir. Por lo tanto, si optimizamos nuestro presupuesto en consecuencia (más sobre la optimización del presupuesto a continuación), podemos mejorar nuestra mezcla de marketing y al mismo tiempo crear más variación en los datos de entrenamiento para obtener estimaciones de ROAS más refinadas para futuras iteraciones 😎.

source: It is also useful to compare the ROAS and the contribution share.
es: También es útil comparar el ROAS y la contribución por canal.

source: Until now we have analyzed the model fit from the in-sample perspective. If we want to follow the model recommendations, we need to have evidence that the model is not only good in explaining the past but also good at making predictions. This is a key component to getting the buy in from the business stakeholders.
es: Hasta ahora hemos analizado el ajuste del modelo desde la perspectiva dentro de la muestra. Si queremos seguir las recomendaciones del modelo, necesitamos tener evidencia de que el modelo no solo es bueno explicando el pasado, sino también en hacer predicciones. Este es un componente clave para obtener el apoyo de los interesados comerciales.

source: The PyMC-Marketing MMM API allows to easily generate out-of-sample predictions from a fitted model as follows:
es: La API de PyMC-Marketing MMM permite generar fácilmente predicciones fuera de muestra a partir de un modelo ajustado de la siguiente manera:

source: We can visualize and compare the in sample and out of sample predictions.
es: Podemos visualizar y comparar las predicciones de muestra y fuera de muestra.

source: Overall, both the in-sample and out-of-sample predictions look very reasonable.
es: En general, tanto las predicciones de muestra como las predicciones fuera de muestra parecen bastante razonables.

source: Let's zoom in the out-of-sample predictions:
es: Vamos a acercarnos a las predicciones fuera de muestra:

source: These look actually very good!
es: Estas predicciones parecen realmente muy buenas!

source: To have a concrete score metric we can use the Continuous Ranked Probability Score ([CRPS](https://towardsdatascience.com/crps-a-scoring-function-for-bayesian-machine-learning-models-dd55a7a337a8)). This is a generalization of the mean absolute error to the case of probabilistic predictions. For more detail see the {ref}`mmm_time_slice_cross_validation` notebook.
es: Para tener una métrica de puntuación concreta, podemos usar el Puntaje de Probabilidad Clasificada Continua ([CRPS](https://towardsdatascience.com/crps-a-scoring-function-for-bayesian-machine-learning-models-dd55a7a337a8)). Esta es una generalización del error absoluto medio al caso de predicciones probabilísticas. Para más detalles, consulte el cuaderno {ref}`mmm_time_slice_cross_validation`.

source: Interestingly enough, the model performance is better in the test set. There could me many reasons for it:
es: Curiosamente, el rendimiento del modelo es mejor en el conjunto de prueba. Podría haber muchas razones para ello:

source: The model is not capturing the end of the seasonality very well in the training set.
es: El modelo no está capturando bien el final de la estacionalidad en el conjunto de entrenamiento.
