Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_identification.po
Languages: es

source: We got even more divergencies 🤪, whats happening here? Everything is worse? Even if we added a new variable to control for the `holiday_signal`? This looks weird, because we are adding a variable that should help us to identify the true causal effect of `x1` and `x2`.
es: Tenemos aún más divergencias 🤪, ¿qué está sucediendo aquí? ¿Todo está peor? ¿Incluso si añadimos una nueva variable para controlar el `holiday_signal`? Esto se ve extraño, porque estamos añadiendo una variable que debería ayudarnos a identificar el verdadero efecto causal de `x1` y `x2`.

source: Lets see the fit of our model 👀
es: Veamos el ajuste de nuestro modelo 👀

source: Somehow $R^2$ is higher than before, could be this a good signal? Maybe are we recovering the true causal effect of `x1` and `x2`?
es: De alguna manera, $R^2$ es más alto que antes, ¿podría ser esto una buena señal? ¿Quizás estamos recuperando el verdadero efecto causal de `x1` y `x2`?

source: At this point, we might feel like we have lost everything. It may seem that some kind of bad luck is affecting our data. Or, we could have an unknown factor that is influencing our marketing results without our notice.
es: En este punto, podríamos sentir que hemos perdido todo. Puede parecer que algún tipo de mala suerte está afectando nuestros datos. O, podríamos tener un factor desconocido que está influyendo en nuestros resultados de marketing sin que nos demos cuenta.

source: After some reflection, we can consider that our competitors’ actions, like their offers and discounts, could be impacting our marketing results. In other words, when our competitors spend more on marketing, they can take away some of our potential incremental sales. Even if we spend the same amount to get exposure, aggressive competitor offers can pull customers away from us as they buy other products instead.
es: Después de una reflexión, podemos considerar que las acciones de nuestros competidores, como sus ofertas y descuentos, podrían estar impactando nuestros resultados de marketing. En otras palabras, cuando nuestros competidores gastan más en marketing, pueden llevarse algunas de nuestras posibles ventas incrementales. Incluso si gastamos la misma cantidad para obtener exposición, las ofertas agresivas de los competidores pueden desviar a los clientes de nosotros mientras compran otros productos en su lugar.

source: Will this affect all our channels the same way? Probably not. Our competitors may not impact our brand awareness, but they likely influence our customers’ consideration. We might think that $x2$ is more affected by our competitors than $x1$. This is because $x2$ is closer to the purchase decision, while $x1$ relates more to brand exposure.
es: ¿Afectará esto a todos nuestros canales de la misma manera? Probablemente no. Nuestros competidores pueden no impactar nuestra notoriedad de marca, pero probablemente influyen en la consideración de nuestros clientes. Podríamos pensar que $x2$ está más afectado por nuestros competidores que $x1$. Esto se debe a que $x2$ está más cerca de la decisión de compra, mientras que $x1$ se relaciona más con la exposición de la marca.

source: This suggests that ‘competitor_offers’ might be an unseen factor affecting $x2$ but not $x1$. Formally, this means we could express $x2$ as a function of ‘competitor_offers’ while $x1$ would not include this factor.
es: Esto sugiere que ‘competitor_offers’ podría ser un factor no visible que afecta a $x2$ pero no a $x1$. Formalmente, esto significa que podríamos expresar $x2$ como una función de ‘competitor_offers’ mientras que $x1$ no incluiría este factor.

source: x2 = f(competitor\_offers) + f(x1) + f(Spend_{x2}) + f(holiday\_signal) + \epsilon
es: x2 = f(ofertas\_competidor) + f(x1) + f(Gasto_{x2}) + f(señal\_vacacional) + \epsilon

source: x1 = f(Spend_{x1}) + f(holiday\_signal) + \epsilon
es: x1 = f(Gastar_{x1}) + f(señal\_vacacional) + \epsilon

source: This is a good approach for building our model. However, we need to add ‘competitor_offers’ to our model, and we currently have no data on our competitors, so we need to think creatively.
es: Este es un buen enfoque para construir nuestro modelo. Sin embargo, necesitamos añadir ‘competitor_offers’ a nuestro modelo, y actualmente no tenemos datos sobre nuestros competidores, por lo que necesitamos pensar de manera creativa.

source: Using Gaussian Process to Model Competitor Offers
es: Uso de Procesos Gaussianos para Modelar Ofertas de Competidores

source: Since we do not directly observe competitor activities like offers or discounts, we can treat ‘competitor_offers’ as a **hidden variable**. This means we will not measure it directly but will infer its behavior based on its impact on other variables in our model. A **Gaussian Process (GP)** can help us model this hidden factor, as it is flexible enough to reflect the data's underlying patterns.
es: Dado que no observamos directamente las actividades de los competidores, como ofertas o descuentos, podemos tratar ‘competitor_offers’ como una **variable oculta**. Esto significa que no la mediremos directamente, sino que inferiremos su comportamiento en función de su impacto en otras variables de nuestro modelo. Un **Proceso Gaussiano (GP)** puede ayudarnos a modelar este factor oculto, ya que es lo suficientemente flexible para reflejar los patrones subyacentes de los datos.

source: A Gaussian Process can be expressed as:
es: Un Proceso Gaussiano puede expresarse como:

source: $f(t)$: The hidden function representing ‘competitor_offers’ over time.
es: $f(t)$: La función oculta que representa ‘competitor_offers’ a lo largo del tiempo.

source: $m(t)$: The mean function, often set to 0 unless we have prior knowledge of a specific trend.
es: $m(t)$: La función media, a menudo establecida en 0 a menos que tengamos conocimiento previo de una tendencia específica.

source: $k(t, t')$: The covariance function (or kernel), which determines the smoothness and structure of $f(t)$.
es: $k(t, t')$: La función de covarianza (o núcleo), que determina la suavidad y la estructura de $f(t)$.

source: PyMC-Marketing includes Gaussian Processes, using a **Hilbert Space Gaussian Process (HSGP) approximation** to make calculations more manageable. This allows us to approximate the hidden function $f(t)$ efficiently.
es: PyMC-Marketing incluye Procesos Gaussianos, utilizando una **aproximación de Proceso Gaussiano en Espacio de Hilbert (HSGP)** para hacer que los cálculos sean más manejables. Esto nos permite aproximar la función oculta $f(t)$ de manera eficiente.

source: Why Use a Gaussian Process?
es: ¿Por qué utilizar un proceso gaussiano?

source: Reveal the hidden structure of ‘competitor_offers’ and other unobserved variables based on its connections to $x2$ and other observed variables.
es: Revele la estructura oculta de ‘competitor_offers’ y otras variables no observadas basadas en sus conexiones con $x2$ y otras variables observadas.

source: Capture non-linear, varying effects that may arise from unseen competitor activities.
es: Capture efectos no lineales y variables que pueden surgir de actividades de competidores no visibles.

source: Now let's see how we can implement this in PyMC-Marketing!
es: Ahora veamos cómo podemos implementar esto en PyMC-Marketing.

source: Let’s delve into the output. First, it’s important to note that our adjustment set clearly indicates the need to control for both **competitors** and **holidays** to accurately estimate our variables. This implies that the variables in our regressions should include those factors along with our treatment variables. Since we lack any observed variables in the data to account for competitors, we set the parameter `time_varying_intercept` to `True` so that our model can accommodate the unobserved confounder.
es: Profundicemos en la salida. Primero, es importante señalar que nuestro conjunto de ajustes indica claramente la necesidad de controlar tanto por **competidores** como por **días festivos** para estimar con precisión nuestras variables. Esto implica que las variables en nuestras regresiones deben incluir esos factores junto con nuestras variables de tratamiento. Dado que no contamos con ninguna variable observada en los datos para tener en cuenta a los competidores, establecemos el parámetro `time_varying_intercept` en `True` para que nuestro modelo pueda acomodar el confusor no observado.

source: Now, let’s take a look at how well our model fits.
es: Ahora, echemos un vistazo a qué tan bien se ajusta nuestro modelo.

source: Great compared to the previous models, we don't have any divergencies, as we discussed before thats a good signal 🔥.
es: Excelente en comparación con los modelos anteriores, no tenemos ninguna divergencia, como discutimos antes, eso es una buena señal 🔥.

source: Lets observe the recovered effect of our treatment variables ($x1$ and $x2$) and as usual the not so causal model fit 👀
es: Observemos el efecto recuperado de nuestras variables de tratamiento ($x1$ y $x2$) y, como de costumbre, el ajuste del modelo que no es tan causal 👀

source: Great news! 🎉 Our model is nailing it when it comes to figuring out the actual impact of our treatment variables. We managed to take into account both the unseen confounders and the things we can see, like holidays.
es: ¡Grandes noticias! 🎉 Nuestro modelo está logrando un excelente desempeño al determinar el impacto real de nuestras variables de tratamiento. Hemos conseguido tener en cuenta tanto los factores de confusión no visibles como las cosas que podemos ver, como los días festivos.

source: You might have noticed we have variables like market growth that aren’t in the data—what's going on with that? Before diving in, let’s observe the time-varying intercept.
es: Es posible que haya notado que tenemos variables como el crecimiento del mercado que no están en los datos—¿qué está sucediendo con eso? Antes de profundizar, observemos el intercepto variable en el tiempo.

source: This intercept is really good at picking up on that unobserved confounder and the effect of market growth. Essentially, the Gaussian process is smart enough to guess all those hidden variables affecting our outcome.
es: Este intercepto es realmente bueno para captar ese confusor no observado y el efecto del crecimiento del mercado. Esencialmente, el proceso gaussiano es lo suficientemente inteligente como para adivinar todas esas variables ocultas que afectan nuestro resultado.

source: Since we have a solid grasp of our context, we can identify which variables our Gaussian process is figuring out. This insight helps us fine-tune our model. On the flip side, if we didn’t understand our world well, the Gaussian process might be inferring the wrong variables, leading to incorrect conclusions. That’s why it’s crucial to really understand our causal ecosystem, the world around us, and how our causal relationships are structured. Every choice and assumption we make with our models can complicate things, impacting the accuracy of our results.
es: Dado que tenemos una comprensión sólida de nuestro contexto, podemos identificar qué variables está determinando nuestro proceso gaussiano. Esta información nos ayuda a ajustar nuestro modelo. Por otro lado, si no entendemos bien nuestro mundo, el proceso gaussiano podría estar inferiendo las variables incorrectas, lo que llevaría a conclusiones erróneas. Por eso es crucial entender realmente nuestro ecosistema causal, el mundo que nos rodea y cómo están estructuradas nuestras relaciones causales. Cada elección y suposición que hacemos con nuestros modelos puede complicar las cosas, impactando la precisión de nuestros resultados.

source: We shouldn’t complicate our model without a solid reason. Adding new variables or Gaussian processes should be carefully considered! It’s essential to grasp the consequences of our choices and the assumptions we adopt once we make them. Using causal identification techniques can help us figure out which control variables to include, guiding us in the causal discovery journey.
es: No deberíamos complicar nuestro modelo sin una razón sólida. ¡Agregar nuevas variables o procesos gaussianos debe ser considerado con cuidado! Es esencial comprender las consecuencias de nuestras elecciones y las suposiciones que adoptamos una vez que las hacemos. Utilizar técnicas de identificación causal puede ayudarnos a determinar qué variables de control incluir, guiándonos en el viaje de descubrimiento causal.

source: Wrap-Up
es: Resumen

source: In this notebook, we explored how to use causal discovery methods to spot unobserved confounders and how to use adjustment sets for including control variables. We also looked at how Gaussian processes can help us model these hidden confounders, particularly through the time-varying intercept.
es: En este cuaderno, exploramos cómo utilizar métodos de descubrimiento causal para identificar confusores no observados y cómo emplear conjuntos de ajuste para incluir variables de control. También analizamos cómo los procesos gaussianos pueden ayudarnos a modelar estos confusores ocultos, particularmente a través del intercepto variable en el tiempo.

source: Now it’s your turn—go ahead and start building your own models!
es: Ahora es tu turno: ¡adelante y comienza a construir tus propios modelos!

source: References
es: Referencias

source: [Aleksander Molak - Causal Discovery](https://www.amazon.com/Causal-Inference-Discovery-Python-learning/dp/1804612987)
es: [Aleksander Molak - Descubrimiento Causal](https://www.amazon.com/Causal-Inference-Discovery-Python-learning/dp/1804612987)

source: [Judea Pearl - The book of why](https://www.amazon.com/Book-Why-Science-Cause-Effect/dp/046509760X)
es: [Judea Pearl - El libro de por qué](https://www.amazon.com/Book-Why-Science-Cause-Effect/dp/046509760X)

source: [Bridging Causal Thinking and Media Mix Models: Carlos Trujillo & Ben Vincent](https://colab.research.google.com/drive/1r5pi9Lh_A6h_CKQFEjyn-7iykL8x-X_H#scrollTo=DRFEJyK1VCi3)
es: [Conectando el Pensamiento Causal y los Modelos de Mezcla de Medios: Carlos Trujillo & Ben Vincent](https://colab.research.google.com/drive/1r5pi9Lh_A6h_CKQFEjyn-7iykL8x-X_H#scrollTo=DRFEJyK1VCi3)
