Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_lift_test.po
Languages: es

source: Lift Test Calibration
es: Calibración de Prueba de Elevación

source: Introduction
es: Introducción

source: You may have heard of the phrase "[All models are wrong but some are useful.](https://en.wikipedia.org/wiki/All_models_are_wrong)" This is true in many areas, and it's likely that after the first attempt, you haven't yet created a model that can accurately determine your true attribution. Even if you have, how can you be sure? We create models to understand the attribution of our marketing channels, but it appears that even then, we can't always rely on what the models tell us.
es: Es posible que haya oído la frase "[Todos los modelos son incorrectos, pero algunos son útiles.](https://en.wikipedia.org/wiki/All_models_are_wrong)" Esto es cierto en muchas áreas, y es probable que después del primer intento, aún no haya creado un modelo que pueda determinar con precisión su verdadera atribución. Incluso si lo ha hecho, ¿cómo puede estar seguro? Creamos modelos para entender la atribución de nuestros canales de marketing, pero parece que incluso entonces, no siempre podemos confiar en lo que los modelos nos dicen.

source: In order to ensure that our models are decomposing correctly, we can use various testing methods to gather real-world data and compare it with our models. This will help us to identify any discrepancies and improve the decomposition accuracy of our models.
es: Para garantizar que nuestros modelos se descomponen correctamente, podemos utilizar diversos métodos de prueba para recopilar datos del mundo real y compararlos con nuestros modelos. Esto nos ayudará a identificar cualquier discrepancia y mejorar la precisión de la descomposición de nuestros modelos.

source: Today, we will explore a new way to integrate experiments into **pymc-marketing**. This will bring us closer to accurate representations of real-world values and improve the estimates generated by our models.
es: Hoy, exploraremos una nueva forma de integrar experimentos en **pymc-marketing**. Esto nos acercará a representaciones precisas de los valores del mundo real y mejorará las estimaciones generadas por nuestros modelos.

source: When are lifts test useful?
es: ¿Cuándo son útiles las pruebas de ascensores?

source: In some situations, all of the relevant experiment spend data is captured within historical data that you will including in your training set. In these cases, a valid approach could be to simply train your MMM on all available data (including experiment and non-experiment periods) in order to optimally inform you about model parameters and ultimately get better insights. However there are a number of situations when this approach will not be appropriate.
es: En algunas situaciones, todos los datos de gasto relevantes de los experimentos se capturan dentro de los datos históricos que incluirá en su conjunto de entrenamiento. En estos casos, un enfoque válido podría ser simplemente entrenar su MMM con todos los datos disponibles (incluyendo períodos de experimentos y no experimentos) para informarle de manera óptima sobre los parámetros del modelo y, en última instancia, obtener mejores conocimientos. Sin embargo, hay una serie de situaciones en las que este enfoque no será apropiado.

source: Imagine your online advertising platform gave you additional credit. You decide to spend this credit by increasing activity on a digital ad channel and you want to use this as a way to evaluate the uplift. In this situation, you will have increased the level of advertising taking place, but this 'increased spend' is not charged to your invoice. So unless your data pipeline is really on point, your spend data will not accurately reflect the level of effective spend.
es: Imagina que tu plataforma de publicidad en línea te otorgara crédito adicional. Decides gastar este crédito aumentando la actividad en un canal de anuncios digitales y deseas utilizar esto como una forma de evaluar el aumento. En esta situación, habrás incrementado el nivel de publicidad que se lleva a cabo, pero este 'gasto incrementado' no se carga a tu factura. Por lo tanto, a menos que tu canal de datos esté realmente en su punto, tus datos de gasto no reflejarán con precisión el nivel de gasto efectivo.

source: You want to run a test on TV. In that case, you probably have to pay months before the test takes place or the commercial is aired. So, your spending may be in February and the action in March, but during the period of the experiment itself, there is no spending. Here, the spend may well be contained in your training data, but the time lag between the spend and the advertising takes place is very high. So the adstock function which accommodates short term lag effects may not adequately capture longer term lags such as this.
es: Desea realizar una prueba en televisión. En ese caso, probablemente tenga que pagar meses antes de que se lleve a cabo la prueba o se emita el comercial. Por lo tanto, su gasto puede ser en febrero y la acción en marzo, pero durante el período del experimento en sí, no hay gasto. Aquí, el gasto puede estar contenido en sus datos de entrenamiento, pero el desfase temporal entre el gasto y la emisión de la publicidad es muy alto. Por lo tanto, la función de adstock que acomoda los efectos de desfase a corto plazo puede no capturar adecuadamente los desfases a largo plazo como este.

source: You are experimenting with discounts or promotions. These might be quantifiable, but not show up in your traditional media spend channels and so your experimentation may not be captured by your MMM.
es: Está experimentando con descuentos o promociones. Estos pueden ser cuantificables, pero no aparecer en sus canales de gasto en medios tradicionales, por lo que su experimentación puede no ser capturada por su MMM.

source: These are just a few examples where lift tests can be useful. In these cases, you can use the results of the lift test to adjust the model parameters and improve the accuracy of the model.
es: Estos son solo algunos ejemplos donde las pruebas de elevación pueden ser útiles. En estos casos, puede utilizar los resultados de la prueba de elevación para ajustar los parámetros del modelo y mejorar la precisión del modelo.

source: Requirements
es: Requisitos

source: Today, we won't be discussing how to conduct lift tests, but instead, we will focus on their utilization. If you wish to acquire knowledge on how to generate results that are compatible with your MMM models, you can check out [CausalPy](https://causalpy.readthedocs.io/en/latest/) for conducting experiments.
es: Hoy, no discutiremos cómo realizar pruebas de elevación, sino que nos centraremos en su utilización. Si desea adquirir conocimientos sobre cómo generar resultados que sean compatibles con sus modelos MMM, puede consultar [CausalPy](https://causalpy.readthedocs.io/en/latest/) para realizar experimentos.

source: Goal
es: Objetivo

source: After reading this notebook, you will have gained the necessary expertise to incorporate the results (detected uplift from your experiments) into our regressive model.
es: Después de leer este cuaderno, habrá adquirido la experiencia necesaria para incorporar los resultados (aumento detectado de sus experimentos) en nuestro modelo regresivo.

source: This notebook will display using the `add_lift_test_measurements` method of `MMM` and its workflow:
es: Este cuaderno mostrará utilizando el método `add_lift_test_measurements` de `MMM` y su flujo de trabajo:

source: Build model: `mmm.build_model(X, y)`
es: Construir modelo: `mmm.build_model(X, y)`

source: Add lift measurements: `mmm.add_lift_test_measurements(df_lift_test)`
es: Agregar mediciones de elevación: `mmm.add_lift_test_measurements(df_lift_test)`

source: Sample posterior: `mmm.fit(X, y)`
es: Muestra posterior: `mmm.fit(X, y)`

source: This is a case study of two correlated channels to see how lift tests help distinguish the channel effects.
es: Este es un estudio de caso de dos canales correlacionados para ver cómo las pruebas de elevación ayudan a distinguir los efectos del canal.

source: Generate Correlated Spends and Model Target
es: Generar Gastos Correlacionados y Modelar Objetivo

source: First we'll generate synthetic data for two channels with completely correlated spends.
es: Primero generaremos datos sintéticos para dos canales con gastos completamente correlacionados.

source: For this example, the synthetic spend data is not produced in a overly realistic manner. However, we have normalized the maxmium spend to 1 for each channel to mimmick data pre-processing that typically takes place in a pymc-marketing workflow.
es: Para este ejemplo, los datos de gasto sintético no se producen de una manera excesivamente realista. Sin embargo, hemos normalizado el gasto máximo a 1 para cada canal para imitar el preprocesamiento de datos que típicamente ocurre en un flujo de trabajo de pymc-marketing.

source: We can double check that the to channels are perfectly correlated.
es: Podemos verificar que los dos canales están perfectamente correlacionados.

source: We use the `MMM` class to specify our model just as usual.
es: Utilizamos la clase `MMM` para especificar nuestro modelo como de costumbre.

source: For this constructed example, we will set parameter of the model with the `pm.do` operator and take a random sample of the target variable. The fixed parameters are below which we will try to recover.
es: Para este ejemplo construido, estableceremos el parámetro del modelo con el operador `pm.do` y tomaremos una muestra aleatoria de la variable objetivo. Los parámetros fijos se encuentran a continuación, los cuales intentaremos recuperar.

source: At this point, a model has not been fit. However, we have created our data set to fit our model on.
es: En este momento, no se ha ajustado un modelo. Sin embargo, hemos creado nuestro conjunto de datos para ajustar nuestro modelo.

source: Indistinguishable Parameter Estimates
es: Estimaciones de Parámetros Indistinguibles

source: In order to show the trouble that completely correlated channels provides, let's fit the model
es: Para mostrar el problema que presentan los canales completamente correlacionados, ajustemos el modelo.

source: Since the spends are completely correlated, there is no way to distinguish the parameters. Not only that, but the parameter estimates are not close to actuals.
es: Dado que los gastos están completamente correlacionados, no hay forma de distinguir los parámetros. No solo eso, sino que las estimaciones de los parámetros no se acercan a los valores reales.

source: We can also witness that while the actual saturation curves are different (because we specified the true parameters for each channel), the MMM is unable to distinguish between the two channels.
es: También podemos observar que, aunque las curvas de saturación reales son diferentes (porque especificamos los parámetros verdaderos para cada canal), el MMM no puede distinguir entre los dos canales.

source: We can show this below by plotting the actual saturation curves (lines) and the direct response curves (points).
es: Podemos mostrar esto a continuación trazando las curvas de saturación reales (líneas) y las curvas de respuesta directa (puntos).

source: Direct response curves
es: Curvas de respuesta directa

source: Plots the direct contribution curves for each marketing channel. The term "direct" refers to the fact we plot costs vs immediate returns and we do not take into account the lagged effects of the channels e.g. adstock transformations. And so these curves will actually consist of a series of points, each representing the direct contribution of a spend level.
es: Grafica las curvas de contribución directa para cada canal de marketing. El término "directo" se refiere al hecho de que graficamos costos frente a retornos inmediatos y no tomamos en cuenta los efectos rezagados de los canales, por ejemplo, las transformaciones de adstock. Por lo tanto, estas curvas consistirán en una serie de puntos, cada uno representando la contribución directa de un nivel de gasto.

source: We can see that the true but latent saturation curves (dashed lines) for each channel are different, but that the the MMM is unable to distinguish that the saturation curves for each channel (points) are different. And this is because the spends are perfectly correlated.
es: Podemos ver que las verdaderas pero latentes curvas de saturación (líneas discontinuas) para cada canal son diferentes, pero que el MMM no puede distinguir que las curvas de saturación para cada canal (puntos) son diferentes. Y esto se debe a que los gastos están perfectamente correlacionados.

source: Let's see if we can improve upon this by adding lift test measurements.
es: Veamos si podemos mejorar esto añadiendo mediciones de pruebas de elevación.

source: In order to avoid confusion with the plot above, the actual saturation curves are represented by the dashed lines, while the direct contribution curves are represented by the points. If lift tests can help us in this situation of high spend correlation, then we should be able to detect this by: a) achieving better parameter estimates, and b) correspondingly, getting better estimates of the saturation curves.
es: Para evitar confusiones con el gráfico anterior, las curvas de saturación reales están representadas por las líneas discontinuas, mientras que las curvas de contribución directa están representadas por los puntos. Si las pruebas de lift pueden ayudarnos en esta situación de alta correlación de gastos, entonces deberíamos poder detectar esto mediante: a) lograr mejores estimaciones de parámetros, y b) correspondientemente, obtener mejores estimaciones de las curvas de saturación.

source: We can also visualize the channel contributions over time. The wide HDI's in the plot below shows that we have considerable uncertainty in the channel contributions. We can also see that the posterior means of the channel contributions are quite far off the mark of the actual channel contributions. Again, these true channel contributions are only known to us in this synthetic data example and would not be available to us in a real world scenario.
es: También podemos visualizar las contribuciones del canal a lo largo del tiempo. Los amplios intervalos de HDI en el gráfico a continuación muestran que tenemos una incertidumbre considerable en las contribuciones del canal. También podemos ver que las medias posteriores de las contribuciones del canal están bastante alejadas de las contribuciones reales del canal. Nuevamente, estas verdaderas contribuciones del canal solo nos son conocidas en este ejemplo de datos sintéticos y no estarían disponibles para nosotros en un escenario del mundo real.

source: About Lift Tests
es: Acerca de las Pruebas de Elevación

source: In a lift study, one temporarily changes the budget of a channel for a fixed period of time, and then uses some method (for example CausalPy) to make inference about the change in sales directly caused by the adjustment.
es: En un estudio de elevación, se cambia temporalmente el presupuesto de un canal durante un período de tiempo fijo, y luego se utiliza algún método (por ejemplo, CausalPy) para inferir sobre el cambio en las ventas directamente causado por el ajuste.

source: A lift test is characterized by:
es: Una prueba de elevación se caracteriza por:

source: `channel`: the channel that was tested
es: `channel`: el canal que fue probado

source: `x`: pre-test channel spend
es: `x`: gasto del canal de pre-prueba

source: `delta_x`: change made to `x`
es: `delta_x`: cambio realizado en `x`

source: `delta_y`: inferred change in sales due to `delta_x`
es: `delta_y`: cambio inferido en las ventas debido a `delta_x`

source: `sigma`: standard deviation of `delta_y`
es: `sigma`: desviación estándar de `delta_y`

source: An experiment characterized in this way can be viewed as two points on the saturation curve for the channel. Accordingly, lift test calibration is implemented by adding a term to the model likelihood, that makes the channel saturation curve (the contribution as a function of spend) align with the test observation.
es: Un experimento caracterizado de esta manera puede ser visto como dos puntos en la curva de saturación para el canal. En consecuencia, la calibración de la prueba de elevación se implementa añadiendo un término a la verosimilitud del modelo, que hace que la curva de saturación del canal (la contribución como función del gasto) se alinee con la observación de la prueba.

source: Let's visualise the lift test results to get an understanding of how they can better inform the model parameters - specifically the saturation curve parameters.
es: Visualicemos los resultados de la prueba de elevación para comprender cómo pueden informar mejor los parámetros del modelo, específicamente los parámetros de la curva de saturación.

source: The top plot shows the results superimposed upon the actual saturation curves. In a real situation we would not know the actual saturation curves, but the plot here is incuded to aid understanding of what is taking place.
es: El gráfico superior muestra los resultados superpuestos sobre las curvas de saturación reales. En una situación real, no conoceríamos las curvas de saturación reales, pero el gráfico aquí se incluye para ayudar a comprender lo que está sucediendo.

source: The bottom plot shows the same results but at y=0, focussing on the fact that we are only observing the _change_ in contribution. This is more true of the partial knowledge you'd have in a real situation.
es: El gráfico inferior muestra los mismos resultados pero en y=0, centrándose en el hecho de que solo estamos observando el _cambio_ en la contribución. Esto es más cierto en relación con el conocimiento parcial que tendrías en una situación real.

source: Lift tests are visualized with the triangles. The base of the triangle shows the change in the spend and height of triangle is change in contribution.
es: Las pruebas de elevación se visualizan con los triángulos. La base del triángulo muestra el cambio en el gasto y la altura del triángulo representa el cambio en la contribución.

source: While we only have the information in the bottom plot, the top plot shows how the lift test information can be used to help better estimate the saturation curves.
es: Aunque solo tenemos la información en el gráfico inferior, el gráfico superior muestra cómo la información de la prueba de elevación puede utilizarse para ayudar a estimar mejor las curvas de saturación.

source: For example, just from the lift tests (bottom triangles) we can see that channel 2 is slower to saturate than channel 1 because we get a higher change in contribution at higher spend levels.
es: Por ejemplo, solo a partir de las pruebas de elevación (triángulos inferiores) podemos ver que el canal 2 tarda más en saturarse que el canal 1 porque obtenemos un mayor cambio en la contribución a niveles de gasto más altos.

source: The first 2 lift tests on channel 1 involved _increasing_ the spend on that channel. However the third lift test on channel 1 involved a _decrease_ in the spend. It is useful to be able to consider both increases and decreases in spend in lift tests. And there is nothing getting in the way of making this decrease even more extreme by temporarily setting the spend to zero.
es: Las primeras 2 pruebas de lift en el canal 1 involucraron _aumentar_ el gasto en ese canal. Sin embargo, la tercera prueba de lift en el canal 1 involucró una _disminución_ en el gasto. Es útil poder considerar tanto aumentos como disminuciones en el gasto en las pruebas de lift. Y no hay nada que impida hacer que esta disminución sea aún más extrema al establecer temporalmente el gasto en cero.

source: Add Lift Tests to Model
es: Agregar Pruebas de Elevación al Modelo

source: Having created a `MMM` model instance, `mmm` and built it using the `build_model` method or fit with `fit` method, we can add lift test results to the model using the `add_lift_test_measurments` method.
es: Habiendo creado una instancia del modelo `MMM`, `mmm` y construido utilizando el método `build_model` o ajustado con el método `fit`, podemos agregar los resultados de la prueba de elevación al modelo utilizando el método `add_lift_test_measurments`.

source: First, let's take a look at the model graph before adding the lift test measurements.
es: Primero, echemos un vistazo al gráfico del modelo antes de agregar las mediciones de la prueba de elevación.

source: And now we'll add the lift test measurements to the model and see how our model graph has changed.
es: Y ahora añadiremos las mediciones de la prueba de elevación al modelo y veremos cómo ha cambiado el gráfico de nuestro modelo.

source: We can see the model graph is modified with new observation for our lift measurements. The observation distribution is assumed to be `Gamma` as each saturation curve is monotonically increasing given a set of parameters.
es: Podemos ver que el gráfico del modelo se ha modificado con una nueva observación para nuestras mediciones de elevación. Se asume que la distribución de la observación es `Gamma`, ya que cada curva de saturación es monótonamente creciente dado un conjunto de parámetros.

source: In short, this works by providing a new likelihood term of the form
es: En resumen, esto funciona al proporcionar un nuevo término de probabilidad de la forma

source: where:
es: donde:

source: $|\Delta_y|$ is the observed absolute change in contribution - as estimate from the lift test.
es: $|\Delta_y|$ es el cambio absoluto observado en la contribución, estimado a partir de la prueba de elevación.

source: $|\tilde{\text{lift}}|$ is the absolute change in contribution as estimated by the model, i.e. based on the parameterized saturation curve.
es: $|\tilde{\text{lift}}|$ es el cambio absoluto en la contribución según lo estimado por el modelo, es decir, basado en la curva de saturación parametrizada.

source: $\sigma$ is the standard deviation of the increase in $\Delta_y$ of lift test. That is, we have uncertainty in the result of the lift test, and $\sigma$ represents the standard deviation of this uncertainty.
es: $\sigma$ es la desviación estándar del aumento en $\Delta_y$ de la prueba de elevación. Es decir, tenemos incertidumbre en el resultado de la prueba de elevación, y $\sigma$ representa la desviación estándar de esta incertidumbre.

source: We can refit the model but with the lift tests included
es: Podemos reacondicionar el modelo, pero con las pruebas de elevación incluidas.

source: The model gets shaped by the lift test measurements and the response curves begin to separate!
es: El modelo se moldea a partir de las mediciones de la prueba de elevación y las curvas de respuesta comienzan a separarse.

source: The 'rug' marks in the plot above show the _initial_ channel spend before the lift test.
es: Las marcas de 'alfombra' en el gráfico anterior muestran el gasto _inicial_ del canal antes de la prueba de elevación.

source: Below we show the (currently modest) changes in the saturation parameter estimates. The idea is that as we add more lift tests (see later), we can better estimate the saturation curves.
es: A continuación, mostramos los cambios (actualmente modestos) en las estimaciones del parámetro de saturación. La idea es que a medida que añadimos más pruebas de elevación (ver más adelante), podemos estimar mejor las curvas de saturación.
