Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_reasoning_and_discovery.po
Languages: es

source: Introducing causal discovery to PyMC-Marketing
es: { "singular": "Introduciendo el descubrimiento causal en PyMC-Marketing", "plural": "Introduciendo el descubrimiento causal en PyMC-Marketing" }

source: In marketing, we love to tell stories about *what drives what*: “TV lifts organic traffic,” “Meta drives sign-ups,” “price cuts increase search volume.” Yet those stories rely on an unspoken assumption — that we actually **know** the direction of influence. What if the “driver” is really a downstream effect of something else, like seasonality or product launches? Without a causal map, even elegant regressions or Bayesian models can mistake correlation for causation, leading us to optimize the wrong levers.
es: { "singular": "En marketing, nos encanta contar historias sobre *qué impulsa qué*: “la televisión aumenta el tráfico orgánico”, “Meta impulsa las inscripciones”, “las reducciones de precios aumentan el volumen de búsqueda.” Sin embargo, esas historias se basan en una suposición no expresada: que realmente **sabemos** la dirección de la influencia. ¿Qué pasaría si el “impulsor” es en realidad un efecto secundario de algo más, como la estacionalidad o los lanzamientos de productos? Sin un mapa causal, incluso regresiones elegantes o modelos bayesianos pueden confundir la correlación con la causalidad, llevándonos a optimizar las palancas equivocadas.", "plural": "En marketing, nos encanta contar historias sobre *qué impulsa qué*: “las televisiones aumentan el tráfico orgánico”, “Meta impulsa las inscripciones”, “las reducciones de precios aumentan el volumen de búsqueda.” Sin embargo, esas historias se basan en una suposición no expresada: que realmente **sabemos** la dirección de la influencia. ¿Qué pasaría si los “impulsores” son en realidad efectos secundarios de algo más, como la estacionalidad o los lanzamientos de productos? Sin un mapa causal, incluso regresiones elegantes o modelos bayesianos pueden confundir la correlación con la causalidad, llevándonos a optimizar las palancas equivocadas." }

source: That’s where **causal discovery** enters: algorithms that learn the underlying graph of cause and effect by testing conditional independences in data. The [classical PC](https://www.jmlr.org/papers/volume8/kalisch07a/kalisch07a.pdf?utm_source=chatgpt.com) and FCI algorithms, used in fields like biology and neuroscience, are brilliant at uncovering causal skeletons under strong assumptions — i.i.d. data, no feedback, and well-separated mechanisms. But marketing rarely plays by those rules. Channels interact, campaigns overlap in time, and KPIs often feed back into exposure decisions. The result? Run a vanilla PC or FCI on raw marketing data, and you’ll likely get nonsense: edges pointing from conversions to impressions, from CTR to spend, or loops that defy business logic.
es: { "singular": { "msgid": "That’s where **causal discovery** enters: algorithms that learn the underlying graph of cause and effect by testing conditional independences in data. The [classical PC](https://www.jmlr.org/papers/volume8/kalisch07a/kalisch07a.pdf?utm_source=chatgpt.com) and FCI algorithms, used in fields like biology and neuroscience, are brilliant at uncovering causal skeletons under strong assumptions — i.i.d. data, no feedback, and well-separated mechanisms. But marketing rarely plays by those rules. Channels interact, campaigns overlap in time, and KPIs often feed back into exposure decisions. The result? Run a vanilla PC or FCI on raw marketing data, and you’ll likely get nonsense: edges pointing from conversions to impressions, from CTR to spend, or loops that defy business logic.", "msgstr": "Ahí es donde entra el **descubrimiento causal**: algoritmos que aprenden el grafo subyacente de causa y efecto al probar independencias condicionales en los datos. Los algoritmos PC [clásico](https://www.jmlr.org/papers/volume8/kalisch07a/kalisch07a.pdf?utm_source=chatgpt.com) y FCI, utilizados en campos como la biología y la neurociencia, son brillantes para descubrir esqueletos causales bajo fuertes supuestos: datos i.i.d., sin retroalimentación y mecanismos bien separados. Pero el marketing rara vez sigue esas reglas. Los canales interactúan, las campañas se superponen en el tiempo y los KPI a menudo retroalimentan las decisiones de exposición. ¿El resultado? Ejecuta un PC o FCI estándar en datos de marketing en bruto, y probablemente obtendrás tonterías: bordes que apuntan de conversiones a impresiones, de CTR a gasto, o bucles que desafían la lógica empresarial." }, "plural": { "msgid": "That’s where **causal discovery** enters: algorithms that learn the underlying graph of cause and effect by testing conditional independences in data. The [classical PC](https://www.jmlr.org/papers/volume8/kalisch07a/kalisch07a.pdf?utm_source=chatgpt.com) and FCI algorithms, used in fields like biology and neuroscience, are brilliant at uncovering causal skeletons under strong assumptions — i.i.d. data, no feedback, and well-separated mechanisms. But marketing rarely plays by those rules. Channels interact, campaigns overlap in time, and KPIs often feed back into exposure decisions. The result? Run a vanilla PC or FCI on raw marketing data, and you’ll likely get nonsense: edges pointing from conversions to impressions, from CTR to spend, or loops that defy business logic.", "msgstr": "Ahí es donde entra el **descubrimiento causal**: algoritmos que aprenden el grafo subyacente de causa y efecto al probar independencias condicionales en los datos. Los algoritmos PC [clásico](https://www.jmlr.org/papers/volume8/kalisch07a/kalisch07a.pdf?utm_source=chatgpt.com) y FCI, utilizados en campos como la biología y la neurociencia, son brillantes para descubrir esqueletos causales bajo fuertes supuestos: datos i.i.d., sin retroalimentación y mecanismos bien separados. Pero el marketing rara vez sigue esas reglas. Los canales interactúan, las campañas se superponen en el tiempo y los KPI a menudo retroalimentan las decisiones de exposición. ¿El resultado? Ejecuta un PC o FCI estándar en datos de marketing en bruto, y probablemente obtendrás tonterías: bordes que apuntan de conversiones a impresiones, de CTR a gasto, o bucles que desafían la lógica empresarial." } }

source: Does this mean causal discovery is hopeless for marketing? Not at all. Marketing systems are **structural**, not chaotic. We already know many relationships cannot exist — impressions don’t depend on conversions, and every causal path should eventually point toward a measurable target or KPI. We also have strong priors about latent factors like seasonality or market share dynamics. This knowledge drastically **reduces the search space** and makes causal discovery feasible if we incorporate it thoughtfully. That’s exactly what this notebook explores.
es: { "singular": "¿Significa esto que el descubrimiento causal es inútil para el marketing? En absoluto. Los sistemas de marketing son **estructurales**, no caóticos. Ya sabemos que muchas relaciones no pueden existir: las impresiones no dependen de las conversiones, y cada camino causal debería eventualmente apuntar hacia un objetivo medible o KPI. También tenemos fuertes priors sobre factores latentes como la estacionalidad o la dinámica de la cuota de mercado. Este conocimiento reduce drásticamente **el espacio de búsqueda** y hace que el descubrimiento causal sea factible si lo incorporamos de manera reflexiva. Eso es exactamente lo que explora este cuaderno.", "plural": "¿Significa esto que los descubrimientos causales son inútiles para el marketing? En absoluto. Los sistemas de marketing son **estructurales**, no caóticos. Ya sabemos que muchas relaciones no pueden existir: las impresiones no dependen de las conversiones, y cada camino causal debería eventualmente apuntar hacia un objetivo medible o KPI. También tenemos fuertes priors sobre factores latentes como la estacionalidad o la dinámica de la cuota de mercado. Este conocimiento reduce drásticamente **el espacio de búsqueda** y hace que los descubrimientos causales sean factibles si los incorporamos de manera reflexiva. Eso es exactamente lo que explora este cuaderno." }

source: TBFPC algorithm overview
es: { "singular": "Descripción general del algoritmo TBFPC", "plural": "Descripción general de los algoritmos TBFPC" }

source: The `TBFPC` algorithm — **Target-first Bayes Factor PC** — is a lightweight, **target-oriented** variant of the classical PC approach, designed with marketing in mind. It tests for independence using **Bayes factors** instead of frequentist tests, and lets you encode **forbidden edges** to reflect domain priors. It adds a **target-edge rule** — `"any"`, `"conservative"`, or `"fullS"` — to bias discovery toward genuine **driver → target** relationships. The Bayes factor is computed via the ΔBIC approximation:
es: { "singular": "El algoritmo `TBFPC` — **Factor de Bayes orientado al objetivo primero** — es una variante ligera y **orientada al objetivo** del enfoque clásico de PC, diseñada con el marketing en mente. Prueba la independencia utilizando **factores de Bayes** en lugar de pruebas frecuentistas, y te permite codificar **bordes prohibidos** para reflejar los priors del dominio. Añade una regla de **borde objetivo** — \"any\", \"conservative\" o \"fullS\" — para sesgar el descubrimiento hacia relaciones genuinas de **driver → target**. El factor de Bayes se calcula a través de la aproximación ΔBIC:", "plural": "Los algoritmos `TBFPC` — **Factores de Bayes orientados al objetivo primero** — son variantes ligeras y **orientadas al objetivo** de los enfoques clásicos de PC, diseñadas con el marketing en mente. Prueban la independencia utilizando **factores de Bayes** en lugar de pruebas frecuentistas, y te permiten codificar **bordes prohibidos** para reflejar los priors del dominio. Añaden una regla de **borde objetivo** — \"any\", \"conservative\" o \"fullS\" — para sesgar el descubrimiento hacia relaciones genuinas de **driver → target**. Los factores de Bayes se calculan a través de la aproximación ΔBIC:" }

source: `TBFPC` is **experimental**, but it bridges an important gap between **Bayesian modeling** and **causal reasoning** for marketing science. It aims not to replace classical discovery frameworks, but to adapt them — respecting the structure, constraints, and realities of marketing data — to yield graphs that make sense both statistically and strategically.
es: { "singular": "`TBFPC` es **experimental**, pero cierra una brecha importante entre el **modelado bayesiano** y el **razonamiento causal** para la ciencia del marketing. Su objetivo no es reemplazar los marcos de descubrimiento clásicos, sino adaptarlos —respetando la estructura, las restricciones y las realidades de los datos de marketing— para generar gráficos que tengan sentido tanto estadísticamente como estratégicamente.", "plural": "`TBFPC` son **experimentales**, pero cierran brechas importantes entre los **modelados bayesianos** y los **razonamientos causales** para las ciencias del marketing. Sus objetivos no son reemplazar los marcos de descubrimiento clásicos, sino adaptarlos —respetando las estructuras, las restricciones y las realidades de los datos de marketing— para generar gráficos que tengan sentido tanto estadísticamente como estratégicamente." }

source: Glossary
es: { "singular": "Glosario", "plural": "Glosarios" }

source: Causal discovery – Algorithms that infer directional relationships between variables by testing conditional independences in observational data.
es: { "singular": "Descubrimiento causal – Algoritmos que inferen relaciones direccionales entre variables al probar independencias condicionales en datos observacionales.", "plural": "Descubrimiento causal – Algoritmos que inferen relaciones direccionales entre variables al probar independencias condicionales en datos observacionales." }

source: Directed Acyclic Graph (DAG) – A fully oriented, cycle-free graph that encodes one specific causal data-generating process.
es: { "singular": "Gráfico Acíclico Dirigido (DAG) – Un gráfico completamente orientado y libre de ciclos que codifica un proceso específico de generación de datos causales.", "plural": "Gráficos Acíclicos Dirigidos (DAG) – Gráficos completamente orientados y libres de ciclos que codifican procesos específicos de generación de datos causales." }

source: Completed Partially Directed Acyclic Graph (CPDAG) – A graph with both directed and undirected edges summarizing every DAG in the same Markov equivalence class.
es: { "singular": "Gráfico Acíclico Dirigido Parcialmente Completado (CPDAG) – Un gráfico con bordes dirigidos y no dirigidos que resume cada DAG en la misma clase de equivalencia de Markov.", "plural": "Gráficos Acíclicos Dirigidos Parcialmente Completados (CPDAG) – Un gráfico con bordes dirigidos y no dirigidos que resume cada DAG en la misma clase de equivalencia de Markov." }

source: Markov equivalence class (MEC) – The collection of DAGs that imply identical d-separation statements and therefore cannot be distinguished via conditional independence tests alone.
es: { "singular": "Clase de equivalencia de Markov (MEC) – La colección de DAGs que implican declaraciones de d-separación idénticas y, por lo tanto, no pueden ser distinguidos únicamente a través de pruebas de independencia condicional.", "plural": "Clases de equivalencia de Markov (MEC) – Las colecciones de DAGs que implican declaraciones de d-separación idénticas y, por lo tanto, no pueden ser distinguidos únicamente a través de pruebas de independencia condicional." }

source: Target-first Bayes Factor PC (TBFPC) – Target-oriented adaptation of the PC discovery algorithm that applies Bayes factor (ΔBIC) tests plus marketing-specific constraints to learn causal skeletons.
es: { "singular": "Factor Bayesiano TBFPC (Target-first Bayes Factor PC) – Adaptación orientada al objetivo del algoritmo de descubrimiento PC que aplica pruebas de factor de Bayes (ΔBIC) más restricciones específicas de marketing para aprender esqueletos causales.", "plural": "Factores Bayesianos TBFPC (Target-first Bayes Factor PC) – Adaptaciones orientadas al objetivo de los algoritmos de descubrimiento PC que aplican pruebas de factor de Bayes (ΔBIC) más restricciones específicas de marketing para aprender esqueletos causales." }

source: Bayes factor ΔBIC test – The log Bayes factor computed from the change in Bayesian Information Criterion, used to decide whether variables remain dependent after conditioning on controls.
es: { "singular": "Prueba del factor de Bayes ΔBIC – El logaritmo del factor de Bayes calculado a partir del cambio en el Criterio de Información Bayesiano, utilizado para decidir si las variables permanecen dependientes después de condicionar sobre los controles.", "plural": "Pruebas del factor de Bayes ΔBIC – Los logaritmos de los factores de Bayes calculados a partir de los cambios en los Criterios de Información Bayesianos, utilizados para decidir si las variables permanecen dependientes después de condicionar sobre los controles." }

source: Import dependencies
es: { "singular": "Importar dependencias", "plural": "Importar dependencias" }

source: Setting notebook
es: { "singular": "Configurando el cuaderno", "plural": "Configurando los cuadernos" }

source: Let’s begin with a simple but powerful causal story, adapted from an article by **Ben Vincent** — [*“Causal Inference: have you been doing science wrong all this time?”*](https://drbenvincent.github.io/posts/causal_fear.html#fig-causal-dag). In it, Ben illustrates (probably without know it) a common situation in marketing analytics where **search**, **media**, and **sales** are tightly interwoven. We’ll recreate a similar structure here, representing the true (but usually hidden) causal data-generating process.
es: { "singular": "Comencemos con una historia causal simple pero poderosa, adaptada de un artículo de **Ben Vincent** — [*“Inferencia Causal: ¿has estado haciendo ciencia mal todo este tiempo?”*](https://drbenvincent.github.io/posts/causal_fear.html#fig-causal-dag). En él, Ben ilustra (probablemente sin saberlo) una situación común en el análisis de marketing donde **búsqueda**, **medios** y **ventas** están estrechamente entrelazados. Recrearemos una estructura similar aquí, representando el verdadero (pero generalmente oculto) proceso generador de datos causales.", "plural": "Comencemos con historias causales simples pero poderosas, adaptadas de artículos de **Ben Vincent** — [*“Inferencia Causal: ¿has estado haciendo ciencia mal todo este tiempo?”*](https://drbenvincent.github.io/posts/causal_fear.html#fig-causal-dag). En ellos, Ben ilustra (probablemente sin saberlo) situaciones comunes en el análisis de marketing donde **búsqueda**, **medios** y **ventas** están estrechamente entrelazados. Recrearemos estructuras similares aquí, representando los verdaderos (pero generalmente ocultos) procesos generadores de datos causales." }

source: Imagine the following system:
es: { "singular": "Imagina el siguiente sistema:", "plural": "Imagina los siguientes sistemas:" }

source: People first engage with **generic search** activity (`Q`), such as looking for products or comparing options.
es: { "singular": "Las personas primero se involucran en la actividad de **búsqueda genérica** (`Q`), como buscar productos o comparar opciones.", "plural": "Las personas primero se involucran en la actividad de **búsqueda genérica** (`Q`), como buscar productos o comparar opciones." }

source: This general intent influences **media exposure** (`X`) — those who are searching more are also more likely to see or click ads.
es: { "singular": { "msgid": "This general intent influences **media exposure** (`X`) — those who are searching more are also more likely to see or click ads.", "msgstr": "Esta intención general influye en **la exposición a los medios** (`X`) — aquellos que buscan más también son más propensos a ver o hacer clic en anuncios." }, "plural": { "msgid": "This general intent influences **media exposure** (`X`) — those who are searching more are also more likely to see or click ads.", "msgstr": "Esta intención general influye en **la exposición a los medios** (`X`) — aquellos que buscan más también son más propensos a ver o hacer clic en anuncios." } }

source: Both `Q` and `X` shape **brand search** (`Y`), which captures the strength of the brand in the customer’s mind.
es: { "singular": "Tanto `Q` como `X` dan forma a **la búsqueda de marca** (`Y`), que captura la fuerza de la marca en la mente del cliente.", "plural": "Tanto `Q` como `X` dan forma a **las búsquedas de marca** (`Y`), que capturan la fuerza de la marca en las mentes de los clientes." }

source: Finally, both `X` and `Y` lead to **purchases** (`P`).
es: { "singular": "Finalmente, tanto `X` como `Y` conducen a **una compra** (`P`).", "plural": "Finalmente, tanto `X` como `Y` conducen a **compras** (`P`)." }

source: This graph tells a clear causal story: upstream **intent** (`Q`) drives both **media** and **brand search**, which together drive **sales**. Yet, if we didn’t know this map and simply ran a regression of `P ~ X + Y`, we might overestimate the effect of `X` (media) because part of its variation is confounded by `Q`. Or we might mistakenly interpret `Y` (brand search) as an independent driver of purchases, when in reality it is *mediated* by media and intent. This is the classic trap of confusing *correlation* with *causation*.
es: { "singular": "Este gráfico cuenta una historia causal clara: la **intención** (`Q`) impulsa tanto a los **medios** como a la **búsqueda de marca**, que juntos impulsan las **ventas**. Sin embargo, si no conociéramos este mapa y simplemente realizáramos una regresión de `P ~ X + Y`, podríamos sobrestimar el efecto de `X` (medios) porque parte de su variación está confundida por `Q`. O podríamos interpretar erróneamente `Y` (búsqueda de marca) como un impulsor independiente de las compras, cuando en realidad está *mediado* por los medios y la intención. Esta es la trampa clásica de confundir *correlación* con *causalidad*.", "plural": "Estos gráficos cuentan historias causales claras: las **intenciones** (`Q`) impulsan tanto a los **medios** como a la **búsqueda de marca**, que juntos impulsan las **ventas**. Sin embargo, si no conociéramos estos mapas y simplemente realizáramos regresiones de `P ~ X + Y`, podríamos sobrestimar el efecto de `X` (medios) porque parte de su variación está confundida por `Q`. O podríamos interpretar erróneamente `Y` (búsqueda de marca) como un impulsor independiente de las compras, cuando en realidad está *mediado* por los medios y las intenciones. Esta es la trampa clásica de confundir *correlación* con *causalidad*." }

source: Such structures are not hypothetical — they mirror real marketing dynamics. Channels, brand signals, and consumer intent often reinforce each other. Without a causal understanding of how these processes interact, any econometric or Bayesian model risks attributing the wrong effects to the wrong levers. **Causal discovery** gives us a principled way to uncover (or at least approximate) this hidden DAG, helping us build models that explain *why* something happens — not just *what* happens. The next cell visualizes this canonical causal map.
es: { "singular": "Tales estructuras no son hipotéticas: reflejan dinámicas de marketing reales. Los canales, las señales de marca y la intención del consumidor a menudo se refuerzan entre sí. Sin una comprensión causal de cómo interactúan estos procesos, cualquier modelo econométrico o bayesiano corre el riesgo de atribuir los efectos incorrectos a las palancas equivocadas. **El descubrimiento causal** nos proporciona una forma fundamentada de descubrir (o al menos aproximar) este DAG oculto, ayudándonos a construir modelos que expliquen *por qué* sucede algo, no solo *qué* sucede. La siguiente celda visualiza este mapa causal canónico.", "plural": "Tales estructuras no son hipotéticas: reflejan dinámicas de marketing reales. Los canales, las señales de marca y la intención del consumidor a menudo se refuerzan entre sí. Sin una comprensión causal de cómo interactúan estos procesos, cualquier modelo econométrico o bayesiano corre el riesgo de atribuir los efectos incorrectos a las palancas equivocadas. **El descubrimiento causal** nos proporciona una forma fundamentada de descubrir (o al menos aproximar) este DAG oculto, ayudándonos a construir modelos que expliquen *por qué* sucede algo, no solo *qué* sucede. La siguiente celda visualiza este mapa causal canónico." }

source: We'll now generate data which follow the same causal structure!
es: { "singular": "¡Ahora generaremos datos que siguen la misma estructura causal!", "plural": "¡Ahora generaremos datos que siguen la misma estructura causal!" }
