Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_quickstart.po
Languages: es

source: MMM Quickstart Guide
es: Guía de inicio rápido de MMM

source: Welcome to **PyMC-Marketing**! This library provides powerful Bayesian modeling tools for marketing analytics. PyMC-Marketing is built on top of [PyMC](https://www.pymc.io/), a probabilistic programming library that enables Bayesian inferenc. In this quickstart, we'll walk through fitting a basic Media Mix Model (MMM) in PyMC-Marketing.
es: Bienvenido a **PyMC-Marketing**. Esta biblioteca ofrece poderosas herramientas de modelado bayesiano para analítica de marketing. PyMC-Marketing está construido sobre [PyMC](https://www.pymc.io/), una biblioteca de programación probabilística que habilita la inferencia bayesiana. En esta guía rápida, recorreremos cómo ajustar un modelo básico de Mezcla de Medios (MMM) en PyMC-Marketing.

source: What is Media Mix Modeling?
es: ¿Qué es el Modelado de Mezcla de Medios?

source: Media Mix Modeling (MMM) helps marketers understand how different advertising channels contribute to business outcomes (like sales or conversions). MMM answers key questions:
es: El Modelado de Mezcla de Medios (MMM) ayuda a los especialistas en marketing a comprender cómo distintos canales de publicidad contribuyen a los resultados del negocio (como ventas o conversiones). MMM responde preguntas clave:

source: **Which channels drive the most sales?**
es: **¿Qué canales impulsan más las ventas?**

source: **What is the Return on Ad Spend (ROAS) for each channel?**
es: **¿Cuál es el Retorno de la Inversión Publicitaria (ROAS) de cada canal?**

source: **How should I allocate my marketing budget?**
es: **¿Cómo debería asignar mi presupuesto de marketing?**

source: Key Concepts
es: Conceptos clave

source: MMM accounts for two important phenomena in advertising:
es: MMM tiene en cuenta dos fenómenos importantes en la publicidad:

source: **Adstock (Carry-over effect)**: The impact of advertising doesn't happen instantaneously—it builds up over time and gradually decays.
es: **Adstock (efecto de arrastre)**: El impacto de la publicidad no ocurre de forma instantánea; se acumula con el tiempo y se atenúa gradualmente.

source: **Saturation**: Returns diminish as you increase spend—the first dollar spent is more effective than the millionth dollar.
es: **Saturación**: Los rendimientos disminuyen a medida que aumentas el gasto; el primer dólar gastado es más efectivo que el millonésimo.

source: Let's see how we can fit a basic MMM model to understand these effects and measure channel contributions.
es: Veamos cómo ajustar un modelo MMM básico para entender estos efectos y medir las contribuciones de los canales.

source: The focus of PyMC-Marketing is to provide tooling for real application. Typically, we need to think about the causal structure, lift test calibration and advanced budget optimization. This example should be seen as a first step to a more complex and rich tool-box to drive marketing decisions of the order of millions of dollars. In our example gallery, you will find extensive resources to help you and guide you through the MMM modeling iterative process.
es: El objetivo de PyMC-Marketing es brindar herramientas para aplicaciones reales. Normalmente, necesitamos pensar en la estructura causal, la calibración de pruebas de lift y la optimización avanzada del presupuesto. Este ejemplo debe considerarse como un primer paso hacia un conjunto de herramientas más complejo y completo para impulsar decisiones de marketing por valor de millones de dólares. En nuestra galería de ejemplos encontrarás recursos extensos para ayudarte y guiarte a través del proceso iterativo de modelado MMM.

source: For an extended version of this example, see {ref}`mmm_example`. Here we delve deeper into the data generating process and model diagnostics. We also include ROAS estimation and out of sample predictions.
es: Para una versión extendida de este ejemplo, consulta {ref}`mmm_example`. Aquí profundizamos en el proceso de generación de datos y en el diagnóstico del modelo. También incluimos la estimación del ROAS y las predicciones fuera de muestra.

source: If you want to see a complete end-to-end analysis, see {ref}`mmm_case_study`. Here we take a "real" world dataset and go through the entire process of model specification, fitting, optimization and scenario planning.
es: Si deseas ver un análisis completo de principio a fin, consulta {ref}`mmm_case_study`. Aquí tomamos un conjunto de datos "real" y recorremos todo el proceso de especificación del modelo, ajuste, optimización y planificación de escenarios.

source: Prepare Notebook
es: Preparar el cuaderno

source: Let's import the necessary libraries:
es: Importemos las librerías necesarias:

source: Load Data
es: Cargar datos

source: We'll use a synthetic dataset that simulates weekly sales data along with spend on two marketing channels (`x1` and `x2`), plus some control variables for special events.
es: Usaremos un conjunto de datos sintético que simula datos semanales de ventas junto con el gasto en dos canales de marketing (`x1` y `x2`), además de algunas variables de control para eventos especiales.

source: Let's visualize our target variable (sales) and the media spend over time:
es: Visualicemos nuestra variable objetivo (ventas) y el gasto en medios a lo largo del tiempo:

source: Feature Engineering
es: Ingeniería de características

source: For our MMM model, we'll include:
es: Para nuestro modelo MMM, incluiremos:

source: **Trend**: A linear trend to capture long-term growth
es: **Tendencia**: Una tendencia lineal para capturar el crecimiento a largo plazo

source: **Seasonality**: Yearly seasonality (handled automatically by the model)
es: **Estacionalidad**: Estacionalidad anual (manejada automáticamente por el modelo)

source: **Events**: Binary indicators for special events
es: **Eventos**: Indicadores binarios para eventos especiales

source: **Media channels**: Our two advertising channels
es: **Canales de medios**: Nuestros dos canales de publicidad

source: Model Specification
es: Especificación del modelo

source: Now we'll configure our MMM model. The key components are:
es: Ahora configuraremos nuestro modelo MMM. Los componentes clave son:

source: **Adstock transformation**: We use `GeometricAdstock` with a maximum lag of 8 weeks
es: **Transformación Adstock**: Usamos `GeometricAdstock` con un retraso máximo de 8 semanas

source: **Saturation transformation**: We use `LogisticSaturation` to capture diminishing returns
es: **Transformación de saturación**: Usamos `LogisticSaturation` para capturar los rendimientos decrecientes

source: **Priors**: We can customize priors based on domain knowledge
es: **Distribuciones a priori**: Podemos personalizar las distribuciones a priori según el conocimiento del dominio

source: Setting Priors
es: Configuración de distribuciones a priori

source: One powerful feature of Bayesian modeling is the ability to incorporate prior knowledge. Here's a simple heuristic for channel priors based on spend share:
es: Una característica poderosa del modelado bayesiano es la capacidad de incorporar conocimiento previo. Aquí hay una heurística sencilla para las distribuciones a priori de los canales basada en la participación de gasto:

source: Now let's define our model configuration:
es: Ahora definamos la configuración de nuestro modelo:

source: Prior Predictive Check
es: Verificación predictiva a priori

source: The prior predictive check is a good way to check that our priors are reasonable. Hence, is strongly recommended to perform this check before fitting the model. If you are new to Bayesian modeling, take a look into our {ref}`prior_predictive` guide notebook.
es: La verificación predictiva a priori es una excelente manera de comprobar que nuestras distribuciones a priori son razonables. Por ello, se recomienda encarecidamente realizar esta verificación antes de ajustar el modelo. Si eres nuevo en el modelado bayesiano, consulta nuestro notebook de guía {ref}`prior_predictive`.

source: Before fitting, let's check that our priors are reasonable:
es: Antes de ajustar, verifiquemos que nuestras distribuciones a priori sean razonables:

source: Overall, the prior predictive check looks good.
es: En general, la verificación predictiva a priori se ve bien.

source: Model Fitting
es: Ajuste del modelo

source: Now let's fit the model to our data using MCMC sampling. Observe that we can use different samplers by passing the `nuts_sampler` argument. For instance, we can use `numpyro` `nutpie` or `blackjax` samplers (see {ref}`other_nuts_samplers` for more details).
es: Ahora ajustemos el modelo a nuestros datos usando muestreo MCMC. Ten en cuenta que podemos usar diferentes muestreadores pasando el argumento `nuts_sampler`. Por ejemplo, podemos usar los muestreadores `numpyro`, `nutpie` o `blackjax` (consulta {ref}`other_nuts_samplers` para más detalles).

source: Model Diagnostics
es: Diagnóstico del modelo

source: After fitting, we should check the model quality. Let's start with divergences:
es: Después del ajuste, debemos verificar la calidad del modelo. Comencemos con las divergencias:

source: Parameter Summary
es: Resumen de parámetros

source: Let's examine the estimated parameters:
es: Examinemos los parámetros estimados:

source: Good trace plots should show:
es: Los gráficos de traza adecuados deben mostrar:

source: **Left side**: Smooth, bell-shaped distributions
es: **Lado izquierdo**: Distribuciones suaves con forma de campana

source: **Right side**: "Fuzzy caterpillar" patterns (good mixing) with no trends
es: **Lado derecho**: patrones de "oruga difusa" (buen mezclado) sin tendencias

source: Posterior Predictive Check
es: Verificación predictiva posterior

source: How well does our model fit the observed data?
es: ¿Qué tan bien se ajusta nuestro modelo a los datos observados?

source: The model captures the observed data well if the black dots (actual sales) fall within the shaded uncertainty bands.
es: El modelo captura bien los datos observados si los puntos negros (ventas reales) caen dentro de las bandas de incertidumbre sombreadas.

source: Contribution Analysis
es: Análisis de contribución

source: Now for the fun part—understanding how much each component contributes to sales!
es: Ahora viene la parte divertida: ¡entender cuánto contribuye cada componente a las ventas!

source: Component Contributions Over Time
es: Contribuciones de componentes a lo largo del tiempo

source: Let's visualize the contribution of each component of the model over time:
es: Visualicemos la contribución de cada componente del modelo a lo largo del tiempo:

source: We see that we have captured the linear trend, events contributions and the seasonalities in the data. The remaining variation is due to the media channels, which is exactly what we want to understand.
es: Observamos que hemos capturado la tendencia lineal, las contribuciones de los eventos y las estacionalidades en los datos. La variación restante se debe a los canales de medios, que es exactamente lo que queremos entender.

source: Waterfall Chart: Total Contribution by Component
es: Gráfico de cascada: Contribución total por componente

source: A waterfall chart shows the total contribution of each component across the entire time period:
es: Un gráfico de cascada muestra la contribución total de cada componente en todo el período de tiempo:

source: This chart answers the question: **"How much did each component contribute to total sales?"**
es: Este gráfico responde a la pregunta: **"¿Cuánto contribuyó cada componente a las ventas totales?"**

source: Channel Contribution Share
es: Participación de contribución por canal

source: What percentage of media-driven sales comes from each channel?
es: ¿Qué porcentaje de ventas impulsadas por medios proviene de cada canal?

source: Direct Contribution Curves
es: Curvas de contribución directa

source: These curves show the relationship between spend and contribution, accounting for saturation:
es: Estas curvas muestran la relación entre gasto y contribución, teniendo en cuenta la saturación:

source: Notice how the curves flatten at higher spend levels—this is the saturation effect in action!
es: Observa cómo las curvas se aplanan a niveles de gasto más altos: ¡este es el efecto de saturación en acción!

source: Channel Contribution Grid
es: Cuadrícula de contribución por canal

source: A complementary view of the media performance is to evaluate the channel contribution at **different share spend levels for the complete training period**. Concretely, if we denote by $\delta$ the input channel data percentage level, so that for $\delta = 1$ we have the model input spend data and for $\delta = 1.5$ we have a $50\%$ increase in the spend, then we can compute the channel contribution at a grid of $\delta$-values and plot the results:
es: Una vista complementaria del rendimiento de los medios consiste en evaluar la contribución por canal en **diferentes niveles de participación de gasto durante todo el período de entrenamiento**. Concretamente, si denotamos por $\delta$ el nivel porcentual del gasto de entrada del canal, de modo que para $\delta = 1$ tenemos los datos de gasto de entrada del modelo y para $\delta = 1.5$ tenemos un aumento del 50\% en el gasto, entonces podemos calcular la contribución por canal en una cuadrícula de valores de $\delta$ y graficar los resultados:

source: Here we can also see the saturation effect and the relative contribution of each channel as a function of the share spend level on the aggregate time period.
es: Aquí también podemos ver el efecto de saturación y la contribución relativa de cada canal en función del nivel de participación de gasto en el período de tiempo agregado.

source: Next Steps
es: Próximos pasos

source: Congratulations! You've successfully fitted your first MMM model with PyMC-Marketing. 🎉
es: ¡Felicidades! Has ajustado con éxito tu primer modelo MMM con PyMC-Marketing. 🎉

source: To continue your journey, check out:
es: Para continuar tu recorrido, revisa:

source: {ref}`mmm_example`: A comprehensive walkthrough including data generation, ROAS calculation, and more advanced diagnostics
es: {ref}`mmm_example`: Un recorrido completo que incluye generación de datos, cálculo de ROAS y diagnósticos avanzados

source: {ref}`mmm_lift_test`: Incorporate experimental results to improve model accuracy
es: {ref}`mmm_lift_test`: Incorpora resultados experimentales para mejorar la precisión del modelo

source: PyMC-Marketing MMM Features
es: Características MMM de PyMC-Marketing

source: PyMC-Marketing provides a comprehensive suite of tools for Marketing Mix Modeling:
es: PyMC-Marketing ofrece un conjunto completo de herramientas para el Modelado de Mezcla de Medios:

source: Feature
es: Característica

source: Description
es: Descripción

source: **Custom Priors and Likelihoods**
es: **Distribuciones a priori y verosimilitudes personalizadas**

source: Tailor your model to your specific business needs by including domain knowledge via prior distributions
es: Adapta tu modelo a tus necesidades específicas de negocio incluyendo conocimiento del dominio mediante distribuciones a priori

source: **Adstock Transformation**
es: **Transformación Adstock**

source: Optimize the carry-over effects in your marketing channels
es: Optimiza los efectos de arrastre en tus canales de marketing

source: **Saturation Effects**
es: **Efectos de saturación**

source: Understand the diminishing returns in media investments
es: Comprende los rendimientos decrecientes en las inversiones en medios

source: **Customize adstock and saturation functions**
es: **Personaliza las funciones de adstock y saturación**

source: Select from a variety of adstock and saturation functions, or implement your own custom functions
es: Elige entre una variedad de funciones de adstock y saturación, o implementa tus propias funciones personalizadas

source: **Time-varying Intercept**
es: **Intercepto variable en el tiempo**

source: Capture time-varying baseline contributions using modern and efficient Gaussian processes approximation methods
es: Captura las contribuciones de línea base variables en el tiempo utilizando métodos modernos y eficientes de aproximación con procesos Gaussianos

source: **Time-varying Media Contribution**
es: **Contribución de medios variable en el tiempo**

source: Capture time-varying media efficiency in your model
es: Captura la eficiencia de los medios variable en el tiempo en tu modelo

source: **Visualization and Model Diagnostics**
es: **Visualización y diagnóstico del modelo**

source: Get a comprehensive view of your model's performance and insights
es: Obtén una visión completa del rendimiento y los insights de tu modelo

source: **Causal Identification**
es: **Identificación causal**

source: Input a business-driven directed acyclic graph to identify meaningful variables for causal conclusions
es: Introduce un grafo acíclico dirigido basado en objetivos de negocio para identificar variables significativas para conclusiones causales

source: **Multiple inference algorithms**
es: **Múltiples algoritmos de inferencia**

source: Choose between various NUTS samplers (e.g., BlackJax, NumPyro, and Nutpie)
es: Elige entre varios muestreadores NUTS (p. ej., BlackJax, NumPyro y Nutpie)

source: **GPU Support**
es: **Compatibilidad con GPU**

source: PyMC's multiple backends allow for GPU acceleration
es: Los múltiples backends de PyMC permiten aceleración por GPU

source: **Out-of-sample Predictions**
es: **Predicciones fuera de muestra**

source: Forecast future marketing performance with credible intervals for simulations and scenario planning
es: Pronostica el rendimiento futuro de marketing con intervalos creíbles para simulaciones y planificación de escenarios

source: **Budget Optimization**
es: **Optimización de presupuesto**

source: Allocate your marketing spend efficiently across various channels for maximum ROI
es: Asigna tu gasto de marketing de manera eficiente entre varios canales para maximizar el ROI

source: **Experiment Calibration**
es: **Calibración de experimentos**

source: Fine-tune your model based on empirical experiments (lift tests) for a more unified view of marketing
es: Ajusta tu modelo basándote en experimentos empíricos (pruebas de lift) para una visión de marketing más unificada

source: References
es: Referencias

source: Jin, Y., Wang, Y., Sun, Y., Chan, D., & Koehler, J. (2017). [Bayesian Methods for Media Mix Modeling with Carryover and Shape Effects.](https://research.google/pubs/pub46001/)
es: Jin, Y., Wang, Y., Sun, Y., Chan, D. y Koehler, J. (2017). [Métodos bayesianos para el Modelado de Mezcla de Medios con efectos de arrastre y de forma.](https://research.google/pubs/pub46001/)

source: [PyMC-Marketing Documentation](https://www.pymc-marketing.io/)
es: [Documentación de PyMC-Marketing](https://www.pymc-marketing.io/)

source: Juan Orduz, [Media Effect Estimation with PyMC: Adstock, Saturation & Diminishing Returns](https://juanitorduz.github.io/pymc_mmm/)
es: Juan Orduz, [Estimación de efectos de medios con PyMC: Adstock, Saturación y Rendimientos decrecientes](https://juanitorduz.github.io/pymc_mmm/)
