Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_example.po
Languages: es

source: **NOTE:** If the method is being called **multiple times**, set the `extend_idata` argument to False in order to not overwrite the `observed_data` in the `InferenceData`
es: **NOTA:** Si el método se llama **múltiples veces**, establece el argumento `extend_idata` a False para no sobrescribir los `observed_data` en el `InferenceData`

source: The new predictions are transformed back to the original scale of the target by default. That can be seen below:
es: Las nuevas predicciones se transforman de nuevo a la escala original de la variable objetivo por defecto. Esto se puede ver a continuación:

source: If the out of sample data is being extended from the original predictions, consider setting the `include_last_observations` to True in order to carry over the effects from the last channel spends in the training set.
es: Si los datos fuera de muestra se extienden desde las predicciones originales, considera establecer el `include_last_observations` a True para llevar los efectos de los gastos del último canal en el conjunto de entrenamiento.

source: The predictions are higher since the channel contributions the final spends still have an impact that eventually subside.
es: Las predicciones son más altas ya que las contribuciones de los canales a los gastos finales aún tienen un impacto que eventualmente se disipa.

source: Finally we can use the model to understand the expected sales for different media spend scenarios considering the adstock and saturation effects learned from the data.
es: Finalmente podemos usar el modelo para entender las ventas esperadas para diferentes escenarios de gasto en medios considerando los efectos de adstock y saturación aprendidos de los datos.

source: We clearly see that since $x_1$ has a higher adstock parameter $\alpha$ than $x_2$, then for new spend on a single date (i.e. `one_time`) $x_1$ has larger delayed contributions than $x_2$.
es: Vemos claramente que, dado que $x_1$ tiene un parámetro de adstock $\alpha$ mayor que $x_2$, entonces, para un nuevo gasto en una sola fecha (es decir, `one_time`) $x_1$ tiene contribuciones con retardo más grandes que $x_2$.

source: 10. Save Model
es: 10. Guardar modelo

source: After your model is train, you can quickly save it using the `save` method. For more information about model deployment see {ref}`model_deployment`.
es: Después de que tu modelo esté entrenado, puedes guardarlo rápidamente usando el método `save`. Para más información sobre el despliegue del modelo, consulta {ref}`model_deployment`.
