Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_allocation_assessment.po
Languages: es

source: Great, here its clear how different strategies can lead to similar results, but with different risk profiles. Some distributions are more narrow, and some are more spread based on the risk tolerance.
es: Excelente, aquí está claro cómo diferentes estrategias pueden llevar a resultados similares, pero con diferentes perfiles de riesgo. Algunas distribuciones son más estrechas, y algunas son más amplias según la tolerancia al riesgo.

source: Conclusion
es: Conclusión

source: In this notebook, we have examined the methodology for assessing the risk associated with various budget allocations, utilizing distinct strategies. We have also demonstrated how to generate an optimal budget allocation that aligns with a specified risk tolerance criterion. Three separate risk assessment metrics were employed: the Mean Tightness Score (MTS), Value at Risk (VaR), and a custom criterion that integrates both the mean tightness score and the diversification ratio.
es: En este cuaderno, hemos examinado la metodología para evaluar el riesgo asociado con diversas asignaciones presupuestarias, utilizando estrategias distintas. También hemos demostrado cómo generar una asignación presupuestaria óptima que se alinee con un criterio de tolerancia al riesgo específico. Se emplearon tres métricas de evaluación de riesgos separadas: el Puntaje de Ajuste Medio (MTS), el Valor en Riesgo (VaR) y un criterio personalizado que integra tanto el puntaje de ajuste medio como el ratio de diversificación.

source: Next Steps
es: Próximos pasos

source: It is essential to recognize that not all risk assessment criteria are compatible with the output without appropriate transformations. For instance, to compute the VaR, we analyzed the Return on Advertising Spend (ROAS) distribution; utilizing the response distribution directly would not adhere to the assumptions inherent in the VaR formula, potentially resulting in inconsistent or nonsensical outcomes.
es: Es esencial reconocer que no todos los criterios de evaluación de riesgos son compatibles con la salida sin las transformaciones adecuadas. Por ejemplo, para calcular el VaR, analizamos la distribución del Retorno sobre el Gasto en Publicidad (ROAS); utilizar la distribución de respuesta directamente no se ajustaría a las suposiciones inherentes a la fórmula del VaR, lo que podría resultar en resultados inconsistentes o sin sentido.

source: The next step is for you to develop your own risk assessment criterion and apply it to optimize your budget allocation.
es: El siguiente paso es que desarrolle su propio criterio de evaluación de riesgos y lo aplique para optimizar la asignación de su presupuesto.
