Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_gam_options.po
Languages: es

source: From Marketing Mix Models to Custom Bayesian GAMs: Extending PyMC-Marketing’s Core
es: De Modelos de Mezcla de Marketing a GAMs Bayesianos Personalizados: Ampliando el Núcleo de PyMC-Marketing

source: Introduction
es: Introducción

source: While PyMC-Marketing is widely recognized for its advanced Marketing Mix Modeling (MMM) capabilities, its true potential extends far beyond traditional MMM frameworks. At its core, PyMC-Marketing provides a flexible and composable architecture that enables the construction of complex probabilistic models—particularly generalized additive models (GAMs)—within the Bayesian paradigm. By leveraging PyMC’s expressive modeling syntax and the modular structure of PyMC-Marketing, everyone can integrate nonlinear transformations, hierarchical priors, auto-regressive dynamics with just a few lines of code or to define their own custom transformations that reflect domain-specific knowledge and data-driven insights. In doing so, PyMC-Marketing becomes not only a framework for marketing optimization but also a general-purpose engine for building interpretable Bayesian GAMs. This flexibility makes it an invaluable tool for anyone seeking to combine causal reasoning, functional flexibility, and probabilistic inference in a coherent modeling workflow.
es: Mientras que PyMC-Marketing es ampliamente reconocido por sus avanzadas capacidades de Modelado de Mezcla de Marketing (MMM), su verdadero potencial se extiende mucho más allá de los marcos tradicionales de MMM. En su núcleo, PyMC-Marketing proporciona una arquitectura flexible y componible que permite la construcción de modelos probabilísticos complejos—particularmente modelos aditivos generalizados (GAMs)—dentro del paradigma bayesiano. Al aprovechar la sintaxis de modelado expresiva de PyMC y la estructura modular de PyMC-Marketing, cualquier persona puede integrar transformaciones no lineales, priors jerárquicos, dinámicas auto-regresivas con solo unas pocas líneas de código o definir sus propias transformaciones personalizadas que reflejen conocimientos específicos del dominio y perspectivas basadas en datos. Al hacerlo, PyMC-Marketing se convierte no solo en un marco para la optimización del marketing, sino también en un motor de propósito general para construir GAMs bayesianos interpretables. Esta flexibilidad lo convierte en una herramienta invaluable para cualquiera que busque combinar razonamiento causal, flexibilidad funcional e inferencia probabilística en un flujo de trabajo de modelado coherente.

source: This allows researchers and analysts to move seamlessly from standard MMMs to fully specified graphical models that capture richer causal and functional relationships across variables.
es: Esto permite a los investigadores y analistas moverse sin problemas de los MMM estándar a modelos gráficos completamente especificados que capturan relaciones causales y funcionales más ricas entre las variables.

source: In the following notebook, we'll showing you several of these functionalities. You can [read more about individual components](https://www.pymc-marketing.io/en/latest/notebooks/mmm/mmm_components.html) and how to build MMM's in the components notebook.
es: En el siguiente cuaderno, le mostraremos varias de estas funcionalidades. Puede [leer más sobre los componentes individuales](https://www.pymc-marketing.io/en/latest/notebooks/mmm/mmm_components.html) y cómo construir MMM en el cuaderno de componentes.

source: Import libraries
es: Importar bibliotecas

source: Setting notebook
es: Configuración del cuaderno

source: Data generation process
es: Proceso de generación de datos

source: For the following examples, we won’t build a large structural process, since the goal of this notebook is simply to showcase the library’s capabilities. Instead, we’ll generate a few time series following random walks and define a simple linear target variable that depends on the number of created drivers.
es: Para los siguientes ejemplos, no construiremos un gran proceso estructural, ya que el objetivo de este cuaderno es simplemente mostrar las capacidades de la biblioteca. En su lugar, generaremos algunas series temporales siguiendo caminatas aleatorias y definiremos una variable objetivo lineal simple que depende del número de controladores creados.

source: The series can be viewed as marketing variables or drivers aimed at a specific target. As we move through the notebook, we’ll generate numerous examples of potential datasets that can be used with each of the models.
es: La serie puede verse como variables de marketing o impulsores dirigidos a un objetivo específico. A medida que avancemos por el cuaderno, generaremos numerosos ejemplos de conjuntos de datos potenciales que pueden utilizarse con cada uno de los modelos.

source: Great, let's visualize our time series!
es: Genial, ¡visualicemos nuestra serie temporal!

source: We’ll build a simple linear model based on these four factors. You can think of them as representing impressions, spend, or any other typical marketing variable, while the target could correspond to outcomes such as revenue, installs, site registrations, or purchases.
es: Construiremos un modelo lineal simple basado en estos cuatro factores. Puede pensar en ellos como representaciones de impresiones, gasto o cualquier otra variable de marketing típica, mientras que el objetivo podría corresponder a resultados como ingresos, instalaciones, registros en el sitio o compras.

source: We put all the data together in the same dataset.
es: Juntamos todos los datos en el mismo conjunto de datos.

source: Sampler settings
es: Configuración del muestreador

source: We'll make a set of predifine sampler settings for all our models.
es: Crearemos un conjunto de configuraciones de muestreo predefinidas para todos nuestros modelos.

source: Simple Linear Model
es: Modelo Lineal Simple

source: To begin, we’ll construct a basic linear model using the `MMM` class. This example demonstrates how PyMC-Marketing can easily represent a standard linear regression.
es: Para comenzar, construiremos un modelo lineal básico utilizando la clase `MMM`. Este ejemplo demuestra cómo PyMC-Marketing puede representar fácilmente una regresión lineal estándar.

source: PyMC-Marketing never forces the use of non-linearity. You can build purely linear models when that's what your data and business context require.
es: PyMC-Marketing nunca obliga al uso de no linealidad. Puedes construir modelos puramente lineales cuando eso es lo que tus datos y el contexto empresarial requieren.

source: In this setup, the target variable $Y_t$ is modeled as a linear combination of several predictors $X_{i,t}$, each weighted by its corresponding coefficient $b_i$, plus a random error term $\varepsilon_t$:
es: En esta configuración, la variable objetivo $Y_t$ se modela como una combinación lineal de varios predictores $X_{i,t}$, cada uno ponderado por su correspondiente coeficiente $b_i$, más un término de error aleatorio $\varepsilon_t$:

source: Here:
es: Aquí:

source: $Y_t$ represents the target at time $t$ (e.g., revenue, installs, or registrations),
es: $Y_t$ representa el objetivo en el tiempo $t$ (por ejemplo, ingresos, instalaciones o registros),

source: $X_{i,t}$ are the explanatory variables (e.g., impressions, spend, or other marketing drivers),
es: $X_{i,t}$ son las variables explicativas (por ejemplo, impresiones, gasto u otros impulsores de marketing),

source: $b_i$ are the channel-specific coefficients capturing the marginal contribution of each variable, and
es: $b_i$ son los coeficientes específicos del canal que capturan la contribución marginal de cada variable, y

source: $\varepsilon_t$ is the residual term accounting for unobserved variation.
es: $\varepsilon_t$ es el término residual que contabiliza la variación no observada.

source: This case represents our precise previous data generation process, but the important thing is how easy it is to write this equation using the MMM API.
es: Este caso representa nuestro preciso proceso de generación de datos anterior, pero lo importante es lo fácil que es escribir esta ecuación utilizando la API de MMM.

source: With just a few lines of code, you can define a linear model that already includes flexible prior configurations and multidimensional structure.
es: Con solo unas pocas líneas de código, puede definir un modelo lineal que ya incluye configuraciones previas flexibles y una estructura multidimensional.

source: The real advantage, however, isn’t just building a more complex graphical model so easily — it’s gaining access to all the powerful tools that PyMC-Marketing provides, even for a simple regression.
es: La verdadera ventaja, sin embargo, no es solo construir un modelo gráfico más complejo tan fácilmente; es obtener acceso a todas las poderosas herramientas que PyMC-Marketing proporciona, incluso para una regresión simple.

source: PyMC-Marketing gives you, out of the box:
es: PyMC-Marketing le ofrece, listo para usar:

source: **Automatic scaling and rescaling** of inputs and outputs.
es: **Escalado y reescalado automáticos** de entradas y salidas.

source: **Comprehensive plotting tools** for posterior evaluation.
es: **Herramientas de trazado completas** para la evaluación posterior.

source: **Sensitivity and marginal effect analysis** for each node in the model.
es: **Análisis de sensibilidad y efecto marginal** para cada nodo en el modelo.

source: **Model calibration** using experimental or causal evidence.
es: **Calibración del modelo** utilizando evidencia experimental o causal.

source: **Budget allocation and optimization** capabilities.
es: **Capacidades de asignación y optimización del presupuesto.**

source: All these features are available even for the simplest models, allowing you to move seamlessly from basic regressions to full probabilistic marketing frameworks.
es: Todas estas características están disponibles incluso para los modelos más simples, lo que le permite pasar sin problemas de regresiones básicas a marcos de marketing probabilísticos completos.

source: Once every model is ready, you can train them in the very same way!
es: Una vez que cada modelo esté listo, ¡puedes entrenarlos de la misma manera!

source: As you can see, we already create a model, add variables to be transform in original scale, and train it. All of these is saved into my object. How could we make this a little more complex?
es: Como puede ver, ya hemos creado un modelo, añadido variables para ser transformadas en la escala original y lo hemos entrenado. Todo esto se guarda en mi objeto. ¿Cómo podríamos hacer esto un poco más complejo?

source: Before go there, we'll need to add something else to our data, in this case, we'll add a few extra dimensions, in order to have a larger dataset.
es: Antes de ir allí, necesitaremos agregar algo más a nuestros datos; en este caso, añadiremos algunas dimensiones adicionales para tener un conjunto de datos más grande.

source: Now our dataset looks better, we have a time series with lenght day per each country, region and product type. Take a look to the number of time series only made for $x1$.
es: Ahora nuestro conjunto de datos se ve mejor, tenemos una serie temporal con longitud de un día para cada país, región y tipo de producto. Eche un vistazo al número de series temporales hechas solo para $x1$.

source: For each time series, we'll make a linear combination as before to get a target variable!
es: Para cada serie temporal, haremos una combinación lineal como antes para obtener una variable objetivo.

source: Adding additional dimensions into our additive model
es: Añadiendo dimensiones adicionales a nuestro modelo aditivo

source: If we wanted to build a similar linear model across multiple dimensions, it might seem like it would require a huge amount of code — right? **Short answer: no.**
es: Si quisiéramos construir un modelo lineal similar en múltiples dimensiones, podría parecer que requeriría una gran cantidad de código — ¿verdad? **Respuesta corta: no.**

source: With PyMC-Marketing, it only takes **one extra line**. By simply adding the `dims` parameter, you can include as many dimensions as your dataset contains, and the class will automatically handle all the structure and bookkeeping for you.
es: Con PyMC-Marketing, solo se necesita **una línea adicional**. Al agregar simplemente el parámetro `dims`, puede incluir tantas dimensiones como contenga su conjunto de datos, y la clase se encargará automáticamente de toda la estructura y la contabilidad por usted.

source: Now we have a **multidimensional model** that still represents the same linear function as before, but with additional indices across dimensions.
es: Ahora tenemos un **modelo multidimensional** que aún representa la misma función lineal que antes, pero con índices adicionales a través de las dimensiones.

source: Creating hierarchical multidimensional model
es: Creando un modelo multidimensional jerárquico

source: Another great feature of PyMC-Marketing is its ability to **handle broadcasting automatically**. This means you don’t need to keep the same parameter shape for every random variable — you can adjust the parameter sizes as needed, and the `MMM` class will take care of the broadcasting for you.
es: Otra gran característica de PyMC-Marketing es su capacidad para **manejar la difusión automáticamente**. Esto significa que no necesitas mantener la misma forma de parámetro para cada variable aleatoria; puedes ajustar los tamaños de los parámetros según sea necesario, y la clase `MMM` se encargará de la difusión por ti.

source: Here’s a quick example:
es: Aquí hay un ejemplo rápido:

source: As you can see, it was incredibly easy to build a hierarchical model with higher dimensionality. However, there’s a small trade-off — as the model grows in size (both in parameters and data), sampling can start to take longer.
es: Como puede ver, fue increíblemente fácil construir un modelo jerárquico con mayor dimensionalidad. Sin embargo, hay un pequeño compromiso: a medida que el modelo crece en tamaño (tanto en parámetros como en datos), el muestreo puede comenzar a tardar más.

source: We’ll explore several techniques to handle this more efficiently later on. For now, let’s quickly draw samples from the **prior predictive distribution** only!
es: Exploraremos varias técnicas para manejar esto de manera más eficiente más adelante. Por ahora, ¡tomemos rápidamente muestras solo de la **distribución predictiva previa**!

source: Adding Trend and Seasonality Components
es: Añadiendo componentes de tendencia y estacionalidad

source: To make our model more realistic, we can extend the linear structure by adding **trend** and **seasonality** components.
es: Para hacer que nuestro modelo sea más realista, podemos extender la estructura lineal añadiendo componentes de **tendencia** y **estacionalidad**.

source: PyMC-Marketing provides convenient classes for this: [`LinearTrend`](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.linear_trend.LinearTrend.html) and [`WeeklyFourier`](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.fourier.html).
es: PyMC-Marketing proporciona clases convenientes para esto: [`LinearTrend`](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.linear_trend.LinearTrend.html) y [`WeeklyFourier`](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.fourier.html).

source: The `LinearTrend` component introduces a piecewise linear trend with a configurable number of changepoints. It allows the model to adapt to shifts in long-term behavior, such as gradual growth or decay over time. Mathematically, the trend can be expressed as:
es: El componente `LinearTrend` introduce una tendencia lineal por tramos con un número configurable de puntos de cambio. Permite que el modelo se adapte a cambios en el comportamiento a largo plazo, como el crecimiento o la disminución gradual a lo largo del tiempo. Matemáticamente, la tendencia se puede expresar como:

source: where:
es: donde:

source: $k$ represents the base slope,
es: $k$ representa la pendiente base,

source: $\delta_j$ are changepoint adjustments, and
es: $\delta_j$ son ajustes de punto de cambio, y

source: $s_j(t)$ are indicator functions that activate after each changepoint.
es: $s_j(t)$ son funciones indicadoras que se activan después de cada punto de cambio.

source: The `WeeklyFourier` component captures **seasonal patterns** using a Fourier series representation. This is particularly useful for weekly or periodic effects in marketing data, such as cyclical user activity. The seasonal term can be written as:
es: El componente `WeeklyFourier` captura **patrones estacionales** utilizando una representación de serie de Fourier. Esto es particularmente útil para efectos semanales o periódicos en datos de marketing, como la actividad cíclica de los usuarios. El término estacional se puede escribir como:

source: where $P$ is the period (e.g., 7 days for weekly cycles) and $N$ is the number of Fourier terms.
es: donde $P$ es el período (por ejemplo, 7 días para ciclos semanales) y $N$ es el número de términos de Fourier.

source: Again, add these complex terms is not difficult at all. Check the following example:
es: De nuevo, agregar estos términos complejos no es difícil en absoluto. Verifique el siguiente ejemplo:

source: Our model is becoming more sophisticated, yet it still represents a linear regression enriched with structural time-series components. But what if we want to capture more realistic marketing dynamics—such as **saturation** or **adstock effects**?
es: Nuestro modelo se está volviendo más sofisticado, sin embargo, aún representa una regresión lineal enriquecida con componentes estructurales de series temporales. Pero, ¿qué pasa si queremos capturar dinámicas de marketing más realistas, como **saturación** o **efectos de adstock**?

source: That’s where we reach the true essence of **Marketing Mix Modeling (MMM)**. These components allow us to model how marketing impact evolves over time and how returns diminish as spend increases. How difficult is to replace our linear functions?
es: Ahí es donde alcanzamos la verdadera esencia del **Modelado de Mezcla de Marketing (MMM)**. Estos componentes nos permiten modelar cómo evoluciona el impacto del marketing a lo largo del tiempo y cómo los retornos disminuyen a medida que aumenta el gasto. ¿Qué tan difícil es reemplazar nuestras funciones lineales?

source: As you can see, the model has been growing in complexity while still relying entirely on PyMC-Marketing’s built-in components.
es: Como puede ver, el modelo ha ido creciendo en complejidad mientras sigue dependiendo completamente de los componentes integrados de PyMC-Marketing.

source: What’s remarkable is that the amount of code remains almost identical to our very first linear model — meaning that building a nonlinear model with several structural time-series components takes virtually the same effort as a simple regression. How cool is that?
es: Lo notable es que la cantidad de código permanece casi idéntica a nuestro primer modelo lineal, lo que significa que construir un modelo no lineal con varios componentes estructurales de series temporales requiere prácticamente el mismo esfuerzo que una regresión simple. ¿Qué tan genial es eso?

source: But what if we need a transformation that isn’t yet included in the PyMC-Marketing library? No problem — you can always define your own **custom functions** and specify exactly how each channel should be transformed.
es: Pero, ¿qué pasa si necesitamos una transformación que aún no está incluida en la biblioteca PyMC-Marketing? No hay problema: siempre puedes definir tus propias **funciones personalizadas** y especificar exactamente cómo debe transformarse cada canal.

source: For example, suppose you want your channels to contribute **exponentially** to the target. Can we do that? Absolutely!
es: Por ejemplo, suponga que desea que sus canales contribuyan **exponencialmente** al objetivo. ¿Podemos hacerlo? ¡Absolutamente!

source: Custom functions in PyMC-Marketing
es: Funciones personalizadas en PyMC-Marketing

source: If you follow the [`SaturationTransformation`](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.components.saturation.SaturationTransformation.html) protocol, you can easily implement any custom function and safely integrate it into your model.
es: Si sigue el protocolo [`SaturationTransformation`](https://www.pymc-marketing.io/en/stable/api/generated/pymc_marketing.mmm.components.saturation.SaturationTransformation.html), puede implementar fácilmente cualquier función personalizada e integrarla de manera segura en su modelo.

source: Since you’ll be working directly with PyMC’s internals, it may require a few extra lines of code — but PyMC-Marketing provides well-designed **base classes** that make this process much simpler and less error-prone.
es: Dado que estará trabajando directamente con los internos de PyMC, puede requerir algunas líneas de código adicionales, pero PyMC-Marketing proporciona **clases base** bien diseñadas que hacen que este proceso sea mucho más simple y menos propenso a errores.

source: This approach gives you full flexibility to design and test your own functional forms, while still benefiting from all the higher-level utilities of the library.
es: Este enfoque le brinda total flexibilidad para diseñar y probar sus propias formas funcionales, mientras sigue beneficiándose de todas las utilidades de nivel superior de la biblioteca.

source: Once again, we’ve expanded our model with only a minimal amount of additional code for the new transformation. The core API remains exactly the same — no extra setup, no additional boilerplate, and no juggling between components.
es: Una vez más, hemos ampliado nuestro modelo con solo una cantidad mínima de código adicional para la nueva transformación. La API principal permanece exactamente igual: sin configuración adicional, sin código adicional y sin tener que alternar entre componentes.

source: And we’re still not done. We can keep enhancing our model by adding **extra linear components** for control variables. As usual, this only requires **a single line of code** — just one more parameter, and the rest of the workflow stays unchanged.
es: Y aún no hemos terminado. Podemos seguir mejorando nuestro modelo añadiendo **componentes lineales adicionales** para las variables de control. Como de costumbre, esto solo requiere **una sola línea de código** — solo un parámetro más, y el resto del flujo de trabajo permanece sin cambios.

source: Adding linear covariates
es: Añadiendo covariables lineales

source: These additional variables are often referred to as **controls** — external covariates that help explain variations in the target which are not directly driven by our marketing channels. Examples might include macroeconomic indicators, competitor activity, or other contextual features such as weather or seasonality indexes.
es: Estas variables adicionales a menudo se denominan **controles** — covariables externas que ayudan a explicar las variaciones en el objetivo que no son impulsadas directamente por nuestros canales de marketing. Ejemplos pueden incluir indicadores macroeconómicos, actividad de competidores u otras características contextuales como el clima o índices de estacionalidad.
