Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_reasoning_and_discovery.po
Languages: es

source: What is particularly powerful about this approach is its simplicity: rather than building and fitting multiple regression models — one per effect or per adjustment set — we recover all estimands **simultaneously** within a single coherent probabilistic model. Each parameter reflects its causal interpretation directly from the DAG, and uncertainty is propagated through the full system rather than estimated piecemeal.
es: { "singular": "Lo que es particularmente poderoso acerca de este enfoque es su simplicidad: en lugar de construir y ajustar múltiples modelos de regresión — uno por efecto o por conjunto de ajustes — recuperamos todos los estimandos **simultáneamente** dentro de un único modelo probabilístico coherente. Cada parámetro refleja su interpretación causal directamente del DAG, y la incertidumbre se propaga a través de todo el sistema en lugar de estimarse de manera fragmentada.", "plural": "Lo que es particularmente poderoso acerca de estos enfoques es su simplicidad: en lugar de construir y ajustar múltiples modelos de regresión — uno por efecto o por conjunto de ajustes — recuperamos todos los estimandos **simultáneamente** dentro de un único modelo probabilístico coherente. Cada parámetro refleja su interpretación causal directamente del DAG, y la incertidumbre se propaga a través de todo el sistema en lugar de estimarse de manera fragmentada." }

source: In this example, the graph served as the blueprint, the Bayesian model performed the joint estimation, and the result is a unified, transparent view of how each driver contributes to the outcome. This not only saves modeling effort but also ensures internal consistency — all effects are inferred together under the same causal and probabilistic assumptions.
es: { "singular": "En este ejemplo, el gráfico sirvió como el plano, el modelo bayesiano realizó la estimación conjunta, y el resultado es una vista unificada y transparente de cómo cada factor contribuye al resultado. Esto no solo ahorra esfuerzo de modelado, sino que también asegura la consistencia interna: todos los efectos se infieren juntos bajo las mismas suposiciones causales y probabilísticas.", "plural": "" }

source: **Causal discovery caveats**
es: { "singular": "**Advertencias sobre el descubrimiento causal**", "plural": "**Advertencias sobre el descubrimiento causal**" }

source: All causal discovery methods rely on strong assumptions:
es: { "singular": "Todos los métodos de descubrimiento causal se basan en suposiciones fuertes:", "plural": "Todos los métodos de descubrimiento causal se basan en suposiciones fuertes:" }

source: (i) The data-generating process is Markov and faithful to a DAG so d-separations line up with conditional independences. (ii) The measured variables capture every relevant cause (no hidden confounders) (iii) Samples are i.i.d. or at least independent enough that independence tests behave properly. (iv) The finite-sample tests are powerful enough to separate signal from noise.
es: { "singular": "(i) El proceso generador de datos es Markov y fiel a un DAG, por lo que las d-separaciones se alinean con las independencias condicionales. (ii) Las variables medidas capturan cada causa relevante (sin confusores ocultos). (iii) Las muestras son i.i.d. o al menos lo suficientemente independientes como para que las pruebas de independencia se comporten correctamente. (iv) Las pruebas de muestra finita son lo suficientemente potentes como para separar la señal del ruido.", "plural": "(i) Los procesos generadores de datos son Markov y fieles a un DAG, por lo que las d-separaciones se alinean con las independencias condicionales. (ii) Las variables medidas capturan cada causa relevante (sin confusores ocultos). (iii) Las muestras son i.i.d. o al menos lo suficientemente independientes como para que las pruebas de independencia se comporten correctamente. (iv) Las pruebas de muestra finita son lo suficientemente potentes como para separar la señal del ruido." }

source: The classical PC algorithm assumes causal sufficiency (no latent common causes) and acyclicity; it removes edges via conditional-independence tests and orients the remainder with Meek’s rules, so any violation of faithfulness or weak tests can leave extra or missing edges. FCI relaxes causal sufficiency by allowing latent variables and selection bias, but in return it produces a richer set of partially oriented edges (bidirected, circle endpoints) that still require strong assumptions to interpret. Because real marketing datasets often include feedback loops, non-stationarity, measurement error, and latent drivers, we treat these algorithms as hypothesis generators rather than truth oracles and bake in domain constraints wherever possible.
es: { "singular": "El algoritmo clásico de PC asume suficiencia causal (sin causas comunes latentes) y aciclicidad; elimina aristas a través de pruebas de independencia condicional y orienta el resto con las reglas de Meek, por lo que cualquier violación de la fidelidad o pruebas débiles puede dejar aristas adicionales o faltantes. FCI relaja la suficiencia causal al permitir variables latentes y sesgo de selección, pero a cambio produce un conjunto más rico de aristas parcialmente orientadas (bidireccionales, extremos circulares) que aún requieren suposiciones fuertes para interpretar. Dado que los conjuntos de datos de marketing reales a menudo incluyen bucles de retroalimentación, no estacionariedad, error de medición y factores latentes, tratamos estos algoritmos como generadores de hipótesis en lugar de oráculos de verdad y incorporamos restricciones del dominio siempre que sea posible.", "plural": "Los algoritmos clásicos de PC asumen suficiencia causal (sin causas comunes latentes) y aciclicidad; eliminan aristas a través de pruebas de independencia condicional y orientan el resto con las reglas de Meek, por lo que cualquier violación de la fidelidad o pruebas débiles puede dejar aristas adicionales o faltantes. FCI relaja la suficiencia causal al permitir variables latentes y sesgo de selección, pero a cambio produce un conjunto más rico de aristas parcialmente orientadas (bidireccionales, extremos circulares) que aún requieren suposiciones fuertes para interpretar. Dado que los conjuntos de datos de marketing reales a menudo incluyen bucles de retroalimentación, no estacionariedad, error de medición y factores latentes, tratamos estos algoritmos como generadores de hipótesis en lugar de oráculos de verdad y incorporamos restricciones del dominio siempre que sea posible." }

source: MMM modeling workflow
es: { "singular": "Flujo de trabajo de modelado MMM", "plural": "Flujos de trabajo de modelado MMM" }

source: If you are thinking how this goes into the workflow to develop a model, you can visualize this as start with causal discovery, identify a credible DAG in a MEC consistent with your data, then quantify by two optional ways.
es: { "singular": "Si está pensando en cómo esto se integra en el flujo de trabajo para desarrollar un modelo, puede visualizarlo como comenzar con el descubrimiento causal, identificar un DAG creíble en un MEC consistente con sus datos, y luego cuantificar de dos maneras opcionales.", "plural": "Si están pensando en cómo esto se integra en el flujo de trabajo para desarrollar un modelo, pueden visualizarlo como comenzar con el descubrimiento causal, identificar un DAG creíble en un MEC consistente con sus datos, y luego cuantificar de dos maneras opcionales." }

source: Causal identification route: Once the CPDAG gives you a candidate driver set for the chosen target, drop that structure into the `pymc_marketing.mmm.causal` model. It conditions on exactly the back-door adjustment set implied by the DAG, so you estimate each driver’s causal effect with targeted regressions or MMM variants. Great for stress-testing multiple DAGs and comparing estimands side by side.
es: { "singular": "Ruta de identificación causal: Una vez que el CPDAG te proporciona un conjunto de conductores candidatos para el objetivo elegido, inserta esa estructura en el modelo `pymc_marketing.mmm.causal`. Condiciona exactamente sobre el conjunto de ajuste de puerta trasera implicado por el DAG, por lo que estimas el efecto causal de cada conductor con regresiones específicas o variantes de MMM. Ideal para realizar pruebas de estrés en múltiples DAGs y comparar estimandos uno al lado del otro.", "plural": "Rutas de identificación causal: Una vez que los CPDAG te proporcionan conjuntos de conductores candidatos para los objetivos elegidos, inserta esas estructuras en los modelos `pymc_marketing.mmm.causal`. Condicionan exactamente sobre los conjuntos de ajuste de puerta trasera implicados por los DAG, por lo que estimas los efectos causales de cada conductor con regresiones específicas o variantes de MMM. Ideales para realizar pruebas de estrés en múltiples DAGs y comparar estimandos uno al lado del otro." }

source: Full DAG-to-model route: Feed a fully oriented DAG into `BuildModelFromDAG` to spin up a single PyMC model that respects the entire causal graph. Each edge gets a slope, the target retains its likelihood, and you sample the joint posterior to read off linear causal effects directly. This is ideal when you want one coherent Bayesian model rather than separate conditionals.
es: { "singular": "Ruta completa de DAG a modelo: Alimente un DAG completamente orientado en `BuildModelFromDAG` para generar un único modelo PyMC que respete todo el gráfico causal. Cada arista obtiene una pendiente, el objetivo retiene su verosimilitud y usted muestrea la posterior conjunta para leer directamente los efectos causales lineales. Esto es ideal cuando desea un modelo bayesiano coherente en lugar de condicionales separados.", "plural": "Rutas completas de DAG a modelo: Alimente DAGs completamente orientados en `BuildModelFromDAG` para generar modelos PyMC que respeten todo el gráfico causal. Cada arista obtiene una pendiente, los objetivos retienen su verosimilitud y usted muestrea las posteriores conjuntas para leer directamente los efectos causales lineales. Esto es ideal cuando desea modelos bayesianos coherentes en lugar de condicionales separados." }

source: Soon we’ll extend `BuildModelFromDAG` so you can plug in nonlinear response transforms (e.g., saturation, adstock) along individual edges. That will let you stay in the DAG-driven workflow while capturing diminishing returns or channel-specific dynamics right inside the generated PyMC model.
es: { "singular": "Pronto extenderemos `BuildModelFromDAG` para que puedas conectar transformaciones de respuesta no lineales (por ejemplo, saturación, adstock) a lo largo de los bordes individuales. Eso te permitirá mantenerte en el flujo de trabajo impulsado por el DAG mientras capturas rendimientos decrecientes o dinámicas específicas de canal directamente dentro del modelo PyMC generado.", "plural": "Pronto extenderemos `BuildModelFromDAG` para que puedas conectar transformaciones de respuesta no lineales (por ejemplo, saturación, adstock) a lo largo de los bordes individuales. Eso te permitirá mantenerte en el flujo de trabajo impulsado por el DAG mientras capturas rendimientos decrecientes o dinámicas específicas de canal directamente dentro del modelo PyMC generado." }

source: Conclusion
es: { "singular": "Conclusión", "plural": "Conclusiones" }

source: Through this complete workflow — from causal discovery to Bayesian estimation — we demonstrated how structural reasoning and probabilistic modeling can be unified into a single, coherent framework.
es: { "singular": "A través de este flujo de trabajo completo — desde el descubrimiento causal hasta la estimación bayesiana — demostramos cómo el razonamiento estructural y el modelado probabilístico pueden unificarse en un único marco coherente.", "plural": "A través de estos flujos de trabajo completos — desde los descubrimientos causales hasta las estimaciones bayesianas — demostramos cómo los razonamientos estructurales y los modelados probabilísticos pueden unificarse en un único marco coherente." }

source: Starting from raw data, or autocorrelated time-series data, we first learned that discovering a purely DAG is unreliable for different reasons. By introducing domain knowledge and/or explicit time-order constraints, we corrected and avoided spurious connections, allowing the graph structure to reflect true causal direction.
es: { "singular": "A partir de datos en bruto, o datos de series temporales autocorrelacionados, primero aprendimos que descubrir un DAG puro es poco fiable por diferentes razones. Al introducir conocimiento del dominio y/o restricciones explícitas de orden temporal, corregimos y evitamos conexiones espurias, permitiendo que la estructura del gráfico refleje la verdadera dirección causal.", "plural": "A partir de datos en bruto, o datos de series temporales autocorrelacionados, primero aprendimos que descubrir un DAG puro es poco fiable por diferentes razones. Al introducir conocimiento del dominio y/o restricciones explícitas de orden temporal, corregimos y evitamos conexiones espurias, permitiendo que la estructura del gráfico refleje la verdadera dirección causal." }

source: Once a stable DAG emerged, we transitioned from structure to substance: using `BuildModelFromDAG`, we converted the discovered causal relationships into a fully specified Bayesian model. This let us estimate all causal effects jointly — obtaining posterior distributions for every edge without needing to build a patchwork of separate regressions. The resulting estimands closely matched the true underlying coefficients, validating both the causal design and the Bayesian inference process.
es: { "singular": "Una vez que emergió un DAG estable, hicimos la transición de la estructura a la sustancia: utilizando `BuildModelFromDAG`, convertimos las relaciones causales descubiertas en un modelo bayesiano completamente especificado. Esto nos permitió estimar todos los efectos causales de manera conjunta, obteniendo distribuciones posteriores para cada arista sin necesidad de construir un mosaico de regresiones separadas. Los estimandos resultantes coincidieron estrechamente con los verdaderos coeficientes subyacentes, validando tanto el diseño causal como el proceso de inferencia bayesiana.", "plural": "Una vez que emergieron DAGs estables, hicimos la transición de la estructura a la sustancia: utilizando `BuildModelFromDAG`, convertimos las relaciones causales descubiertas en modelos bayesianos completamente especificados. Esto nos permitió estimar todos los efectos causales de manera conjunta, obteniendo distribuciones posteriores para cada arista sin necesidad de construir mosaicos de regresiones separadas. Los estimandos resultantes coincidieron estrechamente con los verdaderos coeficientes subyacentes, validando tanto los diseños causales como los procesos de inferencia bayesiana." }

source: Ultimately, this workflow illustrates the strength of an integrated causal–Bayesian approach:
es: { "singular": "En última instancia, este flujo de trabajo ilustra la fortaleza de un enfoque causal-bayesiano integrado:", "plural": "En última instancia, estos flujos de trabajo ilustran la fortaleza de un enfoque causal-bayesiano integrado:" }

source: **Causal discovery** provides the structure (who influences whom).
es: { "singular": { "msgid": "**Causal discovery** proporciona la estructura (quién influye en quién).", "msgstr": "**Causal discovery** proporciona la estructura (quién influye en quién)." }, "plural": { "msgid": "**Causal discovery** proporciona la estructura (quién influye en quién).", "msgstr": "**Causal discovery** proporciona la estructura (quién influye en quién)." } }

source: **Bayesian estimation** provides the magnitude (how strongly, and with what uncertainty).
es: { "singular": "**La estimación bayesiana** proporciona la magnitud (qué tan fuerte y con qué incertidumbre).", "plural": "**Las estimaciones bayesianas** proporcionan las magnitudes (qué tan fuertes y con qué incertidumbre)." }

source: Together they form a complete loop — from learning the graph, to quantifying its effects, to validating against reality.
es: { "singular": "Juntos forman un ciclo completo — desde aprender el gráfico, hasta cuantificar sus efectos, hasta validar contra la realidad.", "plural": "Juntos forman ciclos completos — desde aprender los gráficos, hasta cuantificar sus efectos, hasta validar contra la realidad." }

source: While no method is immune to confounding or model misspecification, this pipeline offers a principled and efficient way to reason about complex systems, such as marketing data, where many drivers interact between themself and over time. It replaces fragmented analyses with a unified, interpretable, and uncertainty-aware causal model — brings meaning to our model and the ecosystem they represent.
es: { "singular": "Si bien ningún método es inmune a la confusión o a la especificación incorrecta del modelo, este pipeline ofrece una forma fundamentada y eficiente de razonar sobre sistemas complejos, como los datos de marketing, donde muchos factores interactúan entre sí y a lo largo del tiempo. Reemplaza análisis fragmentados por un modelo causal unificado, interpretable y consciente de la incertidumbre — aporta significado a nuestro modelo y al ecosistema que representan.", "plural": "Si bien ningún método es inmune a la confusión o a la especificación incorrecta del modelo, estos pipelines ofrecen formas fundamentadas y eficientes de razonar sobre sistemas complejos, como los datos de marketing, donde muchos factores interactúan entre sí y a lo largo del tiempo. Reemplazan análisis fragmentados por modelos causales unificados, interpretables y conscientes de la incertidumbre — aportan significado a nuestros modelos y a los ecosistemas que representan." }

source: We invite you to extend these tools—incorporate richer priors, hierarchical extensions, or dynamic components—to unlock even deeper causal insights and make more confident, data-driven decisions!
es: { "singular": "Le invitamos a ampliar estas herramientas: incorporar priors más ricos, extensiones jerárquicas o componentes dinámicos, para desbloquear conocimientos causales aún más profundos y tomar decisiones más seguras y basadas en datos.", "plural": "Les invitamos a ampliar estas herramientas: incorporar priors más ricos, extensiones jerárquicas o componentes dinámicos, para desbloquear conocimientos causales aún más profundos y tomar decisiones más seguras y basadas en datos." }

source: References
es: { "singular": "Referencia", "plural": "Referencias" }

source: [PC Algorithm for Tabular Causal Discovery](https://opensource.salesforce.com/causalai/latest/tutorials/PC_Algorithm_Tabular.html)
es: { "singular": "[Algoritmo PC para el Descubrimiento Causal Tabular](https://opensource.salesforce.com/causalai/latest/tutorials/PC_Algorithm_Tabular.html)", "plural": "[Algoritmo PC para el Descubrimiento Causal Tabular](https://opensource.salesforce.com/causalai/latest/tutorials/PC_Algorithm_Tabular.html)" }

source: [A fast PC algorithm for high dimensional causal discovery with multi-core PCs](https://arxiv.org/pdf/1502.02454)
es: { "singular": "[Un algoritmo rápido de PC para el descubrimiento causal de alta dimensión con PCs de múltiples núcleos]", "plural": "[Un algoritmo rápido de PC para el descubrimiento causal de alta dimensión con PCs de múltiples núcleos]" }

source: [dcFCI: Robust Causal Discovery Under Latent Confounding, Unfaithfulness, and Mixed Data](https://arxiv.org/abs/2505.06542?utm_source=chatgpt.com)
es: { "singular": "[dcFCI: Descubrimiento Causal Robusto Bajo Confusión Latente, Falsedad y Datos Mixtos](https://arxiv.org/abs/2505.06542?utm_source=chatgpt.com)", "plural": "[dcFCI: Descubrimiento Causal Robusto Bajo Confusión Latente, Falsedad y Datos Mixtos](https://arxiv.org/abs/2505.06542?utm_source=chatgpt.com)" }

source: [FCI Algorithm Introduction](https://causal-learn.readthedocs.io/en/latest/search_methods_index/Constraint-based%20causal%20discovery%20methods/FCI.html?utm_source=chatgpt.com)
es: { "singular": "[Introducción al Algoritmo FCI](https://causal-learn.readthedocs.io/en/latest/search_methods_index/Constraint-based%20causal%20discovery%20methods/FCI.html?utm_source=chatgpt.com)", "plural": "[Introducción al Algoritmo FCI](https://causal-learn.readthedocs.io/en/latest/search_methods_index/Constraint-based%20causal%20discovery%20methods/FCI.html?utm_source=chatgpt.com)" }
