Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_example.po
Languages: es

source: MMM Example Notebook
es: Cuaderno de ejemplo para MMM

source: In this notebook we work out a simulated example to showcase the media mix Model (MMM) API from `pymc-marketing`. This package provides a `pymc` implementation of the MMM presented in the paper [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017)](https://research.google/pubs/pub46001/). We work with synthetic data as we want to do *parameter recovery* to better understand the model assumptions. That is, we explicitly set values for our adstock and saturation parameters (see model specification below) and recover them back from the model. The data generation process is as an adaptation of the blog post ["Media Effect Estimation with PyMC: Adstock, Saturation & Diminishing Returns"](https://juanitorduz.github.io/pymc_mmm/) by [Juan Orduz](https://juanitorduz.github.io/).
es: En este cuaderno desarrollamos un ejemplo simulado para mostrar la API del Modelo de Mezcla de Medios (MMM) de `pymc-marketing`. Este paquete proporciona una implementación en `pymc` del MMM presentado en el artículo [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017)](https://research.google/pubs/pub46001/). Trabajamos con datos sintéticos porque queremos realizar una *recuperación de parámetros* para comprender mejor los supuestos del modelo. Es decir, fijamos explícitamente valores para nuestros parámetros de adstock y saturación (véase la especificación del modelo más abajo) y los recuperamos desde el modelo. El proceso de generación de datos es una adaptación de la entrada del blog ["Media Effect Estimation with PyMC: Adstock, Saturation & Diminishing Returns"](https://juanitorduz.github.io/pymc_mmm/) de [Juan Orduz](https://juanitorduz.github.io/).

source: Business Problem
es: Problema de negocio

source: Before jumping into the data, let's first define the business problem we are trying to solve. We are a marketing agency and we want to optimize the marketing budget of a client. We have access to the following data:
es: Antes de adentrarnos en los datos, definamos primero el problema de negocio que estamos intentando resolver. Somos una agencia de marketing y queremos optimizar el presupuesto de marketing de un cliente. Tenemos acceso a los siguientes datos:

source: Sales data: weekly sales of the client.
es: Datos de ventas: ventas semanales del cliente.

source: Media spend data: weekly spend on different media channels (e.g. TV, radio, online, etc.). In this example we consider 2 media channels: $x_{1}$ and $x_{2}$.
es: Datos de inversión en medios: gasto semanal en diferentes canales de medios (p. ej., TV, radio, online, etc.). En este ejemplo consideramos 2 canales de medios: $x_{1}$ y $x_{2}$.

source: Domain knowledge:
es: Conocimiento del dominio:

source: We know that there has a been an positive sales trend which we believe comes from a strong economic growth.
es: Sabemos que ha habido una tendencia positiva en las ventas que creemos proviene de un fuerte crecimiento económico.

source: We also know that there is a yearly seasonality effect.
es: También sabemos que existe un efecto de estacionalidad anual.

source: In addition, we were informed about two outliers in the data during the weeks `2019-05-13` and `2021-09-14`.
es: Además, se nos informó de dos valores atípicos en los datos durante las semanas `2019-05-13` y `2021-09-14`.

source: Given this information we can draw a Directed Acyclic Graph (DAG) or graphical model of how we believe our variables are related. In other words, represent how we believe our system is causally related.
es: Con esta información podemos dibujar un Gráfico Acíclico Dirigido (DAG) o modelo gráfico de cómo creemos que nuestras variables están relacionadas. En otras palabras, representar cómo creemos que nuestro sistema está causalmente relacionado.

source: In this example, we will consider a simple system where:
es: En este ejemplo, consideraremos un sistema sencillo donde:

source: **Marketing**: It represents the actions generated by $x_{1}$ and $x_{2}$.
es: **Marketing**: Representa las acciones generadas por $x_{1}$ y $x_{2}$.

source: **Special Events**: Outliers on specific days, which are possibly given by special dates.
es: **Eventos especiales**: Valores atípicos en días específicos, posiblemente debidos a fechas especiales.

source: **Exogenous Variables**: We will consider variables that are determined by external factors, not determined in the model (E.g: Country economic growth or weather conditions that determine seasonal behavior).
es: **Variables exógenas**: Consideraremos variables determinadas por factores externos, no determinadas en el modelo (p. ej.: crecimiento económico del país o condiciones meteorológicas que determinan un comportamiento estacional).

source: Understanding this ecosystem is essential to create a model that reveals the true causal signals and allows us to optimize our advertising budget. But, What do we mean by optimize the marketing budget? We want to find the optimal media mix that maximizes sales.
es: Comprender este ecosistema es esencial para crear un modelo que revele las señales causales reales y nos permita optimizar nuestro presupuesto publicitario. Pero, ¿qué entendemos por optimizar el presupuesto de marketing? Queremos encontrar la mezcla de medios óptima que maximice las ventas.

source: Now, given the DAG outlined above, we understand that there is a causal relationship between marketing and sales, but *what is the nature of that relationship*? In this case, we will assume that this relationship is not linear, for example, a $10\%$ increase in channel $x_{1}$ spend does not necessarily translate into a $10\%$ increase in sales. This can be explained by two phenomena:
es: Ahora, dado el DAG descrito arriba, entendemos que existe una relación causal entre marketing y ventas, pero ¿*cuál es la naturaleza de esa relación*? En este caso, asumiremos que esta relación no es lineal; por ejemplo, un aumento del $10\%$ en el gasto del canal $x_{1}$ no se traduce necesariamente en un aumento del $10\%$ en las ventas. Esto puede explicarse por dos fenómenos:

source: On the one hand side, there is a carry-over effect. Meaning, the effect of spend on sales is not instantaneous but accumulates over time.
es: Por un lado, existe un efecto de arrastre. Es decir, el efecto del gasto en las ventas no es instantáneo, sino que se acumula con el tiempo.

source: In addition, there is a saturation effect. Meaning, the effect of spend on sales is not linear but saturates at some point.
es: Además, existe un efecto de saturación. Es decir, el efecto del gasto sobre las ventas no es lineal, sino que se satura en algún punto.

source: The equation implemented to describe the DAG presented above will be the one expressed in [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017)](https://research.google/pubs/pub46001/), adding a causal assumption around the media effects and their exclusively positive impact. Concretely, given a time series target variable $y_{t}$ (e.g. sales or conversions), media variables $x_{m, t}$ (e.g. impressions, clicks or costs) and a set of control covariates $z_{c, t}$ (e.g. holidays, special events) we consider a linear model of the form
es: La ecuación implementada para describir el DAG presentado arriba será la expresada en [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017)](https://research.google/pubs/pub46001/), añadiendo un supuesto causal sobre los efectos de los medios y su impacto exclusivamente positivo. Concretamente, dada una variable objetivo de serie temporal $y_{t}$ (p. ej., ventas o conversiones), variables de medios $x_{m, t}$ (p. ej., impresiones, clics o costes) y un conjunto de covariables de control $z_{c, t}$ (p. ej., festivos, eventos especiales), consideramos un modelo lineal de la forma

source: where $\alpha$ is the intercept, $f$ is a media transformation function and $\varepsilon_{t}$ is the error term which we assume is normally distributed. The function $f$ encodes the positive media contribution on the target variable. Typically we consider two types of transformation: adstock (carry-over) and saturation effects.
es: donde $\alpha$ es el intercepto, $f$ es una función de transformación de medios y $\varepsilon_{t}$ es el término de error que asumimos normalmente distribuido. La función $f$ codifica la contribución positiva de los medios sobre la variable objetivo. Normalmente consideramos dos tipos de transformaciones: adstock (arrastre) y efectos de saturación.

source: In **PyMC-Marketing**, we offer an API for a Bayesian Media Mix Model (MMM) with various specifications. In the example, we’ll implement `Geometric Adstock` and `Logistic Saturation` as the chosen transformations for our previously discussed Structural Causal Equation.
es: En **PyMC-Marketing**, ofrecemos una API para un Modelo Bayesiano de Mezcla de Medios (MMM) con varias especificaciones. En el ejemplo, implementaremos `Adstock geométrico` y `Saturación logística` como las transformaciones elegidas para nuestra Ecuación Causal Estructural previamente discutida.

source: The MMM model in `pymc-marketing` provides additional features on top of this base model:
es: El modelo MMM en `pymc-marketing` proporciona funciones adicionales sobre este modelo base:

source: **Experiment Calibration**: We have the option to add empirical experiments (lift tests) to calibrate the model using custom likelihood functions. See {ref}`mmm_lift_test`.
es: **Calibración con experimentos**: Tenemos la opción de añadir experimentos empíricos (pruebas de lift) para calibrar el modelo usando funciones de verosimilitud personalizadas. Consulta {ref}`mmm_lift_test`.

source: **Time-varying Intercept:** Capture time-varying baseline contributions in your model (using modern and efficient Gaussian processes approximation methods). That is, we allow the intercept term $\alpha = \alpha(t)$ to vary over time. See {ref}`mmm_tvp_example`.
es: **Intercepto variable en el tiempo:** Captura contribuciones base que varían en el tiempo en tu modelo (usando métodos modernos y eficientes de aproximación con procesos gaussianos). Es decir, permitimos que el término de intercepto $\alpha = \alpha(t)$ varíe con el tiempo. Consulta {ref}`mmm_tvp_example`.

source: **Budget Optimization:** Allocate your marketing budget based on the parameters recover by the model, finding the spend distribution to maximizes the amount of contribution given a limited budget. See {ref}`mmm_budget_allocation_example`.
es: **Optimización del presupuesto:** Asigna tu presupuesto de marketing en función de los parámetros recuperados por el modelo, encontrando la distribución de gasto que maximiza la contribución con un presupuesto limitado. Consulta {ref}`mmm_budget_allocation_example`.

source: References:
es: Referencias:

source: [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017).](https://research.google/pubs/pub46001/)
es: [Jin, Yuxue, et al. “Métodos bayesianos para la modelización de mezcla de medios con efectos de arrastre y de forma.” (2017).](https://research.google/pubs/pub46001/)

source: PyMC Labs Blog:
es: Blog de PyMC Labs:

source: [Bayesian Media Mix Modeling for Marketing Optimization](https://www.pymc-labs.com/blog-posts/bayesian-media-mix-modeling-for-marketing-optimization/)
es: [Modelado de Mezcla de Medios Bayesiano para la Optimización del Marketing](https://www.pymc-labs.com/blog-posts/bayesian-media-mix-modeling-for-marketing-optimization/)

source: [Improving the Speed and Accuracy of Bayesian Media Mix Models](https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/)
es: [Mejorando la Velocidad y Precisión de los Modelos de Mezcla de Medios Bayesianos](https://www.pymc-labs.com/blog-posts/reducing-customer-acquisition-costs-how-we-helped-optimizing-hellofreshs-marketing-budget/)

source: [Johns, Michael and Wang, Zhenyu. "A Bayesian Approach to Media Mix Modeling"](https://www.youtube.com/watch?v=UznM_-_760Y)
es: [Johns, Michael y Wang, Zhenyu. "A Bayesian Approach to Media Mix Modeling"](https://www.youtube.com/watch?v=UznM_-_760Y)

source: [Orduz, Juan. "Media Effect Estimation with PyMC: Adstock, Saturation & Diminishing Returns"](https://juanitorduz.github.io/pymc_mmm/)
es: [Orduz, Juan. "Estimación del Efecto de los Medios con PyMC: Adstock, Saturación y Rendimientos Decrecientes"](https://juanitorduz.github.io/pymc_mmm/)

source: Part I: Data Generation Process
es: Parte I: Proceso de generación de datos

source: In Part I of this notebook we focus on the data generating process. That is, we want to construct the target variable $y_{t}$ (sales) by adding each of the components described in the *Business Problem* section.
es: En la Parte I de este cuaderno nos centramos en el proceso de generación de datos. Es decir, queremos construir la variable objetivo $y_{t}$ (ventas) añadiendo cada uno de los componentes descritos en la sección *Problema de negocio*.

source: Prepare Notebook
es: Preparar el cuaderno

source: Generate Data
es: Generar datos

source: 1. Date Range
es: 1. Rango de fechas

source: First we set a time range for our data. We consider a bit more than 2 years of data at weekly granularity.
es: Primero definimos un rango temporal para nuestros datos. Consideramos un poco más de 2 años de datos con granularidad semanal.

source: 2. Media Costs Data
es: 2. Datos de costes de medios

source: Now we generate synthetic data from two channels $x_1$ and $x_2$. We refer to it as the raw signal as it is going to be the input at the modeling phase. We expect the contribution of each channel to be different, based on the carryover and saturation parameters.
es: Ahora generamos datos sintéticos de dos canales $x_1$ y $x_2$. Nos referimos a ello como la señal bruta ya que será la entrada en la fase de modelado. Esperamos que la contribución de cada canal sea diferente, en función de los parámetros de arrastre y saturación.

source: Raw Signal
es: Señal inicial

source: **Remark:** By design, $x_{1}$ should resemble a typical paid social channel and $x_{2}$ a offline (e.g. TV) spend time series.
es: **Nota:** Por diseño, $x_{1}$ debería asemejarse a un canal típico de redes sociales de pago y $x_{2}$ a una serie temporal de gasto offline (p. ej., TV).

source: Effect Signal
es: Señal de efecto

source: Next, we pass the raw signal through the two transformations: first the geometric adstock (carryover effect) and then the logistic saturation. Note that we set the parameters ourselves, but we will recover them back from the model.
es: A continuación, pasamos la señal bruta por las dos transformaciones: primero el adstock geométrico (efecto de arrastre) y luego la saturación logística. Ten en cuenta que fijamos nosotros mismos los parámetros, pero los recuperaremos desde el modelo.

source: Let's start with the adstock transformation. We set the adstock parameter $0 < \alpha < 1$ to be $0.4$ and $0.2$ for $x_1$ and $x_2$ respectively. We set a maximum lag effect of $8$ weeks.
es: Comencemos con la transformación de adstock. Fijamos el parámetro de adstock $0 < \alpha < 1$ en $0.4$ y $0.2$ para $x_1$ y $x_2$ respectivamente. Establecemos un efecto de rezago máximo de $8$ semanas.

source: Next, we compose the resulting adstock signals with the logistic saturation function. We set the parameter $\lambda > 0$ to be $4$ and $3$ for $z_1$ and $z_2$ respectively.
es: A continuación, componemos las señales de adstock resultantes con la función de saturación logística. Fijamos el parámetro $\lambda > 0$ en $4$ y $3$ para $z_1$ y $z_2$ respectivamente.

source: We can now visualize the effect signal for each channel after each transformation:
es: Ahora podemos visualizar la señal de efecto para cada canal después de cada transformación:

source: 3. Trend \& Seasonal Components
es: 3. Componentes de tendencia y estacionalidad

source: Now we add synthetic trend and seasonal components to the effect signal.
es: Ahora añadimos componentes sintéticos de tendencia y estacionalidad a la señal de efecto.

source: 4. Control Variables
es: 4. Variables de control

source: We add two *events* where there was a remarkable peak in our target variable. We assume they are independent and not seasonal (e.g. launch of a particular product).
es: Añadimos dos *eventos* en los que hubo un pico notable en nuestra variable objetivo. Suponemos que son independientes y no estacionales (p. ej., lanzamiento de un producto concreto).

source: 5. Target Variable
es: 5. Variable objetivo

source: Finally, we define the target variable (sales) $y$. We assume it is a linear combination of the effect signal, the trend and the seasonal components, plus the two events and an intercept. We also add some Gaussian noise.
es: Por último, definimos la variable objetivo (ventas) $y$. Suponemos que es una combinación lineal de la señal de efecto, la tendencia y los componentes estacionales, más los dos eventos y un intercepto. También añadimos algo de ruido gaussiano.

source: We can visualize the true component contributions over the historical period:
es: Podemos visualizar las contribuciones reales de los componentes durante el período histórico:

source: We would like to recover these values from the model.
es: Nos gustaría recuperar estos valores a partir del modelo.

source: 6. Media Contribution Interpretation
es: 6. Interpretación de la contribución de medios

source: From the data generating process we can compute the relative contribution of each channel to the target variable. We will recover these values back from the model.
es: A partir del proceso de generación de datos podemos calcular la contribución relativa de cada canal a la variable objetivo. Recuperaremos estos valores desde el modelo.

source: We can obtain the contribution plots for each channel where we clearly see the effect of the adstock and saturation transformations.
es: Podemos obtener las gráficas de contribución para cada canal donde vemos claramente el efecto de las transformaciones de adstock y saturación.

source: This plot shows some interesting aspects of the media contribution:
es: Esta gráfica muestra algunos aspectos interesantes de la contribución de los medios:

source: The adstock effect is reflected in the non-zero contribution of the channel even when the spend is zero.
es: El efecto de adstock se refleja en la contribución distinta de cero del canal incluso cuando el gasto es cero.

source: One clearly see the saturation effect as the contribution growth (slope) decreases as the spend increases.
es: Se observa claramente el efecto de saturación, ya que el crecimiento de la contribución (pendiente) disminuye a medida que aumenta el gasto.

source: As we will see in Part II of this notebook, we will recover these plots from the model!
es: Como veremos en la Parte II de este cuaderno, ¡recuperaremos estas gráficas desde el modelo!

source: We see that channel $x_{1}$ has a higher contribution than $x_{2}$. This could be explained by the fact that there was more spend in channel $x_{1}$ than in channel $x_{2}$:
es: Vemos que el canal $x_{1}$ tiene una contribución mayor que $x_{2}$. Esto podría explicarse por el hecho de que hubo más gasto en el canal $x_{1}$ que en el canal $x_{2}$:

source: However, one usually is not only interested in the contribution itself but rather the Return on Ad Spend (ROAS). That is, the contribution divided by the cost. We can compute the ROAS for each channel as follows:
es: Sin embargo, normalmente no solo interesa la contribución en sí, sino el Retorno sobre la Inversión Publicitaria (ROAS). Es decir, la contribución dividida por el coste. Podemos calcular el ROAS para cada canal de la siguiente manera:

source: That is, channel $x_{1}$ seems to be more efficient than channel $x_{2}$.
es: Es decir, el canal $x_{1}$ parece ser más eficiente que el canal $x_{2}$.

source: We recommended reading Section 4.1 in [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017)](https://research.google/pubs/pub46001/) for a detailed explanation of the ROAS (and mROAS). In particular:
es: Recomendamos leer la Sección 4.1 en [Jin, Yuxue, et al. “Bayesian methods for media mix modeling with carryover and shape effects.” (2017)](https://research.google/pubs/pub46001/) para una explicación detallada del ROAS (y mROAS). En particular:

source: If we transform our target variable $y$ (e.g. with a log transformation), one needs to be careful with the ROAS computation as setting the spend to zero does not commute with the transformation.
es: Si transformamos nuestra variable objetivo $y$ (p. ej., con una transformación logarítmica), hay que tener cuidado con el cálculo del ROAS, ya que fijar el gasto en cero no conmuta con la transformación.

source: One has to be careful with the adstock effect so that we include a carryover period to fully account for the effect of the spend. The ROAS estimation above is an approximation.
es: Hay que tener cuidado con el efecto de adstock para incluir un período de arrastre que contabilice completamente el efecto del gasto. La estimación de ROAS anterior es una aproximación.

source: 7. Data Output
es: 7. Salida de datos

source: We of course will not have all of these features in our real data. Let's filter out the features we will use for modeling:
es: Por supuesto, no tendremos todas estas características en nuestros datos reales. Filtraremos las características que utilizaremos para el modelado:

source: Part II: Modeling
es: Parte II: Modelado

source: On this second part, we focus on the modeling process. We will use the data generated in Part I.
es: En esta segunda parte, nos centramos en el proceso de modelado. Usaremos los datos generados en la Parte I.

source: 1. Feature Engineering
es: 1. Ingeniería de características

source: Assuming we did an EDA and we have a good understanding of the data (we did not do it here as we generated the data ourselves, but please never skip the EDA!), we can start building our model. One thing we immediately see is the seasonality and the trend component. We can generate features ourselves as *control variables*, for example using a uniformly increasing straight line to model the trend component. In addition, we include *dummy variables* to encode the `event_1` and `event_2` contributions.
es: Suponiendo que hicimos un EDA y comprendemos bien los datos (aquí no lo hicimos porque generamos los datos nosotros mismos, ¡pero por favor nunca te saltes el EDA!), podemos empezar a construir nuestro modelo. Una cosa que vemos inmediatamente es la estacionalidad y el componente de tendencia. Podemos generar características nosotros mismos como *variables de control*, por ejemplo usando una línea recta de incremento uniforme para modelar el componente de tendencia. Además, incluimos *variables ficticias* para codificar las contribuciones de `event_1` y `event_2`.

source: For the seasonality component we use Fourier modes (similar as in [Prophet](https://facebook.github.io/prophet/)). We do not need to add the Fourier modes by hand as they are handled by the model API through the `yearly_seasonality` argument (see below). We use 4 modes for the seasonality component.
es: Para el componente de estacionalidad usamos modos de Fourier (similar a [Prophet](https://facebook.github.io/prophet/)). No necesitamos añadir los modos de Fourier a mano ya que la API del modelo los gestiona mediante el argumento `yearly_seasonality` (ver abajo). Usamos 4 modos para el componente estacional.
