Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_reasoning_and_discovery.po
Languages: es

source: In short: with time series, the right graph is rarely “flat and contemporaneous.” Real mechanisms are **lagged** (carryover/adstock), and shared temporal structure (trend/seasonality) acts like **latent confounding**. If we omit lags and temporal controls, the CPDAG will (i) keep extra dashed links among drivers, (ii) miss true edges (low power after partialling correlated series), or (iii) orient target edges inconsistently depending on which conditioning sets soak up more autocorrelation.
es: { "singular": "En resumen: con series temporales, el gráfico correcto rara vez es \"plano y contemporáneo\". Los mecanismos reales están **retrasados** (carryover/adstock), y la estructura temporal compartida (tendencia/estacionalidad) actúa como **confusión latente**. Si omitimos los retrasos y los controles temporales, el CPDAG (i) mantendrá enlaces adicionales discontinuos entre los impulsores, (ii) perderá verdaderos bordes (bajo poder después de parcializar series correlacionadas), o (iii) orientará los bordes objetivo de manera inconsistente dependiendo de qué conjuntos de condicionamiento absorban más autocorrelación.", "plural": "En resumen: con series temporales, los gráficos correctos rara vez son \"planos y contemporáneos\". Los mecanismos reales están **retrasados** (carryover/adstock), y la estructura temporal compartida (tendencia/estacionalidad) actúa como **confusión latente**. Si omitimos los retrasos y los controles temporales, los CPDAG (i) mantendrán enlaces adicionales discontinuos entre los impulsores, (ii) perderán verdaderos bordes (bajo poder después de parcializar series correlacionadas), o (iii) orientarán los bordes objetivo de manera inconsistente dependiendo de qué conjuntos de condicionamiento absorban más autocorrelación." }

source: **How to handle it?**
es: { "singular": "**¿Cómo manejarlo?**", "plural": "**¿Cómo manejarlos?**" }

source: Adding one–period lags (`x1_t1`, `x2_t1`, …) isolates **within–variable temporal persistence**—each series’ own momentum—while forbidding cross-lag edges prevents spurious links between drivers that merely co-move through shared trends or autocorrelation. In the original contemporaneous setup, predictors like `brand_search` and `media_activities` rose and fell together, so conditional-independence tests could not tell whether an observed effect on `purchase` was causal or just inherited from their joint temporal drift.
es: { "singular": "Agregar rezagos de un período (`x1_t1`, `x2_t1`, …) aísla **la persistencia temporal dentro de la variable**—el propio impulso de cada serie—mientras que prohibir los bordes de rezago cruzado evita vínculos espurios entre los impulsores que simplemente se mueven juntos a través de tendencias compartidas o autocorrelación. En la configuración contemporánea original, predictores como `brand_search` y `media_activities` subieron y bajaron juntos, por lo que las pruebas de independencia condicional no podían determinar si un efecto observado en `purchase` era causal o simplemente heredado de su deriva temporal conjunta.", "plural": "Agregar rezagos de un período (`x1_t1`, `x2_t1`, …) aísla **la persistencia temporal dentro de las variables**—el propio impulso de cada serie—mientras que prohibir los bordes de rezago cruzado evita vínculos espurios entre los impulsores que simplemente se mueven juntos a través de tendencias compartidas o autocorrelación. En la configuración contemporánea original, predictores como `brand_search` y `media_activities` subieron y bajaron juntos, por lo que las pruebas de independencia condicional no podían determinar si un efecto observado en `purchase` era causal o simplemente heredado de su deriva temporal conjunta." }

source: Introducing each variable’s lag lets the model partial out that internal memory: the lag explains most of the slow component, leaving the residual (innovation) closer to the *instantaneous* causal signal. By forbidding edges among the lagged features, we ensure that these lags act only as **self-controls**, not as new confounders across channels. This simple configuration effectively de-trends and de-autocorrelates the drivers, stabilizing the Bayes-factor tests and clarifying which contemporaneous edges into `purchase` remain after accounting for each series’ own past. It is therefore a sound minimal strategy for time-series causal discovery—lightweight, interpretable, and providing a first approximation to the dynamic structure before introducing richer lag networks or seasonal terms.
es: { "singular": "La introducción del rezago de cada variable permite que el modelo descomponga esa memoria interna: el rezago explica la mayor parte del componente lento, dejando el residual (innovación) más cerca de la señal causal *instantánea*. Al prohibir los bordes entre las características rezagadas, aseguramos que estos rezagos actúen solo como **autocontroles**, no como nuevos confundidores entre canales. Esta configuración simple descompone y desautocorrela efectivamente los impulsores, estabilizando las pruebas del factor de Bayes y aclarando qué bordes contemporáneos hacia `purchase` permanecen después de tener en cuenta el pasado de cada serie. Por lo tanto, es una estrategia mínima sólida para el descubrimiento causal en series temporales: ligera, interpretable y proporcionando una primera aproximación a la estructura dinámica antes de introducir redes de rezago más ricas o términos estacionales.", "plural": "La introducción de los rezagos de cada variable permite que los modelos descompongan esa memoria interna: los rezagos explican la mayor parte de los componentes lentos, dejando los residuales (innovaciones) más cerca de las señales causales *instantáneas*. Al prohibir los bordes entre las características rezagadas, aseguramos que estos rezagos actúen solo como **autocontroles**, no como nuevos confundidores entre canales. Esta configuración simple descompone y desautocorrela efectivamente los impulsores, estabilizando las pruebas del factor de Bayes y aclarando qué bordes contemporáneos hacia `purchase` permanecen después de tener en cuenta el pasado de cada serie. Por lo tanto, es una estrategia mínima sólida para el descubrimiento causal en series temporales: ligera, interpretable y proporcionando una primera aproximación a la estructura dinámica antes de introducir redes de rezago más ricas o términos estacionales." }

source: Brilliant — the new DAG captures exactly the dynamic structure we were aiming for.
es: { "singular": "Brillante: el nuevo DAG captura exactamente la estructura dinámica que estábamos buscando.", "plural": "Brillantes: los nuevos DAG capturan exactamente las estructuras dinámicas que estábamos buscando." }

source: After introducing the two–period lags, the algorithm correctly recovered that all four contemporaneous drivers (`generic_search`, `media_activities`, `brand_search`, and `exogenous`) directly influence `purchase`, while the lagged variables appear only as their natural temporal continuations (`generic_search` → `x1_t2`, `media_activities` → `x2_t2`, etc.). The presence of these dashed self–lag links simply reflects each series’ own persistence, not new causal pathways.
es: { "singular": "Después de introducir los rezagos de dos períodos, el algoritmo recuperó correctamente que los cuatro impulsores contemporáneos (`generic_search`, `media_activities`, `brand_search` y `exogenous`) influyen directamente en `purchase`, mientras que las variables rezagadas aparecen solo como sus continuaciones temporales naturales (`generic_search` → `x1_t2`, `media_activities` → `x2_t2`, etc.). La presencia de estos enlaces de auto-rezagado en línea discontinua simplemente refleja la propia persistencia de cada serie, no nuevas vías causales.", "plural": "Después de introducir los rezagos de dos períodos, el algoritmo recuperó correctamente que los cuatro impulsores contemporáneos (`generic_search`, `media_activities`, `brand_search` y `exogenous`) influyen directamente en `purchase`, mientras que las variables rezagadas aparecen solo como sus continuaciones temporales naturales (`generic_search` → `x1_t2`, `media_activities` → `x2_t2`, etc.). La presencia de estos enlaces de auto-rezagado en línea discontinua simplemente refleja la propia persistencia de cada serie, no nuevas vías causales." }

source: If we conceptually remove the lag nodes—treating them as background controls that absorb autocorrelation—the remaining contemporaneous graph between the main drivers and `purchase` matches the **true causal structure** almost perfectly. In other words, by adding minimal temporal structure we forced the model to explain away autocorrelation through each variable’s own past, which freed the discovery step to reveal the genuine contemporaneous causal pattern we originally encoded. This is a clean and interpretable confirmation that the lag–augmented approach brings the recovered DAG much closer to the underlying truth.
es: { "singular": "Si eliminamos conceptualmente los nodos de rezago—tratándolos como controles de fondo que absorben la autocorrelación—el gráfico contemporáneo restante entre los principales impulsores y `purchase` coincide casi perfectamente con la **verdadera estructura causal**. En otras palabras, al agregar una estructura temporal mínima obligamos al modelo a explicar la autocorrelación a través del propio pasado de cada variable, lo que liberó el paso de descubrimiento para revelar el genuino patrón causal contemporáneo que originalmente codificamos. Esta es una confirmación limpia e interpretable de que el enfoque aumentado por rezago acerca el DAG recuperado mucho más a la verdad subyacente.", "plural": "Si eliminamos conceptualmente los nodos de rezago—tratándolos como controles de fondo que absorben la autocorrelación—los gráficos contemporáneos restantes entre los principales impulsores y `purchase` coinciden casi perfectamente con la **verdadera estructura causal**. En otras palabras, al agregar una estructura temporal mínima obligamos a los modelos a explicar la autocorrelación a través del propio pasado de cada variable, lo que liberó el paso de descubrimiento para revelar el genuino patrón causal contemporáneo que originalmente codificamos. Esta es una confirmación limpia e interpretable de que el enfoque aumentado por rezago acerca los DAG recuperados mucho más a la verdad subyacente." }

source: How does this work for longer structures? Let's continue testing!
es: { "singular": "¿Cómo funciona esto para estructuras más largas? ¡Sigamos probando!", "plural": "¿Cómo funcionan esto para estructuras más largas? ¡Sigamos probando!" }

source: This structure is similar to the previous expose. Lets reply the same process!
es: { "singular": { "msgid": "This structure is similar to the previous expose. Lets reply the same process!", "msgstr": "Esta estructura es similar a la exposición anterior. ¡Respondamos el mismo proceso!" }, "plural": { "msgid": "This structure is similar to the previous expose. Lets reply the same process!", "msgstr": "Esta estructura es similar a la exposición anterior. ¡Respondamos el mismo proceso!" } }

source: Once, again we got something similar to the original but this time, as before we could not refine the dag with our domain knowledge to get something as expected.
es: { "singular": "Una vez más, obtuvimos algo similar al original, pero esta vez, como antes, no pudimos refinar el dag con nuestro conocimiento del dominio para obtener algo como se esperaba.", "plural": "Una vez más, obtuvimos algo similar a los originales, pero esta vez, como antes, no pudimos refinar el dag con nuestro conocimiento del dominio para obtener algo como se esperaba." }

source: Brilliant — once again, the new DAG captures exactly the dynamic structure we were aiming for. After cleaning the lags variables, the DAG should be in the same MEC.
es: { "singular": { "msgid": "Brilliant — once again, the new DAG captures exactly the dynamic structure we were aiming for. After cleaning the lags variables, the DAG should be in the same MEC.", "msgstr": "Brillante — una vez más, el nuevo DAG captura exactamente la estructura dinámica que buscábamos. Después de limpiar las variables de rezago, el DAG debería estar en el mismo MEC." }, "plural": { "msgid": "Brilliant — once again, the new DAG captures exactly the dynamic structure we were aiming for. After cleaning the lags variables, the DAG should be in the same MEC.", "msgstr": "Brillante — una vez más, el nuevo DAG captura exactamente la estructura dinámica que buscábamos. Después de limpiar las variables de rezago, el DAG debería estar en el mismo MEC." } }

source: Amazing! Having reached a coherent and time-respecting causal structure, we are now ready to move from **discovery** to **estimation**.
es: { "singular": "¡Increíble! Habiendo alcanzado una estructura causal coherente y respetuosa del tiempo, ahora estamos listos para pasar de **descubrimiento** a **estimación**.", "plural": "¡Increíble! Habiendo alcanzado una estructura causal coherente y respetuosa del tiempo, ahora estamos listos para pasar de **descubrimiento** a **estimación**." }

source: The next step is to quantify the strength of the causal relationships encoded in our DAG — meaning, to move from the *graph* to the *estimands* that describe how much each driver truly contributes to the target.
es: { "singular": "El siguiente paso es cuantificar la fuerza de las relaciones causales codificadas en nuestro DAG, lo que significa pasar del *grafo* a los *estimandos* que describen cuánto contribuye realmente cada factor al objetivo.", "plural": "El siguiente paso es cuantificar la fuerza de las relaciones causales codificadas en nuestros DAG, lo que significa pasar de los *grafos* a los *estimandos* que describen cuánto contribuyen realmente cada uno de los factores a los objetivos." }

source: Building models from DAGs - Full luxury causal Bayesian approaches!
es: { "singular": "Construyendo modelos a partir de DAGs - ¡Enfoques bayesianos causales de lujo completos!", "plural": "Construyendo modelos a partir de DAGs - ¡Enfoques bayesianos causales de lujo completos!" }

source: We introduce the class **`BuildModelFromDAG`**, a bridge between the causal graph and a fully specified Bayesian model. Once the structure is established (for example, through `TBFPC` or any other discovery algorithm), `BuildModelFromDAG` automatically translates that structure into a probabilistic program where each directed edge becomes a candidate causal path, and each node’s parents define its conditioning set. This approach allows us to fit all relationships **jointly**, preserving uncertainty propagation across the entire system rather than estimating each edge through separate regressions.
es: { "singular": "Presentamos la clase **`BuildModelFromDAG`**, un puente entre el grafo causal y un modelo bayesiano completamente especificado. Una vez que se establece la estructura (por ejemplo, a través de `TBFPC` o cualquier otro algoritmo de descubrimiento), `BuildModelFromDAG` traduce automáticamente esa estructura en un programa probabilístico donde cada arista dirigida se convierte en un camino causal candidato, y los padres de cada nodo definen su conjunto de condicionamiento. Este enfoque nos permite ajustar todas las relaciones **conjuntamente**, preservando la propagación de la incertidumbre a través de todo el sistema en lugar de estimar cada arista a través de regresiones separadas.", "plural": "Presentamos las clases **`BuildModelFromDAG`**, unos puentes entre los grafos causales y unos modelos bayesianos completamente especificados. Una vez que se establecen las estructuras (por ejemplo, a través de `TBFPC` o cualquier otro algoritmo de descubrimiento), `BuildModelFromDAG` traduce automáticamente esas estructuras en programas probabilísticos donde cada arista dirigida se convierte en un camino causal candidato, y los padres de cada nodo definen sus conjuntos de condicionamiento. Este enfoque nos permite ajustar todas las relaciones **conjuntamente**, preservando la propagación de la incertidumbre a través de todo el sistema en lugar de estimar cada arista a través de regresiones separadas." }

source: Conceptually, this is a “full-luxury” causal-Bayesian workflow: instead of identifying adjustment sets via the classical back-door criterion (as we explored in our previous post [*Causal Identification in MMM*](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_causal_identification.html)) and fitting many conditional models, we let the DAG directly determine the hierarchical dependencies inside a single Bayesian model. The result is a unified inference of all estimands — posterior distributions for each causal effect — consistent with the discovered structure and ready to integrate with marketing mix modeling or other decision frameworks.
es: { "singular": { "msgid": "Conceptually, this is a “full-luxury” causal-Bayesian workflow: instead of identifying adjustment sets via the classical back-door criterion (as we explored in our previous post [*Causal Identification in MMM*](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_causal_identification.html)) and fitting many conditional models, we let the DAG directly determine the hierarchical dependencies inside a single Bayesian model. The result is a unified inference of all estimands — posterior distributions for each causal effect — consistent with the discovered structure and ready to integrate with marketing mix modeling or other decision frameworks.", "msgstr": "Conceptualmente, este es un flujo de trabajo causal-bayesiano de “lujo total”: en lugar de identificar conjuntos de ajuste a través del criterio clásico de puerta trasera (como exploramos en nuestra publicación anterior [*Identificación Causal en MMM*](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_causal_identification.html)) y ajustar muchos modelos condicionales, dejamos que el DAG determine directamente las dependencias jerárquicas dentro de un solo modelo bayesiano. El resultado es una inferencia unificada de todos los estimandos — distribuciones posteriores para cada efecto causal — consistente con la estructura descubierta y lista para integrarse con el modelado de mezcla de marketing u otros marcos de decisión." }, "plural": {} }

source: In short, while the previous section focused on *which* arrows exist, `BuildModelFromDAG` now tells us *how strong* those arrows are. It completes the transition from causal discovery to causal quantification, enabling an end-to-end pipeline from raw data to interpretable, uncertainty-aware causal estimates.
es: { "singular": "En resumen, mientras que la sección anterior se centró en *cuáles* flechas existen, `BuildModelFromDAG` ahora nos dice *qué tan fuertes* son esas flechas. Completa la transición de descubrimiento causal a cuantificación causal, habilitando un pipeline de extremo a extremo desde datos en bruto hasta estimaciones causales interpretables y conscientes de la incertidumbre.", "plural": "En resumen, mientras que las secciones anteriores se centraron en *cuáles* flechas existen, `BuildModelFromDAG` ahora nos dice *qué tan fuertes* son esas flechas. Completa la transición de descubrimiento causal a cuantificación causal, habilitando un pipeline de extremo a extremo desde datos en bruto hasta estimaciones causales interpretables y conscientes de la incertidumbre." }

source: The class works with causal dags, not with CPDAGs. We can use our function get the different Causal DAGs which lie in the same MEC discovery by the algorithm, and now, use those to build a model.
es: { "singular": "La clase trabaja con DAGs causales, no con CPDAGs. Podemos usar nuestra función para obtener los diferentes DAGs causales que se encuentran en el mismo descubrimiento MEC por el algoritmo, y ahora, usar esos para construir un modelo.", "plural": "Las clases trabajan con DAGs causales, no con CPDAGs. Podemos usar nuestras funciones para obtener los diferentes DAGs causales que se encuentran en el mismo descubrimiento MEC por el algoritmo, y ahora, usar esos para construir modelos." }

source: Great, with this few lines we have a pymc model which replicates our precise causal structure. Let's see the computational graph derive from the causal graph.
es: { "singular": "Genial, con estas pocas líneas tenemos un modelo pymc que replica nuestra precisa estructura causal. Veamos el gráfico computacional derivado del gráfico causal.", "plural": "Geniales, con estas pocas líneas tenemos modelos pymc que replican nuestras precisas estructuras causales. Veamos los gráficos computacionales derivados de los gráficos causales." }

source: Great, if your computational graph follows our causal structure, then we can sample and get easily the true coefficients of each variable over purchases.
es: { "singular": "Genial, si tu gráfico computacional sigue nuestra estructura causal, entonces podemos muestrear y obtener fácilmente los verdaderos coeficientes de cada variable sobre las compras.", "plural": "Genial, si tus gráficos computacionales siguen nuestra estructura causal, entonces podemos muestrear y obtener fácilmente los verdaderos coeficientes de cada variable sobre las compras." }

source: As you can see, once the model is built you can treat it as any other PyMC Model.
es: { "singular": "Como puede ver, una vez que el modelo está construido, puede tratarlo como cualquier otro modelo de PyMC.", "plural": "Como puede ver, una vez que los modelos están construidos, puede tratarlos como cualquier otro modelo de PyMC." }

source: Could we recover the true effects? - Indeed, let's see the following picture!
es: { "singular": "¿Podríamos recuperar los verdaderos efectos? - ¡De hecho, veamos la siguiente imagen!", "plural": "¿Podríamos recuperar los verdaderos efectos? - ¡De hecho, veamos las siguientes imágenes!" }

source: Excellent — the estimated posterior means align closely with the true underlying coefficients, confirming that our Bayesian reconstruction faithfully captured the causal signal embedded in the data.
es: { "singular": "Excelente: las medias posteriores estimadas se alinean estrechamente con los verdaderos coeficientes subyacentes, confirmando que nuestra reconstrucción bayesiana capturó fielmente la señal causal incrustada en los datos.", "plural": "Excelentes: las medias posteriores estimadas se alinean estrechamente con los verdaderos coeficientes subyacentes, confirmando que nuestras reconstrucciones bayesianas capturaron fielmente las señales causales incrustadas en los datos." }
