Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_identification.po
Languages: es

source: Introduction to Understanding Causal Relationships in Media Mix Modeling
es: Introducción a la comprensión de las relaciones causales en el modelado de mezcla de medios

source: Causal identification is about figuring out if we can prove a cause-and-effect relationship using the data we have and our assumptions. This process helps us establish clear links between different factors instead of looking at their correlations. It is essential when working with observational data, which can be affected by hidden factors and biases that make it hard to see true causal relationships.
es: La identificación causal consiste en determinar si podemos probar una relación de causa y efecto utilizando los datos que tenemos y nuestras suposiciones. Este proceso nos ayuda a establecer vínculos claros entre diferentes factores en lugar de centrarnos en sus correlaciones. Es esencial al trabajar con datos observacionales, que pueden verse afectados por factores ocultos y sesgos que dificultan la identificación de verdaderas relaciones causales.

source: Note: Inspired by the notebook from [Bridging Causal Thinking and Media Mix Models: Carlos Trujillo & Ben Vincent](https://colab.research.google.com/drive/1r5pi9Lh_A6h_CKQFEjyn-7iykL8x-X_H#scrollTo=DRFEJyK1VCi3).
es: Nota: Inspirado en el cuaderno de [Bridging Causal Thinking and Media Mix Models: Carlos Trujillo & Ben Vincent](https://colab.research.google.com/drive/1r5pi9Lh_A6h_CKQFEjyn-7iykL8x-X_H#scrollTo=DRFEJyK1VCi3).

source: Why Is Understanding Causal Relationships Important in Regressions?
es: ¿Por qué es importante entender las relaciones causales en las regresiones?

source: In regression models, we often aim to estimate how one or more factors affect an outcome. However, if we don't consider causality carefully, our estimates can be biased due to:
es: En los modelos de regresión, a menudo buscamos estimar cómo uno o más factores afectan un resultado. Sin embargo, si no consideramos la causalidad con cuidado, nuestras estimaciones pueden estar sesgadas debido a:

source: **Confounding Bias**: This happens when a hidden factor influences both the predictor and the outcome, leading to misleading connections.
es: **Sesgo confuso**: Esto ocurre cuando un factor oculto influye tanto en el predictor como en el resultado, lo que lleva a conexiones engañosas.

source: **Selection Bias**: When we use non-random samples, this can distort the estimated relationships.
es: **Sesgo de Selección**: Cuando utilizamos muestras no aleatorias, esto puede distorsionar las relaciones estimadas.

source: **Overcontrol**: Adjusting for variables that are influenced by the treatment can lead to incorrect estimates of causal effects.
es: **Sobrecontrol**: Ajustar las variables que son influenciadas por el tratamiento puede llevar a estimaciones incorrectas de los efectos causales.

source: Causal identification helps us adjust the right variables in the regression to isolate the true effect by addressing confounders and avoiding unnecessary adjustments. Without it, we can run into several problems:
es: La identificación causal nos ayuda a ajustar las variables adecuadas en la regresión para aislar el verdadero efecto al abordar los factores de confusión y evitar ajustes innecesarios. Sin ella, podemos enfrentar varios problemas:

source: **Bias in Estimates**: Our understanding of effect size and direction might be wrong, which can lead to poor decisions.
es: **Sesgo en las estimaciones**: Nuestra comprensión del tamaño y la dirección del efecto puede ser incorrecta, lo que puede llevar a decisiones equivocadas.

source: **Spurious Correlations**: We might misinterpret coincidental relationships as causal.
es: **Correlaciones Espurias**: Podríamos malinterpretar relaciones coincidentes como causales.

source: **Inefficient Models**: Including irrelevant variables or missing important confounders can weaken the model’s accuracy and clarity.
es: **Modelos Ineficientes**: Incluir variables irrelevantes o faltar variables de confusión importantes puede debilitar la precisión y claridad del modelo.

source: In media mix modeling (MMM), where businesses allocate budgets across different channels to maximize returns, these issues can lead to poor resource allocation, wasted money, or misattributing success to ineffective strategies.
es: En la modelización de mezcla de medios (MMM), donde las empresas asignan presupuestos a diferentes canales para maximizar los retornos, estos problemas pueden llevar a una mala asignación de recursos, dinero desperdiciado o a atribuir erróneamente el éxito a estrategias ineficaces.

source: Key Concepts in This Notebook
es: Conceptos clave en este cuaderno

source: This notebook covers key ideas in causal inference, including:
es: Este cuaderno abarca ideas clave en la inferencia causal, incluyendo:

source: **Causal Directed Acyclic Graphs (DAGs)**: These are visual tools that show the assumed causal relationships in the data.
es: **Grafos Acíclicos Dirigidos Causales (DAGs)**: Estas son herramientas visuales que muestran las relaciones causales asumidas en los datos.

source: **Backdoor Criterion**: This rule helps identify which variables block paths that create misleading connections between the treatment and outcome.
es: **Criterio de Puerta Trasera**: Esta regla ayuda a identificar qué variables bloquean los caminos que crean conexiones engañosas entre el tratamiento y el resultado.

source: **Minimal Adjustment Set**: This is the smallest group of factors needed to meet the backdoor criterion, ensuring accurate causal estimates.
es: **Conjunto de Ajuste Mínimo**: Este es el grupo más pequeño de factores necesarios para cumplir con el criterio de puerta trasera, asegurando estimaciones causales precisas.

source: These tools help us understand causal inference more clearly and give us solid guidelines for choosing variables in media mix models.
es: Estas herramientas nos ayudan a comprender la inferencia causal de manera más clara y nos brindan pautas sólidas para elegir variables en modelos de mezcla de medios.

source: By the end of this notebook, you will learn how to use `pymc-marketing` alongside causal thinking principles for effective media mix modeling.
es: Al final de este cuaderno, aprenderá a utilizar `pymc-marketing` junto con los principios del pensamiento causal para un modelado efectivo de la mezcla de medios.

source: Let’s start by importing the necessary libraries!
es: ¡Comencemos importando las bibliotecas necesarias!

source: Business problem
es: Problema empresarial

source: Imagine you run a retail company that advertises its products. You've been in business for a while and have noticed steady sales growth. During holidays, sales increase even more. However, you're not the only one advertising; a competitor is also promoting their products, likely with discounts or special offers.
es: Imagina que diriges una empresa minorista que publicita sus productos. Has estado en el negocio durante un tiempo y has notado un crecimiento constante en las ventas. Durante las festividades, las ventas aumentan aún más. Sin embargo, no eres el único que publicita; un competidor también está promoviendo sus productos, probablemente con descuentos u ofertas especiales.

source: Let's explore how different factors relate to each other:
es: Exploremos cómo se relacionan entre sí diferentes factores:

source: **Christmas (C)**: The holiday season boosts consumer interest, leading to more ad views (X1 and X2) and directly increasing your sales (T).
es: **Navidad (C)**: La temporada navideña incrementa el interés del consumidor, lo que lleva a más visualizaciones de anuncios (X1 y X2) y aumenta directamente sus ventas (T).

source: **Marketing Channels (X1, X2)**:
es: **Canales de Marketing (X1, X2)**:

source: **X1**: Social media ads, like those on Facebook or TikTok.
es: **X1**: Anuncios en redes sociales, como los de Facebook o TikTok.

source: **X2**: Search engine ads, which can enhance the impact of social media ads (these channels work well together).
es: **X2**: Anuncios en motores de búsqueda, que pueden aumentar el impacto de los anuncios en redes sociales (estos canales funcionan bien juntos).

source: **Target (T)**: Your goal is to maximize sales revenue.
es: **Objetivo (T)**: Su meta es maximizar los ingresos por ventas.

source: **Unseen Factors**:
es: **Factores no visibles**:

source: **Competitor Offers (I)**: Your competitor may run aggressive holiday discounts, which could lessen the impact of your search ads (X2) and reduce your sales (T).
es: **Ofertas de Competidores (I)**: Su competidor puede ofrecer descuentos agresivos durante las festividades, lo que podría disminuir el impacto de sus anuncios de búsqueda (X2) y reducir sus ventas (T).

source: **Market Growth (G)**: Economic growth during the holiday season might boost sales (T) regardless of your advertising efforts.
es: **Crecimiento del Mercado (G)**: El crecimiento económico durante la temporada navideña podría impulsar las ventas (T) independientemente de sus esfuerzos publicitarios.

source: Visualizing Relationships with a DAG
es: Visualizando relaciones con un DAG

source: We can illustrate these ideas using a Directed Acyclic Graph (DAG).
es: Podemos ilustrar estas ideas utilizando un Grafo Acíclico Dirigido (DAG).

source: Observed Factors:
es: Factores observados:

source: **Marketing Impressions X1 and X2**: Two channels (search ads and social ads) that can affect sales (T). They can also impact each other.
es: **Impresiones de Marketing X1 y X2**: Dos canales (anuncios de búsqueda y anuncios en redes sociales) que pueden afectar las ventas (T). También pueden influirse mutuamente.

source: **Target (T)**: The key metric you want to improve, like sales revenue.
es: **Objetivo (T)**: La métrica clave que desea mejorar, como los ingresos por ventas.

source: Unseen Factors (Dashed Elements):
es: Factores no visibles (Elementos discontinuos):

source: **Christmas (C)**: A seasonal event that influences both marketing impressions (X1, X2) and sales (T).
es: **Navidad (C)**: Un evento estacional que influye tanto en las impresiones de marketing (X1, X2) como en las ventas (T).

source: **Competitor Offers (I)**: Actions by competitors, such as discounts, which can influence marketing channels and sales.
es: **Ofertas de Competidores (I)**: Acciones de los competidores, como descuentos, que pueden influir en los canales de marketing y en las ventas.

source: **Market Growth (G)**: Broader economic trends that affect sales.
es: **Crecimiento del Mercado (G)**: Tendencias económicas más amplias que afectan las ventas.

source: Note: Dashed elements are not possible to intervene, on the other hand, solid elements are possible to intervene.
es: Nota: Los elementos en línea discontinua no se pueden intervenir, mientras que los elementos en línea continua sí se pueden intervenir.

source: Key Relationships:
es: Relaciones Clave:

source: Christmas (C) boosts both marketing impressions (X1, X2) and directly increases sales (T) during the holiday season.
es: La Navidad (C) impulsa tanto las impresiones de marketing (X1, X2) como aumenta directamente las ventas (T) durante la temporada navideña.

source: Marketing impressions (X1, X2) affect sales (T) through your advertising efforts. X1 can help X2 (e.g., social ads support search ads).
es: Las impresiones de marketing (X1, X2) afectan las ventas (T) a través de sus esfuerzos publicitarios. X1 puede ayudar a X2 (por ejemplo, los anuncios en redes sociales apoyan a los anuncios de búsqueda).

source: Competitor Offers (I) and Market Growth (G) impact the marketing channels and sales, which can confuse the understanding of cause and effect.
es: Las Ofertas de Competidores (I) y el Crecimiento del Mercado (G) impactan los canales de marketing y las ventas, lo que puede confundir la comprensión de causa y efecto.

source: We now need to define how these relationships work and create a model to generate data that reflects these assumptions. This way, we can see how well we can identify causal relationships using the data we gather.
es: Ahora necesitamos definir cómo funcionan estas relaciones y crear un modelo para generar datos que reflejen estas suposiciones. De esta manera, podemos ver qué tan bien podemos identificar relaciones causales utilizando los datos que recopilamos.

source: We set a date range between January 2022 and November 2024, at a daily frequency.
es: Establecimos un rango de fechas entre enero de 2022 y noviembre de 2024, con una frecuencia diaria.

source: Generating the Market Growth (Trend)
es: Generando el Crecimiento del Mercado (Tendencia)

source: Next, we generate the data for **market growth**. We assume the market growth follows a power-law trend, meaning that growth accelerates over time rather than remaining constant. This can be mathematically defined as:
es: A continuación, generamos los datos para **el crecimiento del mercado**. Asumimos que el crecimiento del mercado sigue una tendencia de ley de potencias, lo que significa que el crecimiento se acelera con el tiempo en lugar de permanecer constante. Esto se puede definir matemáticamente como:

source: Where:
es: Dónde:

source: $t$: The time index, representing days since the start of the date range.
es: $t$: El índice de tiempo, que representa los días desde el inicio del rango de fechas.

source: $baseline$: A constant added to $t$ to shift the starting point of the trend. This value affects the initial level of market growth. The starting value of the function will be $(baseline)^{exponent} - 1$, not 0.
es: $baseline$: Una constante añadida a $t$ para desplazar el punto de inicio de la tendencia. Este valor afecta el nivel inicial del crecimiento del mercado. El valor inicial de la función será $(baseline)^{exponent} - 1$, no 0.

source: $exponent$: The power to which the time index is raised, determining the rate at which the trend accelerates over time.
es: $exponent$: La potencia a la que se eleva el índice de tiempo, determinando la tasa a la que la tendencia se acelera con el tiempo.

source: Generating the Holiday Effect
es: Generando el Efecto Vacacional

source: In this section, we simulate the effect of holidays on the market growth trend. Certain holidays, like Christmas, can have a significant impact on consumer behavior, leading to seasonal spikes in sales. To capture these effects, we introduce a holiday signal based on Gaussian (normal) distributions centered around specific holiday dates.
es: En esta sección, simulamos el efecto de las festividades en la tendencia de crecimiento del mercado. Ciertas festividades, como la Navidad, pueden tener un impacto significativo en el comportamiento del consumidor, lo que lleva a picos estacionales en las ventas. Para capturar estos efectos, introducimos una señal de festividad basada en distribuciones gaussianas (normales) centradas en fechas específicas de festividades.

source: The function used to model the holiday effect is defined as follows:
es: La función utilizada para modelar el efecto de las vacaciones se define de la siguiente manera:

source: $\Delta t$ is the time difference (in days) between the current date and the holiday date.
es: $\Delta t$ es la diferencia de tiempo (en días) entre la fecha actual y la fecha de la festividad.

source: $\sigma$ is the standard deviation that controls the spread of the effect around the holiday date.
es: $\sigma$ es la desviación estándar que controla la dispersión del efecto alrededor de la fecha de la festividad.

source: For each holiday, we calculate the holiday signal across the date range and add a **holiday contribution** by scaling the signal with a holiday-specific coefficient. This approach models seasonal holiday spikes using Gaussian functions, which capture the transient increase in market activity around holidays, and their respective decay over time.
es: Para cada festividad, calculamos la señal de la festividad a lo largo del rango de fechas y añadimos una **contribución de festividad** escalando la señal con un coeficiente específico de la festividad. Este enfoque modela los picos estacionales de las festividades utilizando funciones gaussianas, que capturan el aumento transitorio en la actividad del mercado alrededor de las festividades y su respectivo decaimiento a lo largo del tiempo.

source: Modeling Competitor Offers
es: Modelando Ofertas de Competidores

source: To simulate the impact of competitor offers on market growth.
es: Para simular el impacto de las ofertas de los competidores en el crecimiento del mercado.

source: $A$: The **amplitude** of the oscillation, representing the maximum deviation from the center. In this context, it controls the intensity of the competitor offers.
es: $A$: La **amplitud** de la oscilación, que representa la desviación máxima del centro. En este contexto, controla la intensidad de las ofertas de los competidores.

source: $C$: The **center of oscillation**, setting the average level around which competitor offers fluctuate.
es: $C$: El **centro de oscilación**, que establece el nivel promedio alrededor del cual fluctúan las ofertas de los competidores.

source: $\omega$: The **angular frequency**, which determines the frequency of the oscillations. It’s calculated as: $\omega = \frac{\pi}{\frac{n}{2}}$ where $n$ is the total number of data points. This ensures a complete cycle within the specified range.
es: $\omega$: La **frecuencia angular**, que determina la frecuencia de las oscilaciones. Se calcula como: $\omega = \frac{\pi}{\frac{n}{2}}$ donde $n$ es el número total de puntos de datos. Esto asegura un ciclo completo dentro del rango especificado.

source: With this form, we simulate a world where competitors offers increase during the initial days of the year, and then decrease towards the end of the year.
es: Con este formulario, simulamos un mundo donde las ofertas de los competidores aumentan durante los primeros días del año y luego disminuyen hacia el final del año.

source: Modeling Marketing Channels
es: Modelando Canales de Marketing

source: In this section, we simulate two marketing channels, $x1$ and $x2$, which represent different advertising channels (e.g., Search ads and Social media campaigns). Each channel's behavior is influenced by random variability and confounding effects from seasonal holidays and competitor actions. Here’s how we model each channel mathematically:
es: En esta sección, simulamos dos canales de marketing, $x1$ y $x2$, que representan diferentes canales publicitarios (por ejemplo, anuncios de búsqueda y campañas en redes sociales). El comportamiento de cada canal está influenciado por la variabilidad aleatoria y los efectos confusos de las festividades estacionales y las acciones de los competidores. Así es como modelamos cada canal matemáticamente:

source: **Channel $x1$**: As mentioned before, we generate $x1$ which is affected by the holiday signal, we could define it as:
es: **Canal $x1$**: Como se mencionó anteriormente, generamos $x1$ que se ve afectado por la señal de vacaciones, podríamos definirlo como:

source: **Channel $x2$**: On the other hand, we generate $x2$ which is affected by the holiday signal, the influence of $x1$ and the competitor offers. We could define it as:
es: **Canal $x2$**: Por otro lado, generamos $x2$ que se ve afectado por la señal de vacaciones, la influencia de $x1$ y las ofertas de los competidores. Podríamos definirlo como:

source: Interpretation
es: Interpretación

source: These equations allow us to capture the complex dynamics influencing each marketing channel:
es: Estas ecuaciones nos permiten capturar la dinámica compleja que influye en cada canal de marketing:

source: **Holiday Effects** increase channel activity around specific dates, simulating seasonal spikes.
es: **Efectos de Vacaciones** aumentan la actividad del canal alrededor de fechas específicas, simulando picos estacionales.

source: **Cross-channel Influences** introduce interdependencies, modeling how one channel's success can amplify another’s.
es: **Influencias entre canales** introducen interdependencias, modelando cómo el éxito de un canal puede amplificar el de otro.

source: **Competitor Effects** introduce fluctuations due to external factors, showing how competitive pressure can decrease engagement or effectiveness.
es: **Efectos de la competencia** introducen fluctuaciones debido a factores externos, mostrando cómo la presión competitiva puede disminuir el compromiso o la efectividad.

source: This approach reflects real-world conditions, where marketing channels are not isolated but affected by seasonal trends, competitor actions, and synergies across different channels.
es: Este enfoque refleja las condiciones del mundo real, donde los canales de marketing no están aislados, sino que se ven afectados por tendencias estacionales, acciones de los competidores y sinergias entre diferentes canales.

source: The two generated signals wil represent the "impressions" of the two marketing channels. Basically, we are simulating the exposure that we would observe from a media platform, reported after we run a campaign.
es: Las dos señales generadas representarán las "impresiones" de los dos canales de marketing. Básicamente, estamos simulando la exposición que observaríamos de una plataforma de medios, reportada después de ejecutar una campaña.

source: The level of exposure doesn't impact our sales in a linear way, so we need to apply a transformation to account for that. We'll use a geometric adstock transformation, which is a common technique in marketing mix modeling to account for the adstock/lagging effect, and a michaelis-menten saturation to account for the diminishing returns effect.
es: El nivel de exposición no impacta nuestras ventas de manera lineal, por lo que necesitamos aplicar una transformación para tenerlo en cuenta. Utilizaremos una transformación de adstock geométrico, que es una técnica común en la modelización de mezcla de marketing para considerar el efecto de adstock/retraso, y una saturación de michaelis-menten para tener en cuenta el efecto de rendimientos decrecientes.

source: Similar as the [initial example in pymc-marketing](https://docs.pymc.io/notebooks/mmm/mmm_initial_example.html).
es: Similar al [ejemplo inicial en pymc-marketing](https://docs.pymc.io/notebooks/mmm/mmm_initial_example.html).

source: Defining the Sales (Target)
es: Definiendo las Ventas (Objetivo)

source: Finally, we define the sales or revenue (target) variable, which is affected by the market growth, the competitor offers, the holiday contributions, the saturated media costs and a noise term.
es: Finalmente, definimos la variable de ventas o ingresos (objetivo), que se ve afectada por el crecimiento del mercado, las ofertas de los competidores, las contribuciones de las festividades, los costos de medios saturados y un término de ruido.

source: The variable, $y$, is defined as follows:
es: La variable, $y$, se define de la siguiente manera:

source: y_{t} = Intercept + f(MG_{t}) - f(C_{t}) + f(H_{t}) + m(I_{x1_t}) + m(I_{x2_t}) + \epsilon
es: y_{t} = Intercepto + f(MG_{t}) - f(C_{t}) + f(H_{t}) + m(I_{x1_t}) + m(I_{x2_t}) + \epsilon

source: **Intercept**: A baseline level of sales, set to 1.5, representing the base sales level in the absence of other effects.
es: **Intercepto**: Un nivel base de ventas, establecido en 1.5, que representa el nivel base de ventas en ausencia de otros efectos.
