Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_tvp_example.po
Languages: es

source: MMM with time-varying parameters (TVP)
es: MMM con parámetros que varían en el tiempo (TVP)

source: In classical marketing mix models, the effect of advertising (or other factors) on sales is assumed to be constant over time. Similarly, the baseline sales—what you would have sold without marketing—is also assumed to be constant. This is a simplification that _typically doesn't_ match reality. There will be times when, for various reasons, your ads are more effective, or when your product just _sells better_.
es: En los modelos clásicos de mezcla de marketing, se asume que el efecto de la publicidad (u otros factores) sobre las ventas es constante a lo largo del tiempo. De manera similar, se asume que las ventas base—lo que habrías vendido sin marketing—también son constantes. Esta es una simplificación que _típicamente no_ coincide con la realidad. Habrá momentos en los que, por diversas razones, tus anuncios sean más efectivos, o cuando tu producto simplemente _venda mejor_.

source: This _time-varying effect_ is something we can capture with a time-varying parameter. In the context of a marketing mix model, this could be changing trends, unexpected events, and other external factors that are not controlled for. For example, if you sell sunglasses or ice cream, an unusually sunny spring will impact both your baseline sales and likely also the effect of your ads on short-term sales.
es: Este _efecto variable en el tiempo_ es algo que podemos capturar con un parámetro variable en el tiempo. En el contexto de un modelo de mezcla de marketing, esto podría incluir tendencias cambiantes, eventos inesperados y otros factores externos que no se controlan. Por ejemplo, si vendes gafas de sol o helados, una primavera inusualmente soleada impactará tanto tus ventas base como, probablemente, el efecto de tus anuncios en las ventas a corto plazo.

source: 👉 In this notebook, we demonstrate how—and when—to use a time-varying parameter for intercept in an MMM, using `pymc-marketing`'s `MMM` model.
es: 👉 En este cuaderno, demostramos cómo—y cuándo—usar un parámetro variable en el tiempo para la intersección en un MMM, utilizando el modelo `MMM` de `pymc-marketing`.

source: The API is straightforward:
es: La API es sencilla:

source: 🤓 Under the hood, the time-varying intercept is modeled as a Gaussian Process (specifically a [Hilbert Space GP](https://www.pymc.io/projects/docs/en/stable/api/gp/generated/pymc.gp.HSGP.html) to speed things up), constrained to $\mu=1$ and then multiplied by a _baseline intercept_. So if the sampler infers that the baseline intercept is 1000 sunglasses sold per week, then the GP models the percentage deviation from that, over time. Have a look at the implementation of `MMM` for concrete structural details.
es: 🤓 En el fondo, el intercepto variable en el tiempo se modela como un Proceso Gaussiano (específicamente un [GP de Espacio de Hilbert](https://www.pymc.io/projects/docs/en/stable/api/gp/generated/pymc.gp.HSGP.html) para acelerar las cosas), restringido a $\mu=1$ y luego multiplicado por un _intercepto base_. Así que si el muestreador infiere que el intercepto base es de 1000 gafas de sol vendidas por semana, entonces el GP modela la desviación porcentual de eso, a lo largo del tiempo. Echa un vistazo a la implementación de `MMM` para detalles estructurales concretos.

source: Below, we give three simple usage examples:
es: A continuación, ofrecemos tres ejemplos de uso simples:

source: **Yearly seasonality**: The intercept is a cosine function with a period of one year. Normally, one would use a Fourier basis to model seasonality, but let's see what happens when we use a time-varying intercept 🤷‍♂️.
es: **Estacionalidad anual**: La intersección es una función coseno con un período de un año. Normalmente, se utilizaría una base de Fourier para modelar la estacionalidad, pero veamos qué sucede cuando usamos una intersección variable en el tiempo 🤷‍♂️.

source: **Upward trending sales**: The intercept is a linearly increasing function, mimicking overall sales growth not explained by marketing or controls. Again, you would normally use a linear increasing control variable for this, but let's see what happens when we use a time-varying parameter.
es: **Ventas en tendencia ascendente**: La intersección es una función que aumenta linealmente, imitando el crecimiento general de las ventas que no se explica por el marketing o los controles. Nuevamente, normalmente usarías una variable de control que aumenta linealmente para esto, pero veamos qué sucede cuando utilizamos un parámetro que varía con el tiempo.

source: **Unexpected events**: The intercept is a flat line, except for intermittent, randomly placed spikes/dips. This is a more realistic scenario, where the effect of marketing is not constant, but rather varies due to various unexpected factors.
es: **Eventos inesperados**: La intersección es una línea plana, excepto por picos/caídas intermitentes y colocados al azar. Este es un escenario más realista, donde el efecto del marketing no es constante, sino que varía debido a diversos factores inesperados.

source: We conclude that while the GP-based time-varying intercept *can* technically do the job for seasonality and trends, it's not the most efficient way to do so (choose a Fourier basis or linear trend instead). However, to capture unexpected events that no other variable can explain, it's very powerful 💪.
es: Concluimos que, aunque el intercepto variable en el tiempo basado en GP *puede* técnicamente cumplir con la función para la estacionalidad y las tendencias, no es la forma más eficiente de hacerlo (elija una base de Fourier o una tendencia lineal en su lugar). Sin embargo, para capturar eventos inesperados que ninguna otra variable puede explicar, es muy poderoso 💪.

source: Load synthetic data
es: Cargar datos sintéticos

source: For this example, we load some simulated consumer goods marketing spend/control data.
es: Para este ejemplo, cargamos algunos datos simulados de gasto/control en marketing de bienes de consumo.

source: → Load input and define columns
es: → Cargar entrada y definir columnas

source: Example 1: Yearly seasonality
es: Ejemplo 1: Estacionalidad anual

source: A common pattern in consumer goods sales is that sales are higher in the summer and lower in the winter, or reverse. In this example, we will simulate sales that follow this pattern—by letting the synthetic intercept be a cosine wave—and then see if the model can recover this using a time-varying intercept.
es: Un patrón común en las ventas de bienes de consumo es que las ventas son más altas en verano y más bajas en invierno, o viceversa. En este ejemplo, simularemos ventas que siguen este patrón, permitiendo que la intersección sintética sea una onda coseno, y luego veremos si el modelo puede recuperar esto utilizando una intersección que varía en el tiempo.

source: → Simulate sales
es: → Simular ventas

source: The data we loaded did _not_ have a target variable. Instead, we simulate one, by **defining a model with fixed parameters**. We can do this using [the recently added `do` operator](https://www.pymc-labs.com/blog-posts/causal-analysis-with-pymc-answering-what-if-with-the-new-do-operator/) in `pymc`. In case you have not seen this trick before, take note because it's neat.
es: Los datos que cargamos _no_ tenían una variable objetivo. En su lugar, simulamos una, **definiendo un modelo con parámetros fijos**. Podemos hacer esto utilizando [el operador `do` que se añadió recientemente](https://www.pymc-labs.com/blog-posts/causal-analysis-with-pymc-answering-what-if-with-the-new-do-operator/) en `pymc`. En caso de que no hayas visto este truco antes, toma nota porque es interesante.

source: → Split into train and test
es: → Dividir en entrenamiento y prueba

source: We split the data into _train_ and _test_ sets, so we may later display out-of-sample predictive performance.
es: Dividimos los datos en conjuntos de _entrenamiento_ y _prueba_, para que podamos mostrar más adelante el rendimiento predictivo fuera de muestra.

source: → Fit model
es: → Ajustar modelo

source: We fit the model with default settings, except specifying a `HalfNormal` prior on the baseline intercept. This is because we know that the baseline sales are positive, for a model like this.
es: Ajustamos el modelo con configuraciones predeterminadas, excepto especificando un prior `HalfNormal` en la intersección base. Esto se debe a que sabemos que las ventas base son positivas para un modelo como este.

source: → Posterior predictive checks
es: → Comprobaciones predictivas posteriores

source: We visualize the posterior predictive distribution, to understand how well the model fits the data.
es: Visualizamos la distribución predictiva posterior para entender qué tan bien se ajusta el modelo a los datos.

source: **Sales**
es: **Ventas**

source: First, we consider predicted versus actual sales both within- and out-of-sample.
es: Primero, consideramos las ventas predichas frente a las ventas reales tanto dentro como fuera de la muestra.

source: Some observations:
es: Algunas observaciones:

source: 👍 The model performs well in-sample.
es: 👍 El modelo tiene un buen rendimiento en la muestra.

source: 🤷‍♂️ The model predicts accurately up to ~3 months into the test set, then starts to deviate.
es: 🤷‍♂️ El modelo predice con precisión hasta aproximadamente 3 meses en el conjunto de prueba, luego comienza a desviarse.

source: Since the most important utility of an MMM is to model the individual channel, control, and intercept contributions *in sample*, this out-of-sample error is not a particular worry. For scenario planning or backtesting, the decent performance in the 3 months after the training period ends, is likely sufficient, and in case a longer prediction window were desired, one would not want to use a GP to model seasonality, but rather a Fourier basis.
es: Dado que la utilidad más importante de un MMM es modelar las contribuciones individuales de canal, control e intercepto *en muestra*, este error fuera de muestra no es una preocupación particular. Para la planificación de escenarios o la validación retrospectiva, el rendimiento aceptable en los 3 meses posteriores al final del período de entrenamiento es probablemente suficiente, y en caso de que se desee una ventana de predicción más larga, no se querría utilizar un GP para modelar la estacionalidad, sino más bien una base de Fourier.

source: **Predicting intercept**
es: **Predicción de intersección**

source: We can dig one step deeper, and display the posterior predictive distribution of the time-varying intercept. Let's first display the fitted baseline intercept (it should be close to 5).
es: Podemos profundizar un paso más y mostrar la distribución predictiva posterior del intercepto variable en el tiempo. Primero, mostremos el intercepto base ajustado (debería estar cerca de 5).

source: 🎉 That indeed is close to the true value of 5.
es: 🎉 Eso, de hecho, está cerca del valor verdadero de 5.

source: Now, let's visualize the posterior predictive distribution of the time-varying intercept, against the actual time-varying intercept.
es: Ahora, visualicemos la distribución predictiva posterior del intercepto variable en el tiempo, en comparación con el intercepto variable en el tiempo real.

source: Visualizing this, it's clear that:
es: Visualizando esto, está claro que:

source: 👌 In-sample it gets the synthetic trend almost exactly right!
es: 👌 En la muestra, ¡captura la tendencia sintética casi exactamente!

source: 👎 Out-of-sample, the uncertainty blows up. This is expected, as GPs are typically not great at extrapolating far from the training data.
es: 👎 Fuera de la muestra, la incertidumbre se dispara. Esto es esperado, ya que los GP generalmente no son buenos extrapolando lejos de los datos de entrenamiento.

source: Example 2: Upward trending sales
es: Ejemplo 2: Ventas en tendencia ascendente

source: This section repeats the steps above, except with a linearly increasing intercept with mean 2.5, to mimic upward trending sales.
es: Esta sección repite los pasos anteriores, excepto con un intercepto que aumenta linealmente con una media de 2.5, para imitar ventas en tendencia ascendente.

source: → Posterior predictive check
es: → Verificación predictiva posterior

source: **Predicting sales**
es: **Predicción de ventas**

source: Observations:
es: Observaciones:

source: 👍 As seen previously, the model performs well in-sample.
es: 👍 Como se vio anteriormente, el modelo tiene un buen rendimiento en la muestra.

source: 👎 Similar to before, predictions are accurate up to ~3-6 months into the test set, then start to deviate.
es: 👎 Similar a antes, las predicciones son precisas hasta aproximadamente 3-6 meses en el conjunto de prueba, luego comienzan a desviarse.

source: 👎 In-sample it follows the synthetic trend but with an offset of about -1.5.
es: 👎 En la muestra, sigue la tendencia sintética pero con un desplazamiento de aproximadamente -1.5.

source: 👎 Out-of-sample, the GP reverts to its prior mean.
es: 👎 Fuera de muestra, el GP vuelve a su media anterior.

source: It's quite clear from this example, that if you have a steep upward trend in your sales data that you have reason to expect will continue, you probably *should not* use a GP to model the intercept. Instead, you may use linearly increasing control variables.
es: Está bastante claro a partir de este ejemplo que, si tiene una tendencia ascendente pronunciada en sus datos de ventas que tiene razones para esperar que continúe, probablemente *no debería* utilizar un GP para modelar la intersección. En su lugar, puede utilizar variables de control que aumenten linealmente.

source: Example 3: Unexpected events
es: Ejemplo 3: Eventos inesperados

source: This section repeats the procedure except with an intercept of 5, except with intermittent spike/dip events. Each event could be a competitor product launch, a global pandemic, an unusually sunny spring, or another impactful, unexpected event.
es: Esta sección repite el procedimiento, excepto con una intersección de 5, excepto con eventos intermitentes de picos/caídas. Cada evento podría ser el lanzamiento de un producto competidor, una pandemia global, una primavera inusualmente soleada, o otro evento impactante e inesperado.

source: The sampling diagnosis ☝️ complains about some divergences. Similarly, the *rhat* statistic is larger than 1.01 for some parameters. Overall it appears that the model has not been parameterized appropriately. Let's see how this pans out...
es: El diagnóstico de muestreo ☝️ se queja de algunas divergencias. De manera similar, la estadística *rhat* es mayor que 1.01 para algunos parámetros. En general, parece que el modelo no ha sido parametrizado adecuadamente. Veamos cómo se desarrolla esto...

source: 👎 The model predictions have large uncertainty, more than observed in the previous examples.
es: 👎 Las predicciones del modelo tienen una gran incertidumbre, más de lo observado en los ejemplos anteriores.

source: 💥 ~3 months into the out-of-sample set, uncertainty explodes.
es: 💥 A ~3 meses de haber comenzado el conjunto fuera de muestra, la incertidumbre explota.

source: Judging from the posterior predictive distribution of the time-varying intercept, there is a problem with the model.
es: A juzgar por la distribución predictiva posterior del intercepto variable en el tiempo, hay un problema con el modelo.

source: We observe that:
es: Observamos que:

source: 👎 The model overestimates the intercept *a lot*.
es: 👎 El modelo sobreestima el intercepto *mucho*.

source: 🤷‍♂️ Only the two major events are captured by the time-varying intercept.
es: 🤷‍♂️ Solo los dos eventos principales son capturados por el intercepto que varía con el tiempo.

source: 👎 Overall uncertainty is greater than in the previous examples.
es: 👎 La incertidumbre general es mayor que en los ejemplos anteriores.

source: This is a strong indication that the time-varying intercept prior may not be well parameterized. Since the events that we synthesize happen on shorter time scales than the trends we modeled previously, it is likely that the mean of the length-scale prior is too high (default is two years).
es: Esto es una fuerte indicación de que el prior del intercepto variable en el tiempo puede no estar bien parametrizado. Dado que los eventos que sintetizamos ocurren en escalas de tiempo más cortas que las tendencias que modelamos anteriormente, es probable que la media del prior de la longitud de escala sea demasiado alta (el valor por defecto es de dos años).

source: 💡 Let's try to refit the model with a shorter length scale prior mean of one year (52.18 weeks).
es: 💡 Intentemos ajustar el modelo con una media de escala de longitud previa más corta de un año (52.18 semanas).

source: Notice ☝️ fewer divergences 👌.
es: Aviso ☝️ menos divergencias 👌.

source: 🎉 Success! As hypothesized, the time-varying intercept now captures the events better, and at the right scale! Notice how lowering the length-scale prior mean from the default two years to one year makes the series more _squiggly_.
es: 🎉 ¡Éxito! Como se había hipotetizado, el intercepto variable en el tiempo ahora captura mejor los eventos y a la escala correcta. ¡Observe cómo reducir la media del prior de la longitud de escala del valor predeterminado de dos años a un año hace que la serie sea más _ondulante_.

source: *Sidenote: While the very-small events are still not captured perfectly, this may be remedied with a more complex covariance function supplied through the `model_config`, although these events are likely below the minimal detectable effect size in this example.*
es: *Nota al margen: Aunque los eventos muy pequeños aún no se capturan perfectamente, esto puede ser solucionado con una función de covarianza más compleja proporcionada a través de `model_config`, aunque es probable que estos eventos estén por debajo del tamaño del efecto mínimo detectable en este ejemplo.*

source: Conclusion
es: Conclusión

source: In this notebook, we have demonstrated how to use a time-varying parameter in a marketing mix model using `pymc-marketing`. We have shown how the model can capture yearly seasonality (with moderate success 🤷‍♂️), upward trending sales (not very well 👎), and random/unexpected events (very well 🎉). In summary, we show that a time-varying intercept, as modeled using a Gaussian Process (GP), is highly appropriate for modeling *random events* that cannot otherwise be accounted for in the model, whereas regular patterns that may influence baseline sales such as seasonality and constant demand increase are better modeled using a Fourier or linear basis.
es: En este cuaderno, hemos demostrado cómo utilizar un parámetro variable en el tiempo en un modelo de mezcla de marketing utilizando `pymc-marketing`. Hemos mostrado cómo el modelo puede capturar la estacionalidad anual (con un éxito moderado 🤷‍♂️), el aumento de las ventas (no muy bien 👎) y eventos aleatorios/no esperados (muy bien 🎉). En resumen, mostramos que un intercepto variable en el tiempo, modelado mediante un Proceso Gaussiano (GP), es altamente apropiado para modelar *eventos aleatorios* que de otro modo no pueden ser considerados en el modelo, mientras que patrones regulares que pueden influir en las ventas base, como la estacionalidad y el aumento constante de la demanda, se modelan mejor utilizando una base de Fourier o lineal.

source: **In a nutshell**
es: **En resumen**

source: GPs are great at capturing patterns that are not easy/possible to extrapolate, and in turn, they cannot well extrapolate simple patterns like seasonality or increasing trends. For such cases, a Fourier basis or similar might be more appropriate. However, for explaining temporal variance that no other model component can account for—like the impact of an unexpected event—a time-varying intercept is great!
es: Los GP son excelentes para capturar patrones que no son fáciles o posibles de extrapolar, y a su vez, no pueden extrapolar bien patrones simples como la estacionalidad o tendencias crecientes. Para tales casos, una base de Fourier o similar podría ser más apropiada. Sin embargo, para explicar la varianza temporal que ningún otro componente del modelo puede tener en cuenta—como el impacto de un evento inesperado—¡un intercepto variable en el tiempo es excelente!

source: **When should I use a time-varying intercept?**
es: **¿Cuándo debo utilizar un intercepto variable en el tiempo?**

source: If you suspect that your baseline sales fluctuate over time due to factors beyond seasonality, constant growth, or explicitly modeled controls, consider using a time-varying parameter. The time-varying intercept is like a _catch-all_ for unexplained variance in your sales data.
es: Si sospecha que sus ventas base fluctúan con el tiempo debido a factores más allá de la estacionalidad, el crecimiento constante o controles modelados explícitamente, considere utilizar un parámetro que varíe en el tiempo. El intercepto que varía en el tiempo es como un _receptor general_ para la varianza no explicada en sus datos de ventas.

source: **How should I parameterize my time-varying component?**
es: **¿Cómo debo parametrizar mi componente variable en el tiempo?**

source: We have defined some sensible defaults, and in most cases, they are adequate. But if you have unexplained variance in your sales that occur on short time scales, you may—as in the example above—experiment with lowering the length-scale prior mean. If you need greater fidelity in the frequencies that the GP can capture, and can live with longer sampling times, you can also increase the number of basis functions `model_config['intercept_tvp_config'].m` from 200 (default) to a higher number. Finally, if you believe you have events affecting your sales on, say, two separate time scales, you can supply a new covariance function through `model_config['intercept_tvp_config'].cov_func`, which is *the sum of two independently defined covariance functions*—each with a length-scale prior mean that matches the given time scales you expect in your data.
es: Hemos definido algunos valores predeterminados sensatos, y en la mayoría de los casos, son adecuados. Pero si tiene una variación inexplicada en sus ventas que ocurre en escalas de tiempo cortas, puede—como en el ejemplo anterior—experimentar con reducir la media del prior de la longitud de escala. Si necesita mayor fidelidad en las frecuencias que el GP puede capturar, y puede aceptar tiempos de muestreo más largos, también puede aumentar el número de funciones base `model_config['intercept_tvp_config'].m` de 200 (predeterminado) a un número más alto. Finalmente, si cree que tiene eventos que afectan sus ventas en, digamos, dos escalas de tiempo separadas, puede proporcionar una nueva función de covarianza a través de `model_config['intercept_tvp_config'].cov_func`, que es *la suma de dos funciones de covarianza definidas independientemente*—cada una con una media del prior de longitud de escala que coincide con las escalas de tiempo dadas que espera en sus datos.
