Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_counterfactuals.po
Languages: es

source: Nice! We can see that, relative to our 'business as usual` (Step 1 forecast), the MMM predicts that the intervention will lead to an increase in sales. This is a simple example of using an MMM for causal inference - we are predicting the effect of an intervention on future sales.
es: ¡Genial! Podemos ver que, en relación con nuestro 'negocio como siempre' (pronóstico del Paso 1), el MMM predice que la intervención conducirá a un aumento en las ventas. Este es un ejemplo simple de cómo utilizar un MMM para inferencia causal: estamos prediciendo el efecto de una intervención en las ventas futuras.

source: For much more information on using Level 2 of the causal ladder, see the dedicated notebook on {ref}`mmm_budget_allocation_example`.
es: Para obtener mucha más información sobre el uso del Nivel 2 de la escalera causal, consulte el cuaderno dedicado en {ref}`mmm_budget_allocation_example`.

source: Level 3 - Counterfactual inference
es: Nivel 3 - Inferencia contrafactual

source: Finally we are at the top of the ladder! We will now use our MMM to estimate the effect of a previous intervention. Remember, our historical dataset includes a period where we increased media spend on $x_1$ by 40%. We will use our MMM to estimate the effect of this intervention on sales.
es: ¡Finalmente estamos en la cima de la escalera! Ahora utilizaremos nuestro MMM para estimar el efecto de una intervención previa. Recuerde que nuestro conjunto de datos históricos incluye un período en el que aumentamos el gasto en medios en $x_1$ en un 40%. Utilizaremos nuestro MMM para estimar el efecto de esta intervención en las ventas.

source: To do this, we will compare what _actually_ happened, to what we think _would have happened_ under some alternative imagined counterfactual scenario such as not increasing media spend by 40%.
es: Para hacer esto, compararemos lo que _realmente_ sucedió con lo que creemos que _habría sucedido_ bajo algún escenario contrafactual alternativo imaginado, como no aumentar el gasto en medios en un 40%.

source: This requires coming up with a counterfactual scenario where we have to think hard about what the $x_1$ media spend would have been in the absence of the campaign. In real-world situations this might be easy or difficult, depending.
es: Esto requiere idear un escenario contrafactual en el que debemos pensar detenidamente sobre cuál habría sido el gasto en medios de $x_1 en ausencia de la campaña. En situaciones del mundo real, esto puede ser fácil o difícil, dependiendo.

source: Easy: If our marketing spend is predictable, we can simply use our business knowledge to define what the spend would have been in the absence of the campaign.
es: Fácil: Si nuestro gasto en marketing es predecible, simplemente podemos utilizar nuestro conocimiento empresarial para definir cuál habría sido el gasto en ausencia de la campaña.

source: Difficult: If our marketing spend is unpredictable, we might have to use a more sophisticated model to predict what the spend would have been in the absence of the campaign. There are ways of doing this, but it is a bit of a side-quest, so is beyond the scope of this notebook.
es: Difícil: Si nuestro gasto en marketing es impredecible, podríamos tener que utilizar un modelo más sofisticado para predecir cuál habría sido el gasto en ausencia de la campaña. Hay formas de hacerlo, pero es un poco una misión secundaria, por lo que está más allá del alcance de este cuaderno.

source: In our case, we will take the easy route. Because we simulated the data, we already know what our media spend would have been in the absence of the campaign. We can use this information to define our counterfactual scenario. This allows us to take a parameter recovery approach - we will be able to compare the model's counterfactual predictions to ground truth.
es: En nuestro caso, tomaremos el camino fácil. Debido a que simulamos los datos, ya sabemos cuál habría sido nuestro gasto en medios en ausencia de la campaña. Podemos utilizar esta información para definir nuestro escenario contrafactual. Esto nos permite adoptar un enfoque de recuperación de parámetros: podremos comparar las predicciones contrafactuales del modelo con la verdad objetiva.

source: Parameter recovery
es: Recuperación de parámetros

source: The logic of running through these steps on simulated actual and counterfactual data is that we can compare the MMM's ability to estimate the causal impact of the marketing campaign to the true causal impact that we know because we simulated the data. If we do ok here, we can be more confident that the MMM will be able to estimate the causal impact of the marketing campaign on real data where only the actual data is available.
es: La lógica de seguir estos pasos con datos simulados reales y contrafactuales es que podemos comparar la capacidad del MMM para estimar el impacto causal de la campaña de marketing con el verdadero impacto causal que conocemos porque simulamos los datos. Si lo hacemos bien aquí, podemos tener más confianza en que el MMM podrá estimar el impacto causal de la campaña de marketing en datos reales donde solo están disponibles los datos reales.

source: Let's make that more real by visualizing the `x1` and `x2` predictors, along with the `y` outcome variable. This is done for both the actual and counterfactual scenarios. We can see that there is divergence in the media spend in `x1` during the campaign period and also for the outcome variable `y`. The difference between the outcome in the actual and counterfactual scenarios is the causal effect of the marketing campaign (bottom plot).
es: Hagamos esto más real al visualizar los predictores `x1` y `x2`, junto con la variable de resultado `y`. Esto se realiza tanto para los escenarios reales como para los contrafactuales. Podemos observar que hay una divergencia en el gasto en medios en `x1` durante el período de la campaña y también para la variable de resultado `y`. La diferencia entre el resultado en los escenarios real y contrafactual es el efecto causal de la campaña de marketing (gráfico inferior).

source: Notice in the bottom plot that the causal impact of the campaign continues on for a short duration after the campaign as ended. This is a direct result of the adstock function in the MMM which models the lagged effect of media spend on sales. Similarly, there is a slight lag effect at the start of the campaign. There is also noise in the causal impact - this makes sense because the way how we similated this data was based on changes in media spend, not on a specified level of sales difference.
es: Observe en el gráfico inferior que el impacto causal de la campaña continúa durante un corto período después de que la campaña ha terminado. Esto es un resultado directo de la función de adstock en el MMM, que modela el efecto rezagado del gasto en medios sobre las ventas. De manera similar, hay un ligero efecto rezagado al inicio de la campaña. También hay ruido en el impacto causal; esto tiene sentido porque la forma en que simulamos estos datos se basó en cambios en el gasto en medios, no en un nivel específico de diferencia en ventas.

source: Now we want to evaluate what the model thinks would have happened in the counterfactual scenario that the intervention did not take place. For this, we will use the counterfactual spend in `df.x1`. But remember, in a real-world scenario, we would not have access to this data and so we would have to estimate it as discussed above.
es: Ahora queremos evaluar qué piensa el modelo que habría sucedido en el escenario contrafactual en el que la intervención no tuvo lugar. Para esto, utilizaremos el gasto contrafactual en `df.x1`. Pero recuerde, en un escenario del mundo real, no tendríamos acceso a estos datos y, por lo tanto, tendríamos que estimarlos como se discutió anteriormente.

source: The command below effectively uses the do-operator to intervene on the DAG and set `x1` to the counterfactual spend, and use the model to predict what the sales would have been in the counterfactual scenario.
es: El comando a continuación utiliza de manera efectiva el operador do para intervenir en el DAG y establecer `x1` en el gasto contrafactual, y usar el modelo para predecir cuáles habrían sido las ventas en el escenario contrafactual.

source: Now we have the actual sales data, and our predicted sales in the counterfactual scenario, we can calculate the causal impact of the intervention. This is done by comparing the actual sales to the predicted sales in the counterfactual scenario.
es: Ahora que tenemos los datos de ventas reales y nuestras ventas predichas en el escenario contrafactual, podemos calcular el impacto causal de la intervención. Esto se realiza comparando las ventas reales con las ventas predichas en el escenario contrafactual.

source: **Top plot:** The top plot shows the actual sales data (black line), the posterior predicted sales under the actual scenario (blue shaded region), and the posterior predicted sales under the counterfactual scenario (orange shaded region). We might be able to see that the model predicts lower sales in the counterfactual scenario than in the actual scenario. This makes sense because the counterfactual scenario is one where we did not conduct the marketing campaign - so lower sales in this case would be expected.
es: **Gráfico superior:** El gráfico superior muestra los datos de ventas reales (línea negra), las ventas predichas posteriores bajo el escenario actual (región sombreada en azul) y las ventas predichas posteriores bajo el escenario contrafactual (región sombreada en naranja). Podríamos observar que el modelo predice ventas más bajas en el escenario contrafactual que en el escenario actual. Esto tiene sentido porque el escenario contrafactual es aquel en el que no realizamos la campaña de marketing, por lo que se esperarían ventas más bajas en este caso.

source: **Middle plot:** The middle plot shows the difference between the actual and counterfactual sales. This is the causal impact of the marketing campaign. We can see that the model predicts a positive causal impact of the marketing campaign. We can also see that the model predicts negligible causal impact of the marketing capaign before the campaign started - this makes total sense but it is important to check that we don't have some unexpected causal impact before the campaign started.
es: **Gráfico del medio:** El gráfico del medio muestra la diferencia entre las ventas reales y las contrafactuales. Este es el impacto causal de la campaña de marketing. Podemos ver que el modelo predice un impacto causal positivo de la campaña de marketing. También podemos observar que el modelo predice un impacto causal negligible de la campaña de marketing antes de que comenzara la campaña; esto tiene total sentido, pero es importante verificar que no tengamos algún impacto causal inesperado antes de que comenzara la campaña.

source: **Bottom plot:** The bottom plot shows the estimated cumulative causal impact from the start of the campaign. And because we simulated the data and know the true causal impact, we can see that the model is doing a good job.
es: **Gráfico inferior:** El gráfico inferior muestra el impacto causal acumulado estimado desde el inicio de la campaña. Y dado que simulamos los datos y conocemos el verdadero impacto causal, podemos ver que el modelo está funcionando bien.

source: Summary
es: Resumen

source: In this notebook, we've recapped Pearl's causal ladder and seen how different levels of causal reasoning can be applied to solve business problems with MMMs. We've seen how MMMs can be used to predict future sales (Step 1), optimize marketing spend (Step 2), and evaluate the impact of marketing campaigns (Step 3).
es: En este cuaderno, hemos resumido la escalera causal de Pearl y hemos visto cómo se pueden aplicar diferentes niveles de razonamiento causal para resolver problemas empresariales con MMMs. Hemos observado cómo se pueden utilizar los MMMs para predecir ventas futuras (Paso 1), optimizar el gasto en marketing (Paso 2) y evaluar el impacto de las campañas de marketing (Paso 3).

source: We saw how counterfactual inference can be used to estimate the causal impact of marketing campaigns. In this notebook we used "God Mode" to simulate a world where we had knowledge of the counterfactual scenario - but in real world use cases we may have to estimate what the media spend would have been had we not run a marketing campaign.
es: Vimos cómo la inferencia contrafactual puede ser utilizada para estimar el impacto causal de las campañas de marketing. En este cuaderno utilizamos el "Modo Dios" para simular un mundo en el que teníamos conocimiento del escenario contrafactual, pero en casos de uso del mundo real, es posible que tengamos que estimar cuál habría sido el gasto en medios si no hubiéramos realizado una campaña de marketing.

source: Of course, the methods demonstrated here can be used in other ways. An immediate one that comes to mind is to evaluate the causal impact of our past media spending by comparing it to a counterfactual scenario of zero media spend (on one or multiple channels), for example.
es: Por supuesto, los métodos demostrados aquí pueden utilizarse de otras maneras. Una inmediata que viene a la mente es evaluar el impacto causal de nuestro gasto en medios pasados comparándolo con un escenario contrafactual de gasto en medios cero (en uno o múltiples canales), por ejemplo.

source: We hope you see how this can be a powerful tool for businesses to understand the impact of their marketing efforts and make data-driven decisions.
es: Esperamos que vea cómo esto puede ser una herramienta poderosa para que las empresas comprendan el impacto de sus esfuerzos de marketing y tomen decisiones basadas en datos.
