Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_sensitivity_analysis.po
Languages: es

source: Understanding your MMM: Sensitivity Analysis and Marginal Effects
es: Entendiendo su MMM: Análisis de Sensibilidad y Efectos Marginales

source: Extracting insights to drive business decisions is a primary goal of any MMM. PyMC-Marketing already offers a powerful suite of tools for this, including:
es: Extraer información para impulsar decisiones comerciales es un objetivo principal de cualquier MMM. PyMC-Marketing ya ofrece un conjunto potente de herramientas para esto, que incluye:

source: Driver contributions: Understanding how much each channel or factor is contributing to the outcome.
es: Contribuciones de los controladores: Comprender cuánto está contribuyendo cada canal o factor al resultado.

source: Return on Ad Spend (ROAS): Quantifying the financial return of your media investments.
es: Retorno de la Inversión en Publicidad (ROAS): Cuantificando el retorno financiero de sus inversiones en medios.

source: Saturation curves: Visualizing how the impact of media spend changes at different spend levels (e.g., diminishing returns).
es: Curvas de saturación: Visualizando cómo el impacto del gasto en medios cambia a diferentes niveles de gasto (por ejemplo, rendimientos decrecientes).

source: However, in many real-world cases, we want to go beyond these summaries. Marketers and analysts frequently ask:
es: Sin embargo, en muchos casos del mundo real, queremos ir más allá de estos resúmenes. Los especialistas en marketing y los analistas preguntan con frecuencia:

source: "What would have happened if we had spent 10% less on media last month?"
es: ¿Qué habría pasado si hubiéramos gastado un 10% menos en medios el mes pasado?

source: "What would the effect of lowering the free shipping threshold by $5 have been?"
es: ¿Cuál habría sido el efecto de reducir el umbral de envío gratuito en $5?

source: "Are we still getting good incremental returns at current spend levels, or have we hit diminishing returns?"
es: ¿Seguimos obteniendo buenos rendimientos incrementales con los niveles de gasto actuales, o hemos alcanzado rendimientos decrecientes?

source: These questions focus on hypothetical scenarios of what would have happened under different conditions. As such, they are a clear form of **[sensitivity analysis](https://en.wikipedia.org/wiki/Sensitivity_analysis)**. Given that we focus on _retrospective_ predictions, these questions are "Step 3" on Pearl's causal ladder (see the [MMMs and Pearl's ladder of causal inference](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_counterfactuals.html) docs). The basic idea is that we can use our model (and what it has learned from the data) to simulate how the outcome would have changes under various peterbations of the driver variables.
es: Estas preguntas se centran en escenarios hipotéticos de lo que habría sucedido bajo diferentes condiciones. Como tal, son una forma clara de **[análisis de sensibilidad](https://en.wikipedia.org/wiki/Sensitivity_analysis)**. Dado que nos enfocamos en predicciones _retrospectivas_, estas preguntas son "Paso 3" en la escalera causal de Pearl (consulte la documentación sobre [MMMs y la escalera de inferencia causal de Pearl](https://www.pymc-marketing.io/en/stable/notebooks/mmm/mmm_counterfactuals.html)). La idea básica es que podemos usar nuestro modelo (y lo que ha aprendido de los datos) para simular cómo habría cambiado el resultado bajo varias perturbaciones de las variables impulsoras.

source: Rather than just considering a single peterbation (e.g., "what if we had spent 10% less on a given media channel"), sensitivity analysis allows us to explore a range of scenarios. So instead we could evaluate our predictions given a **sweep** of possible peterbations. For example, "what if we had spent [0.5, 0.75, 1.0, 1.25, 2.0] times as much on a given media channel?"
es: En lugar de considerar una sola perturbación (por ejemplo, "¿qué pasaría si hubiéramos gastado un 10% menos en un canal de medios determinado?"), el análisis de sensibilidad nos permite explorar una gama de escenarios. Así que, en su lugar, podríamos evaluar nuestras predicciones dado un **barrido** de posibles perturbaciones. Por ejemplo, "¿qué pasaría si hubiéramos gastado [0.5, 0.75, 1.0, 1.25, 2.0] veces más en un canal de medios determinado?"

source: We introduce a flexible tool that allows you to:
es: Le presentamos una herramienta flexible que le permite:

source: Perform counterfactual sweeps across a range of predictor values (e.g., scaling media spend up/down or adjusting business levers like pricing).
es: Realice barridos contrafactuales a través de una variedad de valores predictivos (por ejemplo, aumentando/disminuyendo el gasto en medios o ajustando palancas comerciales como los precios).

source: Visualize both the total expected impact of these interventions.
es: Visualice tanto el impacto total esperado de estas intervenciones.

source: Compute marginal effects—showing the instantaneous rate of change in the outcome as you adjust a predictor.
es: Calcular efectos marginales—mostrando la tasa de cambio instantánea en el resultado a medida que ajusta un predictor.

source: This approach complements the built-in PyMC-Marketing tools by providing scenario-based insights that help you answer "what if?" questions with precision and clarity.
es: Este enfoque complementa las herramientas integradas de PyMC-Marketing al proporcionar información basada en escenarios que le ayuda a responder preguntas de "¿qué pasaría si?" con precisión y claridad.

source: Setting the scene with an example dataset
es: Estableciendo el escenario con un conjunto de datos de ejemplo

source: In this example, we model weekly sales for a direct-to-consumer (DTC) brand that invests in influencer marketing while also adjusting its free shipping policy to drive conversions.
es: En este ejemplo, modelamos las ventas semanales para una marca de venta directa al consumidor (DTC) que invierte en marketing de influencers mientras también ajusta su política de envío gratuito para impulsar las conversiones.

source: Our media variable is **Influencer Spend**, which typically exhibits non-linear effects due to factors like audience saturation and delayed impact, making it a good candidate for adstock and saturation transformations.
es: Nuestra variable de medios es **Gasto en Influencers**, que típicamente presenta efectos no lineales debido a factores como la saturación de la audiencia y el impacto retrasado, lo que la convierte en una buena candidata para transformaciones de adstock y saturación.

source: As a control variable, we include the **Free Shipping Threshold** — the minimum order value required for customers to qualify for free shipping. This is a fully controllable business lever and is expected to have a more linear relationship with sales: lowering the threshold generally increases conversion rates in a predictable way.
es: Como variable de control, incluimos el **Umbral de Envío Gratis** — el valor mínimo de pedido requerido para que los clientes califiquen para el envío gratis. Este es un factor empresarial completamente controlable y se espera que tenga una relación más lineal con las ventas: reducir el umbral generalmente aumenta las tasas de conversión de manera predecible.

source: By examining the marginal effects of media spend and shipping policy, we can provide actionable insights into how each lever contributes to overall performance.
es: Al examinar los efectos marginales del gasto en medios y la política de envío, podemos proporcionar información práctica sobre cómo cada palanca contribuye al rendimiento general.

source: So our causal MMM will look like this:
es: Así que nuestro MMM causal se verá así:

source: Why Marginal Effects Matter: going beyond raw media curves
es: Por qué importan los efectos marginales: yendo más allá de las curvas de medios brutos

source: In Media Mix Models (MMM), we're often interested in understanding how each marketing input (like advertising spend) drives business outcomes. A common way to explore this is by looking at the inferred response curves, such as the saturation curve for media spend. These curves show how total sales respond to increasing investment, accounting for effects like diminishing returns and adstock.
es: En los Modelos de Mezcla de Medios (MMM), a menudo estamos interesados en comprender cómo cada insumo de marketing (como el gasto en publicidad) impulsa los resultados comerciales. Una forma común de explorar esto es observando las curvas de respuesta inferidas, como la curva de saturación para el gasto en medios. Estas curvas muestran cómo las ventas totales responden a un aumento en la inversión, teniendo en cuenta efectos como los rendimientos decrecientes y el adstock.

source: But while these plots are useful, they can be misleading or incomplete when used in isolation.
es: Pero aunque estos gráficos son útiles, pueden ser engañosos o incompletos cuando se utilizan de forma aislada.

source: The reason? Response curves tell you the absolute level of impact across different spend amounts, but they don’t directly tell you the incremental impact of a small change in spend at any given point. This distinction is crucial. For example:
es: La razón es la siguiente: las curvas de respuesta te indican el nivel absoluto de impacto en diferentes cantidades de gasto, pero no te dicen directamente el impacto incremental de un pequeño cambio en el gasto en un momento dado. Esta distinción es crucial. Por ejemplo:

source: A saturation curve might look steep at low spend levels and flatten out at higher spend—but the exact slope at a specific point (e.g., \$50,000 per week) tells you the real-world payoff of spending an extra \$1,000 right now.
es: Una curva de saturación puede parecer empinada en niveles de gasto bajos y aplanarse en niveles de gasto más altos, pero la pendiente exacta en un punto específico (por ejemplo, \$50,000 por semana) te indica el rendimiento real de gastar un extra de \$1,000 en este momento.

source: In cases where multiple inputs are at play (like media spend and pricing changes), response curves for one variable don't show you how interactions or current levels of other variables might affect its marginal impact.
es: En casos donde múltiples entradas están en juego (como el gasto en medios y los cambios de precios), las curvas de respuesta para una variable no muestran cómo las interacciones o los niveles actuales de otras variables podrían afectar su impacto marginal.

source: Marginal effects zero in on this slope—the instantaneous rate of change. They answer questions like:
es: Los efectos marginales se centran en esta pendiente: la tasa de cambio instantánea. Responden a preguntas como:

source: How much additional sales do I gain if I increase influencer spend by 10% next week?
es: ¿Cuánto aumento en ventas adicionales obtengo si incremento el gasto en influencers en un 10% la próxima semana?

source: What's the expected lift if I lower the free shipping threshold by \$5 right now?
es: ¿Cuál es el aumento esperado si reduzco el umbral de envío gratuito en \$5 ahora mismo?

source: These insights are only accessible through marginal effects because they reflect the dynamic, context-sensitive responsiveness of the model:
es: Estos conocimientos solo son accesibles a través de efectos marginales porque reflejan la capacidad de respuesta dinámica y sensible al contexto del modelo:

source: For media inputs with non-linear transformations (like adstock + saturation), marginal effects show how effectiveness varies across the spend range—revealing whether you're still in the high-ROI zone or have hit diminishing returns.
es: Para las entradas de medios con transformaciones no lineales (como adstock + saturación), los efectos marginales muestran cómo varía la efectividad a lo largo del rango de gasto, revelando si aún te encuentras en la zona de alto ROI o si has alcanzado rendimientos decrecientes.

source: For controllable non-media levers (like pricing or shipping policies), marginal effects provide precise, actionable estimates for how tweaks to these levers impact outcomes—even if their overall relationship is more linear.
es: Para palancas no mediáticas controlables (como políticas de precios o de envío), los efectos marginales proporcionan estimaciones precisas y accionables sobre cómo los ajustes a estas palancas impactan los resultados, incluso si su relación general es más lineal.

source: In other words, while a response curve is like a map of the terrain, marginal effects tell you whether it's worth climbing that next hill. They enable surgical precision in decision-making, ensuring that marketers don't just see where their efforts sit on a curve—but understand whether pushing harder in a particular direction is still worthwhile.
es: En otras palabras, mientras que una curva de respuesta es como un mapa del terreno, los efectos marginales te indican si vale la pena escalar esa próxima colina. Permiten una precisión quirúrgica en la toma de decisiones, asegurando que los mercadólogos no solo vean dónde se sitúan sus esfuerzos en una curva, sino que comprendan si seguir presionando en una dirección particular sigue siendo valioso.

source: By incorporating marginal effects into MMM outputs, we move from a static understanding of media performance to a dynamic, context-aware view that directly informs resource allocation and strategic adjustments.
es: Al incorporar efectos marginales en los resultados de MMM, pasamos de una comprensión estática del rendimiento de los medios a una visión dinámica y consciente del contexto que informa directamente sobre la asignación de recursos y los ajustes estratégicos.

source: Generate simulated data
es: Generar datos simulados

source: And here are the first 5 rows of the synthetic dataset:
es: Y aquí están las primeras 5 filas del conjunto de datos sintético:

source: And we can plot the data to get a better sense for the data:
es: Y podemos graficar los datos para tener una mejor comprensión de la información:

source: Build and fit the MMM
es: Construya y ajuste el MMM

source: Sensitivity analysis and marginal effects
es: Análisis de sensibilidad y efectos marginales

source: A multiplicative sweep on influencer spend
es: Un barrido multiplicativo sobre el gasto en influencers

source: The code above saves its results into a new group in the `mmm.idata` called `sensitivity_analysis`. You can explore it below:
es: El código anterior guarda sus resultados en un nuevo grupo en el `mmm.idata` llamado `sensitivity_analysis`. Puedes explorarlo a continuación:

source: And of course, you can plot the results! To demonstrate some of the plotting options we'll plot using the default y-axis scale of absolute sales as well as on a percentage change scale.
es: Y, por supuesto, ¡puede graficar los resultados! Para demostrar algunas de las opciones de graficado, utilizaremos la escala del eje y predeterminada de ventas absolutas, así como una escala de cambio porcentual.

source: The figure above shows the total expected uplift (it can be positive or negative) for the outcome variable as a function of the sweep values provided. In this case, we used a multiplicative sweep, so the curve is showing how the total outcome would vary if we multiply up (sweep values > 1) or down (sweep values < 1) the influencer spend by the set of values we asked for.
es: La figura anterior muestra el aumento total esperado (puede ser positivo o negativo) para la variable de resultado como una función de los valores de barrido proporcionados. En este caso, utilizamos un barrido multiplicativo, por lo que la curva muestra cómo variaría el resultado total si multiplicamos hacia arriba (valores de barrido > 1) o hacia abajo (valores de barrido < 1) el gasto en influenciadores por el conjunto de valores que solicitamos.

source: Intuitively, if we multiply the influence spend by 1.0 then on average we expect no change. If we scale the spend down then we expect negative uplift (i.e., lower sales) and if we scale the spend up then we expect positive uplift (i.e., higher sales). The fact that the curve is curved (not linear) is primarily the result of the saturation function on the influencer spend variable.
es: Intuitivamente, si multiplicamos el gasto en influencia por 1.0, entonces, en promedio, no esperamos ningún cambio. Si reducimos el gasto, entonces esperamos un aumento negativo (es decir, menores ventas) y si aumentamos el gasto, entonces esperamos un aumento positivo (es decir, mayores ventas). El hecho de que la curva sea curva (no lineal) es principalmente el resultado de la función de saturación en la variable de gasto en influenciadores.

source: We can also plot the corresponding marginal effects as below:
es: También podemos trazar los efectos marginales correspondientes como se muestra a continuación:

source: This plot shows the instantaneous rate of change in the outcome variable as we adjust the influencer spend. The y-axis represents the marginal effect, which tells us how much additional sales we expect for a small increase in influencer spend at each point along the sweep values.
es: Este gráfico muestra la tasa de cambio instantánea en la variable de resultado a medida que ajustamos el gasto en influencers. El eje y representa el efecto marginal, que nos indica cuánto aumento adicional en ventas esperamos por un pequeño incremento en el gasto en influencers en cada punto a lo largo de los valores de barrido.

source: We can see that the highest marginal effects occur on the left side of the plot where we the influence spend is zero or very low. The highest incremental/marginal effects are obtained when we go from no spend to some spend. As we would expect from the previous plot, we still get incremental returns at the current spend levels (multiplicative change of 1.0), and are quite far away from totally saturating this channel - the marginal spend doesn't reduce to near zero even if we consider a 2x increase in spend.
es: Podemos ver que los efectos marginales más altos ocurren en el lado izquierdo del gráfico, donde la influencia del gasto es cero o muy baja. Los efectos incrementales/marginales más altos se obtienen cuando pasamos de no gastar a gastar algo. Como esperaríamos del gráfico anterior, todavía obtenemos retornos incrementales en los niveles actuales de gasto (cambio multiplicativo de 1.0), y estamos bastante lejos de saturar completamente este canal; el gasto marginal no se reduce a cerca de cero incluso si consideramos un aumento del gasto de 2x.

source: An absolute sweep on influencer spend
es: Un control absoluto sobre el gasto en influencers

source: The sensitivity analysis we conducted above involved a _multiplicative sweep_ of the influencer spend variable, meaning we varied it by multiplying it by a set of values. However, we can also conduct a _absolute sweep_. Here, we set all historical values of the influencer spend variable to fixed values (given in the `sweep_values` argument) and then compute the expected outcome and marginal effects.
es: El análisis de sensibilidad que realizamos anteriormente involucró un _barrido multiplicativo_ de la variable de gasto de influencers, lo que significa que la variamos multiplicándola por un conjunto de valores. Sin embargo, también podemos realizar un _barrido absoluto_. Aquí, establecemos todos los valores históricos de la variable de gasto de influencers en valores fijos (dados en el argumento `sweep_values`) y luego calculamos el resultado esperado y los efectos marginales.

source: The results of the absolute sweep are comparable to (but not the same as) the multiplicative sweep. They key difference in what we are doing is that we overwrite the historical influencer spend values with a constant spend value (one value for each point in the sweep). This means we are not considering a 'realistic' scenario where spend fluctuates over time, but rather a hypothetical scenario where we set the spend to a fixed value for all weeks in the dataset.
es: Los resultados del barrido absoluto son comparables a (pero no iguales a) los del barrido multiplicativo. La diferencia clave en lo que estamos haciendo es que sobrescribimos los valores de gasto de influenciadores históricos con un valor de gasto constante (un valor para cada punto en el barrido). Esto significa que no estamos considerando un escenario 'realista' donde el gasto fluctúa a lo largo del tiempo, sino más bien un escenario hipotético donde establecemos el gasto a un valor fijo para todas las semanas en el conjunto de datos.

source: We can see the change in the plots as well. The top plot is similar to, but not exactly the same as the saturation curve of influencer spend. Notice that there is a certain fixed spend level where the uplift is about zero. This is interesting - we can interpret this as saying that the total sales in the actual scenario would also have been about the same if we had spent that amount (constantly over time) on influencer marketing.
es: Podemos ver el cambio en los gráficos también. El gráfico superior es similar a, pero no exactamente igual a la curva de saturación del gasto en influencers. Observe que hay un cierto nivel de gasto fijo donde el aumento es aproximadamente cero. Esto es interesante: podemos interpretar esto como que las ventas totales en el escenario actual también habrían sido aproximadamente las mismas si hubiéramos gastado esa cantidad (constantemente a lo largo del tiempo) en marketing de influencers.

source: The top plot nicely shows the saturating quality of the saturation function, and the bottom plot shows that as we approach saturation, the marginal effects drop to near zero.
es: El gráfico superior muestra claramente la calidad de saturación de la función de saturación, y el gráfico inferior muestra que a medida que nos acercamos a la saturación, los efectos marginales caen a casi cero.

source: An additive sweep on influencer spend
es: Un barrido aditivo sobre el gasto en influencers

source: We can also consider a sweep of additive changes to the influencer spend variable. This means we adjust the historical values of the influencer spend by adding a fixed amount (given in the `sweep_values` argument) and then compute the expected outcome and marginal effects.
es: También podemos considerar un barrido de cambios aditivos en la variable de gasto de influencers. Esto significa que ajustamos los valores históricos del gasto de influencers añadiendo una cantidad fija (dada en el argumento `sweep_values`) y luego calculamos el resultado esperado y los efectos marginales.

source: Note that care needs to be taken with an additive sweep. It would be easy to apply a negative peterbation which then actually results in negative spend values which have no meaningful interpretation. So it is worthwhile exploring the actual spend values before deciding on the sweep values to be used.
es: Tenga en cuenta que se debe tener cuidado con un barrido aditivo. Sería fácil aplicar una perturbación negativa que luego resulte en valores de gasto negativos que no tienen una interpretación significativa. Por lo tanto, vale la pena explorar los valores de gasto reales antes de decidir sobre los valores de barrido que se utilizarán.

source: In our case, the minimum spend values is \$0, so we will not considervalues in the sweep.
es: En nuestro caso, el valor mínimo de gasto es \$0, por lo que no consideraremos valores en la barrida.
