Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_upper_funnel_causal_approach.po
Languages: es

source: These equations depend not only on the relation between each $X_j$ and $Y$, but also on the **covariance between the predictors** $\operatorname{Cov}(X_1,X_4)$. Hence, the regression is influenced by **pairwise correlations** among the covariates themselves!
es: Estas ecuaciones dependen no solo de la relación entre cada $X_j$ y $Y$, sino también de la **covarianza entre los predictores** $\operatorname{Cov}(X_1,X_4)$. Por lo tanto, la regresión está influenciada por **correlaciones por pares** entre las covariables mismas.

source: Because $X_1$ and $X_4$ are strongly correlated (due to the causal chain $X_1 \to X_4$), and because $Y$ responds **nonlinearly or dynamically** to $X_4$, the regression cannot represent the true relationship $Y = f(X_4)$. The residuals of this misspecification correlate with $X_1$, and part of the nonlinear structure of $f(X_4)$ is then falsely attributed to $X_1$.
es: Porque $X_1$ y $X_4$ están fuertemente correlacionados (debido a la cadena causal $X_1 \to X_4$), y porque $Y$ responde **no lineal o dinámicamente** a $X_4$, la regresión no puede representar la verdadera relación $Y = f(X_4)$. Los residuos de esta especificación incorrecta se correlacionan con $X_1$, y parte de la estructura no lineal de $f(X_4)$ se atribuye erróneamente a $X_1$.

source: In effect:
es: En efecto:

source: $X_4$ is a **mediator** of $X_1$’s effect.
es: $X_4$ es un **mediador** del efecto de $X_1$.

source: Conditioning on $X_4$ **blocks** the true pathway from $X_1$ to $Y$.
es: Condicionar sobre $X_4$ **bloquea** el verdadero camino de $X_1$ a $Y$.

source: Because the regression also balances correlations among predictors, any **nonlinear or lagged pattern** in $Y$ that depends on $X_4$ but is not modeled correctly gets **redistributed** among correlated predictors — primarily $X_1$.
es: Debido a que la regresión también equilibra las correlaciones entre los predictores, cualquier **patrón no lineal o rezagado** en $Y$ que dependa de $X_4$ pero que no esté modelado correctamente se **redistribuye** entre los predictores correlacionados, principalmente $X_1$.

source: **Mathematical intuition:** The regression coefficient of $X_1$ is proportional to the **partial covariance**
es: **Intuición matemática:** El coeficiente de regresión de $X_1$ es proporcional a la **covarianza parcial**

source: and since $Y$ depends nonlinearly on $X_4$ while $X_1$ and $X_4$ are collinear, $\operatorname{Cov}(X_1,\,Y \mid X_4)$ remains positive even if the true direct effect $X_1\!\to\!Y$ is zero. This creates the illusion of a large direct influence of $X_1$.
es: y dado que $Y$ depende de manera no lineal de $X_4$ mientras que $X_1$ y $X_4$ son colineales, $\operatorname{Cov}(X_1,\,Y \mid X_4)$ permanece positivo incluso si el verdadero efecto directo $X_1\!\to\!Y$ es cero. Esto crea la ilusión de una gran influencia directa de $X_1$.

source: The backdoor criterion
es: El criterio de puerta trasera

source: All above logic is frame under the **backdoor criterion** which tells us which variables we must (and must not) adjust for to estimate a causal effect correctly.
es: Toda la lógica anterior se enmarca bajo el **criterio de puerta trasera** que nos indica qué variables debemos (y no debemos) ajustar para estimar correctamente un efecto causal.

source: A set of variables $Z$ satisfies the backdoor criterion for the effect of $X$ on $Y$ if:
es: Un conjunto de variables $Z$ satisface el criterio de puerta trasera para el efecto de $X$ sobre $Y$ si:

source: None of the variables in $Z$ are **effects of $X$** (they must not lie downstream).
es: Ninguna de las variables en $Z$ son **efectos de $X$** (no deben estar en la parte posterior).

source: Once we control for $Z$, there are **no unblocked paths** that start with an arrow *into* $X$ (these are “backdoor paths” representing confounding).
es: Una vez que controlamos por $Z$, no hay **caminos desbloqueados** que comiencen con una flecha *hacia* $X$ (estos son "caminos de puerta trasera" que representan confusión).

source: If these two conditions hold, we can identify the causal effect of $X$ on $Y$ by comparing units with different $X$ values **but the same $Z$**.
es: Si se cumplen estas dos condiciones, podemos identificar el efecto causal de $X$ sobre $Y$ comparando unidades con diferentes valores de $X$ **pero el mismo $Z$**.

source: In our case
es: En nuestro caso

source: To estimate the causal effect of $X_1$ on $Y$:
es: Para estimar el efecto causal de $X_1$ sobre $Y$:

source: We **should adjust** for background factors that affect both $X_1$ and $Y$ (for example, $\mathrm{Trend}_t$ or $\mathrm{Events}_t$).
es: Debemos **ajustar** los factores de fondo que afectan tanto a $X_1$ como a $Y$ (por ejemplo, $\mathrm{Trend}_t$ o $\mathrm{Events}_t$).

source: We **should not adjust** for mediators such as $X_2$, $X_3$, or $X_4$, because these are **effects** of $X_1$.
es: No **debemos ajustar** por mediadores como $X_2$, $X_3$ o $X_4$, porque estos son **efectos** de $X_1$.

source: Mathematically, the causal effect can be expressed as:
es: Matemáticamente, el efecto causal puede expresarse como:

source: where $Z_t$ contains only the valid backdoor variables (common causes, not descendants).
es: donde $Z_t$ contiene únicamente las variables de puerta trasera válidas (causas comunes, no descendientes).

source: In this case, this will imply to estimate the effect of $X4$ on $Y$. Then we could estimate the effect of $X1$ on $X4$ and get the propagation of the effect of $X1$ on $Y$ after.
es: En este caso, esto implicará estimar el efecto de $X4$ en $Y$. Luego podríamos estimar el efecto de $X1$ en $X4$ y obtener la propagación del efecto de $X1$ en $Y$ después.

source: Let's think once more on our dag, $X1$ is the upper funnel channel. $X4$ is the lower funnel channel. $Y$ is the outcome. This means that $X1$ does not have a direct effect on $Y$, but it does have an indirect effect through $X4$. This means, $X4$ mediates the effect of $X1$ on $Y$.
es: Pensemos una vez más en nuestro diagrama, $X1$ es el canal superior del embudo. $X4$ es el canal inferior del embudo. $Y$ es el resultado. Esto significa que $X1$ no tiene un efecto directo sobre $Y$, pero sí tiene un efecto indirecto a través de $X4$. Esto significa que $X4$ media el efecto de $X1$ sobre $Y$.

source: *The minimal adjustment set based on backdoor paths dictates* that we need to estimate the effect of $X4$ on $Y$ easily, a simple linear or nonlinear model would be enough. $Y ~ f(\theta, X4) + \epsilon$ because $X4$ will block all backdoor paths for the rest of variables.
es: *El conjunto de ajuste mínimo basado en caminos de puerta trasera dicta* que necesitamos estimar el efecto de $X4$ en $Y$ fácilmente, un modelo lineal o no lineal simple sería suficiente. $Y ~ f(\theta, X4) + \epsilon$ porque $X4$ bloqueará todos los caminos de puerta trasera para el resto de las variables.

source: Lets see if we can recover the true contribution of $X4$ on $Y$. This will be the most essential step to recover the true contribution of $X1$ on $Y$ after. Here, just as before, we can take our pytensor graph and evaluate it with the values of $X4$ and get the true contribution.
es: Veamos si podemos recuperar la verdadera contribución de $X4$ en $Y$. Este será el paso más esencial para recuperar la verdadera contribución de $X1$ en $Y$ después. Aquí, al igual que antes, podemos tomar nuestro gráfico de pytensor y evaluarlo con los valores de $X4$ y obtener la verdadera contribución.

source: If this outcome block is faithful, its contributions should trace the simulated truth.
es: Si este bloque de resultado es fiel, sus contribuciones deberían seguir la verdad simulada.

source: Great, we can observe that the true value was recovered. Now we can move forward and estimate the effect of $(X_1)$ on $(X_4)$. This is the second essential step before quantifying the contribution of $(X_1)$ to $(Y)$.
es: Excelente, podemos observar que se recuperó el valor verdadero. Ahora podemos avanzar y estimar el efecto de $(X_1)$ en $(X_4)$. Este es el segundo paso esencial antes de cuantificar la contribución de $(X_1)$ a $(Y)$.

source: Now, in real life you don't know the true structural form which generates your data, here I'm taking two choices.
es: Ahora, en la vida real no conoces la verdadera forma estructural que genera tus datos, aquí estoy tomando dos elecciones.

source: I temporarily remove adstock and saturation so the $(X_1 \to X_4)$ relation is linear.
es: Elimino temporalmente el adstock y la saturación para que la relación $(X_1 \to X_4)$ sea lineal.

source: I avoid a levels-on-levels regression like $(X_{4,t} = \beta\,X_{1,t} + \varepsilon_t)$.
es: Evito una regresión de niveles sobre niveles como $(X_{4,t} = \beta\,X_{1,t} + \varepsilon_t)$.

source: This could be translate to *I don't think effect of $x1$ saturates or adstock before impact $x4$*.
es: Esto podría traducirse como *No creo que el efecto de $x1$ se sature o se acumule antes del impacto $x4$*.

source: Let's build this model to see if we can recover the true value.
es: Construyamos este modelo para ver si podemos recuperar el valor verdadero.

source: **Why to build a model using the difference between variables?** If $(X_{1,t})$ and $(X_{4,t})$ are $(I(1))$ and *not* cointegrated, the residual from $(X_{4,t} - \beta X_{1,t})$ remains $(I(1))$. OLS in levels yields invalid inference and a drifting $(\hat\beta)$. First-differencing removes unit roots and yields a stationary relation:
es: **¿Por qué construir un modelo utilizando la diferencia entre variables?** Si $(X_{1,t})$ y $(X_{4,t})$ son $(I(1))$ y *no* están cointegrados, el residuo de $(X_{4,t} - \beta X_{1,t})$ permanece $(I(1))$. OLS en niveles produce inferencias inválidas y un $(\hat\beta)$ que se desvía. La diferenciación primera elimina raíces unitarias y produce una relación estacionaria:

source: where $(\eta_t)$ is $(I(0))$. Under standard exogeneity of innovations, OLS consistently estimates the **total instantaneous effect** $(\beta)$ of $(X_1)$ on $(X_4)$. In practice, $\alpha \neq 0$ because drifts in the level processes translate into a nonzero mean in differences.
es: donde $(\eta_t)$ es $(I(0))$. Bajo la exogeneidad estándar de las innovaciones, OLS estima consistentemente el **efecto instantáneo total** $(\beta)$ de $(X_1)$ sobre $(X_4)$. En la práctica, $\alpha eq 0$ porque las derivadas en los procesos de nivel se traducen en una media no nula en las diferencias.

source: We can plot the posterior distribution of the beta to see if the true value was recovered. Because the data generation process is linear, we can calculate the true coefficient of $x1$ over $x4$ doing ( $\beta_{1,2} * \beta_{2,4} * \beta_{1,3} * \beta_{3,4}$ )
es: Podemos trazar la distribución posterior del beta para ver si se recuperó el valor verdadero. Dado que el proceso de generación de datos es lineal, podemos calcular el coeficiente verdadero de $x1$ sobre $x4$ haciendo ( $\beta_{1,2} * \beta_{2,4} * \beta_{1,3} * \beta_{3,4}$ )

source: The posterior settles near the ground truth—which is what we’d hope if our story is coherent. Now, what? Armed with the mediated beta, we translate awareness into downstream pressure over time, in‑sample and beyond.
es: El posterior se establece cerca de la verdad fundamental, que es lo que esperaríamos si nuestra historia es coherente. Ahora, ¿qué? Armados con la beta mediada, traducimos la conciencia en presión descendente a lo largo del tiempo, dentro de la muestra y más allá.

source: Let's create the xarray with proper broadcasting for chain, draw, date dimensions.
es: Creemos el xarray con la difusión adecuada para las dimensiones de cadena, dibujo y fecha.

source: Now, we got the estimated contribution of $X1$ on $X4$. Let's plot against the true contribution of $X1$ on $X4$.
es: Ahora, tenemos la contribución estimada de $X1$ sobre $X4$. Vamos a graficar en comparación con la verdadera contribución de $X1$ sobre $X4$.

source: Great, we can see that the estimated contribution is very close to the true contribution in the in-sample period. We can do the same for the out-of-sample period, and using the out of sample period, we can check if we recovered the causal effect of $X1$ on $Y$.
es: Excelente, podemos ver que la contribución estimada está muy cerca de la verdadera contribución en el período de muestra. Podemos hacer lo mismo para el período fuera de muestra, y utilizando el período fuera de muestra, podemos verificar si recuperamos el efecto causal de $X1$ sobre $Y$.

source: This estimations tell us how much $X1$ is contributing to $X4$ in the out-of-sample period. If we want to ask the causal question, we need a counterfactual: What would $X4$ have been if awareness had gone to zero? We can do this by taking the original value of $X4$ and subtracting the estimated contribution of $X1$ on $X4$.
es: Estas estimaciones nos indican cuánto está contribuyendo $X1$ a $X4$ en el período fuera de muestra. Si queremos plantear la pregunta causal, necesitamos un contrafactual: ¿Qué habría sido $X4$ si la concienciación hubiera llegado a cero? Podemos hacer esto tomando el valor original de $X4$ y restando la contribución estimada de $X1$ sobre $X4$.

source: We send that counterfactual $X_4$ under $do(X_1=0)$ through the outcome model to obtain $Y$ under $do(X_1=0)$ as consequence. Then the causal effect will be $Y|do(X_1=1) - Y|do(X_1=0)$.
es: Enviamos ese contrafactual $X_4$ bajo $do(X_1=0)$ a través del modelo de resultados para obtener $Y$ bajo $do(X_1=0)$ como consecuencia. Entonces, el efecto causal será $Y|do(X_1=1) - Y|do(X_1=0)$.

source: We'll compute the true influence of $X_1$ on $Y$ by our true pytensor graph, and finally, we'll compare the recovered effect with the true effect.
es: Calcularemos la verdadera influencia de $X_1$ sobre $Y$ mediante nuestro verdadero gráfico de pytensor y, finalmente, compararemos el efecto recuperado con el efecto verdadero.

source: Let's plot the recovered effect against the true effect, side‑by‑side.
es: Vamos a trazar el efecto recuperado frente al efecto verdadero, uno al lado del otro.

source: This is great, we can see that the recovered effect is very close to the true effect in the in-sample period. We can do the same for the out-of-sample period, and using the out of sample period, we observe the causal effect of $X1$ on $Y$ was properly recovered.
es: Esto es excelente, podemos ver que el efecto recuperado está muy cerca del efecto verdadero en el período de muestra. Podemos hacer lo mismo para el período fuera de muestra, y utilizando el período fuera de muestra, observamos que el efecto causal de $X1$ sobre $Y$ fue correctamente recuperado.

source: In this tutorial we showed that it is possible to recover high‑level, upper‑funnel impacts even when the observed target is a lower‑funnel KPI. By explicitly modeling mediation and then propagating that signal through the outcome model, we captured the causal contribution of upper‑funnel activity from low‑level targets.
es: En este tutorial mostramos que es posible recuperar impactos de alto nivel y de embudo superior incluso cuando el objetivo observado es un KPI de embudo inferior. Al modelar explícitamente la mediación y luego propagar esa señal a través del modelo de resultados, capturamos la contribución causal de la actividad de embudo superior a partir de objetivos de bajo nivel.

source: **Estimate mediated effect**: quantify the link from awareness to a downstream mediator and recover its contribution.
es: **Efecto mediado estimado**: cuantificar el vínculo desde la conciencia hasta un mediador posterior y recuperar su contribución.

source: **Propagate to outcomes**: translate the mediated effect into expected pressure on the final target via the MMM.
es: **Propagar a resultados**: traducir el efecto mediado en la presión esperada sobre el objetivo final a través del MMM.

source: **Causal counterfactuals**: compare against do‑operator counterfactuals to measure upper‑funnel lift credibly.
es: **Contrafactuales causales**: comparar con contrafactuales del operador do para medir de manera creíble el aumento en la parte superior del embudo.

source: This makes upper‑funnel value measurable alongside performance channels, improving attribution, forecasting, and budget decisions while keeping the model grounded in causal structure.
es: Esto hace que el valor del embudo superior sea medible junto con los canales de rendimiento, mejorando la atribución, la previsión y las decisiones presupuestarias, mientras mantiene el modelo fundamentado en una estructura causal.
