Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_evaluation.po
Languages: es

source: Model Evaluation in PyMC-Marketing
es: Evaluación del Modelo en PyMC-Marketing

source: This notebook demonstrates how to evaluate Marketing Mix Models using PyMC-Marketing's evaluation metrics and functions. We'll cover:
es: Este cuaderno demuestra cómo evaluar Modelos de Mezcla de Marketing utilizando las métricas y funciones de evaluación de PyMC-Marketing. Cubriremos:

source: Standard evaluation metrics (RMSE, MAE, MAPE)
es: Métricas de evaluación estándar (RMSE, MAE, MAPE)

source: Normalized metrics (NRMSE, NMAE)
es: Métricas normalizadas (NRMSE, NMAE)

source: Calculating and visualizing metric distributions and summaries of those distributions
es: Calculando y visualizando distribuciones métricas y resúmenes de esas distribuciones

source: Creating evaluation plots (prior vs posterior plots)
es: Creando gráficos de evaluación (gráficos de prior vs posterior)

source: First, let's import the necessary libraries:
es: Primero, importemos las bibliotecas necesarias:

source: Setting up a Demo Model
es: Configurando un Modelo de Demostración

source: Let's first create a simple MMM model using the example dataset:
es: Primero, creemos un modelo MMM simple utilizando el conjunto de datos de ejemplo:

source: Understanding the Evaluation Metrics
es: Comprendiendo las Métricas de Evaluación

source: PyMC-Marketing provides several metrics for evaluating your models:
es: PyMC-Marketing proporciona varias métricas para evaluar sus modelos:

source: Standard metrics from scikit-learn:
es: Métricas estándar de scikit-learn:

source: RMSE (Root Mean Squared Error)
es: RMSE (Error Cuadrático Medio)

source: MAE (Mean Absolute Error)
es: MAE (Error Absoluto Medio)

source: MAPE (Mean Absolute Percentage Error)
es: MAPE (Error Porcentual Absoluto Medio)

source: Bayesian R-Squared (from `arviz.az.r2_score`)
es: R-Cuadrado Bayesiano (de `arviz.az.r2_score`)

source: Normalized metrics:
es: Métricas normalizadas:

source: NRMSE (Normalized Root Mean Squared Error), such as is used by Robyn
es: NRMSE (Error Cuadrático Medio Normalizado), tal como lo utiliza Robyn

source: NMAE (Normalized Mean Absolute Error)
es: NMAE (Error Absoluto Medio Normalizado)

source: Let's calculate these metrics for our model:
es: Calculemos estas métricas para nuestro modelo:

source: `compute_summary_metrics` actually combines the steps of two other functions:
es: `compute_summary_metrics` en realidad combina los pasos de dos otras funciones:

source: `calculate_metric_distributions`
es: calcular_distribuciones_métricas

source: `summarize_metric_distributions`
es: resumir_distribuciones_métricas

source: The metric distributions (unsummarised) can sometimes be useful on their own, e.g. if you'd like to visualise the distribution of a metric.
es: Las distribuciones métricas (no resumidas) pueden ser útiles por sí solas en ocasiones, por ejemplo, si desea visualizar la distribución de una métrica.

source: Understanding Metric Distributions in Bayesian Models
es: Comprendiendo las Distribuciones Métricas en Modelos Bayesianos

source: In Bayesian modeling, we tend to work with distributions rather than point estimates. This is particularly important for model evaluation metrics because:
es: En el modelado bayesiano, tendemos a trabajar con distribuciones en lugar de estimaciones puntuales. Esto es particularmente importante para las métricas de evaluación del modelo porque:

source: **E[f(x)] is not guaranteed to be f(E[x])**: This means calculating metrics on mean predictions can give different (and potentially misleading) results compared to calculating the distribution of metrics across posterior samples.
es: **E[f(x)] no garantiza ser f(E[x])**: Esto significa que calcular métricas sobre predicciones medias puede dar resultados diferentes (y potencialmente engañosos) en comparación con calcular la distribución de métricas a través de muestras posteriores.

source: **Uncertainty Quantification**: Having distributions of metrics allows us to understand the uncertainty in our model's performance.
es: **Cuantificación de la Incertidumbre**: Tener distribuciones de métricas nos permite comprender la incertidumbre en el rendimiento de nuestro modelo.

source: Let's demonstrate this with an example:
es: Demostremos esto con un ejemplo:

source: Comparing Prior vs Posterior Distributions
es: Comparando distribuciones a priori vs a posteriori

source: We can also visualize how our prior beliefs compare to the posterior distributions using the `plot_prior_vs_posterior` method:
es: También podemos visualizar cómo nuestras creencias previas se comparan con las distribuciones posteriores utilizando el método `plot_prior_vs_posterior`:

source: These visualizations help us understand:
es: Estas visualizaciones nos ayudan a entender:

source: How much we learned from the data (difference between prior and posterior)
es: Cuánto aprendimos de los datos (diferencia entre el anterior y el posterior)

source: The uncertainty in our parameter estimates (width of the distributions)
es: La incertidumbre en nuestras estimaciones de parámetros (ancho de las distribuciones)

source: Whether our priors were reasonable (by comparing prior and posterior ranges)
es: Si nuestros priors eran razonables (comparando los rangos previos y posteriores)

source: The `plot_prior_vs_posterior` method allows us to sort channels either alphabetically or by the magnitude of change from prior to posterior, helping identify which channels had the strongest updates from the data.
es: El método `plot_prior_vs_posterior` nos permite ordenar los canales ya sea alfabéticamente o por la magnitud del cambio de previo a posterior, ayudando a identificar cuáles canales tuvieron las actualizaciones más fuertes a partir de los datos.

source: Conclusion
es: Conclusión

source: In this notebook, we've demonstrated how to:
es: En este cuaderno, hemos demostrado cómo:

source: Calculate various evaluation metrics for your MMM including normalized versions (NRMSE, NMAE), as both summaries and distributions
es: Calcule diversas métricas de evaluación para su MMM, incluyendo versiones normalizadas (NRMSE, NMAE), tanto como resúmenes como distribuciones.

source: Visualize metric distributions for a chosen evaluation metric
es: Visualice las distribuciones de métricas para una métrica de evaluación elegida.

source: Compare prior vs posterior distributions for different metrics
es: Comparar las distribuciones anteriores y posteriores para diferentes métricas

source: These tools help us understand model performance and uncertainty in our predictions, which is crucial for making informed marketing decisions.
es: Estas herramientas nos ayudan a comprender el rendimiento del modelo y la incertidumbre en nuestras predicciones, lo cual es crucial para tomar decisiones de marketing informadas.
