Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_multidimensional_example.po
Languages: es

source: You can optionally save the result of your hard work. The model result objects (idata) can get very large once we start working in multiple dimensions. So it can sometimes be helpful to compress the idata before saving. Below are a couple of tricks.
es: Opcionalmente puedes guardar el resultado de tu trabajo. Los objetos de resultados del modelo (idata) pueden volverse muy grandes cuando empezamos a trabajar en múltiples dimensiones. Por ello, a veces puede ser útil comprimir el idata antes de guardarlo. A continuación hay un par de trucos.

source: We are very excited about this new feature and the possibilities it opens up. We are looking forward to hearing your feedback!
es: Estamos muy entusiasmados con esta nueva funcionalidad y las posibilidades que abre. ¡Esperamos tus comentarios!
