Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_reasoning_and_discovery.po
Languages: es

source: In each case, `TBFPC` handled the essentials: it pruned the skeleton where conditional independences existed, oriented **driver → target** edges when the Bayes evidence supported them, and left ambiguous links dashed (the CPDAG), faithfully reflecting the MEC.
es: { "singular": "En cada caso, `TBFPC` manejó lo esencial: podó el esqueleto donde existían independencias condicionales, orientó los bordes **driver → target** cuando la evidencia de Bayes los apoyaba, y dejó los enlaces ambiguos como discontinuos (el CPDAG), reflejando fielmente el MEC.", "plural": "En cada caso, `TBFPC` manejó lo esencial: podó los esqueletos donde existían independencias condicionales, orientó los bordes **driver → target** cuando la evidencia de Bayes los apoyaba, y dejó los enlaces ambiguos como discontinuos (los CPDAG), reflejando fielmente los MEC." }

source: Now look at the next structure, which is trickier:
es: { "singular": "Ahora mire la siguiente estructura, que es más complicada:", "plural": "Ahora mire las siguientes estructuras, que son más complicadas:" }

source: `D → A`, `A → {B, C}`, `B → C`, and `D → C`, with `{B, C} → P`.
es: { "singular": "D → A, A → {B, C}, B → C, y D → C, con {B, C} → P.", "plural": "D → A, A → {B, C}, B → C, y D → C, con {B, C} → P." }

source: Here, **C is a multi-parent collider** (`A → C ← D`) *and* also a child of `B`.
es: { "singular": "Aquí, **C es un colisionador de múltiples padres** (`A → C ← D`) *y* también es un hijo de `B`.", "plural": "" }

source: `D` plays a **fork/confounder** role for both `A` and `C`.
es: { "singular": "`D` desempeña un papel de **confusión/confusor** tanto para `A` como para `C`.", "plural": "`D` desempeña un papel de **confusión/confusores** tanto para `A` como para `C`." }

source: Paths like `D → A → B → C` coexist with the direct `D → C`, creating **redundant routes** and tight correlations among predictors.
es: { "singular": "Rutas como `D → A → B → C` coexisten con la directa `D → C`, creando **rutas redundantes** y estrechas correlaciones entre los predictores.", "plural": "Rutas como `D → A → B → C` coexisten con las directas `D → C`, creando **rutas redundantes** y estrechas correlaciones entre los predictores." }

source: Why might `TBFPC` struggle at first pass?
es: { "singular": "¿Por qué podría `TBFPC` tener dificultades en el primer intento?", "plural": "" }

source: **Collider opening during testing.** Because we test many conditioning sets, including `C` (or its descendants) in a conditioning set can *open* paths (e.g., between `A` and `D`) and make variables look dependent, blocking edge removals that should occur. Classical PC mitigates this with orientation phases and collider rules; our class intentionally **does not run Meek rules**, so it’s easier to keep extra edges in the skeleton when colliders are involved.
es: { "singular": "**Apertura de colisionador durante las pruebas.** Debido a que probamos muchos conjuntos de condicionamiento, incluir `C` (o sus descendientes) en un conjunto de condicionamiento puede *abrir* caminos (por ejemplo, entre `A` y `D`) y hacer que las variables parezcan dependientes, bloqueando las eliminaciones de aristas que deberían ocurrir. El PC clásico mitiga esto con fases de orientación y reglas de colisionador; nuestra clase intencionalmente **no ejecuta las reglas de Meek**, por lo que es más fácil mantener aristas adicionales en el esqueleto cuando están involucrados colisionadores.", "plural": "**Aperturas de colisionador durante las pruebas.** Debido a que probamos muchos conjuntos de condicionamiento, incluir `C` (o sus descendientes) en un conjunto de condicionamiento puede *abrir* caminos (por ejemplo, entre `A` y `D`) y hacer que las variables parezcan dependientes, bloqueando las eliminaciones de aristas que deberían ocurrir. El PC clásico mitiga esto con fases de orientación y reglas de colisionador; nuestra clase intencionalmente **no ejecuta las reglas de Meek**, por lo que es más fácil mantener aristas adicionales en el esqueleto cuando están involucrados colisionadores." }

source: **Redundant pathways and near-unfaithfulness.** Multiple parallel routes into `C` (via `A`, `B`, and `D`) can produce strong collinearities. With finite samples and noise, ΔBIC CI tests may lack power to find a separating set (especially when signals partially cancel or reinforce), so edges stay.
es: { "singular": "**Caminos redundantes y casi infidelidad.** Múltiples rutas paralelas hacia `C` (a través de `A`, `B` y `D`) pueden producir fuertes colinealidades. Con muestras finitas y ruido, las pruebas de CI ΔBIC pueden carecer de poder para encontrar un conjunto separador (especialmente cuando las señales se cancelan o refuerzan parcialmente), por lo que los bordes permanecen.", "plural": "**Caminos redundantes y casi infidelidad.** Múltiples rutas paralelas hacia `C` (a través de `A`, `B` y `D`) pueden producir fuertes colinealidades. Con muestras finitas y ruido, las pruebas de CI ΔBIC pueden carecer de poder para encontrar un conjunto separador (especialmente cuando las señales se cancelan o refuerzan parcialmente), por lo que los bordes permanecen." }

source: **Target-first orientation only.** We only bias arrows **into the target**; orientations among drivers (`A, B, C, D`) are deliberately conservative. This preserves correctness at the cost of leaving more dashed links, and sometimes an **over-connected** skeleton, on complex driver subgraphs.
es: { "singular": "**Orientación solo hacia el objetivo.** Solo sesgamos las flechas **hacia el objetivo**; las orientaciones entre los controladores (`A, B, C, D`) son deliberadamente conservadoras. Esto preserva la corrección a costa de dejar más enlaces discontinuos y, a veces, un esqueleto **sobrecargado** en subgrafos de controladores complejos.", "plural": "**Orientación solo hacia los objetivos.** Solo sesgamos las flechas **hacia los objetivos**; las orientaciones entre los controladores (`A, B, C, D`) son deliberadamente conservadoras. Esto preserva la corrección a costa de dejar más enlaces discontinuos y, a veces, un esqueleto **sobrecargado** en subgrafos de controladores complejos." }

source: The good news: we can **guide** the procedure using built-ins. In the next step we’ll (i) encode domain priors with `forbidden_edges` (e.g., “purchases don’t cause media”), (ii) lock essential mechanisms with `required_edges`, and (iii) tighten how we treat target edges via the `target_edge_rule` (e.g., `"fullS"` for stricter retention). These levers constrain the search space, protect collider structures from being inadvertently “opened” during testing, and help the algorithm converge to a sparser, more faithful CPDAG that matches the marketing story you actually believe.
es: { "singular": "La buena noticia: podemos **guiar** el procedimiento utilizando funciones integradas. En el siguiente paso, (i) codificaremos los priors del dominio con `forbidden_edges` (por ejemplo, “las compras no causan medios”), (ii) bloquearemos mecanismos esenciales con `required_edges`, y (iii) ajustaremos cómo tratamos los bordes objetivo a través de la `target_edge_rule` (por ejemplo, `"fullS"` para una retención más estricta). Estas palancas restringen el espacio de búsqueda, protegen las estructuras de colisión de ser inadvertidamente “abiertas” durante las pruebas, y ayudan al algoritmo a converger a un CPDAG más escaso y fiel que coincida con la historia de marketing en la que realmente crees.", "plural": "Las buenas noticias: podemos **guiar** el procedimiento utilizando funciones integradas. En el siguiente paso, (i) codificaremos los priors del dominio con `forbidden_edges` (por ejemplo, “las compras no causan medios”), (ii) bloquearemos mecanismos esenciales con `required_edges`, y (iii) ajustaremos cómo tratamos los bordes objetivo a través de la `target_edge_rule` (por ejemplo, `"fullS"` para una retención más estricta). Estas palancas restringen el espacio de búsqueda, protegen las estructuras de colisión de ser inadvertidamente “abiertas” durante las pruebas, y ayudan al algoritmo a converger a un CPDAG más escaso y fiel que coincida con la historia de marketing en la que realmente crees." }

source: **What went wrong (and why):** The procedure correctly oriented the **target edges** — `brand_search → purchase` and `media_activities → purchase` — but it **under-oriented (left dashed)** several **driver–driver** relations and even **dropped** one adjacency that exists in the true structure:
es: { "singular": { "msgid": "**What went wrong (and why):** The procedure correctly oriented the **target edges** — `brand_search → purchase` and `media_activities → purchase` — but it **under-oriented (left dashed)** several **driver–driver** relations and even **dropped** one adjacency that exists in the true structure:", "msgstr": "**Qué salió mal (y por qué):** El procedimiento orientó correctamente los **bordes objetivo** — `brand_search → purchase` y `media_activities → purchase` — pero **suborientó (dashed izquierdo)** varias relaciones **driver–driver** e incluso **eliminó** una adyacencia que existe en la estructura verdadera:" }, "plural": { "msgid": "**What went wrong (and why):** The procedure correctly oriented the **target edges** — `brand_search → purchase` and `media_activities → purchase` — but it **under-oriented (left dashed)** several **driver–driver** relations and even **dropped** one adjacency that exists in the true structure:", "msgstr": "**Qué salió mal (y por qué):** El procedimiento orientó correctamente los **bordes objetivo** — `brand_search → purchase` y `media_activities → purchase` — pero **suborientó (dashed izquierdo)** varias relaciones **driver–driver** e incluso **eliminó** una adyacencia que existe en la estructura verdadera:" } }

source: **Missing edge:** there is **no** `media_activities — brand_search` link in the learned CPDAG, even though the true DAG has `media_activities → brand_search`. This is a **false negative** in the skeleton.
es: { "singular": "**Falta de conexión:** no hay **ningún** enlace `media_activities — brand_search` en el CPDAG aprendido, a pesar de que el verdadero DAG tiene `media_activities → brand_search`. Esto es un **falso negativo** en el esqueleto.", "plural": "**Faltas de conexión:** no hay **ningún** enlace `media_activities — brand_search` en los CPDAG aprendidos, a pesar de que los verdaderos DAG tienen `media_activities → brand_search`. Esto es un **falso negativo** en los esqueletos." }

source: **Undirected (dashed) edges where the true DAG is directed:**
es: { "singular": "**Aristas no dirigidas (discontinuas) donde el DAG verdadero es dirigido:**", "plural": "**Aristas no dirigidas (discontinuas) donde el DAG verdadero es dirigido:**" }

source: `exogenous — generic_search` (true: `exogenous → generic_search`)
es: { "singular": "exógeno — búsqueda_genérica (verdadero: exógeno → búsqueda_genérica)", "plural": "exógenos — búsquedas_genéricas (verdadero: exógenos → búsquedas_genéricas)" }

source: `generic_search — media_activities` (true: `generic_search → media_activities`)
es: { "singular": "`generic_search — media_activities` (verdadero: `generic_search → media_activities`)", "plural": "`generic_search — media_activities` (verdaderos: `generic_search → media_activities`)" }

source: `generic_search — brand_search` (true: `generic_search → brand_search`)
es: { "singular": "búsqueda_genérica — búsqueda_de_marca (verdadero: búsqueda_genérica → búsqueda_de_marca)", "plural": "búsquedas_genéricas — búsquedas_de_marca (verdadero: búsquedas_genéricas → búsquedas_de_marca)" }

source: `exogenous — brand_search` (true: `exogenous → brand_search`)
es: { "singular": "exógeno — búsqueda_de_marca", "plural": "exógenos — búsquedas_de_marca" }

source: Why can this happen? (i) **Collider handling**: conditioning on (or on descendants of) a collider can spuriously create dependence, preventing the removal of edges you’d expect; we don’t run Meek rules, so we keep more ambiguity. (ii) **Redundant paths & collinearity**: with routes like `exogenous → generic_search → media_activities → brand_search` coexisting with direct `exogenous → brand_search`, ΔBIC tests may struggle to find separating sets at finite samples, so edges are either **left undirected** or **pruned incorrectly**. (iii) **Target-first bias**: orientations among drivers are conservative by design; we prioritize reliable `driver → target` arrows and leave driver–driver directions unresolved unless the evidence is strong.
es: { "singular": "¿Por qué puede suceder esto? (i) **Manejo de colisionadores**: condicionar sobre (o sobre descendientes de) un colisionador puede crear dependencia espuria, impidiendo la eliminación de bordes que esperarías; no aplicamos las reglas de Meek, por lo que mantenemos más ambigüedad. (ii) **Rutas redundantes y colinealidad**: con rutas como `exógeno → búsqueda_genérica → actividades_mediáticas → búsqueda_de_marca` coexistiendo con `exógeno → búsqueda_de_marca` directa, las pruebas de ΔBIC pueden tener dificultades para encontrar conjuntos separadores en muestras finitas, por lo que los bordes son **dejados no dirigidos** o **podados incorrectamente**. (iii) **Sesgo de objetivo primero**: las orientaciones entre los impulsores son conservadoras por diseño; priorizamos flechas confiables `impulsor → objetivo` y dejamos las direcciones impulsor–impulsor sin resolver a menos que la evidencia sea fuerte.", "plural": "¿Por qué pueden suceder esto? (i) **Manejo de colisionadores**: condicionar sobre (o sobre descendientes de) un colisionador puede crear dependencia espuria, impidiendo la eliminación de bordes que esperarías; no aplicamos las reglas de Meek, por lo que mantenemos más ambigüedad. (ii) **Rutas redundantes y colinealidad**: con rutas como `exógeno → búsqueda_genérica → actividades_mediáticas → búsqueda_de_marca` coexistiendo con `exógeno → búsqueda_de_marca` directa, las pruebas de ΔBIC pueden tener dificultades para encontrar conjuntos separadores en muestras finitas, por lo que los bordes son **dejados no dirigidos** o **podados incorrectamente**. (iii) **Sesgo de objetivo primero**: las orientaciones entre los impulsores son conservadoras por diseño; priorizamos flechas confiables `impulsor → objetivo` y dejamos las direcciones impulsor–impulsor sin resolver a menos que la evidencia sea fuerte." }

source: How to guide the algorithm with domain knowledge:
es: { "singular": "Cómo guiar el algoritmo con conocimiento del dominio:", "plural": "Cómo guiar los algoritmos con conocimiento del dominio:" }

source: Marketing gives us strong, defensible priors. Use them to *constrain the search space*:
es: { "singular": { "msgid": "Marketing gives us strong, defensible priors. Use them to *constrain the search space*:", "msgstr": "El marketing nos proporciona priors sólidos y defendibles. Úselos para *restringir el espacio de búsqueda*:" }, "plural": { "msgid": "Marketing gives us strong, defensible priors. Use them to *constrain the search space*:", "msgstr": "El marketing nos proporciona priors sólidos y defendibles. Úselos para *restringir el espacio de búsqueda*:" } }

source: Choosing the target-edge rule:
es: { "singular": "Eligiendo la regla de borde objetivo:", "plural": "Eligiendo las reglas de borde objetivo:" }

source: *"any"* (more aggressive pruning): keep X → target unless any conditioning set makes $X \perp \text{target} \mid S$. **Pros**: precise, trims spurious target links. **Cons**: can drop true drivers when signals are weak or near-unfaithful (higher false negatives).
es: { "singular": "*\"cualquiera\"* (poda más agresiva): mantener X → objetivo a menos que cualquier conjunto de condiciones haga que $X \perp \text{target} \mid S$. **Pros**: preciso, recorta enlaces de objetivo espurios. **Cons**: puede eliminar verdaderos impulsores cuando las señales son débiles o casi infieles (mayores falsos negativos).", "plural": "*\"cualquiera\"* (podas más agresivas): mantener X → objetivos a menos que cualquier conjunto de condiciones haga que $X \perp \text{target} \mid S$. **Pros**: precisos, recortan enlaces de objetivos espurios. **Cons**: pueden eliminar verdaderos impulsores cuando las señales son débiles o casi infieles (mayores falsos negativos)." }

source: *"conservative"* (more protective): keep X → target if at least one conditioning set shows dependence. **Pros**: better recall of true drivers (fewer false negatives); robust when paths are redundant. **Cons**: may keep some spurious links (denser graph).
es: { "singular": "*\"conservador\"* (más protector): mantener X → objetivo si al menos un conjunto de condicionamiento muestra dependencia. **Pros**: mejor recuerdo de los verdaderos impulsores (menos falsos negativos); robusto cuando los caminos son redundantes. **Contras**: puede mantener algunos enlaces espurios (gráfico más denso).", "plural": "*\"conservadores\"* (más protectores): mantener X → objetivo si al menos un conjunto de condicionamiento muestra dependencia. **Pros**: mejor recuerdo de los verdaderos impulsores (menos falsos negativos); robusto cuando los caminos son redundantes. **Contras**: puede mantener algunos enlaces espurios (gráfico más denso)." }

source: *"fullS"* (stability via maximal conditioning): test only with the full set of other drivers as $S$. **Pros**: fewer arbitrary choices of $S$; stable behavior. **Cons**: risks over-control (blocking mediators) or opening colliders if descendants sit in $S$; may under-orient.
es: { "singular": "*\"fullS\"* (estabilidad a través de la máxima condicionamiento): prueba solo con el conjunto completo de otros controladores como $S$. **Pros**: menos elecciones arbitrarias de $S$; comportamiento estable. **Contras**: riesgos de sobrecontrol (bloqueo de mediadores) o apertura de colisionadores si los descendientes están en $S$; puede suborientar.", "plural": "*\"fullS\"* (estabilidad a través de la máxima condicionamiento): prueben solo con el conjunto completo de otros controladores como $S$. **Pros**: menos elecciones arbitrarias de $S$; comportamiento estable. **Contras**: riesgos de sobrecontrol (bloqueo de mediadores) o apertura de colisionadores si los descendientes están en $S$; puede suborientar." }

source: Switching `target_edge_rule` from `"any"` to `"conservative"` changes **how edges into `purchase` are retained**. With `"any"`, an edge like `media_activities → purchase` (or `brand_search → purchase`) is **removed** if there exists *any* conditioning set `S` such that the data support independence between that driver and `purchase` given `S` (aggressive pruning). With `"conservative"`, the edge is **kept** if **at least one** conditioning set shows dependence (protective retention). In other words:
es: { "singular": "Cambiar `target_edge_rule` de \"any\" a \"conservative\" cambia **cómo se retienen los bordes hacia `purchase`**. Con \"any\", un borde como `media_activities → purchase` (o `brand_search → purchase`) es **eliminado** si existe *cualquier* conjunto de condicionamiento `S` tal que los datos apoyan la independencia entre ese impulsor y `purchase` dado `S` (poda agresiva). Con \"conservative\", el borde es **mantenido** si **al menos uno** de los conjuntos de condicionamiento muestra dependencia (retención protectora). En otras palabras:", "plural": "Cambiar `target_edge_rule` de \"any\" a \"conservative\" cambia **cómo se retienen los bordes hacia `purchase`**. Con \"any\", un borde como `media_activities → purchase` (o `brand_search → purchase`) es **eliminado** si existe *cualquier* conjunto de condicionamiento `S` tal que los datos apoyan la independencia entre esos impulsores y `purchase` dado `S` (poda agresiva). Con \"conservative\", el borde es **mantenido** si **al menos uno** de los conjuntos de condicionamiento muestra dependencia (retención protectora). En otras palabras:" }

source: `"any"`: delete `driver → purchase` if there **exists** `S` with $\log \mathrm{BF}_{10}(\text{driver} \to \text{purchase} \mid S) < \tau$.
es: { "singular": "\"cualquiera\": eliminar `driver → purchase` si existe `S` con $\log \mathrm{BF}_{10}(\text{driver} \to \text{purchase} \mid S) < \tau$.", "plural": "\"cualquiera\": eliminar `driver → purchase` si existen `S` con $\log \mathrm{BF}_{10}(\text{driver} \to \text{purchase} \mid S) < \tau$." }

source: `"conservative"`: **keep** `driver → purchase` if there **exists** `S` with $\log \mathrm{BF}_{10}(\text{driver} \to \text{purchase} \mid S) \ge \tau$.
es: { "singular": "\"conservador\": **mantener** `controlador → compra` si **existe** `S` con $\log \mathrm{BF}_{10}(\text{driver} \to \text{purchase} \mid S) \ge \tau$.", "plural": "\"conservadores\": **mantener** `controladores → compras` si **existen** `S` con $\log \mathrm{BF}_{10}(\text{driver} \to \text{purchase} \mid S) \ge \tau$." }

source: In our new CPDAG, the **target edges remain oriented** — `brand_search → purchase` and `media_activities → purchase` — which is exactly what `"conservative"` encourages: there is at least one conditioning set where each driver still shows dependence with `purchase`. The **driver–driver** relations remain **dashed (undirected)**:
es: { "singular": { "msgid": "In our new CPDAG, the **target edges remain oriented** — `brand_search → purchase` and `media_activities → purchase` — which is exactly what \"conservative\" encourages: there is at least one conditioning set where each driver still shows dependence with `purchase`. The **driver–driver** relations remain **dashed (undirected)**:", "msgstr": "En nuestro nuevo CPDAG, los **bordes objetivo permanecen orientados** — `brand_search → purchase` y `media_activities → purchase` — lo cual es exactamente lo que \"conservador\" fomenta: hay al menos un conjunto de condicionamiento donde cada impulsor aún muestra dependencia con `purchase`. Las relaciones **impulsor–impulsor** permanecen **discontinuas (no dirigidas)**:" }, "plural": {} }

source: `brand_search — exogenous`
es: { "singular": "búsqueda_de_marca — exógeno", "plural": "búsquedas_de_marca — exógenos" }

source: `brand_search — generic_search`
es: { "singular": "búsqueda_de_marca — búsqueda_genérica", "plural": "búsquedas_de_marca — búsquedas_genéricas" }

source: `exogenous — generic_search`
es: { "singular": "exógeno — búsqueda_genérica", "plural": "exógenos — búsquedas_genéricas" }

source: `generic_search — media_activities`
es: { "singular": "búsqueda_genérica — actividades_de_medio", "plural": "búsquedas_genéricas — actividades_de_medio" }

source: These stay undirected because the target-edge rule **does not orient edges among drivers**. Their directions are **Markov-equivalent** given the observed independences, so the algorithm leaves them unresolved.
es: { "singular": "Estos permanecen no dirigidos porque la regla de borde objetivo **no orienta los bordes entre los controladores**. Sus direcciones son **equivalentes a Markov** dadas las independencias observadas, por lo que el algoritmo los deja sin resolver.", "plural": "Estos permanecen no dirigidos porque la regla de borde objetivo **no orienta los bordes entre los controladores**. Sus direcciones son **equivalentes a Markov** dadas las independencias observadas, por lo que el algoritmo los deja sin resolver." }
