Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_multidimensional_example.po
Languages: es

source: MMM Multidimensional Example Notebook
es: Cuaderno de ejemplo multidimensional de MMM

source: In this notebook, we present an new experimental media mix model class to create multidimensional and customized marketing mix models. To showcase its capabilities, we extend the {ref}`mmm_example` simulation to create a multidimensional hierarchical model.
es: En este cuaderno presentamos una nueva clase experimental de modelo de mezcla de medios para crear modelos de marketing mix multidimensionales y personalizados. Para mostrar sus capacidades, extendemos la simulación {ref}`mmm_example` para crear un modelo jerárquico multidimensional.

source: Even though the new {class}`MMM <pymc_marketing.mmm.multidimensional.MMM>` class is an experimental class, it is fully functional and can be used to create multidimensional marketing mix models. This model is under active development and will be further improved in the future (feedback welcome!).
es: Aunque la nueva clase {class}`MMM <pymc_marketing.mmm.multidimensional.MMM>` es experimental, es totalmente funcional y puede utilizarse para crear modelos de marketing mix multidimensionales. Este modelo está en desarrollo activo y se seguirá mejorando en el futuro (¡se agradecen comentarios!).

source: Prepare Notebook
es: Preparar cuaderno

source: Read Data
es: Leer datos

source: We read the simulated data from the {ref}`mmm_multidimensional_example`.
es: Leemos los datos simulados de {ref}`mmm_multidimensional_example`.

source: For our setup, imagine we are selling one product in two different countries (`geo_a` and `geo_b`). Our marketing team maintains two channels - one is a usually-on channel while the other channel is more tactical and is turned on during marketing campaigns. Visual inspection of the data suggests that there is at least some effect of marketing on sales, but the relationship is noisy. Our mission is to see if the MMM can parse the signal in the noise.
es: Para nuestro planteamiento, imagine que vendemos un producto en dos países distintos (`geo_a` y `geo_b`). Nuestro equipo de marketing gestiona dos canales: uno suele estar siempre activo y el otro es más táctico y se activa durante las campañas de marketing. La inspección visual de los datos sugiere que existe al menos algún efecto del marketing sobre las ventas, pero la relación es ruidosa. Nuestra misión es ver si el MMM puede separar la señal del ruido.

source: One strategy for dealing with noisy, low-signal data is to borrow information from similar contexts. If channel 2 seems to be pretty effective in `geo_b`, that gives us reason to suspect it will be effective in `geo_a`. This can be implemented either with **full pooling** or **partial pooling** (partial pooling models are often called 'hierarchical' or 'multi-level'). So this notebook will demonstrate how to fit an MMM to multiple markets at the same time and make decisions about how to pool information across the two contexts.
es: Una estrategia para tratar con datos ruidosos y de baja señal es aprovechar información de contextos similares. Si el canal 2 parece ser bastante efectivo en `geo_b`, eso nos da razones para sospechar que también lo será en `geo_a`. Esto puede implementarse con **full pooling** o **partial pooling** (los modelos de partial pooling a menudo se llaman 'jerárquicos' o 'multinivel'). Este cuaderno mostrará cómo ajustar un MMM a múltiples mercados al mismo tiempo y tomar decisiones sobre cómo agrupar información entre los dos contextos.

source: Prior Specification
es: Especificación de priors

source: The beta parameter represents the maximum number of weekly sales you could drive through a channel. Beta will the only hierarchical parameter in this model. There is good reason to think that different markets saturate at different levels. A product might be popular in one place and the potential audience is very large. In another market, it's a niche product. To capture this, we'll allow the saturation point to vary across geography.
es: El parámetro Beta representa el número máximo de ventas semanales que podrías impulsar a través de un canal. Beta será el único parámetro jerárquico en este modelo. Hay buenas razones para pensar que distintos mercados se saturan en niveles diferentes. Un producto puede ser popular en un lugar y la audiencia potencial muy grande. En otro mercado, es un producto de nicho. Para capturar esto, permitiremos que el punto de saturación varíe según la geografía.

source: A hierarchical model does something clever - instead of assuming that every geography is different, we assume that they must be at least partially related to each other. If you had 10 geos and 9 of them had a high saturation point, you would reasonably expect the 10th one to have a high saturation point. A hierarchical model will adaptively pool information between contexts. When each geo is very different, it will transfer less information between them. When each geo is very similar, it will transfer more information. This is also called **partial pooling**. If you need an introduction on Bayesian hierarchical models, check out the comprehensive example ["A Primer on Bayesian Methods for Multilevel Modeling"](https://www.pymc.io/projects/examples/en/latest/generalized_linear_models/multilevel_modeling.html) in the PyMC documentation.
es: Un modelo jerárquico hace algo ingenioso: en lugar de suponer que cada geografía es diferente, suponemos que al menos están parcialmente relacionadas entre sí. Si tuvieras 10 geos y 9 de ellas tuvieran un alto punto de saturación, razonablemente esperarías que la décima también lo tuviera. Un modelo jerárquico agrupará adaptativamente información entre contextos. Cuando cada geo es muy diferente, transferirá menos información entre ellas. Cuando cada geo es muy similar, transferirá más información. A esto también se le llama **partial pooling**. Si necesitas una introducción a los modelos jerárquicos bayesianos, consulta el ejemplo completo ["A Primer on Bayesian Methods for Multilevel Modeling"](https://www.pymc.io/projects/examples/en/latest/generalized_linear_models/multilevel_modeling.html) en la documentación de PyMC.

source: We can build hierarchical parameters with the prior API. Notice that we have one Prior object with dimensions `(channel, geos)` and then we have further Priors for each parameter. The prior on `mu` captures what we expect the channels to do, without considering their variation on geography. The prior on `sigma` represents how much the effect varies across geographies. Bayesian inference propagates information all the way up and down the network of parameters - as well learn the values of the interior parameters, `mu` and `sigma`, they will act as constraints on the behaviour of the individual beta parameters.
es: Podemos construir parámetros jerárquicos con la API de priors. Observa que tenemos un objeto Prior con dimensiones `(channel, geos)` y luego tenemos más Priors para cada parámetro. El prior sobre `mu` captura lo que esperamos que hagan los canales, sin considerar su variación por geografía. El prior sobre `sigma` representa cuánto varía el efecto entre geografías. La inferencia bayesiana propaga información a lo largo de toda la red de parámetros: a medida que aprendemos los valores de los parámetros internos, `mu` y `sigma`, actuarán como restricciones sobre el comportamiento de los parámetros Beta individuales.

source: There are a lot of option in how we code up each type of effect. It can be difficult to keep track of which parameters share information, which are completely separate, and which are shared. But there is a trick to help you remember - notice that the interior Priors have fewer dimensions than the main Prior. The extra dimension represents the dimension across which information is transferred. The shared dimensions represent the ones that are independent. Channel 1 in `geo_a` influences channel 1 in `geo_b`, but channel 1 never influences channel 2.
es: Hay muchas opciones sobre cómo codificar cada tipo de efecto. Puede ser difícil llevar la cuenta de qué parámetros comparten información, cuáles están completamente separados y cuáles están compartidos. Pero hay un truco para recordarlo: fíjate que los Priors internos tienen menos dimensiones que el Prior principal. La dimensión extra representa la dimensión a lo largo de la cual se transfiere la información. Las dimensiones compartidas representan las que son independientes. El canal 1 en `geo_a` influye en el canal 1 en `geo_b`, pero el canal 1 nunca influye en el canal 2.

source: This notebook is only illustrative so we'll show you how to code each type of assumption you might make (we aren't recommending a universal solution!). Lambda represents the efficiency of a channel. The higher the lambda, the more responsive sales are to spending on that channel. We'll have the lambda parameter be **fully pooled** across all geographies. We are assuming that channel 1 has the same efficiency in both geos, so we do not specify "geo" dims. The package will automatically broadcast the channel effect for each geography.
es: Este cuaderno es solo ilustrativo, así que te mostraremos cómo codificar cada tipo de suposición que podrías hacer (¡no estamos recomendando una solución universal!). Lambda representa la eficiencia de un canal. Cuanto mayor sea lambda, más sensibles serán las ventas al gasto en ese canal. Haremos que el parámetro lambda esté **fully pooled** en todas las geografías. Suponemos que el canal 1 tiene la misma eficiencia en ambas geos, por lo que no especificamos dims de "geo". El paquete difundirá automáticamente el efecto del canal para cada geografía.

source: Adstock alpha represents how long customers remember marketing. For adstock, we'll illustrate the **unpooled** strategy. Here, each channel in each geography has its own effect and those effects do not influence each other. Notice that we put a dim for both geos and channels to indicate that we want 4 unique effects.
es: Adstock alpha representa cuánto tiempo recuerdan los clientes el marketing. Para adstock, ilustraremos la estrategia **unpooled**. Aquí, cada canal en cada geografía tiene su propio efecto y esos efectos no se influyen entre sí. Observa que ponemos una dim para geos y canales para indicar que queremos 4 efectos únicos.

source: You can mix and match the unpooled, fully pooled, and partially pooled strategy for any of your effects. You can extend this strategy to controls or noise parameters as well. Given the variety of options, it can be hard to know which pooling strategy to choose for a given effect. In our opinion, the choice is primarily driven by computational considerations. Partial pooling is generally a more reasonable assumption but it can make the model slower to estimate, more complicated to debug, and more difficult to reason about.
es: Puedes combinar las estrategias unpooled, fully pooled y partially pooled para cualquiera de tus efectos. Puedes extender esta estrategia a controles o parámetros de ruido también. Dada la variedad de opciones, puede ser difícil saber qué estrategia de agrupamiento elegir para un efecto dado. En nuestra opinión, la elección está impulsada principalmente por consideraciones computacionales. El partial pooling suele ser una suposición más razonable, pero puede hacer que el modelo sea más lento de estimar, más complicado de depurar y más difícil de razonar.

source: For example, you might notice that we set our prior with `centered=False`. This is known as a *reparameterization*, a[ strategy to solve computational difficulties](https://www.pymc.io/projects/examples/en/latest/diagnostics_and_criticism/Diagnosing_biased_Inference_with_Divergences.html) that MCMC algorithms can run into when fitting hierarchical models. We recommend that you start with a model that uses only fully pooled or unpooled effects. Once you have a good working model you can add complexity slowly, verifying your model performance and accuracy at each stage.
es: Por ejemplo, puedes notar que configuramos nuestro prior con `centered=False`. Esto se conoce como una reparametrización, una [estrategia para resolver dificultades computacionales](https://www.pymc.io/projects/examples/en/latest/diagnostics_and_criticism/Diagnosing_biased_Inference_with_Divergences.html) con las que los algoritmos MCMC pueden encontrarse al ajustar modelos jerárquicos. Recomendamos empezar con un modelo que use solo efectos fully pooled o unpooled. Una vez tengas un buen modelo funcionando, puedes añadir complejidad lentamente, verificando el rendimiento y la precisión del modelo en cada etapa.

source: We complete the model specification with similar priors as in the {ref}`mmm_example`.
es: Completamos la especificación del modelo con priors similares a los de {ref}`mmm_example`.

source: Model Definition
es: Definición del modelo

source: We are now ready to define the model class. The API is very similar to the one in the {ref}`mmm_example`.
es: Ya estamos listos para definir la clase del modelo. La API es muy similar a la de {ref}`mmm_example`.

source: Observe we have the following two new arguments:
es: Observa que tenemos los dos argumentos nuevos siguientes:

source: `dims`: a tuple of strings that specify the dimensions of the model.
es: `dims`: una tupla de cadenas de texto que especifica las dimensiones del modelo.

source: `scaling`: a dictionary that specifies the scaling method and dimensions for the target and media variables. In this case we leave the dimensions empty as we want to scale the target variable for each geo (see details below).
es: `scaling`: un diccionario que especifica el método de escalado y las dimensiones para la variable objetivo y las variables de medios. En este caso dejamos las dimensiones vacías porque queremos escalar la variable objetivo por cada geo (ver detalles abajo).

source: We can now prepare the training data.
es: Ahora podemos preparar los datos de entrenamiento.

source: To build the model, we need to specify the training data and the target variables.
es: Para construir el modelo, necesitamos especificar los datos de entrenamiento y las variables objetivo.

source: We do not need to build the model, we can simply fit the model. This is just to inspect the model structure.
es: No necesitamos construir el modelo; simplemente podemos ajustarlo. Esto es solo para inspeccionar la estructura del modelo.

source: Let's look into the model graph:
es: Veamos el grafo del modelo:

source: It is great to see that the model automatically vectorizes and creates the expected hierarchies and dimensions 🚀!
es: ¡Es genial ver que el modelo se vectoriza automáticamente y crea las jerarquías y dimensiones esperadas 🚀!

source: As we are scaling our data internally, we can add deterministic terms to recover the component contributions in the original scale.
es: Como estamos escalando nuestros datos internamente, podemos añadir términos deterministas para recuperar las contribuciones de los componentes en la escala original.

source: Coming back to the scalers, we can get them as an xarray dataset.
es: Volviendo a los escaladores, podemos obtenerlos como un dataset de xarray.

source: As expected, from the model definition, we have scalers for the target and media variables across geos.
es: Como era de esperar por la definición del modelo, tenemos escaladores para la variable objetivo y las variables de medios en todas las geos.

source: Prior Predictive Checks
es: Comprobaciones predictivas previas

source: Before fitting the model, we can inspect the prior predictive distribution.
es: Antes de ajustar el modelo, podemos inspeccionar la distribución predictiva previa.

source: The prior predictive distribution looks good and not too restrictive.
es: La distribución predictiva previa se ve bien y no es demasiado restrictiva.

source: Model Fitting
es: Ajuste del modelo

source: We can now fit the model and generate the posterior predictive distribution.
es: Ahora podemos ajustar el modelo y generar la distribución predictiva posterior.

source: The sampling looks good. No divergences and the r-hat values are close to $1$.
es: El muestreo se ve bien. No hay divergencias y los valores de r-hat están cercanos a $1$.

source: Posterior Predictive Checks
es: Comprobaciones predictivas posteriores

source: We can now inspect the posterior predictive distribution. As before, we need to scale the posterior predictive to the original scale to make it comparable to the data.
es: Ahora podemos inspeccionar la distribución predictiva posterior. Como antes, necesitamos escalar la predictiva posterior a la escala original para hacerla comparable con los datos.

source: The fit looks okay! There is a lot of white-noise in the sales process we cannot predict. However, the main movements in the sales are either captured by our seasonality model or the MMM components.
es: ¡El ajuste se ve bien! Hay mucho ruido blanco en el proceso de ventas que no podemos predecir. Sin embargo, los movimientos principales en las ventas están capturados ya sea por nuestro modelo de estacionalidad o por los componentes del MMM.

source: Model Components
es: Componentes del modelo

source: We can extract the contributions of each component of the model in the original scale thanks to the deterministic variables added to the model.
es: Podemos extraer las contribuciones de cada componente del modelo en la escala original gracias a las variables deterministas añadidas al modelo.

source: Media Deep Dive
es: Análisis profundo de medios

source: Next, we can look into the individual channel contributions across geos. This new class has a new `plot` name space that contains many plotting methods.
es: A continuación, podemos analizar las contribuciones individuales por canal en las distintas geos. Esta nueva clase tiene un nuevo espacio de nombres `plot` que contiene muchos métodos de visualización.

source: We can plot the saturation curves for each channel and geo, using a few different functions:
es: Podemos graficar las curvas de saturación para cada canal y geo usando varias funciones diferentes:

source: Using `saturation_scatterplot`, we can get only the scatterplot between investment and estimated returns.
es: Usando `saturation_scatterplot`, podemos obtener únicamente el diagrama de dispersión entre inversión y retornos estimados.

source: Using `saturation_curves`, we can get the posterior of the curves and their posterior fit regarding the given mean contribution.
es: Usando `saturation_curves`, podemos obtener la posterior de las curvas y su ajuste posterior respecto a la contribución media dada.

source: Parameter recovery
es: Recuperación de parámetros

source: One nice sign that the model is working as intend is that it can recover the true parameter values underlying the marketing mechanism. In our case, we know the true parameter values because we simulated the date. Informally, if the bulk of the posterior distribution covers the parameter value, that's a good sign. We do not expect the mean of the posterior to always line up with the true value - for small or noisy data, we should expect the posterior to cover a wide interval regardless of whether we built a good model or not. There are also [formal frameworks](https://arxiv.org/abs/2502.03279) for thinking about parameter recovery in simulations that might be helpful if you need even more rigorous evidence the model is working correctly.
es: Una buena señal de que el modelo funciona como se pretende es que puede recuperar los valores verdaderos de los parámetros subyacentes al mecanismo de marketing. En nuestro caso, conocemos los valores verdaderos de los parámetros porque simulamos los datos. De forma informal, si la mayor parte de la distribución posterior cubre el valor del parámetro, es una buena señal. No esperamos que la media de la posterior siempre coincida con el valor verdadero: para datos pequeños o ruidosos, deberíamos esperar que la posterior cubra un intervalo amplio independientemente de si construimos un buen modelo o no. También existen [marcos formales](https://arxiv.org/abs/2502.03279) para pensar sobre la recuperación de parámetros en simulaciones que pueden ser útiles si necesitas evidencia aún más rigurosa de que el modelo funciona correctamente.

source: Below we compare the posterior distribution to the true values for the main MMM parameters (`saturation lambda`, `saturation beta` and `adstock alpha`).
es: A continuación comparamos la distribución posterior con los valores verdaderos de los principales parámetros del MMM (`saturation lambda`, `saturation beta` y `adstock alpha`).

source: Out of Sample Predictions
es: Predicciones fuera de muestra

source: It is very important to be able to make predictions out of the sample. This is key for model validation, forward looking scenario planning and business decision making. Similarly as in the {ref}`mmm_example`, we assume the future spends are the same as the last day in the training sample. This way we can create a new dataset with the future dates and channel spends and use the model to make predictions.
es: Es muy importante poder hacer predicciones fuera de la muestra. Esto es clave para la validación del modelo, la planificación de escenarios prospectivos y la toma de decisiones empresariales. De forma similar a {ref}`mmm_example`, asumimos que las inversiones futuras son las mismas que el último día de la muestra de entrenamiento. De este modo podemos crear un nuevo dataset con las fechas futuras y los gastos por canal y usar el modelo para hacer predicciones.

source: Using the same `sample_posterior_predictive` method, we can now generate the forecast.
es: Usando el mismo método `sample_posterior_predictive`, ahora podemos generar el pronóstico.

source: Optimization
es: Optimización

source: If you want to run optimizations, then you need to use the `MultiDimensionalBudgetOptimizerWrapper`.
es: Si quieres ejecutar optimizaciones, entonces necesitas usar `MultiDimensionalBudgetOptimizerWrapper`.

source: This object is an xarray dataset with the allocation and posterior predictive responses!
es: ¡Este objeto es un dataset de xarray con la asignación y las respuestas predictivas posteriores!

source: Once you get the allocation, you can plot a the results 🚀
es: Una vez obtengas la asignación, puedes graficar los resultados 🚀

source: The graph shows the optimal budget for each channel on each geo, next to their respective mean contribution given the optimal budget. The method identify automatically the number of dimensions and tries to create a plot based on them.
es: El gráfico muestra el presupuesto óptimo para cada canal en cada geo, junto a su contribución media respectiva dado el presupuesto óptimo. El método identifica automáticamente el número de dimensiones e intenta crear una gráfica en función de ellas.

source: If you want to see the full uncertainty over time, you can use the plot suite and the method `allocated_contribution_by_channel_over_time`.
es: Si quieres ver la incertidumbre completa a lo largo del tiempo, puedes usar la suite de gráficos y el método `allocated_contribution_by_channel_over_time`.

source: If you have a custom model, you can wrapped it into the model protocol, and use the optimizer after. If your model handle scales internally, you don't need to modify anything. Otherwise, for the plots, you may want to use `scale_factor=N`. E.g:
es: Si tienes un modelo personalizado, puedes envolverlo en el protocolo del modelo y usar el optimizador después. Si tu modelo gestiona las escalas internamente, no necesitas modificar nada. De lo contrario, para las gráficas, quizá quieras usar `scale_factor=N`. Por ejemplo:

source: Save Model
es: Guardar modelo
