Repository: pymc-labs/pymc-marketing
Catalog: locales/*/LC_MESSAGES/notebooks/mmm/mmm_causal_reasoning_and_discovery.po
Languages: es

source: When you do want to explore concrete candidates, `TBFPC` exposes `get_all_cdags_from_cpdag`. Under the hood, it takes each dashed edge, tries both directions, **filters out cyclic orientations**, and returns the set of fully directed, acyclic graphs consistent with the CPDAG. Formally, it orients each undecided pair $(u,v)$ to either $u\to v$ or $v\to u$, and keeps only those orientations for which the resulting adjacency matrix is acyclic. This gives you a menu of plausible worlds that all fit the evidence.
es: { "singular": "Cuando desea explorar candidatos concretos, `TBFPC` expone `get_all_cdags_from_cpdag`. En el fondo, toma cada arista discontinua, prueba ambas direcciones, **filtra orientaciones cíclicas**, y devuelve el conjunto de grafos dirigidos y acíclicos que son consistentes con el CPDAG. Formalmente, orienta cada par no decidido $(u,v)$ a ya sea $u\to v$ o $v\to u$, y mantiene solo aquellas orientaciones para las cuales la matriz de adyacencia resultante es acíclica. Esto le proporciona un menú de mundos plausibles que se ajustan a la evidencia.", "plural": "Cuando desean explorar candidatos concretos, `TBFPC` expone `get_all_cdags_from_cpdag`. En el fondo, toma cada arista discontinua, prueba ambas direcciones, **filtra orientaciones cíclicas**, y devuelve el conjunto de grafos dirigidos y acíclicos que son consistentes con el CPDAG. Formalmente, orienta cada par no decidido $(u,v)$ a ya sea $u\to v$ o $v\to u$, y mantiene solo aquellas orientaciones para las cuales la matriz de adyacencia resultante es acíclica. Esto les proporciona un menú de mundos plausibles que se ajustan a la evidencia." }

source: What should you do with that menu? Use **business sense** and **model diagnostics** (We'll talk about build models from dags soon) to pick the DAG that best aligns with mechanism knowledge (e.g., “impressions don’t depend on conversions”) and validates empirically (posterior predictive checks, out-of-sample performance, robustness to adjustments).
es: { "singular": "¿Qué deberías hacer con ese menú? Usa **sentido comercial** y **diagnósticos de modelos** (hablaremos sobre la construcción de modelos a partir de dags pronto) para elegir el DAG que mejor se alinee con el conocimiento del mecanismo (por ejemplo, “las impresiones no dependen de las conversiones”) y que valide empíricamente (comprobaciones predictivas posteriores, rendimiento fuera de muestra, robustez a ajustes).", "plural": "¿Qué deberías hacer con esos menús? Usa **sentido comercial** y **diagnósticos de modelos** (hablaremos sobre la construcción de modelos a partir de dags pronto) para elegir los DAG que mejor se alineen con el conocimiento del mecanismo (por ejemplo, “las impresiones no dependen de las conversiones”) y que validen empíricamente (comprobaciones predictivas posteriores, rendimiento fuera de muestra, robustez a ajustes)." }

source: The panel plotted shows **every fully oriented DAG** that is consistent with the CPDAG we learned: each dashed link has been assigned a direction, cycles were filtered out, and what remains are alternative causal stories that all **fit the same independence structure**. Although the arrows now point one way or the other in each subplot, these DAGs are still members of the **same Markov equivalence class (MEC)** — they share the same skeleton and the same set of **unshielded colliders** (v-structures), and therefore imply the **same d-separations**. In other words, for any triple $(X,Y,Z)$ and any conditioning set $S$, we have $X \perp Y \mid S$ in one DAG **iff** it holds in all DAGs in the panel.
es: { "singular": "El panel trazado muestra **cada DAG completamente orientado** que es consistente con el CPDAG que aprendimos: cada enlace discontinuo ha sido asignado una dirección, se filtraron los ciclos, y lo que queda son historias causales alternativas que todas **se ajustan a la misma estructura de independencia**. Aunque las flechas ahora apuntan en una dirección u otra en cada subgráfico, estos DAGs siguen siendo miembros de la **misma clase de equivalencia de Markov (MEC)** — comparten el mismo esqueleto y el mismo conjunto de **colisionadores no protegidos** (estructuras v), y por lo tanto implican las **mismas d-separaciones**. En otras palabras, para cualquier tripleta $(X,Y,Z)$ y cualquier conjunto de condicionamiento $S$, tenemos $X \perp Y \mid S$ en un DAG **si y solo si** se sostiene en todos los DAGs en el panel.", "plural": "Los paneles trazados muestran **cada DAG completamente orientado** que es consistente con el CPDAG que aprendimos: cada enlace discontinuo ha sido asignado una dirección, se filtraron los ciclos, y lo que queda son historias causales alternativas que todas **se ajustan a la misma estructura de independencia**. Aunque las flechas ahora apuntan en una dirección u otra en cada subgráfico, estos DAGs siguen siendo miembros de la **misma clase de equivalencia de Markov (MEC)** — comparten el mismo esqueleto y el mismo conjunto de **colisionadores no protegidos** (estructuras v), y por lo tanto implican las **mismas d-separaciones**. En otras palabras, para cualquier tripleta $(X,Y,Z)$ y cualquier conjunto de condicionamiento $S$, tenemos $X \perp Y \mid S$ en un DAG **si y solo si** se sostiene en todos los DAGs en el panel." }

source: Here we can do two things: (A) ask whether each of the recovered DAGs lies in the **same MEC** as the *true* structure, or (B) ask whether the **CPDAG** we discovered represents that same equivalence class. In real-world marketing problems, we can’t perform either check — the “true DAG” is unknown. That’s precisely why causal discovery is useful: it narrows down the space of plausible causal worlds and makes explicit *where uncertainty remains*. The decision of which DAG to trust must then come from a blend of **data evidence** and **domain judgment** — what you believe is causally reasonable given how your business and campaigns actually work.
es: { "singular": { "msgid": "Here we can do two things: (A) ask whether each of the recovered DAGs lies in the **same MEC** as the *true* structure, or (B) ask whether the **CPDAG** we discovered represents that same equivalence class. In real-world marketing problems, we can’t perform either check — the “true DAG” is unknown. That’s precisely why causal discovery is useful: it narrows down the space of plausible causal worlds and makes explicit *where uncertainty remains*. The decision of which DAG to trust must then come from a blend of **data evidence** and **domain judgment** — what you believe is causally reasonable given how your business and campaigns actually work.", "msgstr": "Aquí podemos hacer dos cosas: (A) preguntar si cada uno de los DAGs recuperados se encuentra en el **mismo MEC** que la *estructura verdadera*, o (B) preguntar si el **CPDAG** que descubrimos representa esa misma clase de equivalencia. En problemas de marketing del mundo real, no podemos realizar ninguna de las dos comprobaciones — el “DAG verdadero” es desconocido. Esa es precisamente la razón por la cual el descubrimiento causal es útil: reduce el espacio de mundos causales plausibles y hace explícito *dónde permanece la incertidumbre*. La decisión de qué DAG confiar debe provenir entonces de una combinación de **evidencia de datos** y **juicio de dominio** — lo que usted cree que es causalmente razonable dado cómo funcionan realmente su negocio y campañas." }, "plural": {} }

source: Here, we can see the class was able to recover the **True DAG** and all Causal DAGs from the CPDAG, lie in the same MEC. Let's move to another example, and see how the class perform if we change the data genaration process (DAG under the hood).
es: { "singular": "Aquí, podemos ver que la clase pudo recuperar el **True DAG** y todos los DAGs Causales del CPDAG, que se encuentran en el mismo MEC. Pasemos a otro ejemplo y veamos cómo se desempeña la clase si cambiamos el proceso de generación de datos (DAG bajo el capó).", "plural": "Aquí, podemos ver que las clases pudieron recuperar el **True DAG** y todos los DAGs Causales del CPDAG, que se encuentran en el mismo MEC. Pasemos a otro ejemplo y veamos cómo se desempeñan las clases si cambiamos el proceso de generación de datos (DAG bajo el capó)." }

source: Let’s make things a bit more interesting. The next example represents a new causal world — a slightly different **marketing mechanism** that will challenge our discovery procedure. This time, imagine that **generic search** (`A`) drives **media activities** (`B`), which in turn boost **brand search** (`C`), ultimately leading to **purchases** (`P`). Alongside this main pathway, an **exogenous factor** (`D`) — think of it as the broader economy, market trends, or seasonality — also directly influences purchases, independent of the marketing funnel.
es: { "singular": "Hagamos las cosas un poco más interesantes. El siguiente ejemplo representa un nuevo mundo causal — un mecanismo de **marketing** ligeramente diferente que desafiará nuestro procedimiento de descubrimiento. Esta vez, imagina que la **búsqueda genérica** (`A`) impulsa las **actividades de medios** (`B`), que a su vez aumentan la **búsqueda de marca** (`C`), llevando finalmente a las **compras** (`P`). Junto a este camino principal, un **factor exógeno** (`D`) — piensa en ello como la economía más amplia, las tendencias del mercado o la estacionalidad — también influye directamente en las compras, de manera independiente del embudo de marketing.", "plural": "Hagamos las cosas un poco más interesantes. Los siguientes ejemplos representan un nuevo mundo causal — unos mecanismos de **marketing** ligeramente diferentes que desafiarán nuestro procedimiento de descubrimiento. Esta vez, imaginen que la **búsqueda genérica** (`A`) impulsa las **actividades de medios** (`B`), que a su vez aumentan la **búsqueda de marca** (`C`), llevando finalmente a las **compras** (`P`). Junto a estos caminos principales, unos **factores exógenos** (`D`) — piensen en ellos como la economía más amplia, las tendencias del mercado o la estacionalidad — también influyen directamente en las compras, de manera independiente del embudo de marketing." }

source: This structure tells a familiar marketing story: awareness and consideration flow through a funnel (from search intent to media exposure to brand lift to sales), while external forces like macroeconomic conditions add background variation that we can’t fully control. It’s an elegant but subtle system, because now two causal paths meet at the purchase node: one endogenous (marketing-driven) and one exogenous (context-driven). Detecting that distinction is exactly the kind of challenge causal discovery is meant to address.
es: { "singular": "Esta estructura cuenta una historia de marketing familiar: la conciencia y la consideración fluyen a través de un embudo (desde la intención de búsqueda hasta la exposición mediática, el aumento de la marca y las ventas), mientras que fuerzas externas como las condiciones macroeconómicas añaden variación de fondo que no podemos controlar completamente. Es un sistema elegante pero sutil, porque ahora dos caminos causales se encuentran en el nodo de compra: uno endógeno (impulsado por el marketing) y uno exógeno (impulsado por el contexto). Detectar esa distinción es exactamente el tipo de desafío que el descubrimiento causal está destinado a abordar.", "plural": "Estas estructuras cuentan historias de marketing familiares: la conciencia y la consideración fluyen a través de embudos (desde la intención de búsqueda hasta la exposición mediática, el aumento de la marca y las ventas), mientras que fuerzas externas como las condiciones macroeconómicas añaden variación de fondo que no podemos controlar completamente. Son sistemas elegantes pero sutiles, porque ahora dos caminos causales se encuentran en los nodos de compra: uno endógeno (impulsado por el marketing) y uno exógeno (impulsado por el contexto). Detectar esas distinciones es exactamente el tipo de desafío que el descubrimiento causal está destinado a abordar." }

source: All the examples in this notebook are synthetic. They are intentionally designed to stress-test the algorithm and illustrate different causal motifs — some plausible in marketing, others less so. The goal isn't to claim these graphs are "true," but to show how the `TBFPC` class behaves under varied structures, and what kinds of insights (or pitfalls) each configuration can reveal.
es: { "singular": "Todos los ejemplos en este cuaderno son sintéticos. Están diseñados intencionadamente para poner a prueba el algoritmo y ilustrar diferentes motivos causales — algunos plausibles en marketing, otros menos. El objetivo no es afirmar que estos gráficos son \"verdaderos\", sino mostrar cómo se comporta la clase `TBFPC` bajo estructuras variadas, y qué tipos de conocimientos (o trampas) puede revelar cada configuración.", "plural": "Todos los ejemplos en este cuaderno son sintéticos. Están diseñados intencionadamente para poner a prueba el algoritmo y ilustrar diferentes motivos causales — algunos plausibles en marketing, otros menos. El objetivo no es afirmar que estos gráficos son \"verdaderos\", sino mostrar cómo se comporta la clase `TBFPC` bajo estructuras variadas, y qué tipos de conocimientos (o trampas) puede revelar cada configuración." }

source: As before, we need to generate data with this generative structure.
es: { "singular": { "msgid": "As before, we need to generate data with this generative structure.", "msgstr": "Como antes, necesitamos generar datos con esta estructura generativa." }, "plural": { "msgid": "As before, we need to generate data with this generative structure.", "msgstr": "Como antes, necesitamos generar datos con esta estructura generativa." } }

source: Could we find out the true DAG now?
es: { "singular": { "msgid": "Could we find out the true DAG now?", "msgstr": "¿Podríamos averiguar el verdadero DAG ahora?" }, "plural": { "msgid": "Could we find out the true DAG now?", "msgstr": "¿Podríamos averiguar el verdadero DAG ahora?" } }

source: Beautiful — the class successfully recovered the **true causal structure** from the data, meaning that the CPDAG it discovered lies in the same **Markov equivalence class** as our simulated DAG. In other words, the algorithm correctly identified the backbone of the causal system: the sequential flow from **generic search → media → brand → purchase**, plus the independent influence of the **exogenous** factor on purchases.
es: { "singular": "Hermoso: la clase recuperó con éxito la **verdadera estructura causal** de los datos, lo que significa que el CPDAG que descubrió se encuentra en la misma **clase de equivalencia de Markov** que nuestro DAG simulado. En otras palabras, el algoritmo identificó correctamente la columna vertebral del sistema causal: el flujo secuencial de **búsqueda genérica → medios → marca → compra**, más la influencia independiente del factor **exógeno** en las compras.", "plural": "Hermosos: las clases recuperaron con éxito las **verdaderas estructuras causales** de los datos, lo que significa que los CPDAG que descubrieron se encuentran en las mismas **clases de equivalencia de Markov** que nuestros DAG simulados. En otras palabras, los algoritmos identificaron correctamente las columnas vertebrales de los sistemas causales: los flujos secuenciales de **búsqueda genérica → medios → marca → compra**, más la influencia independiente de los factores **exógenos** en las compras." }

source: This outcome highlights the **efficiency and reliability** of the `TBFPC` approach for small, well-structured problems. Even without access to the true underlying DAG, the algorithm can reconstruct a consistent causal skeleton from observational data alone — a strong indication that the combination of **Bayes factor–based independence testing** and **target-oriented edge rules** is working as intended.
es: { "singular": { "msgid": "This outcome highlights the **efficiency and reliability** of the `TBFPC` approach for small, well-structured problems. Even without access to the true underlying DAG, the algorithm can reconstruct a consistent causal skeleton from observational data alone — a strong indication that the combination of **Bayes factor–based independence testing** and **target-oriented edge rules** is working as intended.", "msgstr": "Este resultado destaca la **eficiencia y fiabilidad** del enfoque `TBFPC` para problemas pequeños y bien estructurados. Incluso sin acceso al verdadero DAG subyacente, el algoritmo puede reconstruir un esqueleto causal consistente solo a partir de datos observacionales, lo que indica fuertemente que la combinación de **pruebas de independencia basadas en el factor de Bayes** y **reglas de borde orientadas a objetivos** está funcionando como se esperaba." }, "plural": {} }

source: Of course, these are still **simple synthetic systems** — clean, noise-controlled, and designed to behave nicely. Real-world marketing data are messier: time dependencies, measurement errors, latent effects, and correlated interventions all complicate causal inference. So let’s keep raising the difficulty and see how the algorithm performs when the structure becomes less ideal and closer to what we face in practice.
es: { "singular": "Por supuesto, estos siguen siendo **sistemas sintéticos simples** — limpios, controlados por ruido y diseñados para comportarse adecuadamente. Los datos de marketing del mundo real son más desordenados: las dependencias temporales, los errores de medición, los efectos latentes y las intervenciones correlacionadas complican la inferencia causal. Así que sigamos aumentando la dificultad y veamos cómo se desempeña el algoritmo cuando la estructura se vuelve menos ideal y más cercana a lo que enfrentamos en la práctica.", "plural": "Por supuesto, estos siguen siendo **sistemas sintéticos simples** — limpios, controlados por ruido y diseñados para comportarse adecuadamente. Los datos de marketing del mundo real son más desordenados: las dependencias temporales, los errores de medición, los efectos latentes y las intervenciones correlacionadas complican la inferencia causal. Así que sigamos aumentando la dificultad y veamos cómo se desempeñan los algoritmos cuando la estructura se vuelve menos ideal y más cercana a lo que enfrentamos en la práctica." }

source: Let’s raise the bar again — this time with a more complex and realistic causal system. Imagine a marketing ecosystem where **generic search** (`A`) acts as a top-of-funnel signal: it fuels both **media activities** (`B`) and **brand search** (`C`), as consumers who are already searching generically become more likely to see ads and later perform branded queries. In turn, **media** also influences **brand search**, reinforcing brand awareness and familiarity. Finally, **purchases** (`P`) are driven jointly by all three — media exposure, brand strength, and the influence of an **exogenous factor** (`D`), which could represent macroeconomic conditions, promotions, or competitor activity.
es: { "singular": "Elevemos el estándar nuevamente — esta vez con un sistema causal más complejo y realista. Imagina un ecosistema de marketing donde **búsqueda genérica** (`A`) actúa como una señal de la parte superior del embudo: alimenta tanto las **actividades de medios** (`B`) como la **búsqueda de marca** (`C`), ya que los consumidores que ya están buscando de manera genérica se vuelven más propensos a ver anuncios y luego realizar consultas de marca. A su vez, los **medios** también influyen en la **búsqueda de marca**, reforzando la conciencia y familiaridad de la marca. Finalmente, las **compras** (`P`) son impulsadas conjuntamente por los tres — exposición a medios, fortaleza de marca y la influencia de un **factor exógeno** (`D`), que podría representar condiciones macroeconómicas, promociones o actividad de competidores.", "plural": "Elevemos el estándar nuevamente — esta vez con un sistema causal más complejo y realista. Imagina un ecosistema de marketing donde **búsqueda genérica** (`A`) actúa como una señal de la parte superior del embudo: alimenta tanto las **actividades de medios** (`B`) como la **búsqueda de marca** (`C`), ya que los consumidores que ya están buscando de manera genérica se vuelven más propensos a ver anuncios y luego realizar consultas de marca. A su vez, los **medios** también influyen en la **búsqueda de marca**, reforzando la conciencia y familiaridad de la marca. Finalmente, las **compras** (`P`) son impulsadas conjuntamente por los tres — exposición a medios, fortaleza de marca y la influencia de un **factor exógeno** (`D`), que podría representar condiciones macroeconómicas, promociones o actividad de competidores." }

source: This setup is much closer to the reality faced by marketing analysts: overlapping effects, multiple paths to the same KPI, and unobserved influences lurking in the background. Notice that now **both media and brand search** are children of generic intent (`A`) *and* parents of purchase (`P`). This creates a web of **mediated and confounded effects**, which are notoriously hard to disentangle with standard regression approaches — even if all the variables are observed.
es: { "singular": "Esta configuración está mucho más cerca de la realidad que enfrentan los analistas de marketing: efectos superpuestos, múltiples caminos hacia el mismo KPI y influencias no observadas que acechan en el fondo. Observe que ahora **tanto los medios como la búsqueda de marca** son hijos de la intención genérica (`A`) *y* padres de la compra (`P`). Esto crea una red de **efectos mediados y confundidos**, que son notoriamente difíciles de desenredar con enfoques de regresión estándar, incluso si todas las variables son observadas.", "plural": "Estas configuraciones están mucho más cerca de la realidad que enfrentan los analistas de marketing: efectos superpuestos, múltiples caminos hacia el mismo KPI y influencias no observadas que acechan en el fondo. Observe que ahora **tanto los medios como la búsqueda de marca** son hijos de la intención genérica (`A`) *y* padres de la compra (`P`). Esto crea una red de **efectos mediados y confundidos**, que son notoriamente difíciles de desenredar con enfoques de regresión estándar, incluso si todas las variables son observadas." }

source: So far, our three setups showcased the classic causal motifs that matter in marketing: **chains** (driver cascades like `generic_search → media → brand → purchase`), **forks** (shared causes like `exogenous → {purchase, other signals}` that create confounding), and **colliders** (converging arrows like `media → brand ← intent`, which stay *blocked* unless you condition on them or their descendants).
es: { "singular": "Hasta ahora, nuestras tres configuraciones han mostrado los motivos causales clásicos que importan en marketing: **cadenas** (cascadas de impulso como `generic_search → media → brand → purchase`), **bifurcaciones** (causas compartidas como `exogenous → {purchase, other signals}` que crean confusión), y **colisionadores** (flechas convergentes como `media → brand ← intent`, que permanecen *bloqueadas* a menos que se condicione sobre ellas o sus descendientes).", "plural": "Hasta ahora, nuestras tres configuraciones han mostrado los motivos causales clásicos que importan en marketing: **cadenas** (cascadas de impulso como `generic_search → media → brand → purchase`), **bifurcaciones** (causas compartidas como `exogenous → {purchase, other signals}` que crean confusión), y **colisionadores** (flechas convergentes como `media → brand ← intent`, que permanecen *bloqueadas* a menos que se condicione sobre ellas o sus descendientes)." }
